[{"title": "Roger Penrose: Physics of Consciousness and the Infinite Universe | Lex Fridman Podcast #85", "id": "orMtwOz6Db0", "quotes": [{"time": 312, "text": "I was always a great fan of Arthur C. Clarke."}, {"time": 314, "text": "So it's just a nice plot device."}, {"time": 316, "text": "Yeah, that plot is excellent, yes."}, {"time": 318, "text": "So Hal 9000 decides to get rid of the astronauts because he, it, she believes that they will interfere with the mission."}, {"time": 328, "text": "Yeah, well, there you are."}, {"time": 329, "text": "It's this view."}, {"time": 330, "text": "I don't know whether I disagree with it because in a certain sense it was telling you it's wrong."}, {"time": 335, "text": "See, the machine seemed to think it was superior to the human and so it was entitled to get rid of the human beings and run the show itself."}, {"time": 347, "text": "Well, do you think Hal did the right thing?"}, {"time": 349, "text": "Do you think Hal's flawed evil?"}, {"time": 352, "text": "Or if we think about systems like Hal, would we want Hal to do the same thing in the future?"}, {"time": 358, "text": "What was the flaw there?"}, {"time": 358, "text": "Well, you're basically touching on questions."}, {"time": 361, "text": "You see, it's one supposed to believe that Hal was actually conscious."}, {"time": 366, "text": "I mean, it was played rather that way, as though Hal was a conscious being."}, {"time": 373, "text": "Because Hal showed some pain, some cognizance, Hal appeared to be cognizant of what it means to die."}, {"time": 385, "text": "And therefore had an inkling of consciousness."}, {"time": 388, "text": "Yeah, I mean, I'm not sure that aspect of it was made completely clear, whether Hal was really just a very sophisticated computer, which really didn't actually have these feelings and somehow, but you're right, it didn't like the idea of being turned off."}, {"time": 405, "text": "How does it change things if Hal was or wasn't conscious?"}, {"time": 409, "text": "Well, it might say that it would be wrong to turn it off if it was actually conscious."}, {"time": 415, "text": "I mean, these questions arise if you think."}, {"time": 417, "text": "I mean, AI, one of the ideas, it's sort of a mixture in a sense."}, {"time": 421, "text": "You say, if it's trying to do everything a human can do, and if you take the view that consciousness is something which would come along when the computer is sufficiently complicated, sufficiently whatever criterion you use to characterize its consciousness in terms of some computational criteria, computational criterion."}, {"time": 448, "text": "So how does consciousness change our evaluation of the decision that Hal made?"}, {"time": 455, "text": "I guess I was trying to say that people are a bit confused about this, because if they say these machines will become conscious, but just simply because it's a degree of computation, and when you get beyond that certain degree of computation, it will become conscious, then of course you have all these problems."}, {"time": 472, "text": "I mean, you might say, well, one of the reasons you're doing AI is because you want to send a device out to some distant planet, and you don't want to send a human out there, because then you'd have to bring it back again, and that costs you far more than just sending it there and leaving it there."}, {"time": 487, "text": "But if this device is actually a conscious entity, then you have to face up to the fact that that's immoral."}, {"time": 493, "text": "And so the mere fact that you're making some AI device and thinking that removes your responsibility to it would be incorrect."}, {"time": 505, "text": "And so this is a sign of flaw in that kind of viewpoint."}, {"time": 509, "text": "I'm not sure how people who take it very seriously, I mean, I had this curious conversation with, I'm going to forget names, I'm afraid, because this is what happens to me at the wrong moment, Hofstadter, Douglas Hofstadter."}, {"time": 525, "text": "Douglas Hofstadter, yeah."}, {"time": 526, "text": "And he'd written this book, God Will Let You Up, which I liked."}, {"time": 530, "text": "I thought it was a fantastic book."}, {"time": 536, "text": "I think he got it wrong, you see."}, {"time": 538, "text": "Well, I'll just tell you my story, you see, because I'd never met him."}, {"time": 542, "text": "And then I knew I was going to meet him, the occasion I realized he was coming in, he wanted to talk to me, and I said, that's fine."}, {"time": 549, "text": "And I thought in my mind, well, I'm going to paint him into a corner, you see, because I'll use his arguments to convince him that certain numbers are conscious."}, {"time": 559, "text": "Some integers, large enough integers are actually conscious."}, {"time": 562, "text": "And this was going to be my reductio ad absurdum."}, {"time": 565, "text": "So I started having this argument with him."}, {"time": 566, "text": "He simply leapt into the corner."}, {"time": 568, "text": "He didn't even need to be painted into it."}, {"time": 571, "text": "He took the view that certain numbers were conscious."}, {"time": 573, "text": "I thought that was a reductio ad absurdum, but he seemed to think it was perfectly a reasonable point of view."}, {"time": 578, "text": "Without the absurdum there."}, {"time": 581, "text": "Interesting, but the thing you mentioned about how is the intuition that a lot of the people, at least in the artificial intelligence world, had and have, I think."}, {"time": 591, "text": "They don't make it explicit, but that if you increase the power of computation, naturally consciousness will emerge."}, {"time": 598, "text": "Yes, I think that's what they think."}, {"time": 600, "text": "But basically that's because they can't think of anything else."}, {"time": 603, "text": "And so it's a reasonable thing."}, {"time": 605, "text": "I mean, you think, what does the brain do?"}, {"time": 606, "text": "Well, it does do a lot of computation."}, {"time": 609, "text": "I think most of what you actually call computation is done by the cerebellum."}, {"time": 613, "text": "I mean, this is one of the things that people don't much mention."}, {"time": 617, "text": "I mean, I come to this subject from the outside and certain things strike me, which you hardly ever hear mentioned."}, {"time": 624, "text": "I mean, you hear mentioned about the left right business."}, {"time": 628, "text": "They move your right arm, that's the left side of the brain and so on and all that sort of stuff."}, {"time": 634, "text": "And it's more than that."}, {"time": 636, "text": "If you have these plots of different parts of the brain, there are two of these things called the homunculi, which you see these pictures of a distorted human figure and showing different parts of the brain, controlling different parts of the body."}, {"time": 653, "text": "And it's not simply things like, okay, the right hand is controlled and both sensory and motor on the left side, left hand on the right side."}, {"time": 664, "text": "It's more than that."}, {"time": 665, "text": "Vision is the back basically, your feet at the top."}, {"time": 671, "text": "And it's as though it's about the worst organization you could imagine."}, {"time": 674, "text": "So it can't just be a mistake in nature."}, {"time": 679, "text": "And this is made more pronounced when you think of the cerebellum."}, {"time": 685, "text": "The cerebellum has, when I was first thinking about these things, I was told that it had half as many neurons or something like that, comparable."}, {"time": 693, "text": "And now they tell me it's got far more neurons than the cerebrum, and cerebrum is this sort of convoluted thing at the top people always talk about."}, {"time": 702, "text": "Cerebellum is this thing just looks a bit like a ball of wool right at the back underneath them."}, {"time": 707, "text": "It's got more neurons."}, {"time": 709, "text": "It's got more connections."}, {"time": 711, "text": "Computationally, it's got much more going on than this from the cerebrum."}, {"time": 718, "text": "But as far as we know, that's slightly controversial, the cerebellum is entirely unconscious."}, {"time": 724, "text": "So the actions, you have a pianist who plays an incredible piece of music and think of, and he moves his little finger into this little key to get it, hit it, just the right moment."}, {"time": 735, "text": "Does he or she consciously will that movement?"}, {"time": 743, "text": "Okay, the consciousness is coming in."}, {"time": 744, "text": "It's probably to do with the feeling of the piece of music that's being performed and that sort of thing, which is going on."}, {"time": 751, "text": "But the details of what's going on are controlled."}, {"time": 755, "text": "I would think almost entirely by the cerebellum."}, {"time": 758, "text": "That's where you have this precision and the really detailed."}, {"time": 764, "text": "Once you get, I mean, you think of a tennis player or something, does that tennis player think exactly which muscles should be moved in what direction and so on?"}, {"time": 772, "text": "No, of course not."}, {"time": 774, "text": "But he or she will maybe think, well, if the ball is angled in such a way in that corner, that will be tricky for the opponent."}, {"time": 782, "text": "And the details of that are all done largely with the cerebellum."}, {"time": 788, "text": "That's where all the precise motions, but it's unconscious."}, {"time": 793, "text": "So why is it interesting to you that so much computation is done in the cerebellum and yet it is unconscious?"}, {"time": 799, "text": "Because it doesn't, it's the view that somehow it's computation which is producing the consciousness."}, {"time": 807, "text": "And it's here you have an incredible amount of computation going on."}, {"time": 813, "text": "And as far as we know, it's completely unconscious."}, {"time": 816, "text": "So why, what's the difference?"}, {"time": 819, "text": "And I think it's an important thing."}, {"time": 821, "text": "What's the difference?"}, {"time": 823, "text": "Why is the cerebrum, all this very peculiar stuff that very hard to see on a computational perspective, like having the, everything have to cross over under the other side and do something which looks completely inefficient."}, {"time": 838, "text": "And you've got funny things like the frontal lobe and the, what do we call the lobes?"}, {"time": 844, "text": "And the place where they come together, you have the different parts, the control, you see one to do with motor and the other to do with sensory."}, {"time": 856, "text": "And they're sort of opposite each other rather than being connected by, it's not as though you've got electrical circuits."}, {"time": 863, "text": "There's something else going on there."}, {"time": 866, "text": "So it's just the idea that it's like a complicated computer just seems to me to be completely missing the point."}, {"time": 874, "text": "There must be a lot of computation going on, but the cerebellum seems to be much better at doing that than the cerebrum is."}, {"time": 882, "text": "So for sure, I think what explains it is like half hope and half we don't know what's going on."}, {"time": 889, "text": "And therefore from the computer science perspective, you hope that a Turing machine can be perfectly, can achieve general intelligence."}, {"time": 911, "text": "These people who developed the idea of what a computation is."}, {"time": 917, "text": "And there were different ideas of what a computation, developed differently."}, {"time": 920, "text": "I mean, Church's way of doing it, was very different from Turing's, but then they were shown to be equivalent."}, {"time": 926, "text": "And so the view emerged that what we mean by computation is a very clear concept."}, {"time": 934, "text": "And one of the wonderful things that Turing did was to show that you could have what we call the universal Turing machine."}, {"time": 943, "text": "It's you just have to have a certain finite device."}, {"time": 946, "text": "Okay, it has to have an unlimited storage space, which is accessible to it, but the actual computation, if you like, is performed by this one universal device."}, {"time": 955, "text": "And so the view comes away, well, you have this universal Turing machine, and maybe the brain is something like that, a universal Turing machine, and it's got maybe not unlimited storage, but a huge storage accessible to it."}, {"time": 972, "text": "And this model is one, which is what's used in ordinary computation."}, {"time": 977, "text": "It's a very powerful model."}, {"time": 979, "text": "And the universallness of computation is very useful."}, {"time": 984, "text": "You could have some problem and you may not see immediately how to put it onto a computer, but if it is something of that nature, then there are all sorts of subprograms and subroutines when all the, I mean, I learned a little bit of computing when I was a student, but not very much."}, {"time": 1002, "text": "But it was enough to get the general ideas."}, {"time": 1005, "text": "And there's something really pleasant about a formal system like that."}, {"time": 1009, "text": "Where you can start discussing about what's provable, what's not, these kinds of things."}, {"time": 1012, "text": "And you've got a notion, which is an absolute notion, this notion of computability, and you can address when things are, mathematical problems are computably solvable and what chance."}, {"time": 1024, "text": "And it's a very beautiful area of mathematics, and it's a very powerful area of mathematics."}, {"time": 1029, "text": "And it underlies the whole sort of, I won't say, the principles of computing machines that we have today."}, {"time": 1039, "text": "Could you say, what is Gayle's Incompleteness Theorem?"}, {"time": 1042, "text": "And how does it, maybe also say, is it heartbreaking to you?"}, {"time": 1046, "text": "And how does it interfere with this notion of computation and consciousness?"}, {"time": 1053, "text": "Well, the ideas, basically ideas, which I formulated in my first year as a graduate student in Cambridge."}, {"time": 1061, "text": "I did my undergraduate work in mathematics in London, and I had a colleague, Ian Percival."}, {"time": 1067, "text": "We used to discuss things like computational and logical systems quite a lot."}, {"time": 1072, "text": "I'd heard about Gayle's theorem."}, {"time": 1073, "text": "I was a bit worried by the idea that it seemed to say there were things in mathematics that you could never prove."}, {"time": 1079, "text": "And so when I went to Cambridge as a graduate student, I went to various courses."}, {"time": 1086, "text": "You see, I was doing pure mathematics."}, {"time": 1088, "text": "I was doing algebraic geometry of a sort."}, {"time": 1091, "text": "A little bit different from what my supervisor and people, but it was algebraic geometry."}, {"time": 1097, "text": "And I was interested, I got particularly interested in three lecture courses that were nothing to do with what I was supposed to be doing."}, {"time": 1108, "text": "One was a course by Herman Bondy on Einstein's general theory of relativity, which was a beautiful course."}, {"time": 1114, "text": "He was an amazing lecturer, brought these things alive, absolutely."}, {"time": 1120, "text": "Another was a course on quantum mechanics given by a great physicist, Paul Dirac."}, {"time": 1127, "text": "Very beautiful course in a completely different way."}, {"time": 1130, "text": "It was, he was very kind of organized and never got excited about anything seemingly."}, {"time": 1138, "text": "But it was extremely well put together."}, {"time": 1140, "text": "And I found that amazing too."}, {"time": 1143, "text": "Third course that was nothing to do with what I should be doing was a course on mathematical logic."}, {"time": 1148, "text": "I got excited, as I say, my discussions with Ian Percival was incompleteness theorem already deeply within mathematical logic space."}, {"time": 1158, "text": "Were you introduced to it?"}, {"time": 1160, "text": "I was introduced to it in detail by the course, by Steen."}, {"time": 1165, "text": "And he, it was two things he described which were very fundamental to my understanding."}, {"time": 1171, "text": "One was Turing machines and the whole idea of computability and all that."}, {"time": 1175, "text": "So that was all very much part of the course."}, {"time": 1181, "text": "And it wasn't what I was afraid it was to tell you there were things in mathematics you couldn't prove."}, {"time": 1187, "text": "It was basically, and he phrased it in a way which often people didn't."}, {"time": 1193, "text": "And if you read Douglas Soft status book, he doesn't, you see."}, {"time": 1196, "text": "But Steen made it very clear."}, {"time": 1198, "text": "And also in a sort of public lecture that he gave to a mathematical, I think it may be the Adams Society, one of the mathematical undergraduate societies."}, {"time": 1207, "text": "And he made this point again very clearly."}, {"time": 1209, "text": "That if you've got a formal system of proof, so suppose what you mean by proof is something which you could check with a computer."}, {"time": 1219, "text": "So to say whether you've got it right or not, you've got a lot of steps."}, {"time": 1222, "text": "Have you carried this computational procedure?"}, {"time": 1225, "text": "Well, following the proof, steps of the proof correctly, that can be checked by an algorithm, by a computer."}, {"time": 1235, "text": "So that's the key thing."}, {"time": 1238, "text": "Now what you have to, now you see, is this any good?"}, {"time": 1244, "text": "If you've got an algorithmic system, which claims to say, yes, this is right, this you've proved it correctly, this is true."}, {"time": 1252, "text": "If you've proved it, if you made a mistake, it doesn't say it's true or false."}, {"time": 1255, "text": "But if you have, if you've done it right, then the conclusion you've come to is correct."}, {"time": 1261, "text": "Now you say, why do you believe it's correct?"}, {"time": 1263, "text": "Because you've looked at the rules and you said, well, okay, that one's all right."}, {"time": 1266, "text": "Yeah, that one's all right."}, {"time": 1267, "text": "What about that?"}, {"time": 1268, "text": "Oh, yeah, I see, I see why it's all right."}, {"time": 1270, "text": "Okay, you go through all the rules."}, {"time": 1272, "text": "You say, yes, following those rules, if it says, yes, it's true, it is true."}, {"time": 1277, "text": "So you've got to make sure that these rules are ones that you trust."}, {"time": 1281, "text": "If you follow the rules and it says it's a proof, is the result actually true?"}, {"time": 1287, "text": "And that your belief that it's true depends upon looking at the rules and understanding them."}, {"time": 1316, "text": "And it depends on your trust in the rules."}, {"time": 1319, "text": "Do you believe that the rules only give you truths?"}, {"time": 1322, "text": "If you believe the rules only give you truths, then you believe this other statement is also true."}, {"time": 1327, "text": "I found this absolutely mind blowing."}, {"time": 1329, "text": "When I saw this, it blew my mind."}, {"time": 1332, "text": "I thought, my God, you can see that this statement is true."}, {"time": 1337, "text": "It's as good as any proof, because it only depends on your belief in the reliability of the proof procedure, that's all it is, and understanding that the coding is done correctly."}, {"time": 1349, "text": "And it enables you to transcend that system."}, {"time": 1353, "text": "So whatever system you have, as long as you can understand what it's doing and why you believe it only gives you truths, then you can see beyond that system."}, {"time": 1364, "text": "Now, how do you see beyond it?"}, {"time": 1366, "text": "What is it that enables you to transcend that system?"}, {"time": 1371, "text": "Well, it's your understanding of what the system is actually saying and what the statement that you've constructed is actually saying."}, {"time": 1379, "text": "So it's this quality of understanding, whatever it is, which is not governed by rules."}, {"time": 1385, "text": "It's not a computational procedure."}, {"time": 1387, "text": "So this idea of understanding is not going to be within the rules of the, within the formal system."}, {"time": 1393, "text": "Yes, you're only using those rules anyway, because you have understood them to be rules which only give you truths."}, {"time": 1400, "text": "There'd be no point in it otherwise."}, {"time": 1402, "text": "I mean, people say, well, okay, this is, it's one set of rules as good as any other."}, {"time": 1408, "text": "Well, it's not true."}, {"time": 1408, "text": "You see, you have to understand what the rules mean."}, {"time": 1411, "text": "And why does that understanding of the mean give you something beyond the rules themselves?"}, {"time": 1416, "text": "And that's what it was."}, {"time": 1417, "text": "That's what blew my mind."}, {"time": 1418, "text": "It's somehow understanding why the rules give you truths enables you to transcend the rules."}, {"time": 1425, "text": "So that's where, I mean, even at that time, that's already where the thought entered your mind that the idea of understanding, or we can start calling it things like intelligence or even consciousness is outside the rules."}, {"time": 1440, "text": "See, I've always concentrated on understanding."}, {"time": 1442, "text": "You know, people say, people come and point out things."}, {"time": 1445, "text": "Well, you know, what about creativity?"}, {"time": 1447, "text": "That's something a machine can't do is create."}, {"time": 1449, "text": "What is creativity?"}, {"time": 1451, "text": "And I don't know."}, {"time": 1452, "text": "You know, somebody can put some funny things on a piece of paper and say that's creative and you could make a machine do that."}, {"time": 1456, "text": "Is it really creative?"}, {"time": 1458, "text": "You see, I worry about that one."}, {"time": 1460, "text": "I sort of agree with it in a sense, but it's so hard to do anything with that statement."}, {"time": 1465, "text": "But understanding, yes, you can."}, {"time": 1467, "text": "You can make, go see that understanding, whatever it is, and it's very hard to put your finger on it."}, {"time": 1474, "text": "That's absolutely true."}, {"time": 1475, "text": "Can you try to define or maybe dance around a definition of understanding?"}, {"time": 1481, "text": "To some degree, but I don't, I often wondered about this, but there is something there which is very slippery."}, {"time": 1488, "text": "It's something like standing back."}, {"time": 1492, "text": "And it's got to be something, you see, it's also got to be something which was of value to our remote ancestors."}, {"time": 1499, "text": "Because sometimes, there's a cartoon which I drew sometimes showing you how all these, there's in the foreground, you see this mathematician just doing some mathematical theorem."}, {"time": 1508, "text": "There's a little bit of a joke in that theorem, but let's not go into that."}, {"time": 1512, "text": "He's trying to prove some theorem."}, {"time": 1514, "text": "And he's about to be eaten by a saber tooth tiger who's hiding in the undergrowth, you see."}, {"time": 1559, "text": "See, I don't think consciousness is limited to humans."}, {"time": 1563, "text": "Yeah, that's the interesting question, at which point, if it is indeed connected to the evolutionary process, at which point did we pick up this?"}, {"time": 1571, "text": "A very hard question."}, {"time": 1573, "text": "It's certainly, I don't think it's primates, you know, you see these pictures of African hunting dogs and how they can plan amongst themselves how to catch the antelopes."}, {"time": 1585, "text": "Some of these David Attenborough films, I think this probably was one of them, and you could see the hunting dogs, and they divide themselves into two groups and they go in two routes, two different routes."}, {"time": 1596, "text": "One of them goes and they sort of hide next to the river."}, {"time": 1600, "text": "And the other group goes around and they start yelping at these, they don't bark, I guess whatever noise hunting dogs do, the antelopes, and they sort of round them up and they chase them in the direction of the river."}, {"time": 1614, "text": "And there are the other ones just waiting for them, just to get, because when they get to the river, it slows them down."}, {"time": 1620, "text": "And so they pounce on them."}, {"time": 1622, "text": "So they've obviously planned this all out somehow."}, {"time": 1625, "text": "I have no idea how."}, {"time": 1627, "text": "And there is some element of conscious planning, as far as I can see."}, {"time": 1632, "text": "I don't think it's just some kind of, so much of AI these days is done on what they call bottom up systems, is it?"}, {"time": 1641, "text": "Yeah, where you have neural networks and you give them a zillion different things to look at and then they sort of can choose one thing over another, just because it's seen so many examples and picks up on little signals, which one may not even be conscious of."}, {"time": 1661, "text": "And that doesn't feel like understanding."}, {"time": 1663, "text": "There's no understanding in that whatsoever."}, {"time": 1666, "text": "Well, you're being a little bit human centric, so."}, {"time": 1669, "text": "Well, I'm talking about, I'm not with the dogs, am I?"}, {"time": 1672, "text": "No, you're not."}, {"time": 1673, "text": "Sorry, not human centric, but I misspoke."}, {"time": 1676, "text": "Biology centric."}, {"time": 1679, "text": "Is it possible that consciousness would just look slightly different?"}, {"time": 1683, "text": "Well, I'm not saying it's biological, because we don't know."}, {"time": 1686, "text": "I think other examples of elephants is a wonderful example, too."}, {"time": 1690, "text": "Where they, this was, I think this was an Attenborough one, where the elephants have to go from along, the troop of them have to go long distances."}, {"time": 1700, "text": "And the leader of a troop is a female."}, {"time": 1701, "text": "They all are, apparently."}, {"time": 1703, "text": "And this female, she had to go all the way from one part of the country to another."}, {"time": 1710, "text": "And at a certain point, she made a detour."}, {"time": 1712, "text": "And they went off in this big detour."}, {"time": 1715, "text": "All the troop came with her."}, {"time": 1717, "text": "And this was where her sister had died."}, {"time": 1719, "text": "And there were her bones lying around."}, {"time": 1721, "text": "And they're going to pick up the bones, and they hand it around, and they caress the bones."}, {"time": 1725, "text": "And then they put them back, and they go back again."}, {"time": 1728, "text": "What in the hell are they doing?"}, {"time": 1731, "text": "That's so interesting."}, {"time": 1732, "text": "I mean, there's something going on."}, {"time": 1734, "text": "There's no clear connection with natural selection."}, {"time": 1739, "text": "There's just some deep feeling going on there, which has to do with their conscious experience."}, {"time": 1746, "text": "And I think it's something that, overall, is advantageous, our natural selection, but not directly to do with natural selection."}, {"time": 1758, "text": "I like that."}, {"time": 1762, "text": "Like I told you, I'm Russian, so I tend to romanticize all things of this nature, that it's not merely cold, hard computation."}, {"time": 1773, "text": "Perhaps I could just slightly answer your question."}, {"time": 1775, "text": "You were asking me, what is it?"}, {"time": 1778, "text": "There's something about sort of standing back and thinking about your own thought processes."}, {"time": 1790, "text": "You're standing back and thinking about the rules."}, {"time": 1793, "text": "And so there is something that you might say, you think about you're doing something, and you think, what the hell am I doing?"}, {"time": 1800, "text": "And you sort of stand back and think about what it is that's making you think in such a way."}, {"time": 1805, "text": "Just take a step back outside the game you've been playing."}, {"time": 1808, "text": "Yeah, you back up and you think about, you're just not playing the game anymore."}, {"time": 1812, "text": "You're thinking about what the hell you're doing in playing this game."}, {"time": 1816, "text": "And that's somehow, it's not a very precise description, but somehow it feels very true that that's somehow understanding."}, {"time": 1824, "text": "This kind of reflection."}, {"time": 1826, "text": "The reflection, yes."}, {"time": 1827, "text": "Yeah, it's a bit hard to put your finger on, but there is something there, which I think maybe could be unearthed at some point and see this is really what's going on, why conscious beings have this advantage, what it is that gives them advantage."}, {"time": 1842, "text": "And I think it goes way back."}, {"time": 1844, "text": "I don't think we're talking about the hunting dogs and the elephants."}, {"time": 1848, "text": "It's pretty clear that octopuses have the same sort of quality, and we call it consciousness."}, {"time": 1855, "text": "Seen enough examples of the way that they behave and the evolution route is completely different."}, {"time": 1863, "text": "Does it go way back to some common ancestor or did it come separately?"}, {"time": 1867, "text": "My hope is it's something simple, but the hard question if there's a hardware prerequisite."}, {"time": 1873, "text": "We have to develop some kind of hardware mechanisms in our computers."}, {"time": 1879, "text": "Like basically, as you suggest, we'll get to in a second, we kind of have to throw away the computer as we know it today."}, {"time": 1886, "text": "The deterministic machines we know today to try to create it."}, {"time": 1889, "text": "I mean, my hope, of course, is not, but... Well, I should go really back to the story which, in a sense, I haven't finished because I went to these three courses, you see, when I was a graduate student."}, {"time": 1903, "text": "And so I started to think, well, I'm really, I'm a pretty, what you might call a materialist in the sense of thinking that there's no kind of mystical something or other which comes in from who knows where."}, {"time": 1915, "text": "You still that?"}, {"time": 1916, "text": "Are you still, throughout your life, been a materialist?"}, {"time": 1918, "text": "I don't like the word materialist because it suggests we know what material is."}, {"time": 1922, "text": "And that is a bad word because..."}, {"time": 1926, "text": "But there's no mystical."}, {"time": 1927, "text": "It's not some mystical something which is not treatable by science."}, {"time": 1931, "text": "That's so beautifully put, just to pause on that for a second."}, {"time": 1934, "text": "You're a materialist, but you acknowledge that we don't really know what the material is."}, {"time": 1939, "text": "I mean, I like to call myself a scientist, I suppose, but it means that..."}, {"time": 1947, "text": "Yes, well, you see, the question goes on here."}, {"time": 1950, "text": "So I began thinking, okay, if consciousness or understanding is something which is not a computational process, what can it be?"}, {"time": 1960, "text": "And I knew enough from my undergraduate work."}, {"time": 1962, "text": "I knew about Newtonian mechanics, and I knew how basically you could put it on a computer."}, {"time": 1970, "text": "There is a fundamental issue, which is it important or not?"}, {"time": 1974, "text": "That computation depends upon discrete things."}, {"time": 1979, "text": "So you're using discrete elements, whereas the physical laws depend on the continuum."}, {"time": 1986, "text": "Now, is this something to do with it?"}, {"time": 1989, "text": "Is it the fact that we use the continuum in our physics?"}, {"time": 1992, "text": "And if we model our physical system, we use discrete systems like ordinary computers?"}, {"time": 1999, "text": "I came to the view that that's probably not it."}, {"time": 2002, "text": "I might have to retract on that someday, but the view was no, you can get close enough."}, {"time": 2008, "text": "It's not altogether clear, I have to say, but you can get close enough."}, {"time": 2035, "text": "And it's a very impressive piece of computational work, how you can actually work out the shapes of those signals."}, {"time": 2041, "text": "And now we have LIGO seeing these signals, and they say, yeah, those black holes spiral into each other."}, {"time": 2047, "text": "This is just a vindication of the power of computation in describing Einstein's general relativity."}, {"time": 2056, "text": "So in that case, we can get close, but with computation, we can get close to our understanding of the physics."}, {"time": 2063, "text": "You can get very, very close."}, {"time": 2064, "text": "Now, is that close enough, you see?"}, {"time": 2066, "text": "And then I went to this course by Dirac."}, {"time": 2069, "text": "Now, you see, I think it was the very first lecture that he gave, and he was talking about a superposition principle."}, {"time": 2077, "text": "And he said, if you have a particle, you usually think of particle can be over here or over there, but in quantum mechanics, it can be over here and over there at the same time."}, {"time": 2088, "text": "And you have these states which involve a superposition in some sense of different locations for that particle."}, {"time": 2096, "text": "And then he got out his piece of chalk."}, {"time": 2098, "text": "Some people say he broke it in two as a kind of illustration of how the piece of chalk might be over here and over there at the same time."}, {"time": 2106, "text": "And he was talking about this, and my mind wandered."}, {"time": 2110, "text": "I don't remember what he said."}, {"time": 2113, "text": "All I can remember, he's just moved on to the next topic, and something about energy he'd mentioned, which I had no idea what it had to do with anything."}, {"time": 2121, "text": "And so I'd been struck with this and worried about it ever since."}, {"time": 2125, "text": "It's probably just as well I didn't hear his explanation because it was probably one of these things to calm me down and not worry about it anymore."}, {"time": 2132, "text": "Whereas in my case, I've worried about it ever since."}, {"time": 2135, "text": "So I thought maybe that's the catch."}, {"time": 2138, "text": "There is something in quantum mechanics where the superpositions become one or the other, and that's not part of quantum mechanics."}, {"time": 2147, "text": "There's something missing in the theory."}, {"time": 2150, "text": "The theory is incomplete."}, {"time": 2151, "text": "It's not just incomplete."}, {"time": 2152, "text": "It's in a certain sense not quite right because if you follow the equation, the basic equation of quantum mechanics, that's the Schrodinger equation, you could put that on a computer too."}, {"time": 2162, "text": "There are lots of difficulties about how many parameters you have to put in and so on."}, {"time": 2166, "text": "That can be very tricky, but nevertheless, it is a computational process."}, {"time": 2170, "text": "Modulo this question about the continuum as before, but it's not clear that makes any difference."}, {"time": 2176, "text": "So our theories of quantum mechanics may be missing the same element that the universal Turing machine is missing about consciousness."}, {"time": 2186, "text": "Yeah, this is the view I held is that you need a theory and that what people call the reduction of the state or the collapse of the wave function, which you have to have, otherwise quantum mechanics doesn't relate to the world we see."}, {"time": 2199, "text": "To make it relate to the world we see, you've got to break the Schrodinger equation."}, {"time": 2205, "text": "Schrodinger himself was absolutely appalled by this idea, his own equation."}, {"time": 2210, "text": "I mean, that's why he introduced this famous Schrodinger's cat as a thought experiment."}, {"time": 2216, "text": "He's really saying, look, this is where my equation leads you into it."}, {"time": 2219, "text": "There's something wrong, something we haven't understood, which is basically fundamental."}, {"time": 2225, "text": "And so I was trying to put all these things together and said, well, it's got to be the noncomputability comes in there."}, {"time": 2231, "text": "And I also can't quite remember when I thought this, but it's when gravity is involved in quantum mechanics."}, {"time": 2238, "text": "It's the combination of those two."}, {"time": 2239, "text": "And that's that point when you have good reasons to believe, this came much later, that I have good reason to believe that the principles of general relativity and those of quantum mechanics, most particularly, it's the basic principle of equivalence, which goes back to Galileo."}, {"time": 2261, "text": "If you fall freely, you eliminate the gravitational field."}, {"time": 2266, "text": "So you imagine Galileo dropping his big rock and his little rock from the leaning tower, whether he actually ever did that or not, pretty irrelevant."}, {"time": 2275, "text": "And as the rocks fall to the ground, you have a little insect sitting on one of them, looking at the other one."}, {"time": 2281, "text": "And it seems to think, oh, there's no gravity here."}, {"time": 2284, "text": "Of course, it hits the ground and then you realize something's difference going on."}, {"time": 2287, "text": "But when it's in free fall, the gravity has been eliminated."}, {"time": 2291, "text": "Galileo understood that very beautifully."}, {"time": 2295, "text": "He gives these wonderful examples of fireworks."}, {"time": 2298, "text": "And you see the fireworks and explode, and you see this fear of sparkling fireworks."}, {"time": 2303, "text": "It remains as fear as it falls down, as though there were no gravity."}, {"time": 2309, "text": "So he understood that principle, but he couldn't make a theory out of it."}, {"time": 2313, "text": "Einstein came along, used exactly the same principle."}, {"time": 2316, "text": "And that's the basis of Einstein's general theory of relativity."}, {"time": 2321, "text": "Now, there is a conflict."}, {"time": 2323, "text": "This is something I did much, much later."}, {"time": 2325, "text": "So this wasn't at those days, much, much later."}, {"time": 2328, "text": "You can see there is a basic conflict between the principle of superposition, the thing that Dirac was talking about, and the principle of general covariance."}, {"time": 2338, "text": "Well, principle of equivalence."}, {"time": 2341, "text": "Gravitational field's equivalent to an acceleration."}, {"time": 2343, "text": "Can you pause for a second?"}, {"time": 2344, "text": "What is the principle of equivalence?"}, {"time": 2346, "text": "It's this Galileo principle that we can eliminate, at least locally."}, {"time": 2351, "text": "You have to be in a small neighborhood because if you have people dropping rocks all around the world somewhere, you can't get rid of it all at once."}, {"time": 2359, "text": "But in the local neighborhood, you can eliminate the gravitational field by falling freely with it."}, {"time": 2366, "text": "And we now see this with astronauts, and they don't, you know, the Earth is right there."}, {"time": 2370, "text": "You can see the great globe of the Earth right beneath them."}, {"time": 2373, "text": "But they don't care about it."}, {"time": 2375, "text": "As far as they're concerned, there's no gravity."}, {"time": 2379, "text": "They fall freely within the gravitational field, and that gets rid of the gravitational field."}, {"time": 2385, "text": "And that's the principle of equivalence."}, {"time": 2386, "text": "So what's the contradiction?"}, {"time": 2388, "text": "What's the tension with superposition and equivalence?"}, {"time": 2391, "text": "Oh, well, that's technical."}, {"time": 2392, "text": "So just to backtrack for a second just to see if we can weave a thread through it all."}, {"time": 2397, "text": "So we started to think about consciousness as potentially needing some of the same, not mystical, but some of the same magic."}, {"time": 2408, "text": "You see, it is a complicated story."}, {"time": 2410, "text": "So, you know, people think, oh, I'm drifting away from the point or something."}, {"time": 2414, "text": "But I think it is a complicated story."}, {"time": 2416, "text": "So what I'm trying to say, I mean, I try to put it in a nutshell, but it's not so easy."}, {"time": 2420, "text": "I'm trying to say that whatever consciousness is, it's not a computation."}, {"time": 2427, "text": "Or it's not a physical process which can be described by computation."}, {"time": 2433, "text": "But it nevertheless could be, so one of the interesting models that you've proposed is the orchestrated objective reduction."}, {"time": 2441, "text": "Yes, well, you see, that's going from there, you see."}, {"time": 2444, "text": "So I say I have no idea."}, {"time": 2446, "text": "So I wrote this book through my scientific career."}, {"time": 2450, "text": "I thought, you know, when I'm retired, I'll have enough time to write a sort of a popularish book which I will explain my ideas and puzzles, what I like, beautiful things about physics and mathematics, and this puzzle about computability and consciousness and so on."}, {"time": 2469, "text": "And in the process of writing this book, well, I thought I'd do it when I was retired."}, {"time": 2474, "text": "I didn't actually, I didn't wait that long because there was a radio discussion between Edward Fredkin and Marvin Minsky."}, {"time": 2484, "text": "And they were talking about what computers could do."}, {"time": 2488, "text": "And they were entering a big room."}, {"time": 2490, "text": "They imagined entering this big room where at the other end of the room, two computers were talking to each other."}, {"time": 2496, "text": "And as you walk up to the computers, they will have communicated to each other more ideas, concepts, things than the entire human race had ever done."}, {"time": 2509, "text": "So I thought, well, I know where you're coming from, but I just don't believe you."}, {"time": 2513, "text": "There's something missing."}, {"time": 2517, "text": "So I thought, well, I should write my book."}, {"time": 2520, "text": "And so I did."}, {"time": 2521, "text": "It was roughly the same time Stephen Hawking was writing his brief history of time."}, {"time": 2527, "text": "In the 80s at some point."}, {"time": 2531, "text": "The book you're talking about is The Emperor's New Mind."}, {"time": 2532, "text": "The Emperor's New Mind, that's right."}, {"time": 2533, "text": "And both are incredible books, The Brief History of Time and The Emperor's New Mind."}, {"time": 2538, "text": "Yes, it was quite interesting because he told me he'd got Carl Sagan, I think, to write a foreword for the book, you see."}, {"time": 2546, "text": "So I thought, gosh, what am I gonna do?"}, {"time": 2548, "text": "I'm not gonna get anywhere unless I get somebody."}, {"time": 2551, "text": "So I said, oh, I know Martin Gardner, so I wonder if he'd do it."}, {"time": 2554, "text": "So he did, and he did a very nice foreword."}, {"time": 2556, "text": "So that's an incredible book, and some of the same people you mentioned, Ed Franken, which I guess of expert systems fame, and Minsky, of course, people know in the AI world, but they represent the artificial intelligence world that do hope and dream that AI's intelligence is."}, {"time": 2573, "text": "Well, you see, it was my thinking, well, you know, I see where they're coming from."}, {"time": 2577, "text": "From that perspective, yeah, you're right."}, {"time": 2579, "text": "But that's not my perspective."}, {"time": 2581, "text": "So I thought I had to say it."}, {"time": 2583, "text": "And as I was writing my book, you see, I thought, well, I don't really know anything about neurophysiology."}, {"time": 2587, "text": "What am I doing writing this book?"}, {"time": 2589, "text": "So I started reading up about neurophysiology, and I read up, and I think, now, I'm trying to find out how it is that nerve signals could possibly preserve quantum coherence."}, {"time": 2598, "text": "And all I read is that the electrical signals which go along the nerves create effects through the brain."}, {"time": 2605, "text": "There's no chance you can isolate it."}, {"time": 2608, "text": "So I thought, this is hopeless."}, {"time": 2609, "text": "So I come to the end of the book, and I more or less give up."}, {"time": 2613, "text": "I just think of something which I didn't believe in."}, {"time": 2616, "text": "Maybe this is a way around it, but no."}, {"time": 2619, "text": "And then, you see, I thought, well, maybe this book will at least stimulate young people to do science or something."}, {"time": 2625, "text": "And I got all these letters from old, retired people instead."}, {"time": 2628, "text": "These are the only people who had time to read my book."}, {"time": 2632, "text": "So, I mean, but."}, {"time": 2633, "text": "Except for Stuart Hameroff."}, {"time": 2636, "text": "Stuart Hameroff wrote to me, and he said, I think you're missing something."}, {"time": 2641, "text": "You don't know about microtubules, do you?"}, {"time": 2643, "text": "He didn't put it quite like that."}, {"time": 2644, "text": "But that was more or less it."}, {"time": 2645, "text": "And he said, this is what you really need to consider."}, {"time": 2648, "text": "So I thought, my God, yes."}, {"time": 2650, "text": "That's a much more promising structure."}, {"time": 2652, "text": "So, I mean, fundamentally, you were searching for the source of, noncomputable source of consciousness within the human brain, in the biology."}, {"time": 2665, "text": "And so, what are, if I may ask, what are microtubules?"}, {"time": 2670, "text": "Well, you see, I was ignorant in what I'd read."}, {"time": 2673, "text": "I never came across them in the books I looked at."}, {"time": 2677, "text": "Perhaps I only read rather superficially, which is true."}, {"time": 2680, "text": "But I didn't know about microtubules."}, {"time": 2683, "text": "Stuart, I think one of the things that impressed him about them was, when you see pictures of mitosis, that's a cell dividing, and you see all the chromosomes."}, {"time": 2693, "text": "And the chromosomes, they all get lined up, and then they get pulled apart."}, {"time": 2697, "text": "And so, as the cell divides, half the chromosomes go, they divide into the two parts, and they go two different ways."}, {"time": 2707, "text": "And what is it that's pulling them apart?"}, {"time": 2709, "text": "Well, those are these little things called microtubules."}, {"time": 2712, "text": "And so, he started to get interested in them."}, {"time": 2715, "text": "And he formed the view, well, he was, his day job or night job or whatever you call it, is to put people to sleep, except he doesn't like calling it sleep because it's different."}, {"time": 2725, "text": "General anesthetics in a reversible way."}, {"time": 2729, "text": "So, you want to make sure that they don't experience the pain that would otherwise be something that they feel."}, {"time": 2736, "text": "And consciousness is turned off for a while, and it can be turned back on again."}, {"time": 2741, "text": "So, it's crucial that you can turn it off and turn it on."}, {"time": 2744, "text": "And what do you do when you're doing that?"}, {"time": 2747, "text": "What do general anesthetic gases do?"}, {"time": 2750, "text": "And see, he formed the view that it's the microtubules that they affect."}, {"time": 2756, "text": "And the details of why he formed that view is not, well, they're clear to me, but there's an interesting story he keeps talking about."}, {"time": 2765, "text": "But I found this very exciting because I thought these structures, these little tubes which inhabit pretty well all cells, it's not just neurons, apart from red blood cells, they inhabit pretty well all the other cells in the body."}, {"time": 2783, "text": "But they're not all the same kind."}, {"time": 2785, "text": "You get different kinds of microtubules."}, {"time": 2788, "text": "And the ones that excited me the most, this may still not be totally clear, but the ones that excited me most were the only ones that I knew about at the time because they're very, very symmetrical structures."}, {"time": 2804, "text": "And I had reason to believe that these very symmetrical structures would be much better at preserving a quantum state, quantum coherence, preserving the thing without, you just need to preserve certain degrees of freedom without them leaking into the environment."}, {"time": 2821, "text": "Once they leak into the environment, you're lost."}, {"time": 2823, "text": "So you've got to preserve these quantum states at a level which the state reduction process comes in and that's where I think the noncomputability comes in and it's the measurement process in quantum mechanics, what's going on."}, {"time": 2840, "text": "So something about the measurement process and what's going on, something about the structure of the microtubules, your intuition says maybe there's something here, maybe this kind of structure allows for the mystery of the quantum mechanics."}, {"time": 2855, "text": "There was a much better chance, yes."}, {"time": 2857, "text": "It just struck me that partly it was the symmetry because there is a feature of symmetry you can preserve quantum coherence much better with symmetrical structures."}, {"time": 2868, "text": "There's a good reason for that."}, {"time": 2870, "text": "And that impressed me a lot."}, {"time": 2872, "text": "I didn't know the difference between the A lattice and B lattice at that time, which could be important."}, {"time": 2877, "text": "Now that could even, see, which isn't talked about much."}, {"time": 2880, "text": "But that's some, in some sense, details."}, {"time": 2882, "text": "We've got to take a step back just to say in case people are not familiar."}, {"time": 2886, "text": "So this was called the orchestrated objective reduction idea or ORCOR, which is a biological philosophy of mind that postulates that consciousness originates at the quantum level inside neurons."}, {"time": 2902, "text": "So that has to do with your search for where, where is it coming from?"}, {"time": 2906, "text": "So that's counter to the notion that consciousness may arise from the computation performed by the synapses."}, {"time": 2913, "text": "Yes, I think the key point."}, {"time": 2915, "text": "Sometimes people say it's because it's quantum mechanical."}, {"time": 2920, "text": "It's not just that."}, {"time": 2922, "text": "See, it's more outrageous than that."}, {"time": 2925, "text": "You see, this is one reason I think we're so far off from it, because we don't even know the physics right."}, {"time": 2931, "text": "You see, it's not just quantum mechanics."}, {"time": 2933, "text": "People say, oh, you know, quantum systems and biological structures."}, {"time": 2937, "text": "No, will you starting to see that some basic biological systems does depend on quantum."}, {"time": 2945, "text": "I mean, look, in the first place, all of chemistry is quantum mechanics."}, {"time": 2949, "text": "People got used to that, so they don't count that."}, {"time": 2953, "text": "So he said, let's not count quantum chemistry."}, {"time": 2956, "text": "We sort of got the hang of that, I think."}, {"time": 2959, "text": "But you have quantum effects, which are not just chemical, in photosynthesis."}, {"time": 2965, "text": "And this is one of the striking things in the last several years, that photosynthesis seems to be a basically quantum process, which is not simply chemical."}, {"time": 2976, "text": "It's using quantum mechanics in a very basic way."}, {"time": 2981, "text": "So you could start saying, oh, well, if photosynthesis is based on quantum mechanics, why not behavior of neurons and things like that?"}, {"time": 2990, "text": "Maybe there's something which is a bit like photosynthesis in that respect."}, {"time": 2995, "text": "But what I'm saying is even more outrageous than that, because those things are talking about conventional quantum mechanics."}, {"time": 3003, "text": "Now, my argument says that conventional quantum mechanics, if you're just following the Schrodinger equation, that's still computable."}, {"time": 3011, "text": "So you've got to go beyond that."}, {"time": 3013, "text": "So you've got to go to where quantum mechanics goes wrong in a certain sense."}, {"time": 3021, "text": "You have to be a little bit careful about that, because the way people do quantum mechanics is a sort of mixture of two different processes."}, {"time": 3032, "text": "One of them is the Schrodinger equation, which is an equation Schrodinger wrote down, and it tells you how the state of a system evolves."}, {"time": 3042, "text": "And it evolves according to this equation, completely deterministic, but it evolves into ridiculous situations."}, {"time": 3050, "text": "And this was what Schrodinger was very much pointing out with his cat."}, {"time": 3054, "text": "He said, you follow my equation, that's Schrodinger's equation, and you could say that you have to get a cat, a cat which is dead and alive at the same time."}, {"time": 3064, "text": "That would be the evolution of the Schrodinger equation, would lead to a state, which is the cat being dead and alive at the same time."}, {"time": 3072, "text": "And he's more or less saying, this is an absurdity."}, {"time": 3076, "text": "People nowadays say, oh, well, Schrodinger said you can have a cat which is dead, that's not that."}, {"time": 3080, "text": "You see, he was saying, this is an absurdity."}, {"time": 3085, "text": "And that the reduction of the state or the collapse of the wave function or whatever it is, is something which has to be understood."}, {"time": 3094, "text": "It's not following the Schrodinger equation."}, {"time": 3097, "text": "It's not the way we conventionally do quantum mechanics."}, {"time": 3101, "text": "There's something more than that."}, {"time": 3104, "text": "And it's easy to quote authority here because Einstein, at least three of the greatest physicists of 20th century who were very fundamental in developing quantum mechanics, Einstein, one of them, Schrodinger, another, Dirac, another."}, {"time": 3123, "text": "You have to look carefully at Dirac's writing because he didn't tend to say this out loud too much because he was very cautious about what he said."}, {"time": 3131, "text": "You find the right place and you see he says quantum mechanics is a provisional theory."}, {"time": 3138, "text": "We need something which explains the collapse of the wave function."}, {"time": 3143, "text": "We need to go beyond the theory we have now."}, {"time": 3147, "text": "I happen to be one of the kinds of people, there are many, there is a whole group of people, they're all considered to be a bit mavericks, who believe that quantum mechanics needs to be modified."}, {"time": 3158, "text": "There's a small minority of those people, which are already a minority, who think that the way in which it's modified has to be with gravity."}, {"time": 3168, "text": "And there is an even smaller minority of those people who think it's the particular way that I think it is."}, {"time": 3173, "text": "You see."}, {"time": 3175, "text": "So those are the quantum gravity folks."}, {"time": 3176, "text": "But what's... You see, quantum gravity is already not this."}, {"time": 3180, "text": "Because when you say quantum gravity, what you really mean is quantum mechanics applied to gravitational theory."}, {"time": 3188, "text": "So you say, let's take this wonderful formalism of quantum mechanics and make gravity fit into it."}, {"time": 3195, "text": "So that is what quantum gravity is meant to be."}, {"time": 3198, "text": "Now I'm saying you've got to be more even handed that gravity affects the structure of quantum mechanics too."}, {"time": 3204, "text": "It's not just you quantize gravity, you've got to gravitate quantum mechanics."}, {"time": 3209, "text": "And it's a two way thing."}, {"time": 3211, "text": "But then when do you even get started?"}, {"time": 3212, "text": "So that you're saying that we have to figure out a totally new ideas in there."}, {"time": 3217, "text": "No, you're stuck."}, {"time": 3219, "text": "You don't have a theory."}, {"time": 3221, "text": "That's the trouble."}, {"time": 3222, "text": "So this is a big problem."}, {"time": 3224, "text": "If you say, okay, well, what's the theory?"}, {"time": 3227, "text": "So maybe in the very early days, sort of..."}, {"time": 3229, "text": "It is in the very early days."}, {"time": 3231, "text": "But just making this point."}, {"time": 3233, "text": "You see, Stuart Hammeroff tends to be, oh, Penrose says that it's got to be a reduction of the state and so on, so let's use it."}, {"time": 3240, "text": "The trouble is Penrose doesn't say that."}, {"time": 3242, "text": "Penrose says, well, I think that we have no experiments as yet, which shows that."}, {"time": 3250, "text": "There are experiments which are being thought through and which I'm hoping will be performed."}, {"time": 3255, "text": "There is an experiment which is being developed by Dirk Baumeister, who I've known for a long time, who shares his time between Leiden in the Netherlands and Santa Barbara in the US."}, {"time": 3267, "text": "And he's been working on an experiment which could perhaps demonstrate that quantum mechanics, as we now understand it, if you don't bring in the gravitational effects, it has to be modified."}, {"time": 3282, "text": "And then there's also experiments that are underway that kind of look at the microtubule side of things to see if there's, in the biology, you could see something like that."}, {"time": 3293, "text": "Could you briefly mention it?"}, {"time": 3295, "text": "Because that's really sort of one of the only experimental attempts in the very early days of even thinking about consciousness."}, {"time": 3302, "text": "I think there's a very serious area here, which is what Stuart Hammeroff is doing, and I think it's very important."}, {"time": 3309, "text": "One of the few places that you can really get a bit of a handle on what consciousness is is what turns it off."}, {"time": 3317, "text": "And when you're thinking about general anesthetics, it's very specific."}, {"time": 3321, "text": "These things turn consciousness off."}, {"time": 3324, "text": "What the hell do they do?"}, {"time": 3326, "text": "Well, Stuart and a number of people who work with him and others happen to believe that the general anesthetics directly affect microtubules."}, {"time": 3336, "text": "And there is some evidence for this."}, {"time": 3338, "text": "I don't know how strong it is and how watertight the case is, but I think there is some evidence pointing in that kind of direction."}, {"time": 3349, "text": "It's not just an ordinary chemical process."}, {"time": 3351, "text": "There's something quite different about it."}, {"time": 3353, "text": "And one of the main candidates is that these anesthetic gases do affect directly microtubules."}, {"time": 3362, "text": "And how strong that evidence is, I wouldn't be in a position to say, but I think there is fairly impressive evidence."}, {"time": 3370, "text": "And the point is the experiments are being undertaken, which is."}, {"time": 3373, "text": "I mean, that is experimental."}, {"time": 3374, "text": "You see, so it's a very clear direction where you can think of experiments which could indicate whether or not it's really microtubules which the anesthetic gases directly affect."}, {"time": 3387, "text": "One of the sad things is as far as I'm, from my outside perspective, is not many people are working on this."}, {"time": 3394, "text": "So there's a very, like with Stuart, it feels like there's very few people are carrying the flag forward on this."}, {"time": 3401, "text": "I think it's not many in the sense it's a minority, but it's not zero anymore."}, {"time": 3406, "text": "You see, when Stuart and I were originally taught by us, we were just us and a few of our friends, there weren't many people taking it, but it's grown into one of the main viewpoints."}, {"time": 3419, "text": "There might be about four or five or six different views which people hold, and it's one of them."}, {"time": 3427, "text": "So it's considered as one of the possible lines of thinking, yes."}, {"time": 3433, "text": "You describe physics theories as falling into one of three categories, the superb, the useful, or the tentative."}, {"time": 3439, "text": "I like those words."}, {"time": 3441, "text": "It's a beautiful categorization."}, {"time": 3443, "text": "Do you think we'll ever have a superb theory of intelligence and of consciousness?"}, {"time": 3449, "text": "We might."}, {"time": 3451, "text": "We're a long way from it."}, {"time": 3453, "text": "I don't think we're even, whether we're in the tentative scale."}, {"time": 3456, "text": "I mean, it's... You don't think we've even entered the realm of tentative?"}, {"time": 3464, "text": "Now, when you see this, it's so controversial."}, {"time": 3467, "text": "We don't have a clear view which is accepted by a majority."}, {"time": 3473, "text": "I mean, you see, yeah, people, most views are computational in one form or another."}, {"time": 3477, "text": "They think it's some, but it's not very clear, because even the IIT people who think of them as computational, but I've heard them say, no, consciousness is supposed to be not computational."}, {"time": 3489, "text": "I say, well, if it's not computational, what in the hell is it?"}, {"time": 3492, "text": "What's going on?"}, {"time": 3494, "text": "What physical processes are going on which are that?"}, {"time": 3498, "text": "What does it mean for something to be computational then?"}, {"time": 3501, "text": "So, is... Well, there has to be a process which is... You see, it's very curious the way the history has developed in quantum mechanics, because very early on, people thought there was something to do with consciousness, but it was almost the other way around."}, {"time": 3519, "text": "You see, you have to say the Schrodinger equation says all these different alternatives happen all at once, and then when is it that only one of them happens?"}, {"time": 3528, "text": "Well, one of the views, which was quite commonly held by a few distinguished quantum physicists, that's when a conscious being looks at the system or becomes aware of it, and at that point, it becomes one or the other."}, {"time": 3541, "text": "That's a role where consciousness is somehow actively reducing the state."}, {"time": 3547, "text": "My view is almost the exact opposite of that."}, {"time": 3550, "text": "It's the state reduces itself in some way which..."}, {"time": 3554, "text": "Some noncomputational way which we don't understand, we don't have a proper theory of, and that is the building block of what consciousness is."}, {"time": 3564, "text": "So consciousness is the other way around."}, {"time": 3566, "text": "It depends on that choice which nature makes all the time when the state becomes one or the other rather than the superposition of one and the other, and when that happens, there is what we're saying now, an element of proto consciousness takes place."}, {"time": 3583, "text": "Proto consciousness is, roughly speaking, the building block out of which actual consciousness is constructed."}, {"time": 3590, "text": "So you have these proto conscious elements, which are when the state decides to do one thing or the other, and that's the thing which when organized together, that's the OR part in ORCOR, but the ORC part, that's the OR part at least one can see where we're driving at a theory."}, {"time": 3610, "text": "You can say it's the quantum choice of going this way or that way, but the ORC part, which is the orchestration of this, is much more mysterious, and how does the brain somehow orchestrate all these individual OR processes into a genuine, genuine conscious experience?"}, {"time": 3632, "text": "And it might be something that's beautifully simple, but we're completely in the dark about."}, {"time": 3637, "text": "Yeah, I think at the moment, that's the thing, you know, we happily put the word ORC down there to say orchestrated, but that's even more unclear what that really means."}, {"time": 3649, "text": "Just like the word material, orchestrated, who knows?"}, {"time": 3654, "text": "And we've been dancing a little bit between the word intelligence or understanding and consciousness."}, {"time": 3660, "text": "Do you kind of see those as sitting in the same space of mystery as we discussed?"}, {"time": 3665, "text": "Yes, well, you see, I tend to say you have understanding and intelligence and awareness, and somehow understanding is in the middle of it, you see."}, {"time": 3681, "text": "I like to say, could you say of an entity that is actually intelligent if it doesn't have the quality of understanding?"}, {"time": 3690, "text": "Now, you see, I'm using terms I don't even know how to define, but who cares?"}, {"time": 3694, "text": "I'm just relating them."}, {"time": 3695, "text": "They're somewhat poetic, so if I somehow understand them."}, {"time": 3698, "text": "Yes, that's right, we don't, exactly."}, {"time": 3700, "text": "But they're not mathematical in nature."}, {"time": 3702, "text": "Yes, you see, as a mathematician, I don't know how to define any of them, but at least I can point to the connections."}, {"time": 3707, "text": "So the idea is intelligence is something which I believe needs understanding, otherwise you wouldn't say it's really intelligence."}, {"time": 3716, "text": "And understanding needs awareness, otherwise you wouldn't really say it's understanding."}, {"time": 3722, "text": "Do you say of an entity that understands something, unless it's really aware of it, you know, normal usage."}, {"time": 3728, "text": "So there's a three sort of awareness, understanding, and intelligence."}, {"time": 3733, "text": "And I just tend to concentrate on understanding because that's where I can say something."}, {"time": 3741, "text": "But what does it mean to be, perceive the color blue or something?"}, {"time": 3746, "text": "I mean, I'm foggiest."}, {"time": 3748, "text": "It's a much more difficult question."}, {"time": 3751, "text": "I mean, is it the same if I see a color blue and you see it?"}, {"time": 3754, "text": "If you're somebody with this condition, what's it called then?"}, {"time": 3758, "text": "Or where you assign a sound to a color."}, {"time": 3762, "text": "You get colors and sounds mixed up."}, {"time": 3764, "text": "And that sort of thing."}, {"time": 3765, "text": "I mean, an interesting subject."}, {"time": 3769, "text": "But from the physics perspective, from the fundamentals perspective, we don't."}, {"time": 3773, "text": "I think we're way off having much understanding what's going on there."}, {"time": 3777, "text": "In your 2010 book, Cycles of Time, you suggest that another universe may have existed before the Big Bang."}, {"time": 3786, "text": "Can you describe this idea?"}, {"time": 3788, "text": "First of all, what is the Big Bang?"}, {"time": 3790, "text": "Sounds like a funny word."}, {"time": 3793, "text": "And what may have been there before it?"}, {"time": 3797, "text": "Just as a matter of terminology, I don't like to call it another universe."}, {"time": 3801, "text": "Because when you have another universe, you think of it kind of quite separate from us."}, {"time": 3805, "text": "But these things, they're not separate."}, {"time": 3808, "text": "Now the Big Bang, conventional theory."}, {"time": 3811, "text": "You see, I was actually brought up in the sense of when I started getting interested in cosmology, there was a thing called the Steady State Model, which was sort of philosophically very interesting."}, {"time": 3821, "text": "And there wasn't a Big Bang in that theory."}, {"time": 3823, "text": "But somehow, new material was created all the time in the form of hydrogen, and the universe kept on expanding, expanding, expanding, and there was room for more hydrogen."}, {"time": 3832, "text": "It was a rather philosophically nice picture."}, {"time": 3834, "text": "It was disproved when the Big Bang, well, when I say the Big Bang, this was theoretically discovered by people trying to solve Einstein's equations and apply it to cosmology."}, {"time": 3849, "text": "Einstein didn't like the idea."}, {"time": 3850, "text": "He liked a universe which was there all the time."}, {"time": 3854, "text": "And he had a model which was there all the time."}, {"time": 3856, "text": "But then there was this discovery, accidental discovery, very important discovery, of this microwave background."}, {"time": 3865, "text": "And if you, there's the crackle on your television screen which is already sensing this microwave background, which is coming at us from all directions."}, {"time": 3875, "text": "And you can trace it back and back and back and back."}, {"time": 3877, "text": "And it came from a very early stage of the universe."}, {"time": 3881, "text": "Well, it's part of the Big Bang theory."}, {"time": 3883, "text": "The Big Bang theory was when people tried to solve Einstein's equations."}, {"time": 3887, "text": "They really found you had to have this initial state where the universe, it used to be called the primordial atom and things like this."}, {"time": 3895, "text": "There's Friedman and Lemaitre."}, {"time": 3898, "text": "Friedman was a Russian, Lemaitre was a Belgian."}, {"time": 3901, "text": "And they independently, well, basically Friedman first."}, {"time": 3904, "text": "And Lemaitre talked about the initial state, which is a very, very concentrated initial state which seemed to be the origin of the universe."}, {"time": 3913, "text": "Primordial atom."}, {"time": 3914, "text": "Primordial atom is what he called it, yes."}, {"time": 3917, "text": "And then it became, well, Fred Hoyle used the term Big Bang in a kind of derogatory sense."}, {"time": 3922, "text": "Just like with the Schrodinger and the cats, right?"}, {"time": 3925, "text": "Yes, it's like sort of got picked up on whereas it wasn't his intention originally."}, {"time": 3930, "text": "But then the evidence piled up and piled up."}, {"time": 3933, "text": "And one of my friends and I learned a lot from him when I was in Cambridge was Dennis Sharma."}, {"time": 3938, "text": "He was a great proponent of steady state."}, {"time": 3940, "text": "And then he got converted."}, {"time": 3941, "text": "He said, no, I'm sorry."}, {"time": 3943, "text": "I had a great respect for him."}, {"time": 3944, "text": "He went around lecturing and said, I was wrong."}, {"time": 3946, "text": "The steady state model doesn't work."}, {"time": 3948, "text": "There was this Big Bang."}, {"time": 3950, "text": "And this microwave background that you see, okay, it's not actually quite the Big Bang."}, {"time": 3955, "text": "When I say not quite, it's about 380,000 years after the Big Bang, but that's what you see."}, {"time": 3961, "text": "But then you have to have had this Big Bang before it in order to make the equations work."}, {"time": 3965, "text": "And it works beautifully except for one little thing, which is this thing called inflation, which people had to put into it to make it work."}, {"time": 3974, "text": "When I first heard of it, I didn't like it at all."}, {"time": 3977, "text": "Inflation is that in the first, I'm gonna give you a very tiny number."}, {"time": 3982, "text": "Think of a second."}, {"time": 3983, "text": "That's not very long."}, {"time": 3985, "text": "Now I'm gonna give you a fraction of a second, one over a number."}, {"time": 3989, "text": "This number has 32 digits between, well, let's say between 36 and 32 digits."}, {"time": 3997, "text": "Tiny, tiny time between those two tiny, ridiculous seconds, fraction of a second, the universe was supposed to have expanded in this exponential way, an enormous way."}, {"time": 4009, "text": "For no apparent reason, you had to invent a particular thing called the inflaton field to make it do it."}, {"time": 4016, "text": "And I thought this is completely crazy."}, {"time": 4018, "text": "There are reasons why people stuck with this idea."}, {"time": 4021, "text": "You see, the thing is that I formed my model for reasons which are very fundamental, if you like."}, {"time": 4027, "text": "It has to do with this very fundamental principle, which is known as the second law of thermodynamics."}, {"time": 4033, "text": "The second law of thermodynamics says more or less, things get more and more random as time goes on."}, {"time": 4040, "text": "Now, another way of saying exactly the same thing is things get less and less random."}, {"time": 4044, "text": "As things go back, as you go back in time, they get less and less random."}, {"time": 4048, "text": "They go back and back and back and back."}, {"time": 4050, "text": "And the earliest thing you can directly see is this microwave background."}, {"time": 4054, "text": "What's one of the most striking features of it is that it's random."}, {"time": 4059, "text": "It has this, what you call this spectrum of, which is what's called the Planck spectrum, of frequencies, different intensities for different frequencies."}, {"time": 4069, "text": "And it's this wonderful curve due to Max Planck."}, {"time": 4073, "text": "And what's it telling you?"}, {"time": 4074, "text": "It's telling you that the entropy is at a maximum."}, {"time": 4078, "text": "Started off at a maximum and it's going up ever since."}, {"time": 4082, "text": "I call that the mammoth in the room."}, {"time": 4083, "text": "I mean, it's a paradox."}, {"time": 4085, "text": "A mammoth, yeah, it is."}, {"time": 4087, "text": "And so people, why don't cosmologists worry about this?"}, {"time": 4090, "text": "So I worried about it."}, {"time": 4091, "text": "And then I thought, well, it's not really a paradox because you're looking at matter and radiation at a maximum entropy state."}, {"time": 4100, "text": "What you're not seeing directly in that is the gravitation."}, {"time": 4105, "text": "It's gravitation, which is not thermalized."}, {"time": 4108, "text": "The gravitation was very, very low entropy."}, {"time": 4112, "text": "And it's low entropy by the uniformity."}, {"time": 4114, "text": "And you see that in the microwave too."}, {"time": 4115, "text": "It's very uniform over the whole sky."}, {"time": 4118, "text": "I'm compressing a long story into a very short few sentences."}, {"time": 4120, "text": "And doing a great job, yeah."}, {"time": 4122, "text": "So what I'm saying is that there's a huge puzzle."}, {"time": 4125, "text": "Why was gravity in this very low entropy state, very highly organized state, everything else was all random?"}, {"time": 4135, "text": "And that to me was the biggest problem in cosmology."}, {"time": 4139, "text": "The biggest problem, nobody seems to even worry about it."}, {"time": 4142, "text": "People say they solved all the problems and they don't even worry about it."}, {"time": 4145, "text": "They think inflation solves it."}, {"time": 4147, "text": "It doesn't, it can't."}, {"time": 4148, "text": "Because it's just that... Just to clarify, that was your problem with the inflation describing some aspect of the moments right after the Big Bang?"}, {"time": 4160, "text": "Inflation is supposed to stretch it out and make it all uniform, you see."}, {"time": 4163, "text": "It doesn't do it because it can only do it if it's uniform already at the beginning."}, {"time": 4167, "text": "It's, you just have to look at, I can't go into the details, but it doesn't solve it."}, {"time": 4171, "text": "And it was completely clear to me it doesn't solve it."}, {"time": 4173, "text": "But where does the conformal cyclic cosmology of starting to talk about something before that singular and the Big Bang?"}, {"time": 4181, "text": "I was just thinking to myself, how boring this universe is going to be."}, {"time": 4187, "text": "You've got this exponential expansion."}, {"time": 4189, "text": "This was discovered early in the, in this century, 21st century."}, {"time": 4196, "text": "People discovered that these supernova exploding stars showed that the universe is actually undergoing this exponential expansion."}, {"time": 4207, "text": "So it's a self similar expansion."}, {"time": 4210, "text": "And it seems to be a feature of this term that Einstein introduced into his cosmology for the wrong reason."}, {"time": 4218, "text": "He wanted a universe that was static."}, {"time": 4220, "text": "He put this new term into his cosmology."}, {"time": 4223, "text": "To make it make sense, it's called the cosmological constant."}, {"time": 4226, "text": "And then when he got convinced that the universe had a Big Bang, he retracted it complaining this was his greatest blunder."}, {"time": 4233, "text": "The trouble is it wasn't a blunder."}, {"time": 4234, "text": "It was actually right, very ironic."}, {"time": 4237, "text": "And so the universe seems to be behaving with this cosmological constant."}, {"time": 4241, "text": "Okay, so this universe is expanding and expanding."}, {"time": 4245, "text": "What's going to happen in the future?"}, {"time": 4246, "text": "Well, it gets more and more boring for a while."}, {"time": 4248, "text": "What's the most interesting thing in the universe?"}, {"time": 4250, "text": "Well, there's black holes."}, {"time": 4251, "text": "The black holes more or less gulp down entire clusters of galaxies."}, {"time": 4256, "text": "The cluster, it'll swallow up most of our galaxy."}, {"time": 4259, "text": "We will run into our Andromeda galaxy's black hole."}, {"time": 4261, "text": "That black hole will swallow our one."}, {"time": 4263, "text": "They'll get bigger and bigger and they'll basically swallow up the whole cluster of galaxies, gulp it all down."}, {"time": 4270, "text": "Pretty well all, most of it, maybe not all, most of it."}, {"time": 4273, "text": "Okay, then that'll happen to, there'll be just these black holes around."}, {"time": 4276, "text": "Pretty boring, but still not as boring as it's gonna get."}, {"time": 4279, "text": "It's gonna get more boring because these black holes, you wait and you wait and you wait and you wait an unbelievable length of time and Hawking's black hole evaporation starts to come in."}, {"time": 4290, "text": "And the black holes, you just, it's incredibly tedious."}, {"time": 4294, "text": "Finally evaporate away."}, {"time": 4296, "text": "Each one goes away, disappears with a pop at the end."}, {"time": 4299, "text": "What could be more boring?"}, {"time": 4300, "text": "It was boring then, now this is really boring."}, {"time": 4303, "text": "There's nothing, not even black holes."}, {"time": 4306, "text": "Universe gets colder and colder and colder and colder."}, {"time": 4308, "text": "And I thought, this is very, very boring."}, {"time": 4312, "text": "Now that's not science, is it?"}, {"time": 4314, "text": "But it's emotional."}, {"time": 4316, "text": "So I thought, who's gonna be bored by this universe?"}, {"time": 4319, "text": "Not us, we won't be around."}, {"time": 4321, "text": "It'll be mostly photons running around."}, {"time": 4324, "text": "And what the photons do, they don't get bored because it's part of relativity, you see."}, {"time": 4328, "text": "It's not really that they don't experience anything."}, {"time": 4330, "text": "That's not the point."}, {"time": 4332, "text": "Photons get right out to infinity without experience any time."}, {"time": 4338, "text": "It's the way relativity works."}, {"time": 4341, "text": "And this was part of what I used to do in my old days when I was looking at gravitational radiation and how things behaved to infinity."}, {"time": 4347, "text": "Infinity is just like another place."}, {"time": 4350, "text": "You can squash it down."}, {"time": 4351, "text": "As long as you don't have any mass in the world, infinity is just another place."}, {"time": 4356, "text": "The photons get there, the gravitons get there."}, {"time": 4359, "text": "What do they get?"}, {"time": 4360, "text": "They've run into infinity."}, {"time": 4362, "text": "They say, well, now I'm here, what do I?"}, {"time": 4364, "text": "There's something on the other side, is there?"}, {"time": 4366, "text": "The usual view, it's just a mathematical notion."}, {"time": 4368, "text": "There's nothing on the other side."}, {"time": 4369, "text": "That's just the boundary of it."}, {"time": 4371, "text": "A nice example is this beautiful series of pictures by the Dutch artist MC Escher."}, {"time": 4377, "text": "You may know them."}, {"time": 4378, "text": "The one's called Circle Limits."}, {"time": 4379, "text": "They're a very famous one with the angels and the devils."}, {"time": 4382, "text": "And you can see them crowding and crowding and crowding up to the edge."}, {"time": 4386, "text": "Now, the kind of geometry that these angels and devils inhabit, that's their infinity."}, {"time": 4392, "text": "But from our perspective, infinity is just a place."}, {"time": 4396, "text": "Okay, there is..."}, {"time": 4397, "text": "I'm sorry, can you just take a brief pause?"}, {"time": 4401, "text": "In just the words you're saying, infinity is just a place."}, {"time": 4404, "text": "So for the most part, infinity, sort of even just going back, infinity is a mathematical concept."}, {"time": 4411, "text": "I think this is one of the things... You think there's an actual physical manifest..."}, {"time": 4415, "text": "In which way does infinity ever manifest itself in our physical universe?"}, {"time": 4420, "text": "Well, it does in various places."}, {"time": 4421, "text": "You see, it's a thing that if you're not a mathematician, you think, oh, infinity, I can't think about that."}, {"time": 4426, "text": "Mathematicians think about affinity all the time."}, {"time": 4428, "text": "They get used to the idea and they just play around with different kinds of infinities and it becomes no problem."}, {"time": 4434, "text": "But you just have to take my word for it."}, {"time": 4437, "text": "Now, one of the things is, you see, you take a Euclidean geometry."}, {"time": 4440, "text": "Well, it just keeps on going and it goes out to infinity."}, {"time": 4444, "text": "Now, there's other kinds of geometry and this is what's called hyperbolic geometry."}, {"time": 4449, "text": "It's a bit like Euclidean geometry, it's a little bit different."}, {"time": 4452, "text": "It's like what Escher was trying to describe in his angels and devils."}, {"time": 4457, "text": "And he learned about this from Coxeter and he think that's a very nice thing."}, {"time": 4461, "text": "That's why I represent this infinity to this kind of geometry."}, {"time": 4465, "text": "So it's not quite Euclidean geometry, it's a bit like it, that the angels and the devils inhabit."}, {"time": 4470, "text": "And their infinity, by this nice transformation, you squash their infinity down so you can draw it as this nice circle boundary to their universe."}, {"time": 4482, "text": "Now, from our outside perspective, we can see their infinity as this boundary."}, {"time": 4487, "text": "Now, what I'm saying is that it's very like that."}, {"time": 4490, "text": "The infinity that we might experience like those angels and devils in their world can be thought of as a boundary."}, {"time": 4499, "text": "Now, I found this a very useful way of talking about radiation, gravitational radiation and things like that."}, {"time": 4507, "text": "It was a trick, mathematical trick."}, {"time": 4510, "text": "So now what I'm saying is that that mathematical trick becomes real."}, {"time": 4514, "text": "That somehow, the photons, they need to go somewhere because from their perspective, infinity is just another place."}, {"time": 4525, "text": "Now, this is a difficult idea to get your mind around."}, {"time": 4528, "text": "So that's one of the reasons cosmologists are finding a lot of trouble taking me seriously."}, {"time": 4534, "text": "But to me, it's not such a wild idea."}, {"time": 4537, "text": "What's on the other side of that infinity?"}, {"time": 4539, "text": "You have to think, why am I allowed to think of this?"}, {"time": 4543, "text": "Why am I allowed to think of this?"}, {"time": 4545, "text": "Because photons don't have any mass."}, {"time": 4548, "text": "And we in physics have beautiful ways of measuring time."}, {"time": 4553, "text": "There are incredibly precise clocks, atomic and nuclear clocks, unbelievably precise."}, {"time": 4559, "text": "Why are they so precise?"}, {"time": 4561, "text": "Because of the two most famous equations of 20th century physics."}, {"time": 4566, "text": "One of them is Einstein's E equals MC squared."}, {"time": 4570, "text": "What's that tell us?"}, {"time": 4571, "text": "Energy and mass are equivalent."}, {"time": 4574, "text": "The other one is even older than that, still 20th century, only just."}, {"time": 4578, "text": "Max Planck, E equals h nu."}, {"time": 4582, "text": "Nu is a frequency, h is a constant, again, like C. E is energy."}, {"time": 4588, "text": "Energy and frequency are equivalent."}, {"time": 4591, "text": "Put the two together, energy and mass are equivalent, Einstein."}, {"time": 4594, "text": "Energy and frequency are equivalent, Max Planck."}, {"time": 4597, "text": "Put the two together, mass and frequency are equivalent."}, {"time": 4601, "text": "Absolutely basic physical principle."}, {"time": 4604, "text": "If you have a massive entity, a massive particle, it is a clock with a very, very precise frequency."}, {"time": 4613, "text": "It's not, you can't directly use it, you have to scale it down."}, {"time": 4616, "text": "So your atomic and nuclear clocks, but that's the basic principle."}, {"time": 4619, "text": "You scale it down to something you can actually perceive."}, {"time": 4622, "text": "But it's the same principle."}, {"time": 4623, "text": "If you have mass, you have beautiful clocks."}, {"time": 4627, "text": "But the other side of that coin is, if you don't have mass, you don't have clocks."}, {"time": 4634, "text": "If you don't have clocks, you don't have rulers."}, {"time": 4638, "text": "You don't have scale."}, {"time": 4640, "text": "So you don't have space and time."}, {"time": 4641, "text": "You don't have a measure of the scale of space and time."}, {"time": 4644, "text": "Oh, scale of space and time."}, {"time": 4646, "text": "You do have the structure, what's called the conformal structure."}, {"time": 4650, "text": "You see, it's what the angels and devils have."}, {"time": 4653, "text": "If you look at the eye of the devil, no matter how close to the boundary it is, it has the same shape, but it has a different size."}, {"time": 4660, "text": "So you can scale up and you can scale down, but you mustn't change the shape."}, {"time": 4666, "text": "So it's basically the same idea, but applied to space time now."}, {"time": 4670, "text": "In the very remote future, you have things which don't measure the scale, but the shape, if you like, is still there."}, {"time": 4678, "text": "Now that's in the remote future."}, {"time": 4679, "text": "Now I'm gonna do the exact opposite."}, {"time": 4681, "text": "Now I'm gonna go way back into the Big Bang."}, {"time": 4684, "text": "Now as you get there, things get hotter and hotter, denser and denser."}, {"time": 4690, "text": "What's the universe dominated by?"}, {"time": 4693, "text": "Particles moving around almost with the speed of light."}, {"time": 4696, "text": "When they get almost with the speed of light, okay, they begin to lose the mass too."}, {"time": 4701, "text": "So for completely opposite reason, they lose the sense of scale as well."}, {"time": 4706, "text": "So my crazy idea is the Big Bang and the remote future, they seem completely different."}, {"time": 4713, "text": "One is extremely dense, extremely hot."}, {"time": 4716, "text": "The other is very, very rarefied and very, very cold."}, {"time": 4719, "text": "But if you squash one down by this conformal scaling, you get the other."}, {"time": 4724, "text": "So although they look and feel very different, they're really almost the same."}, {"time": 4730, "text": "The remote future on the other side, I'm claiming is that where do the photons go?"}, {"time": 4735, "text": "They go into the next Big Bang."}, {"time": 4738, "text": "You've got to get your mind around that crazy idea."}, {"time": 4741, "text": "Taking a step on the other side of the place that is infinity."}, {"time": 4745, "text": "Okay, but."}, {"time": 4747, "text": "So I'm saying the other side of our Big Bang, now I'm going back into the Big Bang."}, {"time": 4750, "text": "Back, backwards."}, {"time": 4751, "text": "There was the remote future of a previous eon."}, {"time": 4753, "text": "Previous eon."}, {"time": 4755, "text": "And what I'm saying is that previous eon, there are signals coming through to us, which we can see and which we do see."}, {"time": 4763, "text": "And these are both signals, the two main signals are to do with black holes."}, {"time": 4769, "text": "One of them is the collisions between black holes."}, {"time": 4773, "text": "And as they spiral into each other, they release a lot of energy in the form of gravitational waves."}, {"time": 4779, "text": "Those gravitational waves get through in a certain form into the next eon."}, {"time": 4784, "text": "That's fascinating that there's some, I mean, maybe you can correct me if I'm wrong, but that means that some information can travel from another eon."}, {"time": 4794, "text": "That is fascinating."}, {"time": 4798, "text": "I mean, I've seen somewhere described sort of the discussion of the Fermi Paradox, you know, that if there's intelligent life."}, {"time": 4809, "text": "Being, you know, communication immediately takes you there."}, {"time": 4813, "text": "We have a paper, I have my colleague, Vahid Guzajan, who I worked with on these ideas for a while."}, {"time": 4819, "text": "We have a crazy paper on that, yes."}, {"time": 4822, "text": "Looking at the Fermi Paradox, yes."}, {"time": 4823, "text": "Right, so if the universe is just cycling over and over and over, punctuated by the, punctuated the singularity of the Big Bang, and then intelligent or any kind of intelligent systems can communicate through from eon to eon, why haven't we heard anything from our alien friends?"}, {"time": 4844, "text": "Because we don't know how to look."}, {"time": 4846, "text": "That's fundamentally the reason, is we."}, {"time": 4848, "text": "I don't know, you see, it's speculation."}, {"time": 4851, "text": "I mean, the SETI program is a reasonable thing to do, but still speculation."}, {"time": 4856, "text": "It's trying to say, okay, maybe not too far away was a civilization which got there first, before us, early enough that they could send us signals, but how far away would you need to go before, I mean, I don't know, we have so little knowledge about that, we haven't seen any signals yet, but it's worth looking, it's worth looking."}, {"time": 4878, "text": "What I'm trying to say, here's another possible place where you might look."}, {"time": 4920, "text": "But what kind of signals would they be?"}, {"time": 4921, "text": "I haven't the foggiest."}, {"time": 4925, "text": "Let me ask the question."}, {"time": 4927, "text": "What to you is the most beautiful idea in physics or mathematics or the art at the intersection of the two?"}, {"time": 4935, "text": "I'm gonna have to say complex analysis."}, {"time": 4937, "text": "I might've said infinities."}, {"time": 4939, "text": "And one of the most single, most beautiful idea I think was the fact that you can have infinities of different sizes and so on."}, {"time": 4946, "text": "But that's in a way, I think complex analysis."}, {"time": 4950, "text": "It's got so much magic in it."}, {"time": 4952, "text": "It's a very simple idea."}, {"time": 4956, "text": "You take these, you take numbers, you take the integers and then you fill them up into the fractions and the real numbers."}, {"time": 4964, "text": "You imagine you're trying to measure a continuous line and then you think of how you can solve equations."}, {"time": 4970, "text": "Then what about X squared equals minus one?"}, {"time": 4974, "text": "Well, there's no real number which has to satisfy that."}, {"time": 4977, "text": "So you have to think of, well, there's a number called I."}, {"time": 4981, "text": "You think you invent it."}, {"time": 4982, "text": "Well, in a certain sense, it's there already."}, {"time": 4985, "text": "But this number, when you add that square root of minus one to it, you have what's called the complex numbers."}, {"time": 4990, "text": "And they're an incredible system."}, {"time": 4993, "text": "If you like, you put one little thing in, you put square root of minus one in and you get how much benefit out of it."}, {"time": 5000, "text": "All sorts of things that you'd never imagined before."}, {"time": 5003, "text": "And it's that amazing, all hiding there in putting that square root of minus one in."}]}]