[{"title": "Jeffrey Shainline: Neuromorphic Computing and Optoelectronic Intelligence | Lex Fridman Podcast #225", "id": "EwueqdgIvq4", "quotes": [{"time": 404, "text": "You're running the same computer program, but those devices are getting smaller, so they get faster, they get more energy efficient, and all of our computing performance just continues to improve."}, {"time": 413, "text": "And we don't have to think too hard about what we're doing as, say, a software designer or something like that."}, {"time": 420, "text": "I absolutely don't mean to say that there's no innovation in software or the user side of things, of course there is."}, {"time": 427, "text": "But from the hardware perspective, we just have been given this gift of continued performance improvement through this scaling that is ever smaller feature sizes with very similar, say, power consumption."}, {"time": 442, "text": "That power consumption has not continued to scale in the most recent decades, but nevertheless, we had a really good run there for a while."}, {"time": 451, "text": "And now we're down to gates that are seven nanometers, which is state of the art right now."}, {"time": 456, "text": "Maybe GlobalFoundries is trying to push it even lower than that."}, {"time": 459, "text": "I can't keep up with where the predictions are that it's gonna end."}, {"time": 463, "text": "But seven nanometer transistor has just a few tens of atoms along the length of the conduction pathway."}, {"time": 471, "text": "So a naive semiconductor device physicist would think you can't go much further than that without some kind of revolution in the way we think about the physics of our devices."}, {"time": 483, "text": "Is there something to be said about the mass manufacture of these devices?"}, {"time": 488, "text": "Right, right, so that's another thing."}, {"time": 489, "text": "So how have we been able to make those transistors smaller and smaller?"}, {"time": 493, "text": "Well, companies like Intel, GlobalFoundries, they invest a lot of money in the lithography."}, {"time": 500, "text": "So how are these chips actually made?"}, {"time": 502, "text": "Well, one of the most important steps is this what's called ion implantation."}, {"time": 507, "text": "So you start with sort of a pristine silicon crystal and then using photolithography, which is a technique where you can pattern different shapes using light, you can define which regions of space you're going to implant with different species of ions that are going to change the local electrical properties right there."}, {"time": 529, "text": "So by using ever shorter wavelengths of light and different kinds of optical techniques and different kinds of lithographic techniques, things that go far beyond my knowledge base, you can just simply shrink that feature size down."}, {"time": 543, "text": "And you say you're at seven nanometers."}, {"time": 544, "text": "Well, the wavelength of light that's being used is over a hundred nanometers."}, {"time": 548, "text": "That's already deep in the UV."}, {"time": 550, "text": "So how are those minute features patterned?"}, {"time": 554, "text": "Well, there's an extraordinary amount of innovation that has gone into that, but nevertheless, it stayed very consistent in this ever shrinking feature size."}, {"time": 561, "text": "And now the question is, can you make it smaller?"}, {"time": 564, "text": "And even if you do, do you still continue to get performance improvements?"}, {"time": 568, "text": "But that's another kind of scaling where these companies have been able to..."}, {"time": 574, "text": "So, okay, you picture a chip that has a processor on it."}, {"time": 576, "text": "Well, that chip is not made as a chip."}, {"time": 578, "text": "It's made on a wafer."}, {"time": 580, "text": "And using photolithography, you basically print the same pattern on different dyes all across the wafer, multiple layers, tens, probably a hundred some layers in a mature foundry process."}, {"time": 595, "text": "And you do this on ever bigger wafers too."}, {"time": 597, "text": "That's another aspect of scaling that's occurred in the last several decades."}, {"time": 600, "text": "So now you have this 300 millimeter wafer."}, {"time": 602, "text": "It's like as big as a pizza and it has maybe a thousand processors on it."}, {"time": 606, "text": "And then you dice that up using a saw."}, {"time": 608, "text": "And now you can sell these things so cheap because the manufacturing process was so streamlined."}, {"time": 614, "text": "I think a technology as revolutionary as silicon microelectronics has to have that kind of manufacturing scalability, which I will just emphasize, I believe is enabled by physics."}, {"time": 628, "text": "It's not, I mean, of course there's human ingenuity that goes into it, but at least from my side where I sit, it sure looks like the physics of our universe allows us to produce that."}, {"time": 640, "text": "And we've discovered how more so than we've invented it, although of course we have invented it, humans have invented it, but it's almost as if it was there waiting for us to discover it."}, {"time": 652, "text": "You mean the entirety of it or are you specifically talking about the techniques of photolithography, like the optics involved?"}, {"time": 659, "text": "I mean, the entirety of the scaling down to the seven nanometers, you're able to have electrons not interfere with each other in such a way that you could still have gates."}, {"time": 671, "text": "Like that's enabled."}, {"time": 673, "text": "To achieve that scale, spatial and temporal, it seems to be very special and is enabled by the physics of our world."}, {"time": 681, "text": "All of the things you just said."}, {"time": 682, "text": "So starting with the silicon material itself, silicon is a unique semiconductor."}, {"time": 688, "text": "It has essentially ideal properties for making a specific kind of transistor that's extraordinarily useful."}, {"time": 695, "text": "So I mentioned that silicon has, well, when you make a transistor, you have this gate contact that sits on top of the conduction channel."}, {"time": 704, "text": "And depending on the voltage you apply there, you pull more carriers into the conduction channel or push them away so it becomes more or less conductive."}, {"time": 713, "text": "In order to have that work without just sucking those carriers right into that contact, you need a very thin insulator."}, {"time": 719, "text": "And part of scaling has been to gradually decrease the thickness of that gate insulator so that you can use a roughly similar voltage and still have the same current voltage characteristics."}, {"time": 732, "text": "So the material that's used to do that, or I should say was initially used to do that was a silicon dioxide, which just naturally grows on the silicon surface."}, {"time": 741, "text": "So you expose silicon to the atmosphere that we breathe and well, if you're manufacturing, you're gonna purify these gases, but nevertheless, that what's called a native oxide will grow there."}, {"time": 753, "text": "There are essentially no other materials on the entire periodic table that have as good of a gate insulator as that silicon dioxide."}, {"time": 763, "text": "And that has to do with nothing but the physics of the interaction between silicon and oxygen."}, {"time": 769, "text": "And if it wasn't that way, transistors could not perform in nearly the degree of capability that they have."}, {"time": 778, "text": "And that has to do with the way that the oxide grows, the reduced density of defects there, it's insulation, meaning essentially it's energy gaps."}, {"time": 788, "text": "You can apply a very large voltage there without having current leak through it."}, {"time": 792, "text": "So that's physics right there."}, {"time": 795, "text": "There are other things too."}, {"time": 796, "text": "Silicon is a semiconductor in an elemental sense."}, {"time": 799, "text": "You only need silicon atoms."}, {"time": 801, "text": "A lot of other semiconductors, you need two different kinds of atoms, like a compound from group three and a compound from group five."}, {"time": 808, "text": "That opens you up to lots of defects that can occur where one atom's not sitting quite at the lattice site, it is and it's switched with another one that degrades performance."}, {"time": 818, "text": "But then also on the side that you mentioned with the manufacturing, we have access to light sources that can produce these very short wavelengths of light."}, {"time": 829, "text": "How does photolithography occur?"}, {"time": 830, "text": "Well, you actually put this polymer on top of your wafer and you expose it to light, and then you use a aqueous chemical processing to dissolve away the regions that were exposed to light and leave the regions that were not."}, {"time": 845, "text": "And we are blessed with these polymers that have the right property where they can cause scission events where the polymer splits where a photon hits."}, {"time": 856, "text": "I mean, maybe that's not too surprising, but I don't know, it all comes together to have this really complex, manufacturable ecosystem where very sophisticated technologies can be devised and it works quite well."}, {"time": 873, "text": "And amazingly, like you said, with a wavelength at like 100 nanometers or something like that, you're still able to achieve on this polymer precision of whatever we said, seven nanometers."}, {"time": 883, "text": "I think I've heard like four nanometers being talked about, something like that."}, {"time": 888, "text": "If we could just pause on this and we'll return to superconductivity, but in this whole journey from a history perspective, what do you think is the most beautiful at the intersection of engineering and physics to you in this whole process that we talked about with silicon and photolithography, things that people were able to achieve in order to push Moore's law forward?"}, {"time": 912, "text": "Is it the early days, the invention of the transistor itself?"}, {"time": 916, "text": "Is it some particular cool little thing that maybe not many people know about?"}, {"time": 921, "text": "Like, what do you think is most beautiful in this whole process, journey?"}, {"time": 926, "text": "The most beautiful is a little difficult to answer."}, {"time": 929, "text": "Let me try and sidestep it a little bit and just say what strikes me about looking at the history of silicon microelectronics is that, so when quantum mechanics was developed, people quickly began applying it to semiconductors and it was broadly understood that these are fascinating systems and people cared about them for their basic physics, but also their utility as devices."}, {"time": 955, "text": "And then the transistor was invented in the late forties in a relatively crude experimental setup where you just crammed a metal electrode into the semiconductor and that was ingenious."}, {"time": 968, "text": "These people were able to make it work."}, {"time": 973, "text": "But so what I wanna get to that really strikes me is that in those early days, there were a number of different semiconductors that were being considered."}, {"time": 982, "text": "They had different properties, different strengths, different weaknesses."}, {"time": 984, "text": "Most people thought germanium was the way to go."}, {"time": 988, "text": "It had some nice properties related to things about how the electrons move inside the lattice."}, {"time": 997, "text": "But other people thought that compound semiconductors with group three and group five also had really, really extraordinary properties that might be conducive to making the best devices."}, {"time": 1010, "text": "So there were different groups exploring each of these and that's great, that's how science works."}, {"time": 1014, "text": "You have to cast a broad net."}, {"time": 1016, "text": "But then what I find striking is why is it that silicon won?"}, {"time": 1022, "text": "Because it's not that germanium is a useless material and it's not present in technology or compound semiconductors."}, {"time": 1028, "text": "They're both doing exciting and important things, slightly more niche applications whereas silicon is the semiconductor material for microelectronics which is the platform for digital computing which has transformed our world."}, {"time": 1042, "text": "Why did silicon win?"}, {"time": 1044, "text": "It's because of a remarkable assemblage of qualities that no one of them was the clear winner but it made these sort of compromises between a number of different influences."}, {"time": 1056, "text": "It had that really excellent gate oxide that allowed us to make MOSFETs, these high performance transistors, so quickly and cheaply and easily without having to do a lot of materials development."}, {"time": 1069, "text": "The band gap of silicon is actually, so in a semiconductor there's an important parameter which is called the band gap which tells you there are sort of electrons that fill up to one level in the energy diagram and then there's a gap where electrons aren't allowed to have an energy in a certain range and then there's another energy level above that."}, {"time": 1091, "text": "And that difference between the lower sort of filled level and the unoccupied level, that tells you how much voltage you have to apply in order to induce a current to flow."}, {"time": 1102, "text": "So with germanium, that's about 0.75 electron volts."}, {"time": 1107, "text": "That means you have to apply 0.75 volts to get a current moving."}, {"time": 1112, "text": "And it turns out that if you compare that to the thermal excitations that are induced just by the temperature of our environment, that gap's not quite big enough."}, {"time": 1122, "text": "You start to use it to perform computations, it gets a little hot and you get all these accidental carriers that are excited into the conduction band and it causes errors in your computation."}, {"time": 1133, "text": "Silicon's band gap is just a little higher, 1.1 electron volts, but you have an exponential dependence on the number of carriers that are present that can induce those errors."}, {"time": 1146, "text": "It decays exponentially with that voltage."}, {"time": 1148, "text": "So just that slight extra energy in that band gap really puts it in an ideal position to be operated in the conditions of our ambient environment."}, {"time": 1160, "text": "It's kind of fascinating that, like you mentioned, errors decrease exponentially with the voltage."}, {"time": 1167, "text": "So it's funny because this error thing comes up when you start talking about quantum computing."}, {"time": 1174, "text": "And it's kind of amazing that everything we've been talking about, the errors, as we scale down, seems to be extremely low."}, {"time": 1182, "text": "And like all of our computation is based on the assumption that it's extremely low."}, {"time": 1187, "text": "Yes, well it's digital computation."}, {"time": 1189, "text": "Digital, sorry, digital computation."}, {"time": 1191, "text": "So as opposed to our biological computation in our brain, is like the assumption is stuff is gonna fail all over the place and we somehow have to still be robust to that."}, {"time": 1203, "text": "So this also, this is gonna be the most controversial part of our conversation where you're gonna make some enemies."}, {"time": 1207, "text": "So let me ask, because we've been talking about physics and engineering."}, {"time": 1214, "text": "Which group of people is smarter and more important for this one?"}, {"time": 1217, "text": "Let me ask the question in a better way."}, {"time": 1220, "text": "Some of the big innovations, some of the beautiful things that we've been talking about, how much of it is physics?"}, {"time": 1226, "text": "How much of it is engineering?"}, {"time": 1228, "text": "My dad is a physicist and he talks down to all the amazing engineering that we're doing in the artificial intelligence and the computer science and the robotics and all that space."}, {"time": 1239, "text": "So we argue about this all the time."}, {"time": 1242, "text": "Who gets more credit?"}, {"time": 1243, "text": "I'm genuinely not trying to just be politically correct here."}, {"time": 1246, "text": "I don't see how you would have any of the, what we consider sort of the great accomplishments of society without both."}, {"time": 1254, "text": "You absolutely need both of those things."}, {"time": 1255, "text": "Physics tends to play a key role earlier in the development and then engineering optimization, these things take over."}, {"time": 1264, "text": "And I mean, the invention of the transistor or actually even before that, the understanding of semiconductor physics that allowed the invention of the transistor, that's all physics."}, {"time": 1275, "text": "So if you didn't have that physics, you don't even get to get on the field."}, {"time": 1280, "text": "But once you have understood and demonstrated that this is in principle possible, more so as engineering."}, {"time": 1288, "text": "Why we have computers more powerful than old supercomputers in each of our phones, that's all engineering."}, {"time": 1297, "text": "And I think I would be quite foolish to say that that's not valuable, that's not a great contribution."}, {"time": 1306, "text": "It's a beautiful dance."}, {"time": 1307, "text": "Would you put like Silicon, the understanding of the material properties in the space of engineering?"}, {"time": 1314, "text": "Like how does that whole process work?"}, {"time": 1315, "text": "To understand that it has all these nice properties or even the development of photolithography, is that basically, would you put that in a category of engineering?"}, {"time": 1326, "text": "No, I would say that it is basic physics, it is applied physics, it's material science, it's X ray crystallography, it's polymer chemistry, it's everything."}, {"time": 1338, "text": "Chemistry even is thrown in there?"}, {"time": 1340, "text": "Absolutely, yes, absolutely."}, {"time": 1342, "text": "Just no biology."}, {"time": 1345, "text": "We can get to biology."}, {"time": 1346, "text": "Or the biologies and the humans that are engineering the system, so it's all integrated deeply."}, {"time": 1351, "text": "Okay, so let's return, you mentioned this word superconductivity."}, {"time": 1355, "text": "So what does that have to do with what we're talking about?"}, {"time": 1358, "text": "Right, okay, so in a semiconductor, as I tried to describe a second ago, you can sort of induce currents by applying voltages and those have sort of typical properties that you would expect from some kind of a conductor."}, {"time": 1375, "text": "Those electrons, they don't just flow perfectly without dissipation."}, {"time": 1380, "text": "If an electron collides with an imperfection in the lattice or another electron, it's gonna slow down, it's gonna lose its momentum."}, {"time": 1386, "text": "So you have to keep applying that voltage in order to keep the current flowing."}, {"time": 1391, "text": "In a superconductor, something different happens."}, {"time": 1393, "text": "If you get a current to start flowing, it will continue to flow indefinitely."}, {"time": 1398, "text": "There's no dissipation."}, {"time": 1399, "text": "So that's crazy."}, {"time": 1401, "text": "How does that happen?"}, {"time": 1402, "text": "Well, it happens at low temperature and this is crucial."}, {"time": 1406, "text": "It has to be a quite low temperature and what I'm talking about there, for essentially all of our conversation, I'm gonna be talking about conventional superconductors, sometimes called low TC superconductors, low critical temperature superconductors."}, {"time": 1425, "text": "And so those materials have to be at a temperature around, say around four Kelvin."}, {"time": 1431, "text": "I mean, their critical temperature might be 10 Kelvin, something like that, but you wanna operate them at around four Kelvin, four degrees above absolute zero."}, {"time": 1439, "text": "And what happens at that temperature, at very low temperatures in certain materials is that the noise of atoms moving around, the lattice vibrating, electrons colliding with each other, that becomes sufficiently low that the electrons can settle into this very special state."}, {"time": 1458, "text": "It's sometimes referred to as a macroscopic quantum state because if I had a piece of superconducting material here, let's say niobium is a very typical superconductor."}, {"time": 1470, "text": "If I had a block of niobium here and we cooled it below its critical temperature, all of the electrons in that superconducting state would be in one coherent quantum state."}, {"time": 1482, "text": "The wave function of that state is described in terms of all of the particles simultaneously, but it extends across macroscopic dimensions, the size of whatever block of that material I have sitting here."}, {"time": 1497, "text": "And the way this occurs is that, let's try to be a little bit light on the technical details, but essentially the electrons coordinate with each other."}, {"time": 1506, "text": "They are able to, in this macroscopic quantum state, they're able to sort of, one can quickly take the place of the other."}, {"time": 1514, "text": "You can't tell electrons apart."}, {"time": 1515, "text": "They're what's known as identical particles."}, {"time": 1517, "text": "So if this electron runs into a defect that would otherwise cause it to scatter, it can just sort of almost miraculously avoid that defect because it's not really in that location."}, {"time": 1532, "text": "It's part of a macroscopic quantum state and the entire quantum state was not scattered by that defect."}, {"time": 1537, "text": "So you can get a current that flows without dissipation and that's called a supercurrent."}, {"time": 1542, "text": "That's sort of just very much scratching the surface of superconductivity."}, {"time": 1549, "text": "There's very deep and rich physics there, just probably not the main subject we need to go into right now."}, {"time": 1555, "text": "But it turns out that when you have this material, you can do usual things like make wires out of it so you can get current to flow in a straight line on a chip, but you can also make other devices that perform different kinds of operations."}, {"time": 1571, "text": "Some of them are kind of logic operations like you'd get in a transistor."}, {"time": 1576, "text": "The most common or the most, I would say, diverse in its utility component is a Josephson junction."}, {"time": 1586, "text": "It's not analogous to a transistor in the sense that if you apply a voltage here, it changes how much current flows from left to right, but it is analogous in sort of a sense of it's the go to component that a circuit engineer is going to use to start to build up more complexity."}, {"time": 1604, "text": "So these junctions serve as gates."}, {"time": 1608, "text": "They can serve as gates."}, {"time": 1610, "text": "So I'm not sure how concerned to be with semantics, but let me just briefly say what a Josephson junction is and we can talk about different ways that they can be used."}, {"time": 1622, "text": "Basically, if you have a superconducting wire and then a small gap of a different material that's not superconducting, an insulator or normal metal, and then another superconducting wire on the other side, that's a Josephson junction."}, {"time": 1637, "text": "So it's sometimes referred to as a superconducting weak link."}, {"time": 1640, "text": "So you have this superconducting state on one side and on the other side, and the superconducting wave function actually tunnels across that gap."}, {"time": 1650, "text": "And when you create such a physical entity, it has very unusual current voltage characteristics."}, {"time": 1661, "text": "In that gap, like weird stuff happens."}, {"time": 1664, "text": "Through the entire circuit."}, {"time": 1665, "text": "So you can imagine, suppose you had a loop set up that had one of those weak links in the loop."}, {"time": 1671, "text": "Current would flow in that loop independent, even if you hadn't applied a voltage to it, and that's called the Josephson effect."}, {"time": 1677, "text": "So the fact that there's this phase difference in the quantum wave function from one side of the tunneling barrier to the other induces current to flow."}, {"time": 1685, "text": "So how does you change state?"}, {"time": 1688, "text": "So how do you change state?"}, {"time": 1689, "text": "Now picture if I have a current bias coming down this line of my circuit and there's a Josephson junction right in the middle of it."}, {"time": 1698, "text": "And now I make another wire that goes around the Josephson junction."}, {"time": 1701, "text": "So I have a loop here, a superconducting loop."}, {"time": 1704, "text": "I can add current to that loop by exceeding the critical current of that Josephson junction."}, {"time": 1710, "text": "So like any superconducting material, it can carry this supercurrent that I've described, this current that can propagate without dissipation up to a certain level."}, {"time": 1721, "text": "And if you try and pass more current than that through the material, it's going to become a resistive material, normal material."}, {"time": 1731, "text": "So in the Josephson junction, the same thing happens."}, {"time": 1734, "text": "I can bias it above its critical current."}, {"time": 1737, "text": "And then what it's going to do, it's going to add a quantized amount of current into that loop."}, {"time": 1744, "text": "And what I mean by quantized is it's going to come in discrete packets with a well defined value of current."}, {"time": 1751, "text": "So in the vernacular of some people working in this community, you would say you pop a flux on into the loop."}, {"time": 1760, "text": "So a flux on."}, {"time": 1761, "text": "You pop a flux on into the loop."}, {"time": 1763, "text": "Yeah, so a flux on."}, {"time": 1764, "text": "Sounds like skateboarder talk, I love it."}, {"time": 1766, "text": "Okay, sorry, go ahead."}, {"time": 1768, "text": "A flux on is one of these quantized sort of amounts of current that you can add to a loop."}, {"time": 1775, "text": "And this is a cartoon picture, but I think it's sufficient for our purposes."}, {"time": 1778, "text": "So which, maybe it's useful to say, what is the speed at which these discrete packets of current travel?"}, {"time": 1787, "text": "Because we'll be talking about light a little bit."}, {"time": 1789, "text": "It seems like the speed is important."}, {"time": 1791, "text": "The speed is important, that's an excellent question."}, {"time": 1793, "text": "Sometimes I wonder where you, how you became so astute."}, {"time": 1797, "text": "But so this."}, {"time": 1800, "text": "Matrix 4 is coming out, so maybe that's related."}, {"time": 1805, "text": "I'm dressed for the job."}, {"time": 1806, "text": "I was trying to get to become an extra on Matrix 4, didn't work out."}, {"time": 1810, "text": "Anyway, so what's the speed of these packets?"}, {"time": 1813, "text": "You'll have to find another gig."}, {"time": 1815, "text": "I know, I'm sorry."}, {"time": 1816, "text": "So the speed of the pack is actually these flux ons, these sort of pulses of current that are generated by Joseph's injunctions, they can actually propagate very close to the speed of light, maybe something like a third of the speed of light."}, {"time": 1831, "text": "That's quite fast."}, {"time": 1832, "text": "So one of the reasons why Joseph's injunctions are appealing is because their signals can propagate quite fast and they can also switch very fast."}, {"time": 1843, "text": "What I mean by switch is perform that operation that I described where you add current to the loop."}, {"time": 1849, "text": "That can happen within a few tens of picoseconds."}, {"time": 1853, "text": "So you can get devices that operate in the hundreds of gigahertz range."}, {"time": 1858, "text": "And by comparison, most processors in our conventional computers operate closer to the one gigahertz range, maybe three gigahertz seems to be kind of where those speeds have leveled out."}, {"time": 1872, "text": "The gamers listening to this are getting really excited to overclock their system to like, what is it?"}, {"time": 1878, "text": "Like four gigahertz or something, a hundred sounds incredible."}, {"time": 1881, "text": "Can I just as a tiny tangent, is the physics of this understood well how to do this stably?"}, {"time": 1888, "text": "Oh yes, the physics is understood well."}, {"time": 1890, "text": "The physics of Joseph's injunctions is understood well."}, {"time": 1892, "text": "The technology is understood quite well too."}, {"time": 1894, "text": "The reasons why it hasn't displaced silicon microelectronics in conventional digital computing I think are more related to what I was alluding to before about the myriad practical, almost mundane aspects of silicon that make it so useful."}, {"time": 1912, "text": "You can make a transistor ever smaller and smaller and it will still perform its digital function quite well."}, {"time": 1918, "text": "The same is not true of a Joseph's injunction."}, {"time": 1920, "text": "You really, they don't, they just, it's not the same thing that there's this feature that you can keep making smaller and smaller and it'll keep performing the same operations."}, {"time": 1928, "text": "This loop I described, any Joseph's in circuit, well, I wanna be careful, I shouldn't say any Joseph's in circuit, but many Joseph's in circuits, the way they process information or the way they perform whatever function it is they're trying to do, maybe it's sensing a weak magnetic field, it depends on an interplay between the junction and that loop."}, {"time": 1948, "text": "And you can't make that loop much smaller."}, {"time": 1950, "text": "And it's not for practical reasons that have to do with lithography."}, {"time": 1953, "text": "It's for fundamental physical reasons about the way the magnetic field interacts with that superconducting material."}, {"time": 1961, "text": "There are physical limits that no matter how good our technology got, those circuits would, I think would never be able to be scaled down to the densities that silicon microelectronics can."}, {"time": 1974, "text": "I don't know if we mentioned, is there something interesting about the various superconducting materials involved or is it all?"}, {"time": 1981, "text": "There's a lot of stuff that's interesting."}, {"time": 1982, "text": "And it's not silicon."}, {"time": 1984, "text": "It's not silicon, no."}, {"time": 1985, "text": "So like it's some materials that also required to be super cold, four Kelvin and so on."}, {"time": 1992, "text": "So let's dissect a couple of those different things."}, {"time": 1995, "text": "The super cold part, let me just mention for your gamers out there that are trying to clock it at four gigahertz and would love to go to 400."}, {"time": 2002, "text": "What kind of cooling system can achieve four Kelvin?"}, {"time": 2004, "text": "Four Kelvin, you need liquid helium."}, {"time": 2006, "text": "And so liquid helium is expensive."}, {"time": 2009, "text": "It's inconvenient."}, {"time": 2009, "text": "You need a cryostat that sits there and the energy consumption of that cryostat is impracticable for, it's not going in your cell phone."}, {"time": 2020, "text": "So you can picture holding your cell phone like this and then something the size of a keg of beer or something on your back to cool it."}, {"time": 2029, "text": "So if you're trying to make this in consumer devices, electronics that are ubiquitous across society, superconductors are not in the race for that."}, {"time": 2039, "text": "For now, but you're saying, so just to frame the conversation, maybe the thing we're focused on is computing systems that serve as servers, like large."}, {"time": 2050, "text": "Yes, large systems."}, {"time": 2051, "text": "So then you can contrast what's going on in your cell phone with what's going on at one of the supercomputers."}, {"time": 2059, "text": "Colleague Katie Schuman invited us out to Oak Ridge a few years ago, so we got to see Titan and that was when they were building Summit."}, {"time": 2066, "text": "So these are some high performance supercomputers out in Tennessee and those are filling entire rooms the size of warehouses."}, {"time": 2073, "text": "So once you're at that level, okay, there you're already putting a lot of power into cooling."}, {"time": 2079, "text": "Cooling is part of your engineering task that you have to deal with."}, {"time": 2083, "text": "So there it's not entirely obvious that cooling to four Kelvin is out of the question."}, {"time": 2089, "text": "It has not happened yet and I can speak to why that is in the digital domain if you're interested."}, {"time": 2095, "text": "I think it's not going to happen."}, {"time": 2097, "text": "I don't think superconductors are gonna replace semiconductors for digital computation."}, {"time": 2105, "text": "There are a lot of reasons for that, but I think ultimately what it comes down to is all things considered cooling errors, scaling down to feature sizes, all that stuff, semiconductors work better at the system level."}, {"time": 2119, "text": "Is there some aspect of just curious about the historical momentum of this?"}, {"time": 2125, "text": "Is there some power to the momentum of an industry that's mass manufacturing using a certain material?"}, {"time": 2131, "text": "Is this like a Titanic shifting?"}, {"time": 2133, "text": "Like what's your sense when a good idea comes along, how good does that idea need to be for the Titanic to start shifting?"}, {"time": 2144, "text": "That's an excellent way to frame it."}, {"time": 2146, "text": "And you know, I don't know the answer to that, but what I think is, okay, so the history of the superconducting logic goes back to the 70s."}, {"time": 2158, "text": "IBM made a big push to do superconducting digital computing in the 70s."}, {"time": 2162, "text": "And they made some choices about their devices and their architectures and things that in hindsight, were kind of doomed to fail."}, {"time": 2171, "text": "And I don't mean any disrespect for the people that did it, it was hard to see at the time."}, {"time": 2174, "text": "But then another generation of superconducting logic was introduced, I wanna say the 90s, someone named Lykarev and Seminov, they proposed an entire family of circuits based on Joseph's injunctions that are doing digital computing based on logic gates and or not these kinds of things."}, {"time": 2197, "text": "And they showed how it could go hundreds of times faster than silicon microelectronics."}, {"time": 2203, "text": "And it's extremely exciting."}, {"time": 2205, "text": "I wasn't working in the field at that time, but later when I went back and read the literature, I was just like, wow, this is so awesome."}, {"time": 2213, "text": "And so you might think, well, the reason why it didn't display silicon is because silicon already had so much momentum at that time."}, {"time": 2221, "text": "But that was the 90s."}, {"time": 2222, "text": "Silicon kept that momentum because it had the simple way to keep getting better."}, {"time": 2226, "text": "You just make features smaller and smaller."}, {"time": 2228, "text": "So it would have to be, I don't think it would have to be that much better than silicon to displace it."}, {"time": 2235, "text": "But the problem is it's just not better than silicon."}, {"time": 2237, "text": "It might be better than silicon in one metric, speed of a switching operation or power consumption of a switching operation."}, {"time": 2244, "text": "But building a digital computer is a lot more than just that elemental operation."}, {"time": 2248, "text": "It's everything that goes into it, including the manufacturing, including the packaging, including the various materials aspects of things."}, {"time": 2258, "text": "So the reason why, and even in some of those early papers, I can't remember which one it was, Lykarev said something along the lines of, you can see how we could build an entire family of digital electronic circuits based on these components."}, {"time": 2272, "text": "They could go a hundred or more times faster than semiconductor logic gates."}, {"time": 2279, "text": "But I don't think that's the right way to use superconducting electronic circuits."}, {"time": 2282, "text": "He didn't say what the right way was, but he basically said digital logic, trying to steal the show from silicon is probably not what these circuits are most suited to accomplish."}, {"time": 2296, "text": "So if we can just linger and use the word computation."}, {"time": 2300, "text": "When you talk about computation, how do you think about it?"}, {"time": 2304, "text": "Do you think purely on just the switching, or do you think something a little bit larger scale, a circuit taken together, performing the basic arithmetic operations that are then required to do the kind of computation that makes up a computer?"}, {"time": 2322, "text": "Because when we talk about the speed of computation, is it boiled down to the basic switching, or is there some bigger picture that you're thinking about?"}, {"time": 2329, "text": "Well, all right, so maybe we should disambiguate."}, {"time": 2332, "text": "There are a variety of different kinds of computation."}, {"time": 2335, "text": "I don't pretend to be an expert in the theory of computation or anything like that."}, {"time": 2340, "text": "I guess it's important to differentiate though between digital logic, which represents information as a series of bits, binary digits, which you can think of them as zeros and ones or whatever."}, {"time": 2354, "text": "Usually they correspond to a physical system that has two very well separated states."}, {"time": 2361, "text": "And then other kinds of computation, like we'll get into more the way your brain works, which it is, I think, indisputably processing information, but where the computation begins and ends is not anywhere near as well defined."}, {"time": 2376, "text": "It doesn't depend on these two levels."}, {"time": 2379, "text": "Here's a zero, here's a one."}, {"time": 2381, "text": "There's a lot of gray area that's usually referred to as analog computing."}, {"time": 2385, "text": "Also in conventional digital computers or digital computers in general, you have a concept of what's called arithmetic depth, which is jargon that basically means how many sequential operations are performed to turn an input into an output."}, {"time": 2407, "text": "And those kinds of computations in digital systems are highly serial, meaning that data streams, they don't branch off too far to the side."}, {"time": 2416, "text": "You do, you have to pull some information over there and access memory from here and stuff like that."}, {"time": 2420, "text": "But by and large, the computation proceeds in a serial manner."}, {"time": 2426, "text": "It's not that way in the brain."}, {"time": 2427, "text": "In the brain, you're always drawing information from different places."}, {"time": 2431, "text": "It's much more network based computing."}, {"time": 2433, "text": "Neurons don't wait for their turn."}, {"time": 2435, "text": "They fire when they're ready to fire."}, {"time": 2437, "text": "And so it's asynchronous."}, {"time": 2439, "text": "So one of the other things about a digital system is you're performing these operations on a clock."}, {"time": 2444, "text": "And that's a crucial aspect of it."}, {"time": 2446, "text": "Get rid of a clock in a digital system, nothing makes sense anymore."}, {"time": 2450, "text": "The brain has no clock."}, {"time": 2451, "text": "It builds its own timescales based on its internal activity."}, {"time": 2456, "text": "So you can think of the brain as kind of like this, like network computation, where it's actually really trivial, simple computers, just a huge number of them and they're networked."}, {"time": 2468, "text": "I would say it is complex, sophisticated little processors and there's a huge number of them."}, {"time": 2474, "text": "Neurons are not, are not simple."}, {"time": 2476, "text": "I don't mean to offend neurons."}, {"time": 2477, "text": "They're very complicated and beautiful and yeah, but we often oversimplify them."}, {"time": 2481, "text": "Yes, they're actually like there's computation happening within a neuron."}, {"time": 2485, "text": "Right, so I would say to think of a transistor as the building block of a digital computer is accurate."}, {"time": 2492, "text": "You use a few transistors to make your logic gates."}, {"time": 2494, "text": "You build up more, you build up processors from logic gates and things like that."}, {"time": 2499, "text": "So you can think of a transistor as a fundamental building block, or you can think of, as we get into more highly parallelized architectures, you can think of a processor as a fundamental building block."}, {"time": 2509, "text": "To make the analogy to the neuro side of things, a neuron is not a transistor."}, {"time": 2515, "text": "A neuron is a processor."}, {"time": 2517, "text": "It has synapses, even synapses are not transistors, but they are more, they're lower on the information processing hierarchy in a sense."}, {"time": 2525, "text": "They do a bulk of the computation, but neurons are entire processors in and of themselves that can take in many different kinds of inputs on many different spatial and temporal scales and produce many different kinds of outputs so that they can perform different computations in different contexts."}, {"time": 2544, "text": "So this is where enters this distinction between computation and communication."}, {"time": 2550, "text": "So you can think of neurons performing computation and the inter, the networking, the interconnectivity of neurons is communication between neurons."}, {"time": 2560, "text": "And you see this with very large server systems."}, {"time": 2563, "text": "I've been, I mentioned offline, we've been talking to Jim Keller, whose dream is to build giant computers that, you know, the bottom like there is often the communication between the different pieces of computing."}, {"time": 2574, "text": "So in this paper that we mentioned, Optoelectronic Intelligence, you say electrons excel at computation while light is excellent for communication."}, {"time": 2588, "text": "Maybe you can linger and say in this context, what do you mean by computation and communication?"}, {"time": 2593, "text": "What are electrons, what is light and why do they excel at those two tasks?"}, {"time": 2600, "text": "Yeah, just to first speak to computation versus communication, I would say computation is essentially taking in some information, performing operations on that information and producing new, hopefully more useful information."}, {"time": 2619, "text": "So for example, imagine you have a picture in front of you and there is a key in it and that's what you're looking for, for whatever reason, you wanna find the key, we all wanna find the key."}, {"time": 2631, "text": "So the input is that entire picture and the output might be the coordinates where the key is."}, {"time": 2639, "text": "So you've reduced the total amount of information you have but you found the useful information for you in that present moment, that's the useful information."}, {"time": 2645, "text": "And you think about this computation as the controlled synchronous sequential?"}, {"time": 2650, "text": "Not necessarily, it could be, that could be how your system is performing the computation or it could be asynchronous, there are lots of ways to find the key."}, {"time": 2661, "text": "It depends on the nature of the data, it depends on, that's a very simplified example, a picture with a key in it, what about if you're in the world and you're trying to decide the best way to live your life?"}, {"time": 2675, "text": "It might be interactive, it might be there might be some recurrence or some weird asynchrony, I got it."}, {"time": 2681, "text": "But there's an input and there's an output and you do some stuff in the middle that actually goes from the input to the output."}, {"time": 2686, "text": "You've taken in information and output different information, hopefully reducing the total amount of information and extracting what's useful."}, {"time": 2693, "text": "Communication is then getting that information from the location at which it's stored because information is physical as Landauer emphasized and so it is in one place and you need to get that information to another place so that something else can use it for whatever computation it's working on."}, {"time": 2712, "text": "Maybe it's part of the same network and you're all trying to solve the same problem but neuron A over here just deduced something based on its inputs and it's now sending that information across the network to another location so that would be the act of communication."}, {"time": 2728, "text": "Can you linger on Landauer and saying information is physical?"}, {"time": 2731, "text": "Rolf Landauer, not to be confused with Lev Landauer."}, {"time": 2764, "text": "And it's all somehow related to the second law of thermodynamics and that the universe is an information process and then we're living in a simulation."}, {"time": 2771, "text": "So okay, sorry, sorry for that tangent."}, {"time": 2773, "text": "So that's the defining the distinction between computation and communication."}, {"time": 2779, "text": "Let me say one more thing just to clarify."}, {"time": 2781, "text": "Communication ideally does not change the information."}, {"time": 2787, "text": "It moves it from one place to another but it is preserved."}, {"time": 2790, "text": "Got it, okay."}, {"time": 2792, "text": "All right, that's beautiful."}, {"time": 2793, "text": "So then the electron versus light distinction and why are electrons good at computation and light good at communication?"}, {"time": 2804, "text": "Yes, there's a lot that goes into it I guess but just try to speak to the simplest part of it."}, {"time": 2814, "text": "Electrons interact strongly with one another."}, {"time": 2816, "text": "They're charged particles."}, {"time": 2818, "text": "So if I pile a bunch of them over here they're feeling a certain amount of force and they wanna move somewhere else."}, {"time": 2825, "text": "They're strongly interactive."}, {"time": 2826, "text": "You can also get them to sit still."}, {"time": 2828, "text": "You can, an electron has a mass so you can cause it to be spatially localized."}, {"time": 2835, "text": "So for computation that's useful because now I can make these little devices that put a bunch of electrons over here and then I change the state of a gate like I've been describing, put a different voltage on this gate and now I move the electrons over here."}, {"time": 2849, "text": "Now they're sitting somewhere else."}, {"time": 2851, "text": "I have a physical mechanism with which I can represent information."}, {"time": 2856, "text": "It's spatially localized and I have knobs that I can adjust to change where those electrons are or what they're doing."}, {"time": 2862, "text": "Light by contrast, photons of light which are the discrete packets of energy that were identified by Einstein, they do not interact with each other especially at low light levels."}, {"time": 2876, "text": "If you're in a medium and you have a bright high light level you can get them to interact with each other through the interaction with that medium that they're in but that's a little bit more exotic."}, {"time": 2887, "text": "And for the purposes of this conversation we can assume that photons don't interact with each other."}, {"time": 2893, "text": "So if you have a bunch of them all propagating in the same direction they don't interfere with each other."}, {"time": 2899, "text": "If I wanna send, if I have a communication channel and I put one more photon on it, it doesn't screw up with those other ones."}, {"time": 2906, "text": "It doesn't change what those other ones were doing at all."}, {"time": 2909, "text": "So that's really useful for communication because that means you can sort of allow a lot of these photons to flow without disruption of each other and they can branch really easily and things like that."}, {"time": 2921, "text": "But it's not good for computation because it's very hard for this packet of light to change what this packet of light is doing."}, {"time": 2928, "text": "They pass right through each other."}, {"time": 2930, "text": "So in computation you want to change information and if photons don't interact with each other it's difficult to get them to change the information represented by the others."}, {"time": 2939, "text": "So that's the fundamental difference."}, {"time": 2941, "text": "Is there also something about the way they travel through different materials or is that just a particular engineering?"}, {"time": 2950, "text": "No, it's not, that's deep physics I think."}, {"time": 2952, "text": "So this gets back to electrons interact with each other and photons don't."}, {"time": 2958, "text": "So say I'm trying to get a packet of information from me to you and we have a wire going between us."}, {"time": 2965, "text": "In order for me to send electrons across that wire I first have to raise the voltage on my end of the wire and that means putting a bunch of charges on it and then that charge packet has to propagate along the wire and it has to get all the way over to you."}, {"time": 2981, "text": "That wire is gonna have something that's called capacitance which basically tells you how much charge you need to put on the wire in order to raise the voltage on it and the capacitance is gonna be proportional to the length of the wire."}, {"time": 2994, "text": "So the longer the length of the wire is the more charge I have to put on it and the energy required to charge up that line and move those electrons to you is also proportional to the capacitance and goes as the voltage squared."}, {"time": 3008, "text": "So you get this huge penalty if you wanna send electrons across a wire over appreciable distances."}, {"time": 3016, "text": "So distance is an important thing here when you're doing communication."}, {"time": 3020, "text": "Distance is an important thing."}, {"time": 3022, "text": "So is the number of connections I'm trying to make."}, {"time": 3025, "text": "Me to you, okay one, that's not so bad."}, {"time": 3027, "text": "If I want to now send it to 10,000 other friends then all of those wires are adding tons of extra capacitance."}, {"time": 3035, "text": "Now not only does it take forever to put the charge on that wire and raise the voltage on all those lines but it takes a ton of power and the number 10,000 is not randomly chosen."}, {"time": 3046, "text": "That's roughly how many connections each neuron in your brain makes."}, {"time": 3050, "text": "So a neuron in your brain needs to send 10,000 messages every time it has something to say."}, {"time": 3056, "text": "You can't do that if you're trying to drive electrons from here to 10,000 different places."}, {"time": 3062, "text": "The brain does it in a slightly different way which we can discuss."}, {"time": 3064, "text": "How can light achieve the 10,000 connections and why is it better?"}, {"time": 3069, "text": "In terms of like the energy use required to use light for the communication of the 10,000 connections."}, {"time": 3076, "text": "So now instead of trying to send electrons from me to you, I'm trying to send photons."}, {"time": 3079, "text": "So I can make what's called a wave guide which is just a simple piece of a material."}, {"time": 3085, "text": "It could be glass like an optical fiber or silicon on a chip."}, {"time": 3089, "text": "And I just have to inject photons into that wave guide and independent of how long it is, independent of how many different connections I'm making, it doesn't change the voltage or anything like that that I have to raise up on the wire."}, {"time": 3105, "text": "So if I have one more connection, if I add additional connections, I need to add more light to the wave guide because those photons need to split and go to different paths."}, {"time": 3115, "text": "That makes sense but I don't have a capacitive penalty."}, {"time": 3118, "text": "Sometimes these are called wiring parasitics."}, {"time": 3121, "text": "There are no parasitics associated with light in that same sense."}, {"time": 3124, "text": "So this might be a dumb question but how do I catch a photon on the other end?"}, {"time": 3131, "text": "Is it material?"}, {"time": 3132, "text": "Is it the polymer stuff you were talking about for a different application for photolithography?"}, {"time": 3139, "text": "Like how do you catch a photon?"}, {"time": 3140, "text": "There's a lot of ways to catch a photon."}, {"time": 3143, "text": "It's a deep and important question that basically defines a lot of the work that goes on in our group at NIST."}, {"time": 3151, "text": "One of my group leaders, Seywoon Nam, has built his career around these superconducting single photon detectors."}, {"time": 3158, "text": "So if you're going to try to sort of reach a lower limit and detect just one particle of light, superconductors come back into our conversation and just picture a simple device where you have current flowing through a superconducting wire and... A loop again or no?"}, {"time": 3176, "text": "Let's say yes, you have a loop."}, {"time": 3177, "text": "So you have a superconducting wire that goes straight down like this and on your loop branch, you have a little ammeter, something that measures current."}, {"time": 3185, "text": "There's a resistor up there too."}, {"time": 3187, "text": "Go with me here."}, {"time": 3189, "text": "So your current biasing this, so there's current flowing through that superconducting branch."}, {"time": 3194, "text": "Since there's a resistor over here, all the current goes through the superconducting branch."}, {"time": 3198, "text": "Now a photon comes in, strikes that superconductor."}, {"time": 3202, "text": "We talked about this superconducting macroscopic quantum state."}, {"time": 3205, "text": "That's going to be destroyed by the energy of that photon."}, {"time": 3208, "text": "So now that branch of the circuit is resistive too."}, {"time": 3212, "text": "And you've properly designed your circuit so that the resistance on that superconducting branch is much greater than the other resistance."}, {"time": 3218, "text": "Now all of your current's going to go that way."}, {"time": 3220, "text": "Your ammeter says, oh, I just got a pulse of current."}, {"time": 3223, "text": "That must mean I detected a photon."}, {"time": 3225, "text": "Then where you broke that superconductivity in a matter of a few nanoseconds, it cools back off, dissipates that energy and the current flows back through that superconducting branch."}, {"time": 3234, "text": "This is a very powerful superconducting device that allows us to understand quantum states of light."}, {"time": 3242, "text": "I didn't realize a loop like that could be sensitive to a single photon."}, {"time": 3247, "text": "I mean, that seems strange to me because, I mean, so what happens when you just barrage it with photons?"}, {"time": 3256, "text": "If you put a bunch of photons in there, essentially the same thing happens."}, {"time": 3259, "text": "You just drive it into the normal state, it becomes resistive and it's not particularly interesting."}, {"time": 3265, "text": "So you have to be careful how many photons you send."}, {"time": 3267, "text": "Like you have to be very precise with your communication."}, {"time": 3271, "text": "So I would say that that's actually in the application that we're trying to use these detectors for."}, {"time": 3277, "text": "That's a feature because what we want is for, if a neuron sends one photon to a synaptic connection and one of these superconducting detectors is sitting there, you get this pulse of current."}, {"time": 3291, "text": "And that synapse says event, then I'm gonna do what I do when there's a synapse event, I'm gonna perform computations, that kind of thing."}, {"time": 3298, "text": "But if accidentally you send two there or three or five, it does the exact same."}, {"time": 3304, "text": "And so this is how in the system that we're devising here, communication is entirely binary."}, {"time": 3312, "text": "And that's what I tried to emphasize a second ago."}, {"time": 3315, "text": "Communication should not change the information."}, {"time": 3317, "text": "You're not saying, oh, I got this kind of communication event for photons."}, {"time": 3322, "text": "No, we're not keeping track of that."}, {"time": 3323, "text": "This neuron fired, this synapse says that neuron fired, that's it."}, {"time": 3327, "text": "So that's a noise filtering property of those detectors."}, {"time": 3331, "text": "However, there are other applications where you'd rather know the exact number of photons that can be very useful in quantum computing with light."}, {"time": 3339, "text": "And our group does a lot of work around another kind of superconducting sensor called a transition edge sensor that Adrian Alita in our group does a lot of work on that."}, {"time": 3349, "text": "And that can tell you based on the amplitude of the current pulse you divert exactly how many photons were in that pulse."}, {"time": 3360, "text": "What's that useful for?"}, {"time": 3362, "text": "One way that you can encode information in quantum states of light is in the number of photons."}, {"time": 3367, "text": "You can have what are called number states and a number state will have a well defined number of photons and maybe the output of your quantum computation encodes its information in the number of photons that are generated."}, {"time": 3380, "text": "So if you have a detector that is sensitive to that, it's extremely useful."}, {"time": 3384, "text": "Can you achieve like a clock with photons or is that not important?"}, {"time": 3390, "text": "Is there a synchronicity here?"}, {"time": 3393, "text": "In general, it can be important."}, {"time": 3396, "text": "Clock distribution is a big challenge in especially large computational systems."}, {"time": 3403, "text": "And so yes, optical clocks, optical clock distribution is a very powerful technology."}, {"time": 3411, "text": "I don't know the state of that field right now, but I imagine that if you're trying to distribute a clock across any appreciable size computational system, you wanna use light."}, {"time": 3420, "text": "Yeah, I wonder how these giant systems work, especially like supercomputers."}, {"time": 3427, "text": "Do they need to do clock distribution or are they doing more ad hoc parallel like concurrent programming?"}, {"time": 3435, "text": "Like there's some kind of locking mechanisms or something."}, {"time": 3438, "text": "That's a fascinating question, but let's zoom in at this very particular question of computation on a processor and communication between processors."}, {"time": 3451, "text": "So what does this system look like that you're envisioning?"}, {"time": 3458, "text": "One of the places you're envisioning it is in the paper on optoelectronic intelligence."}, {"time": 3464, "text": "Are we talking about something that starts to look a lot like the human brain or does it still look a lot like a computer?"}, {"time": 3471, "text": "What are the size of this thing?"}, {"time": 3472, "text": "Is it going inside a smartphone or as you said, does it go inside something that's more like a house?"}, {"time": 3478, "text": "Like what should we be imagining?"}, {"time": 3481, "text": "What are you thinking about when you're thinking about these fundamental systems?"}, {"time": 3485, "text": "Let me introduce the word neuromorphic."}, {"time": 3487, "text": "There's this concept of neuromorphic computing where what that broadly refers to is computing based on the information processing principles of the brain."}, {"time": 3499, "text": "And as digital computing seems to be pushing towards some fundamental performance limits, people are considering architectural advances, drawing inspiration from the brain, more distributed parallel network kind of architectures and stuff."}, {"time": 3514, "text": "And so there's this continuum of neuromorphic from things that are pretty similar to digital computers, but maybe there are more cores and the way they send messages is a little bit more like the way brain neurons send spikes."}, {"time": 3532, "text": "But for the most part, it's still digital electronics."}, {"time": 3536, "text": "And then you have some things in between where maybe you're using transistors, but now you're starting to use them instead of in a digital way, in an analog way."}, {"time": 3546, "text": "And so you're trying to get those circuits to behave more like neurons."}, {"time": 3550, "text": "And then that's a little bit, quite a bit more on the neuromorphic side of things."}, {"time": 3554, "text": "You're trying to get your circuits, although they're still based on silicon, you're trying to get them to perform operations that are highly analogous to the operations in the brain."}, {"time": 3564, "text": "And that's where a great deal of work is in neuromorphic computing, people like Giacomo Indoveri and Gert Kauenberg, Jennifer Hasler, countless others."}, {"time": 3572, "text": "It's a rich and exciting field going back to Carver Mead in the late 1980s."}, {"time": 3579, "text": "And then all the way on the other extreme of the continuum is where you say, I'll give up anything related to transistors or semiconductors or anything like that."}, {"time": 3591, "text": "I'm not starting with the assumption that I'm gonna use any kind of conventional computing hardware."}, {"time": 3597, "text": "And instead, what I wanna do is try and understand what makes the brain powerful at the kind of information processing it does."}, {"time": 3603, "text": "And I wanna think from first principles about what hardware is best going to enable us to capture those information processing principles in an artificial system."}, {"time": 3616, "text": "And that's where I live."}, {"time": 3617, "text": "That's where I'm doing my exploration these days."}, {"time": 3621, "text": "So what are the first principles of brain like computation communication?"}, {"time": 3629, "text": "Right, yeah, this is so important and I'm glad we booked 14 hours for this because."}, {"time": 3635, "text": "I only have 13, I'm sorry."}, {"time": 3638, "text": "Okay, so the brain is notoriously complicated."}, {"time": 3641, "text": "And I think that's an important part of why it can do what it does."}, {"time": 3646, "text": "But okay, let me try to break it down."}, {"time": 3649, "text": "Starting with the devices, neurons, as I said before, they're sophisticated devices in and of themselves and synapses are too."}, {"time": 3658, "text": "They can change their state based on the activity."}, {"time": 3663, "text": "So they adapt over time."}, {"time": 3664, "text": "That's crucial to the way the brain works."}, {"time": 3666, "text": "They don't just adapt on one timescale, they can adapt on myriad timescales from the spacing between pulses, the spacing between spikes that come from neurons all the way to the age of the organism."}, {"time": 3683, "text": "Also relevant, perhaps I think the most important thing that's guided my thinking is the network structure of the brain, so."}, {"time": 3693, "text": "Which can also be adjusted on different scales."}, {"time": 3696, "text": "Absolutely, yes, so you're making new, you're changing the strength of contacts, you're changing the spatial distribution of them, although spatial distribution doesn't change that much once you're a mature organism."}, {"time": 3709, "text": "But that network structure is really crucial."}, {"time": 3712, "text": "So let me dwell on that for a second."}, {"time": 3715, "text": "You can't talk about the brain without emphasizing that most of the neurons in the neocortex or the prefrontal cortex, the part of the brain that we think is most responsible for high level reasoning and things like that, those neurons make thousands of connections."}, {"time": 3731, "text": "So you have this network that is highly interconnected."}, {"time": 3735, "text": "And I think it's safe to say that one of the primary reasons that they make so many different connections is that allows information to be communicated very rapidly from any spot in the network to any other spot in the network."}, {"time": 3750, "text": "So that's a sort of spatial aspect of it."}, {"time": 3753, "text": "You can quantify this in terms of concepts that are related to fractals and scale invariants, which I think is a very beautiful concept."}, {"time": 3763, "text": "So what I mean by that is kind of, no matter what spatial scale you're looking at in the brain within certain bounds, you see the same general statistical pattern."}, {"time": 3774, "text": "So if I draw a box around some region of my cortex, most of the connections that those neurons within that box make are gonna be within the box to each other in their local neighborhood."}, {"time": 3786, "text": "And that's sort of called clustering, loosely speaking."}, {"time": 3789, "text": "But a non negligible fraction is gonna go outside of that box."}, {"time": 3792, "text": "And then if I draw a bigger box, the pattern is gonna be exactly the same."}, {"time": 3796, "text": "So you have this scale invariants, and you also have a non vanishing probability of a neuron making connection very far away."}, {"time": 3805, "text": "So suppose you wanna plot the probability of a neuron making a connection as a function of distance."}, {"time": 3812, "text": "If that were an exponential function, it would go e to the minus radius over some characteristic radius, and it would drop off up to some certain radius, the probability would be reasonably close to one, and then beyond that characteristic length R zero, it would drop off sharply."}, {"time": 3831, "text": "And so that would mean that the neurons in your brain are really localized, and that's not what we observe."}, {"time": 3838, "text": "Instead, what you see is that the probability of making a longer distance connection, it does drop off, but it drops off as a power law."}, {"time": 3845, "text": "So the probability that you're gonna have a connection at some radius R goes as R to the minus some power."}, {"time": 3853, "text": "And that's more, that's what we see with forces in nature, like the electromagnetic force between two particles or gravity goes as one over the radius squared."}, {"time": 3863, "text": "So you can see this in fractals."}, {"time": 3864, "text": "I love that there's like a fractal dynamics of the brain that if you zoom out, you draw the box and you increase that box by certain step sizes, you're gonna see the same statistics."}, {"time": 3876, "text": "I think that's probably very important to the way the brain processes information."}, {"time": 3881, "text": "It's not just in the spatial domain, it's also in the temporal domain."}, {"time": 3885, "text": "And what I mean by that is... That's incredible that this emerged through the evolutionary process that potentially somehow connected to the way the physics of the universe works."}, {"time": 3897, "text": "Yeah, I couldn't agree more that it's a deep and fascinating subject that I hope to be able to spend the rest of my life studying."}, {"time": 3904, "text": "You think you need to solve, understand this, this fractal nature in order to understand intelligence and communication."}, {"time": 3911, "text": "I think they're deeply intertwined."}, {"time": 3913, "text": "Yes, I think power laws are right at the heart of it."}, {"time": 3916, "text": "So just to push that one through, the same thing happens in the temporal domain."}, {"time": 3921, "text": "So suppose your neurons in your brain were always oscillating at the same frequency, then the probability of finding a neuron oscillating as a function of frequency would be this narrowly peaked function around that certain characteristic frequency."}, {"time": 3936, "text": "That's not at all what we see."}, {"time": 3937, "text": "The probability of finding neurons oscillating or producing spikes at a certain frequency is again a power law, which means there's no defined scale of the temporal activity in the brain."}, {"time": 3953, "text": "At what speed do your thoughts occur?"}, {"time": 3956, "text": "Well, there's a fastest speed they can occur and that is limited by communication and other things, but there's not a characteristic scale."}, {"time": 3963, "text": "We have thoughts on all temporal scales from a few tens of milliseconds, which is physiologically limited by our devices, compare that to tens of picoseconds that I talked about in superconductors, all the way up to the lifetime of the organism."}, {"time": 3979, "text": "You can still think about things that happened to you when you were a kid."}, {"time": 3982, "text": "Or if you wanna be really trippy then across multiple organisms in the entirety of human civilization, you have thoughts that span organisms, right?"}, {"time": 3989, "text": "Yes, taking it to that level, yes."}, {"time": 3991, "text": "If you're willing to see the entirety of the human species as a single organism with a collective intelligence and that too on a spatial and temporal scale, there's thoughts occurring."}, {"time": 4001, "text": "And then if you look at not just the human species, but the entirety of life on earth as an organism with thoughts that are occurring, that are greater and greater sophisticated thoughts, there's a different spatial and temporal scale there."}, {"time": 4014, "text": "This is getting very suspicious."}, {"time": 4017, "text": "Well, hold on though, before we're done, I just wanna just tie the bow and say that the spatial and temporal aspects are intimately interrelated with each other."}, {"time": 4026, "text": "So activity between neurons that are very close to each other is more likely to happen on this faster timescale and information is gonna propagate and encompass more of the brain, more of your cortices, different modules in the brain are gonna be engaged in information processing on longer timescales."}, {"time": 4045, "text": "So there's this concept of information integration where neurons are specialized."}, {"time": 4051, "text": "Any given neuron or any cluster of neuron has its specific purpose, but they're also very much integrated."}, {"time": 4059, "text": "So you have neurons that specialize, but share their information."}, {"time": 4063, "text": "And so that happens through these fractal nested oscillations that occur across spatial and temporal scales."}, {"time": 4069, "text": "I think capturing those dynamics in hardware, to me, that's the goal of neuromorphic computing."}, {"time": 4077, "text": "So does it need to look, so first of all, that's fascinating."}, {"time": 4080, "text": "We stated some clear principles here."}, {"time": 4083, "text": "Now, does it have to look like the brain outside of those principles as well?"}, {"time": 4089, "text": "Like what other characteristics have to look like the human brain?"}, {"time": 4093, "text": "Or can it be something very different?"}, {"time": 4095, "text": "Well, it depends on what you're trying to use it for."}, {"time": 4098, "text": "And so I think a lot of the community asks that question a lot."}, {"time": 4103, "text": "What are you gonna do with it?"}, {"time": 4104, "text": "And I completely get it."}, {"time": 4106, "text": "I think that's a very important question."}, {"time": 4108, "text": "And it's also sometimes not the most helpful question."}, {"time": 4111, "text": "What if what you wanna do with it is study it?"}, {"time": 4113, "text": "What if you just wanna see, what do you have to build into your hardware in order to observe these dynamical principles?"}, {"time": 4123, "text": "And also, I ask myself that question every day and I'm not sure I'm able to answer that."}, {"time": 4129, "text": "So like, what are you gonna do with this particular neuromorphic machine?"}, {"time": 4133, "text": "So suppose what we're trying to do with it is build something that thinks."}, {"time": 4136, "text": "We're not trying to get it to make us any money or drive a car."}, {"time": 4140, "text": "Maybe we'll be able to do that, but that's not our goal."}, {"time": 4142, "text": "Our goal is to see if we can get the same types of behaviors that we observe in our own brain."}, {"time": 4148, "text": "And by behaviors in this sense, what I mean the behaviors of the components, the neurons, the network, that kind of stuff."}, {"time": 4156, "text": "I think there's another element that I didn't really hit on that you also have to build into this."}, {"time": 4161, "text": "And those are architectural principles."}, {"time": 4162, "text": "They have to do with the hierarchical modular construction of the network."}, {"time": 4167, "text": "And without getting too lost in jargon, the main point that I think is relevant there, let me try and illustrate it with a cartoon picture of the architecture of the brain."}, {"time": 4178, "text": "So in the brain, you have the cortex, which is sort of this outer sheet."}, {"time": 4184, "text": "It's actually, it's a layered structure."}, {"time": 4186, "text": "You can, if you could take it out of your brain, you could unroll it on the table and it would be about the size of a pizza sitting there."}, {"time": 4193, "text": "And that's a module."}, {"time": 4196, "text": "It does certain things."}, {"time": 4197, "text": "It processes as Yogi Buzaki would say, it processes the what of what's going on around you."}, {"time": 4203, "text": "But you have another really crucial module that's called the hippocampus."}, {"time": 4208, "text": "And that network is structured entirely differently."}, {"time": 4210, "text": "First of all, this cortex that had described 10 billion neurons in there."}, {"time": 4214, "text": "So numbers matter here."}, {"time": 4216, "text": "And they're organized in that sort of power law distribution where the probability of making a connection drops off as a power law in space."}, {"time": 4224, "text": "The hippocampus is another module that's important for understanding how, where you are, when you are keeping track of your position in space and time."}, {"time": 4237, "text": "And that network is very much random."}, {"time": 4239, "text": "So the probability of making a connection, it almost doesn't even drop off as a function of distance."}, {"time": 4244, "text": "It's the same probability that you'll make it here to over there, but there are only about 100 million neurons there, so you can have that huge densely connected module because it's not so big."}, {"time": 4257, "text": "And the neocortex or the cortex and the hippocampus, they talk to each other constantly."}, {"time": 4264, "text": "And that communication is largely facilitated by what's called the thalamus."}, {"time": 4269, "text": "I'm not a neuroscientist here."}, {"time": 4270, "text": "I'm trying to do my best to recite things."}, {"time": 4272, "text": "Cartoon picture of the brain, I gotcha."}, {"time": 4275, "text": "So this thalamus is coordinating the activity between the neocortex and the hippocampus and making sure that they talk to each other at the right time and send messages that will be useful to one another."}, {"time": 4286, "text": "So this all taken together is called the thalamocortical complex."}, {"time": 4291, "text": "And it seems like building something like that is going to be crucial to capturing the types of activity we're looking for because those responsibilities, those separate modules, they do different things, that's gotta be central to achieving these states of efficient information integration across space and time."}, {"time": 4315, "text": "By the way, I am able to achieve this state by watching simulations, visualizations of the thalamocortical complex."}, {"time": 4323, "text": "There's a few people I forget from where."}, {"time": 4326, "text": "They've created these incredible visual illustrations of visual stimulation from the eye or something like that."}, {"time": 4334, "text": "And this image flowing through the brain."}, {"time": 4338, "text": "Wow, I haven't seen that, I gotta check that out."}, {"time": 4340, "text": "So it's one of those things, you find this stuff in the world, and you see on YouTube, it has 1,000 views, these visualizations of the human brain processing information."}, {"time": 4352, "text": "And because there's chemistry there, because this is from actual human brains, I don't know how they're doing the coloring, but they're able to actually trace the different, the chemical and the electrical signals throughout the brain, and the visual thing, it's like, whoa, because it looks kinda like the universe, I mean, the whole thing is just incredible."}, {"time": 4373, "text": "I recommend it highly, I'll probably post a link to it."}, {"time": 4376, "text": "But you can just look for, one of the things they simulate is the thalamocortical complex and just visualization."}, {"time": 4385, "text": "You can find that yourself on YouTube, but it's beautiful."}, {"time": 4389, "text": "The other question I have for you is, how does memory play into all of this?"}, {"time": 4394, "text": "Because all the signals sending back and forth, that's computation and communication, but that's kinda like processing of inputs and outputs, to produce outputs in the system, that's kinda like maybe reasoning, maybe there's some kind of recurrence."}, {"time": 4410, "text": "But is there a storage mechanism that you think about in the context of neuromorphic computing?"}, {"time": 4415, "text": "Yeah, absolutely, so that's gotta be central."}, {"time": 4417, "text": "You have to have a way that you can store memories."}, {"time": 4421, "text": "And there are a lot of different kinds of memory in the brain."}, {"time": 4425, "text": "That's yet another example of how it's not a simple system."}, {"time": 4429, "text": "So there's one kind of memory, one way of talking about memory, usually starts in the context of Hopfield networks."}, {"time": 4439, "text": "You were lucky to talk to John Hopfield on this program."}, {"time": 4442, "text": "But the basic idea there is working memory is stored in the dynamical patterns of activity between neurons."}, {"time": 4450, "text": "And you can think of a certain pattern of activity as an attractor, meaning if you put in some signal that's similar enough to other previously experienced signals like that, then you're going to converge to the same network dynamics and you will see these neurons participate in the same network patterns of activity that they have in the past."}, {"time": 4477, "text": "So you can talk about the probability that different inputs will allow you to converge to different basins of attraction and you might think of that as, oh, I saw this face and then I excited this network pattern of activity because last time I saw that face, I was at some movie and that's a famous person that's on the screen or something like that."}, {"time": 4498, "text": "So that's one memory storage mechanism."}, {"time": 4500, "text": "But crucial to the ability to imprint those memories in your brain is the ability to change the strength of connection between one neuron and another, that synaptic connection between them."}, {"time": 4513, "text": "So synaptic weight update is a massive field of neuroscience and neuromorphic computing as well."}, {"time": 4519, "text": "So there are two poles on that spectrum."}, {"time": 4526, "text": "Okay, so more in the language of machine learning, we would talk about supervised and unsupervised learning."}, {"time": 4532, "text": "And when I'm trying to tie that down to neuromorphic computing, I will use a definition of supervised learning, which basically means the external user, the person who's controlling this hardware has some knob that they can tune to change each of the synaptic weights, depending on whether or not the network is doing what you want it to do."}, {"time": 4553, "text": "Whereas what I mean in this conversation when I say unsupervised learning is that those synaptic weights are dynamically changing in your network based on nothing that the user is doing, nothing that there's no wire from the outside going into any of those synapses."}, {"time": 4569, "text": "The network itself is reconfiguring those synaptic weights based on physical properties that you've built into the devices."}, {"time": 4577, "text": "So if the synapse receives a pulse from here and that causes the neuron to spike, some circuit built in there with no help from me or anybody else adjust the weight in a way that makes it more likely to store the useful information and excite the useful network patterns and makes it less likely that random noise, useless communication events will have an important effect on the network activity."}, {"time": 4605, "text": "So there's memory encoded in the weights, the synaptic weights."}, {"time": 4609, "text": "What about the formation of something that's not often done in machine learning, the formation of new synaptic connections?"}, {"time": 4616, "text": "Right, well, that seems to, so again, not a neuroscientist here, but my reading of the literature is that that's particularly crucial in early stages of brain development where a newborn is born with tons of extra synaptic connections and it's actually pruned over time."}, {"time": 4633, "text": "So the number of synapses decreases as opposed to growing new long distance connections."}, {"time": 4639, "text": "It is possible in the brain to grow new neurons and assign new synaptic connections but it doesn't seem to be the primary mechanism by which the brain is learning."}, {"time": 4651, "text": "So for example, like right now, sitting here talking to you, you say lots of interesting things and I learn from you and I can remember things that you just said and I didn't grow new axonal connections down to new synapses to enable those."}, {"time": 4667, "text": "It's plasticity mechanisms in the synaptic connections between neurons that enable me to learn on that timescale."}, {"time": 4675, "text": "So at the very least, you can sufficiently approximate that with just weight updates."}, {"time": 4681, "text": "You don't need to form new connections."}, {"time": 4682, "text": "I would say weight updates are a big part of it."}, {"time": 4685, "text": "I also think there's more because broadly speaking, when we're doing machine learning, our networks, say we're talking about feed forward, deep neural networks, the temporal domain is not really part of it."}, {"time": 4696, "text": "Okay, you're gonna put in an image and you're gonna get out a classification and you're gonna do that as fast as possible."}, {"time": 4702, "text": "So you care about time but time is not part of the essence of this thing really."}, {"time": 4707, "text": "Whereas in spiking neural networks, what we see in the brain, time is as crucial as space and they're intimately intertwined as I've tried to say."}, {"time": 4716, "text": "And so adaptation on different timescales is important not just in memory formation, although it plays a key role there, but also in just keeping the activity in a useful dynamic range."}, {"time": 4730, "text": "So you have other plasticity mechanisms, not just weight update, or at least not on the timescale of many action potentials, but even on the shorter timescale."}, {"time": 4740, "text": "So a synapse can become much less efficacious."}, {"time": 4744, "text": "It can transmit a weaker signal after the second, third, fourth, that can second, third, fourth action potential to occur in a sequence."}, {"time": 4753, "text": "So that's what's called short term synaptic plasticity, which is a form of learning."}, {"time": 4757, "text": "You're learning that I'm getting too much stimulus from looking at something bright right now."}, {"time": 4761, "text": "So I need to tone that down."}, {"time": 4764, "text": "There's also another really important mechanism in learning that's called metoplasticity."}, {"time": 4770, "text": "What that seems to be is a way that you change not the weights themselves, but the rate at which the weights change."}, {"time": 4780, "text": "So when I am in say a lecture hall and my, this is a potentially terrible cartoon example, but let's say I'm in a lecture hall and it's time to learn, right?"}, {"time": 4791, "text": "So my brain will release more, perhaps dopamine or some neuromodulator that's gonna change the rate at which synaptic plasticity occurs."}, {"time": 4802, "text": "So that can make me more sensitive to learning at certain times, more sensitive to overriding previous information and less sensitive at other times."}, {"time": 4810, "text": "And finally, as long as I'm rattling off the list, I think another concept that falls in the category of learning or memory adaptation is homeostasis or homeostatic adaptation, where neurons have the ability to control their firing rate."}, {"time": 4827, "text": "So if one neuron is just like blasting way too much, it will naturally tone itself down."}, {"time": 4833, "text": "Its threshold will adjust so that it stays in a useful dynamical range."}, {"time": 4838, "text": "And we see that that's captured in deep neural networks where you don't just change the synaptic weights, but you can also move the thresholds of simple neurons in those models."}, {"time": 4847, "text": "And so to achieve the spiking neural networks, you want to use, you want to implement the first principles that you mentioned of the temporal and the spatial fractal dynamics here."}, {"time": 4867, "text": "So you can communicate locally, you can communicate across much greater distances and do the same thing in space and do the same thing in time."}, {"time": 4878, "text": "Now, you have like a chapter called Superconducting Hardware for Neuromorphic Computing."}, {"time": 4884, "text": "So what are some ideas that integrate some of the things we've been talking about in terms of the first principles of neuromorphic computing and the ideas that you outline in optoelectronic intelligence?"}, {"time": 4898, "text": "Yeah, so let me start, I guess, on the communication side of things, because that's what led us down this track in the first place."}, {"time": 4907, "text": "By us, I'm talking about my team of colleagues at NIST, Saeed Han, Bryce Brimavera, Sonia Buckley, Jeff Chiles, Adam McCallum to name, Alex Tate to name a few, our group leaders, Saewoo Nam and Rich Mirren."}, {"time": 4921, "text": "We've all contributed to this."}, {"time": 4922, "text": "So this is not me saying necessarily just the things that I've proposed, but sort of where our team's thinking has evolved over the years."}, {"time": 4931, "text": "Can I quickly ask, what is NIST and where is this amazing group of people located?"}, {"time": 4938, "text": "NIST is the National Institute of Standards and Technology."}, {"time": 4943, "text": "The larger facility is out in Gaithersburg, Maryland."}, {"time": 4946, "text": "Our team is located in Boulder, Colorado."}, {"time": 4951, "text": "NIST is a federal agency under the Department of Commerce."}, {"time": 4956, "text": "We do a lot with, by we, I mean other people at NIST, do a lot with standards, making sure that we understand the system of units, international system of units, precision measurements."}, {"time": 4969, "text": "There's a lot going on in electrical engineering, material science."}, {"time": 4974, "text": "And it's historic."}, {"time": 4976, "text": "I mean, it's one of those, it's like MIT or something like that."}, {"time": 4979, "text": "It has a reputation over many decades of just being this really a place where there's a lot of brilliant people have done a lot of amazing things."}, {"time": 4987, "text": "But in terms of the people in your team, in this team of people involved in the concept we're talking about now, I'm just curious, what kind of disciplines are we talking about?"}, {"time": 4998, "text": "Mostly physicists and electrical engineers, some material scientists, but I would say, yeah, I think physicists and electrical engineers, my background is in photonics, the use of light for technology."}, {"time": 5011, "text": "So coming from there, I tend to have found colleagues that are more from that background."}, {"time": 5018, "text": "Although Adam McConn, more of a superconducting electronics background, we need a diversity of folks."}, {"time": 5024, "text": "This project is sort of cross disciplinary."}, {"time": 5026, "text": "I would love to be working more with neuroscientists and things, but we haven't reached that scale yet."}, {"time": 5034, "text": "You're focused on the hardware side, which requires all the disciplines that you mentioned."}, {"time": 5039, "text": "And then of course, neuroscientists may be a source of inspiration for some of the longterm vision."}, {"time": 5044, "text": "I would actually call it more than inspiration."}, {"time": 5046, "text": "I would call it sort of a roadmap."}, {"time": 5051, "text": "We're not trying to build exactly the brain, but I don't think it's enough to just say, oh, neurons kind of work like that."}, {"time": 5059, "text": "Let's kind of do that thing."}, {"time": 5060, "text": "I mean, we're very much following the concepts that the cognitive sciences have laid out for us, which I believe is a really robust roadmap."}, {"time": 5070, "text": "I mean, just on a little bit of a tangent, it's often stated that we just don't understand the brain."}, {"time": 5076, "text": "And so it's really hard to replicate it because we just don't know what's going on there."}, {"time": 5080, "text": "And maybe five or seven years ago, I would have said that, but as I got more interested in the subject, I read more of the neuroscience literature and I was just taken by the exact opposite sense."}, {"time": 5093, "text": "I can't believe how much they know about this."}, {"time": 5095, "text": "I can't believe how mathematically rigorous and sort of theoretically complete a lot of the concepts are."}, {"time": 5104, "text": "That's not to say we understand consciousness or we understand the self or anything like that, but what is the brain doing and why is it doing those things?"}, {"time": 5113, "text": "Neuroscientists have a lot of answers to those questions."}, {"time": 5116, "text": "So if you're a hardware designer that just wants to get going, whoa, it's pretty clear which direction to go in, I think."}, {"time": 5123, "text": "Okay, so I love the optimism behind that, but in the implementation of these systems that uses superconductivity, how do you make it happen?"}, {"time": 5139, "text": "So to me, it starts with thinking about the communication network."}, {"time": 5143, "text": "You know for sure that the ability of each neuron to communicate to many thousands of colleagues across the network is indispensable."}, {"time": 5152, "text": "I take that as a core principle of my architecture, my thinking on the subject."}, {"time": 5158, "text": "So coming from a background in photonics, it was very natural to say, okay, we're gonna use light for communication."}, {"time": 5165, "text": "Just in case listeners may not know, light is often used in communication."}, {"time": 5170, "text": "I mean, if you think about radio, that's light, it's long wavelengths, but it's electromagnetic radiation."}, {"time": 5175, "text": "It's the same physical phenomenon obeying exactly the same Maxwell's equations."}, {"time": 5180, "text": "And then all the way down to fiber, fiber optics."}, {"time": 5184, "text": "Now you're using visible or near infrared wavelengths of light, but the way you send messages across the ocean is now contemporary over optical fibers."}, {"time": 5193, "text": "So using light for communication is not a stretch."}, {"time": 5198, "text": "So you might ask, well, why don't you use light for communication in a conventional microchip?"}, {"time": 5205, "text": "And the answer to that is, I believe, physical."}, {"time": 5209, "text": "If we had a light source on a silicon chip that was as simple as a transistor, there would not be a processor in the world that didn't use light for communication, at least above some distance."}, {"time": 5221, "text": "How many light sources are needed?"}, {"time": 5224, "text": "Oh, you need a light source at every single point."}, {"time": 5226, "text": "A light source per neuron."}, {"time": 5228, "text": "Per neuron, per little, but then if you could have a really small and nice light source, your definition of neuron could be flexible."}, {"time": 5237, "text": "Could be, yes, yes."}, {"time": 5239, "text": "Sometimes it's helpful to me to say, in this hardware, a neuron is that entity which has a light source."}, {"time": 5245, "text": "That, and I can explain."}, {"time": 5247, "text": "And then there was light."}, {"time": 5249, "text": "I mean, I can explain more about that, but."}, {"time": 5252, "text": "Somehow this like rhymes with consciousness because people will often say the light of consciousness."}, {"time": 5258, "text": "So that consciousness is that which is conscious."}, {"time": 5263, "text": "That's not my quote."}, {"time": 5264, "text": "That's me, that's my quote."}, {"time": 5267, "text": "You see, that quote comes from my background."}, {"time": 5269, "text": "Yours is in optics, mine in light, mine's in darkness."}, {"time": 5275, "text": "So go ahead."}, {"time": 5276, "text": "So the point I was making there is that if it was easy to manufacture light sources along with transistors on a silicon chip, they would be everywhere."}, {"time": 5288, "text": "People have been trying for decades and it's actually extremely difficult."}, {"time": 5291, "text": "I think an important part of our research is dwelling right at that spot there."}, {"time": 5297, "text": "Is it physics or engineering?"}, {"time": 5299, "text": "So, okay, so it's physics, I think."}, {"time": 5302, "text": "So what I mean by that is, as we discussed, silicon is the material of choice for transistors and it's very difficult to imagine that that's gonna change anytime soon."}, {"time": 5315, "text": "Silicon is notoriously bad at emitting light."}, {"time": 5319, "text": "And that has to do with the immutable properties of silicon itself."}, {"time": 5324, "text": "The way that the energy bands are structured in silicon, you're never going to make silicon efficient as a light source at room temperature without doing very exotic things that degrade its ability to interface nicely with those transistors in the first place."}, {"time": 5339, "text": "So that's like one of these things where it's, why is nature dealing us that blow?"}, {"time": 5345, "text": "You give us these beautiful transistors and you give us all the motivation to use light for communication, but then you don't give us a light source."}, {"time": 5351, "text": "So, well, okay, you do give us a light source."}, {"time": 5354, "text": "Compound semiconductors, like we talked about back at the beginning, an element from group three and an element from group five form an alloy where every other lattice site switches which element it is."}, {"time": 5363, "text": "Those have much better properties for generating light."}, {"time": 5367, "text": "You put electrons in, light comes out."}, {"time": 5370, "text": "Almost 100% of the electron hold, it can be made efficient."}, {"time": 5376, "text": "I'll take your word for it, okay."}, {"time": 5377, "text": "However, I say it's physics, not engineering, because it's very difficult to get those compound semiconductor light sources situated with your silicon."}, {"time": 5387, "text": "In order to do that ion implantation that I talked about at the beginning, high temperatures are required."}, {"time": 5392, "text": "So you gotta make all of your transistors first and then put the compound semiconductors on top of there."}, {"time": 5398, "text": "You can't grow them afterwards because that requires high temperature."}, {"time": 5402, "text": "It screws up all your transistors."}, {"time": 5404, "text": "You try and stick them on there."}, {"time": 5405, "text": "They don't have the same lattice constant."}, {"time": 5407, "text": "The spacing between atoms is different enough that it just doesn't work."}, {"time": 5411, "text": "So nature does not seem to be telling us that, hey, go ahead and combine light sources with your digital switches for conventional digital computing."}, {"time": 5422, "text": "And conventional digital computing will often require smaller scale, I guess, in terms of like smartphone."}, {"time": 5430, "text": "So in which kind of systems does nature hint that we can use light and photons for communication?"}, {"time": 5440, "text": "Well, so let me just try and be clear."}, {"time": 5442, "text": "You can use light for communication in digital systems, just the light sources are not intimately integrated with the silicon."}, {"time": 5450, "text": "You manufacture all the silicon, you have your microchip, plunk it down."}, {"time": 5454, "text": "And then you manufacture your light sources, separate chip, completely different process made in a different foundry."}, {"time": 5460, "text": "And then you put those together at the package level."}, {"time": 5463, "text": "So now you have some, I would say a great deal of architectural limitations that are introduced by that sort of package level integration as opposed to monolithic on the same chip integration, but it's still a very useful thing to do."}, {"time": 5479, "text": "And that's where I had done some work previously before I came to NIST."}, {"time": 5484, "text": "There's a project led by Vladimir Stoyanovich that now spun out into a company called IR Labs led by Mark Wade and Chen Sun where they're doing exactly that."}, {"time": 5494, "text": "So you have your light source chip, your silicon chip, whatever it may be doing, maybe it's digital electronics, maybe it's some other control purpose, something."}, {"time": 5503, "text": "And the silicon chip drives the light source chip and modulates the intensity of the lights."}, {"time": 5509, "text": "You can get data out of the package on an optical fiber."}, {"time": 5512, "text": "And that still gives you tremendous advantages in bandwidth as opposed to sending those signals out over electrical lines."}, {"time": 5520, "text": "But it is somewhat peculiar to my eye that they have to be integrated at this package level."}, {"time": 5527, "text": "And those people, I mean, they're so smart."}, {"time": 5529, "text": "Those are my colleagues that I respect a great deal."}, {"time": 5532, "text": "So it's very clear that it's not just they're making a bad choice."}, {"time": 5538, "text": "This is what physics is telling us."}, {"time": 5540, "text": "It just wouldn't make any sense to try to stick them together."}, {"time": 5544, "text": "Yeah, so even if it's difficult, it's easier than the alternative, unfortunately."}, {"time": 5551, "text": "And again, I need to go back and make sure that I'm not taking the wrong way."}, {"time": 5555, "text": "I'm not saying that the pursuit of integrating compound semiconductors with silicon is fruitless and shouldn't be pursued."}, {"time": 5561, "text": "It should, and people are doing great work."}, {"time": 5563, "text": "Kai Mei Lau and John Bowers, others, they're doing it and they're making progress."}, {"time": 5568, "text": "But to my eye, it doesn't look like that's ever going to be just the standard monolithic light source on silicon process."}, {"time": 5578, "text": "I just don't see it."}, {"time": 5580, "text": "Yeah, so nature kind of points the way usually."}, {"time": 5582, "text": "And if you resist nature, you're gonna have to do a lot more work."}, {"time": 5585, "text": "And it's gonna be expensive and not scalable."}, {"time": 5588, "text": "But okay, so let's go far into the future."}, {"time": 5591, "text": "Let's imagine this gigantic neuromorphic computing system that simulates all of our realities."}, {"time": 5597, "text": "It currently is Mantra Matrix 4."}, {"time": 5599, "text": "So this thing, this powerful computer, how does it operate?"}, {"time": 5604, "text": "So what are the neurons?"}, {"time": 5607, "text": "What is the communication?"}, {"time": 5610, "text": "All right, so let me now, after spending 45 minutes trashing light source integration with silicon, let me now say why I'm basing my entire life, professional life, on integrating light sources with electronics."}, {"time": 5624, "text": "I think the game is completely different when you're talking about superconducting electronics."}, {"time": 5629, "text": "For several reasons, let me try to go through them."}, {"time": 5634, "text": "One is that, as I mentioned, it's difficult to integrate those compound semiconductor light sources with silicon."}, {"time": 5641, "text": "With silicon is a requirement that is introduced by the fact that you're using semiconducting electronics."}, {"time": 5647, "text": "In superconducting electronics, you're still gonna start with a silicon wafer, but it's just the bread for your sandwich in a lot of ways."}, {"time": 5653, "text": "You're not using that silicon in precisely the same way for the electronics."}, {"time": 5657, "text": "You're now depositing superconducting materials on top of that."}, {"time": 5661, "text": "The prospects for integrating light sources with that kind of an electronic process are certainly less explored, but I think much more promising because you don't need those light sources to be intimately integrated with the transistors."}, {"time": 5676, "text": "That's where the problems come up."}, {"time": 5677, "text": "They don't need to be lattice matched to the silicon, all that kind of stuff."}, {"time": 5681, "text": "Instead, it seems possible that you can take those compound semiconductor light sources, stick them on the silicon wafer, and then grow your superconducting electronics on the top of that."}, {"time": 5692, "text": "It's at least not obviously going to fail."}, {"time": 5695, "text": "So the computation would be done on the superconductive material as well?"}, {"time": 5700, "text": "Yes, the computation is done in the superconducting electronics, and the light sources receive signals that say, hey, a neuron reached threshold, produce a pulse of light, send it out to all your downstream synaptic connections."}, {"time": 5712, "text": "Those are, again, superconducting electronics."}, {"time": 5716, "text": "Perform your computation, and you're off to the races."}, {"time": 5719, "text": "Your network works."}, {"time": 5720, "text": "So then if we can rewind real quick, so what are the limitations of the challenges of superconducting electronics when we think about constructing these kinds of systems?"}, {"time": 5731, "text": "So actually, let me say one other thing about the light sources, and then I'll move on, I promise, because this is probably tedious for some."}, {"time": 5742, "text": "This is super exciting."}, {"time": 5744, "text": "Okay, one other thing about the light sources."}, {"time": 5745, "text": "I said that silicon is terrible at emitting photons."}, {"time": 5748, "text": "It's just not what it's meant to do."}, {"time": 5750, "text": "However, the game is different when you're at low temperature."}, {"time": 5754, "text": "If you're working with superconductors, you have to be at low temperature because they don't work otherwise."}, {"time": 5758, "text": "When you're at four Kelvin, silicon is not obviously a terrible light source."}, {"time": 5763, "text": "It's still not as efficient as compound semiconductors, but it might be good enough for this application."}, {"time": 5768, "text": "The final thing that I'll mention about that is, again, leveraging superconductors, as I said, in a different context, superconducting detectors can receive one single photon."}, {"time": 5779, "text": "In that conversation, I failed to mention that semiconductors can also receive photons."}, {"time": 5783, "text": "That's the primary mechanism by which it's done."}, {"time": 5786, "text": "A camera in your phone that's receptive to visible light is receiving photons."}, {"time": 5791, "text": "It's based on silicon, or you can make it in different semiconductors for different wavelengths, but it requires on the order of a thousand, a few thousand photons to receive a pulse."}, {"time": 5803, "text": "Now, when you're using a superconducting detector, you need one photon, exactly one."}, {"time": 5808, "text": "I mean, one or more."}, {"time": 5810, "text": "So the fact that your synapses can now be based on superconducting detectors instead of semiconducting detectors brings the light levels that are required down by some three orders of magnitude."}, {"time": 5823, "text": "So now you don't need good light sources."}, {"time": 5826, "text": "You can have the world's worst light sources."}, {"time": 5828, "text": "As long as they spit out maybe a few thousand photons every time a neuron fires, you have the hardware principles in place that you might be able to perform this optoelectronic integration."}, {"time": 5841, "text": "To me optoelectronic integration is, it's just so enticing."}, {"time": 5845, "text": "We want to be able to leverage electronics for computation, light for communication, working with silicon microelectronics at room temperature that has been exceedingly difficult."}, {"time": 5855, "text": "And I hope that when we move to the superconducting domain, target a different application space that is neuromorphic instead of digital and use superconducting detectors, maybe optoelectronic integration comes to us."}, {"time": 5870, "text": "Okay, so there's a bunch of questions."}, {"time": 5871, "text": "So one is temperature."}, {"time": 5873, "text": "So in these kinds of hybrid heterogeneous systems, what's the temperature?"}, {"time": 5879, "text": "What are some of the constraints to the operation here?"}, {"time": 5881, "text": "Does it all have to be a four Kelvin as well?"}, {"time": 5883, "text": "Four Kelvin."}, {"time": 5884, "text": "Everything has to be at four Kelvin."}, {"time": 5886, "text": "Okay, so what are the other engineering challenges of making this kind of optoelectronic systems?"}, {"time": 5894, "text": "Let me just dwell on that four Kelvin for a second because some people hear four Kelvin and they just get up and leave."}, {"time": 5899, "text": "They just say, I'm not doing it, you know?"}, {"time": 5901, "text": "And to me, that's very earth centric, species centric."}, {"time": 5905, "text": "We live in 300 Kelvin."}, {"time": 5907, "text": "So we want our technologies to operate there too."}, {"time": 5909, "text": "I totally get it."}, {"time": 5910, "text": "Yeah, what's zero Celsius?"}, {"time": 5911, "text": "Zero Celsius is 273 Kelvin."}, {"time": 5914, "text": "So we're talking very, very cold here."}, {"time": 5917, "text": "This is... Not even Boston cold."}, {"time": 5920, "text": "This is real cold."}, {"time": 5923, "text": "Siberia cold, no."}, {"time": 5924, "text": "Okay, so just for reference, the temperature of the cosmic microwave background is about 2.7 Kelvin."}, {"time": 5929, "text": "So we're still warmer than deep space."}, {"time": 5932, "text": "So that when the universe dies out, it'll be colder than four K. It's already colder than four K. In the expanses, you know, you don't have to get that far away from the earth in order to drop down to not far from four Kelvin."}, {"time": 5948, "text": "So what you're saying is the aliens that live at the edge of the observable universe are using superconductive material for their computation."}, {"time": 5956, "text": "They don't have to live at the edge of the universe."}, {"time": 5957, "text": "The aliens that are more advanced than us in their solar system are doing this in their asteroid belt."}, {"time": 5966, "text": "We can get to that."}, {"time": 5967, "text": "Oh, because they can get that to that temperature easier there?"}, {"time": 5972, "text": "All you have to do is reflect the sunlight away and you have a huge headstart."}, {"time": 5976, "text": "Oh, so the sun is the problem here."}, {"time": 5977, "text": "Like it's warm here on earth."}, {"time": 5979, "text": "Okay, so can you..."}, {"time": 5981, "text": "So how do we get to four K?"}, {"time": 5982, "text": "What's... Well, okay, so what I want to say about temperature... Yeah."}, {"time": 5988, "text": "What I want to say about temperature is that if you can swallow that, if you can say, all right, I give up applications that have to do with my cell phone and the convenience of a laptop on a train and you instead... For me, I'm very much in the scientific head space."}, {"time": 6006, "text": "I'm not looking at products."}, {"time": 6007, "text": "I'm not looking at what this will be useful to sell to consumers."}, {"time": 6011, "text": "Instead, I'm thinking about scientific questions."}, {"time": 6013, "text": "Well, it's just not that bad to have to work at four Kelvin."}, {"time": 6016, "text": "We do it all the time in our labs at NIST."}, {"time": 6019, "text": "And so does..."}, {"time": 6019, "text": "I mean, for reference, the entire quantum computing sector usually has to work at something like 100 millikelvin, 50 millikelvin."}, {"time": 6029, "text": "So now you're talking of another factor of 100 even colder than that, a fraction of a degree."}, {"time": 6035, "text": "And everybody seems to think quantum computing is going to take over the world."}, {"time": 6039, "text": "It's so much more expensive to have to get that extra factor of 10 or whatever colder."}, {"time": 6046, "text": "And yet it's not stopping people from investing in that area."}, {"time": 6050, "text": "And by investing, I mean putting their research into it as well as venture capital or whatever."}, {"time": 6055, "text": "So... Oh, so based on the energy of what you're commenting on, I'm getting a sense that's one of the criticism of this approach is 4K, 4 Kelvin is a big negative."}, {"time": 6066, "text": "It is the showstopper for a lot of people."}, {"time": 6070, "text": "They just, I mean, and understandably, I'm not saying that that's not a consideration."}, {"time": 6077, "text": "For some..."}, {"time": 6078, "text": "Okay, so different motivations for different people."}, {"time": 6081, "text": "In the academic world, suppose you spent your whole life learning about silicon microelectronic circuits."}, {"time": 6086, "text": "You send a design to a foundry, they send you back a chip and you go test it at your tabletop."}, {"time": 6093, "text": "And now I'm saying, here now learn how to use all these cryogenics so you can do that at 4 Kelvin."}, {"time": 6098, "text": "No, come on, man."}, {"time": 6101, "text": "That sounds bad."}, {"time": 6102, "text": "It's the old momentum, the Titanic of the turning."}, {"time": 6105, "text": "But you're saying that's not too much of a..."}, {"time": 6108, "text": "When we're looking at large systems and the gain you can potentially get from them, that's not that much of a cost."}, {"time": 6113, "text": "And when you wanna answer the scientific question about what are the physical limits of cognition?"}, {"time": 6118, "text": "Well, the physical limits, they don't care if you're at 4 Kelvin."}, {"time": 6121, "text": "If you can perform cognition at a scale orders of magnitude beyond any room temperature technology, but you gotta get cold to do it, you're gonna do it."}, {"time": 6130, "text": "And to me, that's the interesting application space."}, {"time": 6134, "text": "It's not even an application space, that's the interesting scientific paradigm."}, {"time": 6138, "text": "So I personally am not going to let low temperature stop me from realizing a technological domain or realm that is achieving in most ways everything else that I'm looking for in my hardware."}, {"time": 6156, "text": "So that, okay, that's a big one."}, {"time": 6157, "text": "Is there other kind of engineering challenges that you envision?"}, {"time": 6161, "text": "So let me take a moment here because I haven't really described what I mean by a neuron or a network in this particular hardware."}, {"time": 6169, "text": "Yeah, do you wanna talk about loop neurons and there's so many fascinating..."}, {"time": 6173, "text": "But you just have so many amazing papers that people should definitely check out and the titles alone are just killer."}, {"time": 6179, "text": "So anyway, go ahead."}, {"time": 6181, "text": "Right, so let me say big picture, based on optics, photonics for communication, superconducting electronics for computation, how does this all work?"}, {"time": 6191, "text": "So a neuron in this hardware platform can be thought of as circuits that are based on Josephson junctions, like we talked about before, where every time a photon comes in..."}, {"time": 6205, "text": "So let's start by talking about a synapse."}, {"time": 6207, "text": "A synapse receives a photon, one or more, from a different neuron and it converts that optical signal to an electrical signal."}, {"time": 6215, "text": "The amount of current that that adds to a loop is controlled by the synaptic weight."}, {"time": 6220, "text": "So as I said before, you're popping fluxons into a loop, right?"}, {"time": 6224, "text": "So a photon comes in, it hits a superconducting single photon detector, one photon, the absolute physical minimum that you can communicate from one place to another with light."}, {"time": 6234, "text": "And that detector then converts that into an electrical signal and the amount of signal is correlated with some kind of weight."}, {"time": 6241, "text": "Yeah, so the synaptic weight will tell you how many fluxons you pop into the loop."}, {"time": 6245, "text": "It's an analog number."}, {"time": 6246, "text": "We're doing analog computation now."}, {"time": 6248, "text": "Well, can you just linger on that?"}, {"time": 6249, "text": "What the heck is a fluxon?"}, {"time": 6250, "text": "Are we supposed to know this?"}, {"time": 6251, "text": "Or is this a funny, is this like the big bang?"}, {"time": 6255, "text": "Is this a funny word for something deeply technical?"}, {"time": 6258, "text": "No, let's try to avoid using the word fluxon because it's not actually necessary."}, {"time": 6262, "text": "When a photon..."}, {"time": 6264, "text": "It's fun to say though."}, {"time": 6265, "text": "So it's very necessary, I would say."}, {"time": 6269, "text": "When a photon hits that superconducting single photon detector, current is added to a superconducting loop."}, {"time": 6276, "text": "And the amount of current that you add is an analog value, can have eight bit equivalent resolution, something like that."}, {"time": 6284, "text": "10 bits, maybe."}, {"time": 6285, "text": "That's amazing, by the way."}, {"time": 6286, "text": "This is starting to make a lot more sense."}, {"time": 6288, "text": "When you're using superconductors for this, the energy of that circulating current is less than the energy of that photon."}, {"time": 6298, "text": "So your energy budget is not destroyed by doing this analog computation."}, {"time": 6304, "text": "So now in the language of a neuroscientist, you would say that's your postsynaptic signal."}, {"time": 6309, "text": "You have this current being stored in a loop."}, {"time": 6311, "text": "You can decide what you wanna do with it."}, {"time": 6313, "text": "Most likely you're gonna have it decay exponentially."}, {"time": 6316, "text": "So every single synapse is gonna have some given time constant."}, {"time": 6320, "text": "And that's determined by putting some resistor in that superconducting loop."}, {"time": 6327, "text": "So a synapse event occurs when a photon strikes a detector, adds current to that loop, it decays over time."}, {"time": 6333, "text": "That's the postsynaptic signal."}, {"time": 6335, "text": "Then you can process that in a dendritic tree."}, {"time": 6338, "text": "Bryce Primavera and I have a paper that we've submitted about that."}, {"time": 6343, "text": "For the more neuroscience oriented people, there's a lot of dendritic processing, a lot of plasticity mechanisms you can implement with essentially exactly the same circuits."}, {"time": 6351, "text": "You have this one simple building block circuit that you can use for a synapse, for a dendrite, for the neuron cell body, for all the plasticity functions."}, {"time": 6360, "text": "It's all based on the same building block, just tweaking a couple parameters."}, {"time": 6363, "text": "So this basic building block has both an optical and an electrical component, and then you just build arbitrary large systems with that?"}, {"time": 6371, "text": "Close, you're not at fault for thinking that that's what I meant."}, {"time": 6375, "text": "What I should say is that if you want it to be a synapse, you tack a superconducting detector onto the front of it."}, {"time": 6382, "text": "And if you want it to be anything else, there's no optical component."}, {"time": 6385, "text": "Got it, so at the front, optics in the front, electrical stuff in the back."}, {"time": 6392, "text": "Electrical, yeah, in the processing and in the output signal that it sends to the next stage of processing further."}, {"time": 6399, "text": "So the dendritic trees is electrical."}, {"time": 6401, "text": "It's all electrical."}, {"time": 6402, "text": "It's all electrical in the superconducting domain."}, {"time": 6404, "text": "For anybody who's up on their superconducting circuits, it's just based on a DC squid, the most ubiquitous, which is a circuit composed of two Joseph's injunctions."}, {"time": 6415, "text": "So it's a very bread and butter kind of thing."}, {"time": 6418, "text": "And then the only place where you go beyond that is the neuron cell body itself."}, {"time": 6423, "text": "It's receiving all these electrical inputs from the synapses or dendrites or however you've structured that particular unique neuron."}, {"time": 6429, "text": "And when it reaches its threshold, which occurs by driving a Joseph's injunction above its critical current, it produces a pulse of current, which starts an amplification sequence, voltage amplification, that produces light out of a transmitter."}, {"time": 6444, "text": "So one of our colleagues, Adam McCann, and Sonia Buckley as well, did a lot of work on the light sources and the amplifiers that drive the current and produce sufficient voltage to drive current through that now semiconducting part."}, {"time": 6459, "text": "So that light source is the semiconducting part of a neuron."}, {"time": 6463, "text": "And that, so the neuron has reached threshold."}, {"time": 6465, "text": "It produces a pulse of light."}, {"time": 6467, "text": "That light then fans out across a network of wave guides to reach all the downstream synaptic terminals that perform this process themselves."}, {"time": 6477, "text": "So it's probably worth explaining what a network of wave guides is, because a lot of listeners aren't gonna know that."}, {"time": 6484, "text": "Look up the papers by Jeff Chiles on this one."}, {"time": 6487, "text": "But basically, light can be guided in a simple, basically wire of usually an insulating material."}, {"time": 6494, "text": "So silicon, silicon nitride, different kinds of glass, just like in a fiber optic, it's glass, silicon dioxide."}, {"time": 6503, "text": "That makes it a little bit big."}, {"time": 6504, "text": "We wanna bring these down."}, {"time": 6506, "text": "So we use different materials like silicon nitride, but basically just imagine a rectangle of some material that just goes and branches, forms different branch points that target different subregions of the network."}, {"time": 6523, "text": "You can transition between layers of these."}, {"time": 6525, "text": "So now we're talking about building in the third dimension, which is absolutely crucial."}, {"time": 6528, "text": "So that's what wave guides are."}, {"time": 6532, "text": "Why the third dimension is crucial?"}, {"time": 6534, "text": "Okay, so yes, you were talking about what are some of the technical limitations."}, {"time": 6539, "text": "One of the things that I believe we have to grapple with is that our brains are miraculously compact."}, {"time": 6548, "text": "For the number of neurons that are in our brain, it sure does fit in a small volume, as it would have to if we're gonna be biological organisms that are resource limited and things like that."}, {"time": 6559, "text": "Any kind of hardware neuron is almost certainly gonna be much bigger than that if it is of comparable complexity, whether it's based on silicon transistors."}, {"time": 6568, "text": "Okay, a transistor, seven nanometers, that doesn't mean a semiconductor based neuron is seven nanometers."}, {"time": 6574, "text": "They're big."}, {"time": 6575, "text": "They require many transistors, different other things like capacitors and things that store charge."}, {"time": 6581, "text": "They end up being on the order of 100 microns by 100 microns, and it's difficult to get them down any smaller than that."}, {"time": 6588, "text": "The same is true for superconducting neurons, and the same is true if we're trying to use light for communication."}, {"time": 6594, "text": "Even if you're using electrons for communication, you have these wires where, okay, the size of an electron might be angstroms, but the size of a wire is not angstroms, and if you try and make it narrower, the resistance just goes up, so you don't actually win."}, {"time": 6610, "text": "To communicate over long distances, you need your wires to be microns wide, and it's the same thing for wave guides."}, {"time": 6659, "text": "Active, I mean superconducting electronic circuits that are performing computations, and passive, I mean these wave guides that are routing the optical signals to different places, you have to be able to stack those."}, {"time": 6671, "text": "If you can get to something like 10 planes of each of those, or maybe not even 10, maybe five, six, something like that, then you're in business."}, {"time": 6679, "text": "Now you can get millions of neurons on a wafer, but that's not anywhere close to the brain scale."}, {"time": 6708, "text": "I think that applies to any hardware where you're trying to reach commensurate scale and complexity as the human brain."}, {"time": 6715, "text": "So you need that fractal stacking, so stacking on the wafer, and stacking of the wafers, and then whatever the system that combines, this stacking of the tables with the wafers."}, {"time": 6726, "text": "And it has to be fractal all the way, you're exactly right, because that's the only way that you can efficiently get information from a small point to across that whole network."}, {"time": 6735, "text": "It has to have the power law connected."}, {"time": 6737, "text": "And photons are like optics throughout."}, {"time": 6741, "text": "Once you're at this scale, to me it's just obvious."}, {"time": 6743, "text": "Of course you're using light for communication."}, {"time": 6745, "text": "You have fiber optics given to us from nature, so simple."}, {"time": 6750, "text": "The thought of even trying to do any kind of electrical communication just doesn't make sense to me."}, {"time": 6757, "text": "I'm not saying it's wrong, I don't know, but that's where I'm coming from."}, {"time": 6760, "text": "So let's return to loop neurons."}, {"time": 6763, "text": "Why are they called loop neurons?"}, {"time": 6766, "text": "Yeah, the term loop neurons comes from the fact, like we've been talking about, that they rely heavily on these superconducting loops."}, {"time": 6773, "text": "So even in a lot of forms of digital computing with superconductors, storing a signal in a superconducting loop is a primary technique."}, {"time": 6785, "text": "In this particular case, it's just loops everywhere you look."}, {"time": 6788, "text": "So the strength of a synaptic weight is gonna be set by the amount of current circulating in a loop that is coupled to the synapse."}, {"time": 6797, "text": "So memory is implemented as current circulating in a superconducting loop."}, {"time": 6804, "text": "The coupling between, say, a synapse and a dendrite or a synapse in the neuron cell body occurs through loop coupling through transformers."}, {"time": 6813, "text": "So current circulating in a synapse is gonna induce current in a different loop, a receiving loop in the neuron cell body."}, {"time": 6820, "text": "So since all of the computation is happening in these flux storage loops and they play such a central role in how the information is processed, how memories are formed, all that stuff, I didn't think too much about it, I just called them loop neurons because it rolls off the tongue a little bit better than superconducting optoelectronic neurons."}, {"time": 6842, "text": "Okay, so how do you design circuits for these loop neurons?"}, {"time": 6849, "text": "There's a lot of different scales of design."}, {"time": 6852, "text": "So at the level of just one synapse, you can use conventional methods."}, {"time": 6858, "text": "They're not that complicated as far as superconducting electronics goes."}, {"time": 6863, "text": "It's just four Joseph's injunctions or something like that depending on how much complexity you wanna add."}, {"time": 6869, "text": "So you can just directly simulate each component in SPICE."}, {"time": 6874, "text": "What's SPICE?"}, {"time": 6875, "text": "It's Standard Electrical Simulation Software, basically."}, {"time": 6879, "text": "So you're just explicitly solving the differential equations that describe the circuit elements."}, {"time": 6884, "text": "And then you can stack these things together in that simulation software to then build circuits."}, {"time": 6888, "text": "You can, but that becomes computationally expensive."}, {"time": 6891, "text": "So one of the things when COVID hit, we knew we had to turn some attention to more things you can do at home in your basement or whatever, and one of them was computational modeling."}, {"time": 6902, "text": "So we started working on adapting, abstracting out the circuit performance so that you don't have to explicitly solve the circuit equations, which for Joseph's injunctions usually needs to be done on like a picosecond timescale and you have a lot of nodes in your circuit."}, {"time": 6921, "text": "So it results in a lot of differential equations that need to be solved simultaneously."}, {"time": 6926, "text": "We were looking for a way to simulate these circuits that is scalable up to networks of millions or so neurons is sort of where we're targeting right now."}, {"time": 6936, "text": "So we were able to analyze the behavior of these circuits."}, {"time": 6940, "text": "And as I said, it's based on these simple building blocks."}, {"time": 6943, "text": "So you really only need to understand this one building block."}, {"time": 6946, "text": "And if you get a good model of that, boom, it tiles."}, {"time": 6948, "text": "And you can change the parameters in there to get different behaviors and stuff, but it's all based on now it's one differential equation that you need to solve."}, {"time": 6957, "text": "So one differential equation for every synapse, dendrite or neuron in your system."}, {"time": 6963, "text": "And for the neuroscientists out there, it's just a simple leaky integrate and fire model, leaky integrator, basically."}, {"time": 6970, "text": "A synapse is a leaky integrator, a dendrite is a leaky integrator."}, {"time": 6973, "text": "So I'm really fascinated by how this one simple component can be used to achieve lots of different types of dynamical activity."}, {"time": 6984, "text": "And to me, that's where scalability comes from."}, {"time": 6987, "text": "And also complexity as well."}, {"time": 6989, "text": "Complexity is often characterized by relatively simple building blocks connected in potentially simple or sometimes complicated ways, and then emergent new behavior that was hard to predict from those simple elements."}, {"time": 7004, "text": "And that's exactly what we're working with here."}, {"time": 7006, "text": "So it's a very exciting platform, both from a modeling perspective and from a hardware manifestation perspective where we can hopefully start to have this test bed where we can explore things, not just related to neuroscience, but also related to other things that connected to other physics like critical phenomenon, Ising models, things like that."}, {"time": 7028, "text": "So you were asking how we simulate these circuits."}, {"time": 7033, "text": "It's at different levels and we've got the simple spice circuit stuff."}, {"time": 7039, "text": "And now we're building these network models based on this more efficient leaky integrator."}, {"time": 7043, "text": "So we can actually reduce every element to one differential equation."}, {"time": 7047, "text": "And then we can also step through it on a much coarser time grid."}, {"time": 7050, "text": "So it ends up being something like a factor of a thousand to 10,000 speed improvement, which allows us to simulate, but hopefully up to millions of neurons."}, {"time": 7060, "text": "Whereas before we would have been limited to tens, a hundred, something like that."}, {"time": 7065, "text": "And just like simulating quantum mechanical systems with a quantum computer."}, {"time": 7069, "text": "So the goal here is to understand such systems."}, {"time": 7073, "text": "For me, the goal is to study this as a scientific physical system."}, {"time": 7078, "text": "I'm not drawn towards turning this into an enterprise at this point."}, {"time": 7083, "text": "I feel short term applications that obviously make a lot of money is not necessarily a curiosity driver for you at the moment."}, {"time": 7092, "text": "If you're interested in short term making money, go with deep learning, use silicon microelectronics."}, {"time": 7096, "text": "If you wanna understand things like the physics of a fascinating system, or if you wanna understand something more along the lines of the physical limits of what can be achieved, then I think single photon communication, superconducting electronics is extremely exciting."}, {"time": 7115, "text": "What if I wanna use superconducting hardware at four Kelvin to mine Bitcoin?"}, {"time": 7122, "text": "That's my main interest."}, {"time": 7124, "text": "The reason I wanted to talk to you today, I wanna say, no, I don't know."}, {"time": 7127, "text": "What's Bitcoin?"}, {"time": 7131, "text": "Look it up on the internet."}, {"time": 7133, "text": "Somebody told me about it."}, {"time": 7134, "text": "I'm not sure exactly what it is."}, {"time": 7137, "text": "But let me ask nevertheless about applications to machine learning."}, {"time": 7141, "text": "Okay, so if you look at the scale of five, 10, 20 years, is it possible to, before we understand the nature of human intelligence and general intelligence, do you think we'll start falling out of this exploration of neuromorphic systems ability to solve some of the problems that the machine learning systems of today can't solve?"}, {"time": 7166, "text": "Well, I'm really hesitant to over promise."}, {"time": 7174, "text": "Also, I don't really understand machine learning in a lot of senses."}, {"time": 7177, "text": "I mean, machine learning from my perspective appears to require that you know precisely what your input is and also what your goal is."}, {"time": 7191, "text": "You usually have some objective function or something like that."}, {"time": 7194, "text": "And that's very limiting."}, {"time": 7197, "text": "I mean, of course, a lot of times that's the case."}, {"time": 7200, "text": "There's a picture and there's a horse in it, so you're done."}, {"time": 7203, "text": "But that's not a very interesting problem."}, {"time": 7206, "text": "I think when I think about intelligence, it's almost defined by the ability to handle problems where you don't know what your inputs are going to be and you don't even necessarily know what you're trying to accomplish."}, {"time": 7218, "text": "I mean, I'm not sure what I'm trying to accomplish in this world."}, {"time": 7222, "text": "Yeah, at all scales."}, {"time": 7224, "text": "Yeah, at all scales, right."}, {"time": 7225, "text": "I mean, so I'm more drawn to the underlying phenomena, the critical dynamics of this system, trying to understand how elements that you build into your hardware result in emergent fascinating activity that was very difficult to predict, things like that."}, {"time": 7251, "text": "So, but I gotta be really careful because I think a lot of other people who, if they found themselves working on this project in my shoes, they would say, all right, what are all the different ways we can use this for machine learning?"}, {"time": 7262, "text": "Actually, let me just definitely mention colleague at NIST, Mike Schneider."}, {"time": 7266, "text": "He's also very much interested, particularly in the superconducting side of things, using the incredible speed, power efficiency, also Ken Seagal at Colgate, other people working on specifically the superconducting side of this for machine learning and deep feed forward neural networks."}, {"time": 7285, "text": "There, the advantages are obvious."}, {"time": 7287, "text": "It's extremely fast."}, {"time": 7288, "text": "Yeah, so that's less on the nature of intelligences and more on various characteristics of this hardware that you can use for the basic computation as we know it today and communication."}, {"time": 7300, "text": "One of the things that Mike Schneider's working on right now is an image classifier at a relatively small scale."}, {"time": 7306, "text": "I think he's targeting that nine pixel problem where you can have three different characters and you put in a nine pixel image and you classify it as one of these three categories."}, {"time": 7318, "text": "And that's gonna be really interesting to see what happens there, because if you can show that even at that scale, you just put these images in and you get it out and he thinks he can do it, I forgot if it's a nanosecond or some extremely fast classification time, it's probably less, it's probably a hundred picoseconds or something."}, {"time": 7337, "text": "There you have challenges though, because the Joseph's injunctions themselves, the electronic circuit is extremely power efficient."}, {"time": 7344, "text": "Some orders of magnitude for something more than a transistor doing the same thing, but when you have to cool it down to four Kelvin, you pay a huge overhead just for keeping it cold, even if it's not doing anything."}, {"time": 7355, "text": "So it has to work at large scale in order to overcome that power penalty, but that's possible."}, {"time": 7365, "text": "It's just, it's gonna have to get that performance."}, {"time": 7368, "text": "And this is sort of what you were asking about before is like how much better than silicon would it need to be?"}, {"time": 7372, "text": "And the answer is, I don't know."}, {"time": 7374, "text": "I think if it's just overall better than silicon at a problem that a lot of people care about, maybe it's image classification, maybe it's facial recognition, maybe it's monitoring credit transactions, I don't know, then I think it will have a place."}, {"time": 7389, "text": "It's not gonna be in your cell phone, but it could be in your data center."}, {"time": 7392, "text": "So what about in terms of the data center, I don't know if you're paying attention to the various systems, like Tesla recently announced DOJO, which is a large scale machine learning training system, that again, the bottleneck there is probably going to be communication between those systems."}, {"time": 7412, "text": "Is there something from your work on everything we've been talking about in terms of superconductive hardware that could be useful there?"}, {"time": 7423, "text": "Oh, I mean, okay, tomorrow, no."}, {"time": 7426, "text": "In the long term, it could be the whole thing."}, {"time": 7429, "text": "It could be nothing."}, {"time": 7429, "text": "I don't know, but definitely, definitely."}, {"time": 7434, "text": "When you look at the, so I don't know that much about DOJO."}, {"time": 7436, "text": "My understanding is that that's new, right?"}, {"time": 7438, "text": "That's just coming online."}, {"time": 7441, "text": "Well, I don't even know where it hasn't come online."}, {"time": 7446, "text": "And when you announce big, sexy, so let me explain to you the way things work in the world of business and marketing."}, {"time": 7455, "text": "It's not always clear where you are on the coming online part of that."}, {"time": 7460, "text": "So I don't know where they are exactly, but the vision is from a ground up to build a very, very large scale, modular machine learning, ASIC, basically hardware that's optimized for training neural networks."}, {"time": 7474, "text": "And of course, there's a lot of companies that are small and big working on this kind of problem."}, {"time": 7479, "text": "The question is how to do it in a modular way that has very fast communication."}, {"time": 7485, "text": "The interesting aspect of Tesla is you have a company that at least at this time is so singularly focused on solving a particular machine learning problem and is making obviously a lot of money doing so because the machine learning problem happens to be involved with autonomous driving."}, {"time": 7505, "text": "So you have a system that's driven by an application."}, {"time": 7509, "text": "And that's really interesting because you have maybe Google working on TPUs and so on."}, {"time": 7517, "text": "You have all these other companies with ASICs."}, {"time": 7521, "text": "They're usually more kind of always thinking general."}, {"time": 7525, "text": "So I like it when it's driven by a particular application because then you can really get to the, it's somehow if you just talk broadly about intelligence, you may not always get to the right solutions."}, {"time": 7540, "text": "It's nice to couple that sometimes with specific clear illustration of something that requires general intelligence, which for me driving is one such case."}, {"time": 7551, "text": "Sometimes just having that focus on that application brings a lot of people focuses their energy and attention."}, {"time": 7557, "text": "I think that, so one of the things that's appealing about what you're saying is not just that the application is specific, but also that the scale is big and that the benefit is also huge."}, {"time": 7570, "text": "Financial and to humanity."}, {"time": 7573, "text": "Yeah, so I guess let me just try to understand is the point of this dojo system to figure out the parameters that then plug into neural networks and then you don't need to retrain, you just make copies of a certain chip that has all the other parameters established or?"}, {"time": 7592, "text": "No, it's straight up retraining a large neural network over and over and over."}, {"time": 7598, "text": "So you have to do it once for every new car?"}, {"time": 7601, "text": "No, no, you have to, so they do this interesting process, which I think is a process for machine learning, supervised machine learning systems you're going to have to do, which is you have a system, you train your network once, it takes a long time."}, {"time": 7616, "text": "I don't know how long, but maybe a week."}, {"time": 7618, "text": "To train."}, {"time": 7620, "text": "And then you deploy it on, let's say about a million cars."}, {"time": 7625, "text": "I don't know what the number is."}, {"time": 7625, "text": "But that part, you just write software that updates some weights in a table and yeah, okay."}, {"time": 7630, "text": "But there's a loop back."}, {"time": 7632, "text": "Yeah, yeah, okay."}, {"time": 7633, "text": "Each of those cars run into trouble, rarely, but they catch the edge cases of the performance of that particular system and then send that data back and either automatically or by humans, that weird edge case data is annotated and then the network has to become smart enough to now be able to perform in those edge cases, so it has to get retrained."}, {"time": 7661, "text": "There's clever ways of retraining different parts of that network, but for the most part, I think they prefer to retrain the entire thing."}, {"time": 7669, "text": "So you have this giant monster that kind of has to be retrained regularly."}, {"time": 7674, "text": "I think the vision with Dojo is to have a very large machine learning focused, driving focused supercomputer that then is sufficiently modular that can be scaled to other machine learning applications."}, {"time": 7717, "text": "So it has to do with training neural networks fast and training neural networks that are large."}, {"time": 7725, "text": "But also based on an extraordinary amount of diverse input."}, {"time": 7729, "text": "Data, yeah."}, {"time": 7730, "text": "And that's one of the things, so this does seem like one of those spaces where the scale of superconducting optoelectronics, the way that, so when you talk about the weaknesses, like I said, okay, well, you have to cool it down."}, {"time": 7744, "text": "At this scale, that's fine."}, {"time": 7745, "text": "Because that's not too much of an added cost."}, {"time": 7749, "text": "Most of your power is being dissipated by the circuits themselves, not the cooling."}, {"time": 7752, "text": "And also you have one centralized kind of cognitive hub, if you will."}, {"time": 7760, "text": "And so if we're talking about putting a superconducting system in a car, that's questionable."}, {"time": 7768, "text": "Do you really wanna cryostat in the trunk of everyone in your car?"}, {"time": 7771, "text": "It'll fit, it's not that big of a deal, but hopefully there's a better way, right?"}, {"time": 7775, "text": "But since this is sort of a central supreme intelligence or something like that, and it needs to really have this massive data acquisition, massive data integration, I would think that that's where large scale spiking neural networks with vast communication and all these things would have something pretty tremendous to offer."}, {"time": 7794, "text": "It's not gonna happen tomorrow."}, {"time": 7795, "text": "There's a lot of development that needs to be done."}, {"time": 7798, "text": "But we have to be patient with self driving cars for a lot of reasons."}, {"time": 7802, "text": "We were all optimistic that they would be here by now."}, {"time": 7804, "text": "And okay, they are to some extent, but if we're thinking five or 10 years down the line, it's not unreasonable."}, {"time": 7812, "text": "One other thing, let me just mention, getting into self driving cars and technologies that are using AI out in the world, this is something NIST cares a lot about."}, {"time": 7821, "text": "Elham Tabassi is leading up a much larger effort in AI at NIST than my little project."}, {"time": 7829, "text": "And really central to that mission is this concept of trustworthiness."}, {"time": 7835, "text": "So when you're going to deploy this neural network in every single automobile with so much on the line, you have to be able to trust that."}, {"time": 7845, "text": "So now how do we know that we can trust that?"}, {"time": 7848, "text": "How do we know that we can trust the self driving car or the supercomputer that trained it?"}, {"time": 7853, "text": "There's a lot of work there and there's a lot of that going on at NIST."}, {"time": 7856, "text": "And it's still early days."}, {"time": 7858, "text": "I mean, you're familiar with the problem and all that."}, {"time": 7861, "text": "But there's a fascinating dance in engineering with safety critical systems."}, {"time": 7866, "text": "There's a desire in computer science, just recently talked to Don Knuth, for algorithms and for systems, for them to be provably correct or provably safe."}, {"time": 7877, "text": "And this is one other difference between humans and biological systems is we're not provably anything."}, {"time": 7884, "text": "And so there's some aspect of imperfection that we need to have built in, like robustness to imperfection be part of our systems, which is a difficult thing for engineers to contend with."}, {"time": 7900, "text": "They're very uncomfortable with the idea that you have to be okay with failure and almost engineer failure into the system."}, {"time": 7909, "text": "Mathematicians hate it too."}, {"time": 7910, "text": "But I think it was Turing who said something along the lines of, I can give you an intelligent system or I can give you a flawless system, but I can't give you both."}, {"time": 7920, "text": "And it's in sort of creativity and abstract thinking seem to rely somewhat on stochasticity and not having components that perform exactly the same way every time."}, {"time": 7933, "text": "This is where like the disagreement I have with, not disagreement, but a different view on the world."}, {"time": 7938, "text": "I'm with Turing, but when I talk to robotic, robot colleagues, that sounds like I'm talking to robots, colleagues that are roboticists, the goal is perfection."}, {"time": 7951, "text": "And to me is like, no, I think the goal should be imperfection that's communicated."}, {"time": 7960, "text": "And through the interaction between humans and robots, that imperfection becomes a feature, not a bug."}, {"time": 7969, "text": "Like together, seen as a system, the human and the robot together are better than either of them individually, but the robot itself is not perfect in any way."}, {"time": 7980, "text": "Of course, there's a bunch of disagreements, including with Mr. Elon about, to me, autonomous driving is fundamentally a human robot interaction problem, not a robotics problem."}, {"time": 7992, "text": "To Elon, it's a robotics problem."}, {"time": 7994, "text": "That's actually an open and fascinating question, whether humans can be removed from the loop completely."}, {"time": 8004, "text": "We've talked about a lot of fascinating chemistry and physics and engineering, and we're always running up against this issue that nature seems to dictate what's easy and what's hard."}, {"time": 8017, "text": "So you have this cool little paper that I'd love to just ask you about."}, {"time": 8023, "text": "It's titled, Does Cosmological Evolution Select for Technology?"}, {"time": 8028, "text": "So in physics, there's parameters that seem to define the way our universe works, that physics works, that if it worked any differently, we would get a very different world."}, {"time": 8041, "text": "So it seems like the parameters are very fine tuned to the kind of physics that we see."}, {"time": 8046, "text": "All the beautiful E equals MC squared, they would get these nice, beautiful laws."}, {"time": 8050, "text": "It seems like very fine tuned for that."}, {"time": 8053, "text": "So what you argue in this article is it may be that the universe has also fine tuned its parameters that enable the kind of technological innovation that we see, the technology that we see."}, {"time": 8069, "text": "Can you explain this idea?"}, {"time": 8071, "text": "Yeah, I think you've introduced it nicely."}, {"time": 8073, "text": "Let me just try to say a few things in my language layout."}, {"time": 8079, "text": "What is this fine tuning problem?"}, {"time": 8081, "text": "So physicists have spent centuries trying to understand the system of equations that govern the way nature behaves, the way particles move and interact with each other."}, {"time": 8095, "text": "And as that understanding has become more clear over time, it became sort of evident that it's all well adjusted to allow a universe like we see, very complex, this large, long lived universe."}, {"time": 8116, "text": "And so one answer to that is, well, of course it is because we wouldn't be here otherwise."}, {"time": 8121, "text": "But I don't know, that's not very satisfying."}, {"time": 8124, "text": "That's sort of, that's what's known as the weak anthropic principle."}, {"time": 8127, "text": "It's a statement of selection bias."}, {"time": 8129, "text": "We can only observe a universe that is fit for us to live in."}, {"time": 8133, "text": "So what does it mean for a universe to be fit for us to live in?"}, {"time": 8136, "text": "Well, the pursuit of physics, it is based partially on coming up with equations that describe how things behave and interact with each other."}, {"time": 8146, "text": "But in all those equations you have, so there's the form of the equation, sort of how different fields or particles move in space and time."}, {"time": 8156, "text": "But then there are also the parameters that just tell you sort of the strength of different couplings."}, {"time": 8162, "text": "How strongly does a charged particle couple to the electromagnetic field or masses?"}, {"time": 8167, "text": "How strongly does a particle couple to the Higgs field or something like that?"}, {"time": 8172, "text": "And those parameters that define, not the general structure of the equations, but the relative importance of different terms, they seem to be every bit as important as the structure of the equations themselves."}, {"time": 8187, "text": "And so I forget who it was."}, {"time": 8189, "text": "Somebody, when they were working through this and trying to see, okay, if I adjust the parameter, this parameter over here, call it the, say the fine structure constant, which tells us the strength of the electromagnetic interaction."}, {"time": 8200, "text": "Oh boy, I can't change it very much."}, {"time": 8202, "text": "Otherwise nothing works."}, {"time": 8203, "text": "The universe sort of doesn't, it just pops into existence and goes away in a nanosecond or something like that."}, {"time": 8208, "text": "And somebody had the phrase, this looks like a put up job, meaning every one of these parameters was dialed in."}, {"time": 8217, "text": "It's arguable how precisely they have to be dialed in, but dialed in to some extent, not just in order to enable our existence, that's a very anthropocentric view, but to enable a universe like this one."}, {"time": 8230, "text": "So, okay, maybe I think the majority position of working physicists in the field is, it has to be that way in order for us to exist."}, {"time": 8238, "text": "We're here, we shouldn't be surprised that that's the way the universe is."}, {"time": 8242, "text": "And I don't know, for a while, that never sat well with me, but I just kind of moved on because there are things to do and a lot of exciting work."}, {"time": 8251, "text": "It doesn't depend on resolving this puzzle, but as I started working more with technology, getting into the more recent years of my career, particularly when I started, after having worked with silicon for a long time, which was kind of eerie on its own, but then when I switched over to superconductors, I was just like, this is crazy."}, {"time": 8273, "text": "It's just absolutely astonishing that our universe gives us superconductivity."}, {"time": 8280, "text": "It's one of the most beautiful physical phenomena and it's also extraordinarily useful for technology."}, {"time": 8286, "text": "So you can argue that the universe has to have the parameters it does for us to exist because we couldn't be here otherwise, but why does it give us technology?"}, {"time": 8294, "text": "Why does it give us silicon that has this ideal oxide that allows us to make a transistor without trying that hard?"}, {"time": 8303, "text": "That can't be explained by the same anthropic reasoning."}, {"time": 8307, "text": "Yeah, so it's asking the why question."}, {"time": 8347, "text": "Well, yeah, you can start to quantify things."}, {"time": 8350, "text": "So nowhere am I arguing that in all of the vast parameter space of everything that could conceivably exist in the multiverse of nature, there's this one point in parameter space where complexity arises."}, {"time": 8366, "text": "That would be a shameful waste of resources, it seems."}, {"time": 8371, "text": "But it might be that we reside at one place in parameter space that has been adapted through an evolutionary process to allow us to make certain technologies that allow our particular kind of universe to arise and sort of achieve the things it does."}, {"time": 8389, "text": "See, I wonder if nature in this kind of discussion, if nature is a catalyst for innovation or if it's a ceiling for innovation."}, {"time": 8397, "text": "So like, is it going to always limit us?"}, {"time": 8400, "text": "Like you're talking about silicon."}, {"time": 8404, "text": "Is it just make it super easy to do awesome stuff in a certain dimension, but we could still do awesome stuff in other ways, it'll just be harder?"}, {"time": 8411, "text": "Or does it really set like the maximum we can do?"}, {"time": 8415, "text": "That's a good thing to, that's a good subject to discuss."}, {"time": 8419, "text": "I guess I feel like we need to lay a little bit more groundwork."}, {"time": 8423, "text": "So I want to make sure that I introduce this in the context of Lee Smolin's previous idea."}, {"time": 8431, "text": "So who's Lee Smolin and what kind of ideas does he have?"}, {"time": 8435, "text": "Okay, Lee Smolin is a theoretical physicist who back in the late 1980s published a paper in the early 1990s introduced this idea of cosmological natural selection, which argues that the universe did evolve."}, {"time": 8451, "text": "So his paper was called, did the universe evolve?"}, {"time": 8454, "text": "And I gave myself the liberty of titling my paper does cosmological selection or does cosmological evolution select for technology in reference to that."}, {"time": 8465, "text": "So he introduced that idea decades ago."}, {"time": 8468, "text": "Now he primarily works on quantum gravity, loop quantum gravity, other approaches to unifying quantum mechanics with general relativity, as you can read about in his most recent book, I believe, and he's been on your show as well."}, {"time": 8484, "text": "So, but I want to introduce this idea of cosmological natural selection, because I think that is one of the core ideas that could change our understanding of how the universe got here, our role in it, what technology is doing here."}, {"time": 8499, "text": "But there's a couple more pieces that need to be set up first."}, {"time": 8502, "text": "So the beginning of our universe is largely accepted to be the big bang."}, {"time": 8507, "text": "And what that means is if you look back in time by looking far away in space, you see that everything used to be at one point and it expanded away from there."}, {"time": 8518, "text": "There was an era in the evolutionary process of our universe that was called inflation."}, {"time": 8525, "text": "And this idea was developed primarily by Alan Guth and others, Andre Linde and others in the 80s."}, {"time": 8533, "text": "And this idea of inflation is basically that when a singularity begins this process of growth, there can be a temporary stage where it just accelerates incredibly rapidly."}, {"time": 8550, "text": "And based on quantum field theory, this tells us that this should produce matter in precisely the proportions that we find of hydrogen and helium in the big bang, lithium too, lithium also, and other things too."}, {"time": 8564, "text": "So the predictions that come out of big bang inflationary cosmology have stood up extremely well to empirical verification, the cosmic microwave background, things like this."}, {"time": 8575, "text": "So most scientists working in the field think that the origin of our universe is the big bang."}, {"time": 8583, "text": "And I base all my thinking on that as well."}, {"time": 8588, "text": "I'm just laying this out there so that people understand that where I'm coming from is an extension, not a replacement of existing well founded ideas."}, {"time": 8599, "text": "In a paper, I believe it was 1986 with Alan Guth and another author Farhi, they wrote that a big bang, I don't remember the exact quote, a big bang is inextricably linked with a black hole."}, {"time": 8615, "text": "The singularity that we call our origin is mathematically indistinguishable from a black hole."}, {"time": 8624, "text": "And Lee Smolin based his thinking on that idea, I believe, I don't mean to speak for him, but this is my reading of it."}, {"time": 8632, "text": "So what Lee Smolin will say is that a black hole in one universe is a big bang in another universe."}, {"time": 8640, "text": "And this allows us to have progeny, offspring."}, {"time": 8644, "text": "So a universe can be said to have come before another universe."}, {"time": 8650, "text": "And very crucially, Smolin argues, I think this is potentially one of the great ideas of all time, that's my opinion, that when a black hole forms, it's not a classical entity, it's a quantum gravitational entity."}, {"time": 8664, "text": "So it is subject to the fluctuations that are inherent in quantum mechanics, the properties, what we're calling the parameters that describe the physics of that system are subject to slight mutations so that the offspring universe does not have the exact same parameters defining its physics as its parent universe."}, {"time": 8688, "text": "They're close, but they're a little bit different."}, {"time": 8690, "text": "And so now you have a mechanism for evolution, for natural selection."}, {"time": 8697, "text": "So there's mutation, so there's, and then if you think about the DNA of the universe are the basic parameters that govern its laws."}, {"time": 8705, "text": "Exactly, so what Smolin said is our universe results from an evolutionary process that can be traced back some, he estimated, 200 million generations."}, {"time": 8717, "text": "Initially, there was something like a vacuum fluctuation that produced through random chance a universe that was able to reproduce just one."}, {"time": 8727, "text": "So now it had one offspring."}, {"time": 8728, "text": "And then over time, it was able to make more and more until it evolved into a highly structured universe with a very long lifetime, with a great deal of complexity and importantly, especially importantly for Lee Smolin, stars, stars make black holes."}, {"time": 8747, "text": "Therefore, we should expect our universe to be optimized, have its physical parameters optimized to make very large numbers of stars because that's how you make black holes and black holes make offspring."}, {"time": 8759, "text": "So we expect the physics of our universe to have evolved to maximize fecundity, the number of offspring."}, {"time": 8766, "text": "And the way Lee Smolin argues you do that is through stars that the biggest ones die in these core collapse supernova that make a black hole and a child."}, {"time": 8775, "text": "Okay, first of all, I agree with you that this is back to our fractal view of everything from intelligence to our universe."}, {"time": 8787, "text": "That is very compelling and a very powerful idea that unites the origin of life and perhaps the origin of ideas and intelligence."}, {"time": 8799, "text": "So from a Dawkins perspective here on earth, the evolution of those and then the evolution of the laws of physics that led to us."}, {"time": 8811, "text": "I mean, it's beautiful."}, {"time": 8812, "text": "And then you stacking on top of that, that maybe we are one of the offspring."}, {"time": 8817, "text": "Right, okay, so before getting into where I'd like to take that idea, let me just a little bit more groundwork."}, {"time": 8825, "text": "There is this concept of the multiverse and it can be confusing."}, {"time": 8828, "text": "Different people use the word multiverse in different ways."}, {"time": 8831, "text": "In the multiverse that I think is relevant to picture when trying to grasp Lee Smolin's idea, essentially every vacuum fluctuation can be referred to as a universe."}, {"time": 8845, "text": "It occurs, it borrows energy from the vacuum for some finite amount of time and it evanesces back into the quantum vacuum."}, {"time": 8853, "text": "And ideas of Guth before that and Andrei Linde with eternal inflation aren't that different that you would expect nature due to the quantum properties of the vacuum, which we know exist, they're measurable through things like the Casimir effect and others."}, {"time": 8872, "text": "You know that there are these fluctuations that are occurring."}, {"time": 8875, "text": "What Smolin is arguing is that there is this extensive multiverse, that this universe, what we can measure and interact with is not unique in nature."}, {"time": 8887, "text": "It's just our residents, it's where we reside."}, {"time": 8890, "text": "And there are countless, potentially infinity other universes, other entire evolutionary trajectories that have evolved into things like what you were mentioning a second ago with different parameters and different ways of achieving complexity and reproduction and all that stuff."}, {"time": 8907, "text": "So it's not that the evolutionary process is a funnel towards this end point, not at all."}, {"time": 8914, "text": "Just like the biological evolutionary process that has occurred within our universe is not a unique route toward achieving one specific chosen kind of species."}, {"time": 8925, "text": "No, we have extraordinary diversity around us."}, {"time": 8929, "text": "That's what evolution does."}, {"time": 8930, "text": "And for any one species like us, you might feel like we're at the center of this process."}, {"time": 8934, "text": "We're the destination of this process, but we're just one of the many nearly infinite branches of this process."}, {"time": 8942, "text": "And I suspect it is exactly infinite."}, {"time": 8944, "text": "I mean, I just can't understand how with this idea, you can ever draw a boundary around it and say, no, the universe, I mean, the multiverse has 10 to the one quadrillion components, but not infinity."}, {"time": 8960, "text": "Well, yeah, I have cognitively incapable as I think all of us are and truly understanding the concept of infinity."}, {"time": 8969, "text": "And the concept of nothing as well."}, {"time": 8971, "text": "And nothing, but also the concept of a lot is pretty difficult."}, {"time": 8975, "text": "I can just, I can count."}, {"time": 8977, "text": "I run out of fingers at a certain point and then you're screwed."}, {"time": 8980, "text": "And when you're wearing shoes and you can't even get down to your toes, it's like."}, {"time": 8984, "text": "It's like, all right, a thousand fine, a million."}, {"time": 8987, "text": "Is that what?"}, {"time": 8988, "text": "And then it gets crazier and crazier."}, {"time": 8991, "text": "So this particular, so when we say technology, by the way, I mean, there's some, not to over romanticize the thing, but there is some aspect about this branch of ours that allows us to, for the universe to know itself."}, {"time": 9008, "text": "So to be, to have like little conscious cognitive fingers that are able to feel like to scratch the head."}, {"time": 9019, "text": "To be able to construct E equals MC squared and to introspect, to start to gain some understanding of the laws that govern it."}, {"time": 9027, "text": "Isn't that, isn't that kind of amazing?"}, {"time": 9032, "text": "Okay, I'm just human, but it feels like that, if I were to build a system that does this kind of thing, that evolves laws of physics, that evolves life, that evolves intelligence, that my goal would be to come up with things that are able to think about itself."}, {"time": 9048, "text": "Right, aren't we kind of close to the design specs, the destination?"}, {"time": 9054, "text": "We're pretty close, I don't know."}, {"time": 9056, "text": "I mean, I'm spending my career designing things that I hope will think about themselves, so you and I aren't too far apart on that one."}, {"time": 9062, "text": "But then maybe that problem is a lot harder than we imagine."}, {"time": 9066, "text": "Maybe we need to."}, {"time": 9067, "text": "Let's not get, let's not get too far because I want to emphasize something that, what you're saying is, isn't it fascinating that the universe evolved something that can be conscious, reflect on itself?"}, {"time": 9079, "text": "But Lee Smolin's idea didn't take us there, remember?"}, {"time": 9083, "text": "It took us to stars."}, {"time": 9085, "text": "Lee Smolin has argued, I think, right on almost every single way that cosmological natural selection could lead to a universe with rich structure."}, {"time": 9098, "text": "And he argued that the structure, the physics of our universe is designed to make a lot of stars so that they can make black holes."}, {"time": 9106, "text": "But that doesn't explain what we're doing here."}, {"time": 9108, "text": "In order for that to be an explanation of us, what you have to assume is that once you made that universe that was capable of producing stars, life, planets, all these other things, we're along for the ride."}, {"time": 9121, "text": "They got lucky."}, {"time": 9122, "text": "We're kind of arising, growing up in the cracks, but the universe isn't here for us."}, {"time": 9126, "text": "We're still kind of a fluke in that picture."}, {"time": 9129, "text": "And I can't, I don't necessarily have like a philosophical opposition to that stance."}, {"time": 9134, "text": "It's just not, okay, so I don't think it's complete."}, {"time": 9140, "text": "So it seems like whatever we got going on here to you, it seems like whatever we have here on earth seems like a thing you might want to select for in this whole big process."}, {"time": 9150, "text": "So if what you are truly, if your entire evolutionary process only cares about fecundity, it only cares about making offspring universes because then there's gonna be the most of them in that local region of hyperspace, which is the set of all possible universes, let's say."}, {"time": 9170, "text": "You don't care how those universes are made."}, {"time": 9172, "text": "You know they have to be made by black holes."}, {"time": 9174, "text": "This is what inflationary theory tells us."}, {"time": 9177, "text": "The big bang tells us that black holes make universes."}, {"time": 9182, "text": "But what if there was a technological means to make universes?"}, {"time": 9185, "text": "Stars require a ton of matter because they're not thinking very carefully about how you make a black hole."}, {"time": 9192, "text": "They're just using gravity, you know?"}, {"time": 9196, "text": "But if we devise technologies that can efficiently compress matter into a singularity, it turns out that if you can compress about 10 kilograms into a very small volume, that will make a black hole that is likely highly probable to inflate into its own offspring universe."}, {"time": 9214, "text": "This is according to calculations done by other people who are professional quantum theorists, quantum field theorists, and I hope I am grasping what they're telling me correctly."}, {"time": 9224, "text": "I am somewhat of a translator here."}, {"time": 9272, "text": "Yeah, more efficiently, more faster and better and more different."}, {"time": 9276, "text": "Then you start to have different kind of mechanisms and mutation perhaps, all that kind of stuff."}, {"time": 9280, "text": "And so if you do a simple calculation that says, all right, if I want to, we know roughly how many core collapse supernovae have resulted in black holes in our galaxy since the beginning of the universe and it's something like a billion."}, {"time": 9297, "text": "So then you would have to estimate that it would be possible for a technological civilization to produce more than a billion black holes with the energy and matter at their disposal."}, {"time": 9343, "text": "That's one asteroid."}, {"time": 9344, "text": "So now if you envision an intelligent species that would potentially have been devised initially by humans, but then based on superconducting optoelectronic networks, no doubt, and they go out and populate, they don't have to fill the galaxy."}, {"time": 9358, "text": "They just have to get out to the asteroid belt."}, {"time": 9361, "text": "They could potentially dramatically outpace the rate at which stars are producing offspring universes."}, {"time": 9367, "text": "And then wouldn't you expect that that's where we came from instead of a star?"}, {"time": 9373, "text": "Yeah, so you have to somehow become masters of gravity, so like, or generate."}, {"time": 9377, "text": "John, this is really gravity."}, {"time": 9378, "text": "So stars make black holes with gravity, but any force that can make the energy density can compactify matter to produce a great enough energy density can form a singularity."}, {"time": 9391, "text": "It doesn't, it would not likely be gravity."}, {"time": 9393, "text": "It's the weakest force."}, {"time": 9394, "text": "You're more likely to use something like the technologies that we're developing for fusion, for example."}, {"time": 9400, "text": "So I don't know, the Large Ignition Facility recently blasted a pellet with 100 really bright lasers and caused that to get dense enough to engage in nuclear fusion."}, {"time": 9415, "text": "So something more like that, or a tokamak with a really hot plasma, I'm not sure."}, {"time": 9419, "text": "Something, I don't know exactly how it would be done."}, {"time": 9422, "text": "I do like the idea of that, especially just been reading a lot about gravitational waves and the fact that us humans with our technological capabilities, one of the most impressive technological accomplishments of human history is LIGO, being able to precisely detect gravitational waves."}, {"time": 9440, "text": "I'm particularly find appealing the idea that other alien civilizations from very far distances communicate with gravity, with gravitational waves, because as you become greater and greater master of gravity, which seems way out of reach for us right now, maybe that seems like a effective way of sending signals, especially if your job is to manufacture black holes."}, {"time": 9469, "text": "So that, so let me ask there, whatever, I mean, broadly thinking, because we tend to think other alien civilizations would be very human like, but if we think of alien civilizations out there as basically generators of black holes, however they do it, because they got stars, do you think there's a lot of them in our particular universe out there?"}, {"time": 9497, "text": "In our universe?"}, {"time": 9500, "text": "Well, okay, let me ask, okay, this is great."}, {"time": 9503, "text": "Let me ask a very generic question and then let's see how you answer it, which is how many alien civilizations are out there?"}, {"time": 9515, "text": "If the hypothesis that I just described is on the right track, it would mean that the parameters of our universe have been selected so that intelligent civilizations will occur in sufficient numbers so that if they reach something like supreme technological maturity, let's define that as the ability to produce black holes, then that's not a highly improbable event."}, {"time": 9542, "text": "It doesn't need to happen often because as I just described, if you get one of them in a galaxy, you're gonna make more black holes than the stars in that galaxy."}, {"time": 9552, "text": "But there's also not a super strong motivation, well, it's not obvious that you need them to be ubiquitous throughout the galaxy."}, {"time": 9564, "text": "One of the things that I try to emphasize in that paper is that given this idea of how our parameters might've been selected, it's clear that it's a series of trade offs, right?"}, {"time": 9579, "text": "If you make, I mean, in order for intelligent life of our variety or anything resembling us to occur, you need a bunch of stuff, you need stars."}, {"time": 9587, "text": "So that's right back to Smolin's roots of this idea, but you also need water to have certain properties."}, {"time": 9622, "text": "You have to compromise on all these things."}, {"time": 9649, "text": "So we can test how much these things are in a tug of war with each other, and the prediction would be that we kind of sit at this central point where if you move the parameters too much, stars aren't stable, or life doesn't form, or technology's infeasible, because life alone, at least the kind of life that we know of, cannot make black holes."}, {"time": 9674, "text": "We don't have this, well, I'm speaking for myself, you're a very fit and strong person, but it might be possible for you, but not for me to compress matter."}, {"time": 9682, "text": "So we need these technologies, but we don't know, we have not been able to quantify yet how finely adjusted the parameters would need to be in order for silicon to have the properties it does."}, {"time": 9695, "text": "Okay, this is not directly speaking to what you're saying, you're getting to the Fermi paradox, which is where are they, where are the life forms out there, how numerous are they, that sort of thing."}, {"time": 9704, "text": "What I'm trying to argue is that if this framework is on the right track, a potentially correct explanation for our existence, we, it doesn't necessarily predict that intelligent civilizations are just everywhere, because even if you just get one of them in a galaxy, which is quite rare, it could be enough to dramatically increase the fecundity of the universe as a whole."}, {"time": 9730, "text": "Yeah, and I wonder, once you start generating the offspring for universes, black holes, how that has effect on the, what kind of effect does it have on the other candidate's civilizations within that universe?"}, {"time": 9746, "text": "Maybe it has a destructive aspect, or there could be some arguments about once you have a lot of offspring, that that just quickly accelerates to where the other ones can't even catch up."}, {"time": 9755, "text": "It could, but I guess if you want me to put my chips on the table or whatever, I think I come down more on the side that intelligent life civilizations are rare."}, {"time": 9772, "text": "And I guess I follow Max Tegmark here."}, {"time": 9777, "text": "And also there's a lot of papers coming out recently in the field of astrobiology that are seeming to say, all right, you just work through the numbers on some modified Drake equation or something like that."}, {"time": 9789, "text": "And it looks like it's not improbable."}, {"time": 9793, "text": "You shouldn't be surprised that an intelligent species has arisen in our galaxy, but if you think there's one the next solar system over, it's highly improbable."}, {"time": 9801, "text": "So I can see that the number, the probability of finding a civilization in a galaxy, maybe it's most likely that you're gonna find one to a hundred or something."}, {"time": 9845, "text": "But it's also, I think, a little bit naive to think that they're going to coincide in time and we'll be able to observe them."}, {"time": 9854, "text": "And also, if you look at the span of life on Earth, the Earth history, it was surprising to me to kind of look at the amount of time, first of all, the short amount of time, there's no life, it's surprising."}, {"time": 9871, "text": "Life sprang up pretty quickly."}, {"time": 9873, "text": "It's single cell."}, {"time": 9875, "text": "But that's the point I'm trying to make is like so much of life on Earth was just like single cell organisms, like most of it."}, {"time": 9885, "text": "Most of it was like boring bacteria type of stuff."}, {"time": 9888, "text": "Well, bacteria are fascinating, but I take your point."}, {"time": 9890, "text": "No, I get it."}, {"time": 9891, "text": "I mean, no offense to them."}, {"time": 9892, "text": "But this kind of speaking from the perspective of your paper of something that's able to generate technology as we kind of understand it, that's a very short moment in time relative to that full history of life on Earth."}, {"time": 9908, "text": "And maybe our universe is just saturated with bacteria like humans."}, {"time": 9917, "text": "But not the special extra AGI super humans, that those are very rare."}, {"time": 9925, "text": "And once those spring up, everything just goes to like, it accelerates very quickly."}, {"time": 9933, "text": "Yeah, we just don't have enough data to really say, but I find this whole subject extremely engaging."}, {"time": 9940, "text": "I mean, there's this concept, I think it's called the Rare Earth Hypothesis, which is that basically stating that, okay, microbes were here right away after the Hadian era where we were being bombarded."}, {"time": 9952, "text": "Well, after, yeah, bombarded by comets, asteroids, things like that, and also after the moon formed."}, {"time": 9957, "text": "So once things settled down a little bit, in a few hundred million years, you have microbes everywhere."}, {"time": 9963, "text": "And it could have been, we don't know exactly when it could have been remarkably brief that that took."}, {"time": 9968, "text": "So it does indicate that, okay, life forms relatively easily."}, {"time": 9972, "text": "I think that alone is sort of a checker on the scale for the argument that the parameters that allow even microbial life to form are not just a fluke."}, {"time": 9984, "text": "But anyway, that aside, yes, then there was this long dormant period, not dormant, things were happening, but important things were happening for some two and a half billion years or something after the metabolic process that releases oxygen was developed."}, {"time": 10002, "text": "Then basically the planet's just sitting there, getting more and more oxygenated, more and more oxygenated until it's enough that you can build these large, complex organisms."}, {"time": 10014, "text": "And so the Rare Earth Hypothesis would argue that the microbes are common everywhere in any planet that's roughly in the habitable zone and has some water on it, it's probably gonna have those."}, {"time": 10026, "text": "But then getting to this Cambrian explosion that happened some between 500 and 600 million years ago, that's rare, you know?"}, {"time": 10036, "text": "And I buy that, I think that is rare."}, {"time": 10039, "text": "So if you say how much life is in our galaxy, I think that's probably the right answer is that microbes are everywhere."}, {"time": 10046, "text": "Cambrian explosion is extremely rare."}, {"time": 10049, "text": "And then, but the Cambrian explosion kind of went like that where within a couple of tens or a hundred million years, all of these body plans came into existence."}, {"time": 10060, "text": "And basically all of the body plans that are now in existence on the planet were formed in that brief window and we've just been shuffling around since then."}, {"time": 10071, "text": "So then what caused humans to pop out of that?"}, {"time": 10074, "text": "I mean, that could be another extremely rare threshold that a planet roughly in the habitable zone with water is not guaranteed to cross, you know?"}, {"time": 10088, "text": "To me, it's fascinating for being humble, like the humans cannot possibly be the most amazing thing that such, if you look at the entirety of the system that Lee Smolin and you paint, that cannot possibly be the most amazing thing that process generates."}, {"time": 10101, "text": "So like, if you look at the evolution, what's the equivalent in the cosmological evolution and its selection for technology, the equivalent of the human eye or the human brain?"}, {"time": 10112, "text": "Universes that are able to do some like, they don't need the damn stars."}, {"time": 10117, "text": "They're able to just do some incredible generation of complexity fast, like much more than, if you think about it, it's like most of our universe is pretty freaking boring."}, {"time": 10130, "text": "There's not much going on, there's a few rocks flying around and there's some like apes that are just like doing podcasts on some weird planet."}, {"time": 10140, "text": "It just seems very inefficient."}, {"time": 10142, "text": "If you think about like the amazing thing in the human eye, the visual cortex can do, the brain, the nervous, everything that makes us more powerful than single cell organisms."}, {"time": 10155, "text": "Like if there's an equivalent of that for universes, like the richness of physics that could be expressed through a particular set of parameters."}, {"time": 10166, "text": "Like, I mean, like for me, I'm a sort of from a computer science perspective, huge fan of cellular automata, which is a nice sort of pretty visual way to illustrate how different laws can result in drastically different levels of complexity."}, {"time": 10186, "text": "So like, it's like, yeah, okay."}, {"time": 10189, "text": "So we're all like celebrating, look, our little cellular automata is able to generate pretty triangles and squares and therefore we achieve general intelligence."}, {"time": 10197, "text": "And then there'll be like some badass Chuck Norris type, like universal Turing machine type of cellular automata."}, {"time": 10206, "text": "They're able to generate other cellular automata that does any arbitrary level of computation off the bat."}, {"time": 10214, "text": "Like those have to then exist."}, {"time": 10216, "text": "And then we're just like, we'll be forgotten."}, {"time": 10219, "text": "This story, this podcast just entertains a few other apes for a few months."}, {"time": 10226, "text": "Well, I'm kind of surprised to hear your cynicism."}, {"time": 10230, "text": "No, I'm very up."}, {"time": 10232, "text": "I usually think of you as like one who celebrates humanity and all its forms and things like that."}, {"time": 10237, "text": "And I guess I just, I don't, I see it the way you just described."}, {"time": 10241, "text": "I mean, okay, we've been here for 13.7 billion years and you're saying, gosh, that's a long time."}, {"time": 10247, "text": "Let's get on with the show already."}, {"time": 10248, "text": "Some other universe could have kicked our butt by now, but that's putting a characteristic time."}, {"time": 10255, "text": "I mean, why is 13.7 billion a long time?"}, {"time": 10258, "text": "I mean, compared to what?"}, {"time": 10260, "text": "I guess, so when I look at our universe, I see this extraordinary hierarchy that has developed over that time."}, {"time": 10268, "text": "So at the beginning, it was a chaotic mess of some plasma and nothing interesting going on there."}, {"time": 10276, "text": "And even for the first stars to form, that a lot of really interesting evolutionary processes had to occur, by evolutionary in that sense, I just mean taking place over extended periods of time and structures are forming then."}, {"time": 10292, "text": "And then it took that first generation of stars in order to produce the metals that then can more efficiently produce another generation of stars."}, {"time": 10302, "text": "We're only the third generation of stars."}, {"time": 10304, "text": "So we might still be pretty quick to the game here."}]}]