[{"title": "Elon Musk: Neuralink, AI, Autopilot, and the Pale Blue Dot | Lex Fridman Podcast #49", "id": "smK9dgdTl40", "quotes": [{"time": 404, "text": "What do you think is most promising, most interesting, as a civilization that we should invest in?"}, {"time": 414, "text": "I think there's a lot of tremendous amount of investment going on in AI, where there's a lack of investment is in AI safety."}, {"time": 457, "text": "I would argue that AI is unequivocally something that has potential to be dangerous to the public, and therefore should have a regulatory agency just as other things that are dangerous to the public have a regulatory agency."}, {"time": 468, "text": "But let me tell you, the problem with this is that the government moves very slowly."}, {"time": 474, "text": "And the rate of the rate, the usually way a regulatory agency comes into being is that something terrible happens."}, {"time": 481, "text": "There's a huge public outcry."}, {"time": 481, "text": "And years after that, there's a regulatory agency or a rule put in place, take something like, like seatbelts, it was known for a decade or more that seatbelts would have a massive impact on safety and save so many lives in serious injuries."}, {"time": 505, "text": "And the car industry fought the requirement to put seatbelts in tooth and nail."}, {"time": 512, "text": "And hundreds of 1000s of people probably died because of that."}, {"time": 521, "text": "And they said people wouldn't buy cars if they had seatbelts, which is obviously absurd."}, {"time": 525, "text": "Yeah, or look at the tobacco industry and how long they fought any thing about smoking."}, {"time": 525, "text": "That's part of why I helped make that movie."}, {"time": 531, "text": "Thank you for smoking."}, {"time": 531, "text": "You can sort of see just how pernicious it can be when you have these companies effectively achieve regulatory capture of government."}, {"time": 538, "text": "The bad people in the community refer to the advent of digital super intelligence as a singularity."}, {"time": 557, "text": "That is not to say that it is good or bad, but that it is very difficult to predict what will happen after that point."}, {"time": 563, "text": "And then there's some probability it will be bad, some probably it'll be it will be good."}, {"time": 568, "text": "We obviously want to affect that probability and have it be more good than bad."}, {"time": 575, "text": "Well, let me on the merger with AI question and the incredible work that's being done at Neuralink."}, {"time": 580, "text": "There's a lot of fascinating innovation here across different disciplines going on."}, {"time": 580, "text": "So the flexible wires, the robotic sewing machine, that responsive brain movement, everything around ensuring safety and so on."}, {"time": 592, "text": "So we currently understand very little about the human brain."}, {"time": 592, "text": "Do you also hope that the work at Neuralink will help us understand more about our about our human brain?"}, {"time": 607, "text": "Yeah, I think the work in Neuralink will definitely shed a lot of insight into how the brain, the mind works."}, {"time": 613, "text": "Right now, just the data we have regarding how the brain works is very limited."}, {"time": 613, "text": "You know, we've got fMRI, which is that that's kind of like putting us, you know, stethoscope on the outside of a factory wall and then putting it like all over the factory wall and you can sort of hear the sounds, but you don't know what the machines are doing, really."}, {"time": 633, "text": "You can infer a few things, but it's very broad brushstroke."}, {"time": 638, "text": "In order to really know what's going on in the brain, you really need you have to have high precision sensors."}, {"time": 643, "text": "And then you want to have stimulus and response."}, {"time": 647, "text": "Like if you trigger a neuron, what, how do you feel?"}, {"time": 647, "text": "What do you see?"}, {"time": 647, "text": "How does it change your perception of the world?"}, {"time": 653, "text": "You're speaking to physically just getting close to the brain, being able to measure signals, how do you know what's going on in the brain?"}, {"time": 660, "text": "Physically, just getting close to the brain, being able to measure signals from the brain will give us sort of open the door inside the factory."}, {"time": 668, "text": "Being able to have high precision sensors that tell you what individual neurons are doing."}, {"time": 675, "text": "And then being able to trigger a neuron and see what the response is in the brain."}, {"time": 682, "text": "So you can see the consequences of if you fire this neuron, what happens?"}, {"time": 682, "text": "How do you feel?"}, {"time": 682, "text": "What does it change?"}, {"time": 688, "text": "It'll be really profound to have this in people because people can articulate their change."}, {"time": 695, "text": "Like if there's a change in mood, or if they can tell you if they can see better, or hear better, or be able to form sentences better or worse, or their memories are jogged, or that kind of thing."}, {"time": 711, "text": "So on the human side, there's this incredible general malleability, plasticity of the human brain, the human brain adapts, adjusts, and so on."}, {"time": 721, "text": "So that's not that plastic, to be totally frank."}, {"time": 723, "text": "So there's a firm structure, but nevertheless, there's some plasticity."}, {"time": 723, "text": "And the open question is, sort of, if I could ask a broad question is how much that plasticity can be utilized."}, {"time": 729, "text": "Sort of, on the human side, there's some plasticity in the human brain."}, {"time": 735, "text": "And on the machine side, we have neural networks, machine learning, artificial intelligence, it's able to adjust and figure out signals."}, {"time": 746, "text": "So there's a mysterious language that we don't perfectly understand that's within the human brain."}, {"time": 751, "text": "And then we're trying to understand that language to communicate both directions."}, {"time": 757, "text": "So the brain is adjusting a little bit, we don't know how much, and the machine is adjusting."}, {"time": 762, "text": "Where do you see, as they try to sort of reach together, almost like with an alien species, try to find a protocol, communication protocol that works?"}, {"time": 768, "text": "Where do you see the biggest, the biggest benefit arriving from on the machine side or the human side?"}, {"time": 773, "text": "Do you see both of them working together?"}, {"time": 779, "text": "I think the machine side is far more malleable than the biological side, by a huge amount."}, {"time": 783, "text": "So it'll be the machine that adapts to the brain."}, {"time": 783, "text": "That's the only thing that's possible."}, {"time": 792, "text": "The brain can't adapt that well to the machine."}, {"time": 792, "text": "You can't have neurons start to regard an electrode as another neuron, because neurons just, there's like the pulse."}, {"time": 799, "text": "And so something else is pulsing."}, {"time": 804, "text": "So there is that elasticity in the interface, which we believe is something that can happen."}, {"time": 812, "text": "But the vast majority of the malleability will have to be on the machine side."}, {"time": 817, "text": "But it's interesting, when you look at that synaptic plasticity at the interface side, there might be like an emergent plasticity."}, {"time": 823, "text": "Because it's a whole nother, it's not like in the brain, it's a whole nother extension of the brain."}, {"time": 828, "text": "You know, we might have to redefine what it means to be malleable for the brain."}, {"time": 833, "text": "So maybe the brain is able to adjust to external interfaces."}, {"time": 833, "text": "There will be some adjustments to the brain, because there's going to be something reading and simulating the brain."}, {"time": 843, "text": "And so it will adjust to that thing."}, {"time": 843, "text": "But most, the vast majority of the adjustment will be on the machine side."}, {"time": 852, "text": "This is just, this is just, it has to be that otherwise it will not work."}, {"time": 858, "text": "Ultimately, like, we currently operate on two layers, we have sort of a limbic, like prime primitive brain layer, which is where all of our kind of impulses are coming from."}, {"time": 863, "text": "It's sort of like we've got, we've got like a monkey brain with a computer stuck on it."}, {"time": 869, "text": "That's that's the human brain."}, {"time": 874, "text": "And a lot of our impulses and everything are driven by the monkey brain."}, {"time": 879, "text": "And the computer, the cortex is constantly trying to make the monkey brain happy."}, {"time": 884, "text": "It's not the cortex that's steering the monkey brains, the monkey brain steering the cortex."}, {"time": 891, "text": "You know, the cortex is the part that tells the story of the whole thing."}, {"time": 891, "text": "So we convince ourselves it's, it's more interesting than just the monkey brain."}, {"time": 896, "text": "The cortex is like what we call like human intelligence."}, {"time": 901, "text": "You know, it's just like, that's like the advanced computer relative to other creatures."}, {"time": 905, "text": "The other creatures do not have either."}, {"time": 905, "text": "Really, they don't, they don't have the computer, or they have a very weak computer relative to humans."}, {"time": 911, "text": "But it's, it's like, it sort of seems like surely the really smart thing should control the dumb thing."}, {"time": 919, "text": "But actually, the dumb thing controls the smart thing."}, {"time": 924, "text": "So do you think some of the same kind of machine learning methods, whether that's natural language processing applications are going to be applied for the communication between the machine and the brain to learn how to do certain things like movement of the body, how to process visual stimuli, and so on."}, {"time": 943, "text": "Do you see the value of using machine learning to understand the language of the two way communication with the brain?"}, {"time": 955, "text": "I mean, we're neural net."}, {"time": 955, "text": "And that, you know, AI is basically neural net."}, {"time": 962, "text": "So it's like digital neural net will interface with biological neural net."}, {"time": 968, "text": "And hopefully bring us along for the ride."}, {"time": 968, "text": "But the vast majority of our intelligence will be digital."}, {"time": 974, "text": "Like, so like, think of like, the difference in intelligence between your cortex and your limbic system is gigantic, your limbic system really has no comprehension of what the hell the cortex is doing."}, {"time": 989, "text": "It's just literally hungry, you know, or tired or angry or sexy or something, you know, that's just and then that communicates that that impulse to the cortex and tells the cortex to go satisfy that then love a great deal of like, a massive amount of thinking, like truly stupendous amount of thinking has gone into sex without purpose, without procreation, without procreation."}, {"time": 1020, "text": "Which is actually quite a silly action in the absence of procreation."}, {"time": 1020, "text": "It's a bit silly."}, {"time": 1031, "text": "Why are you doing it?"}, {"time": 1031, "text": "Because it makes the limbic system happy."}, {"time": 1037, "text": "But it's pretty absurd, really."}, {"time": 1037, "text": "Well, the whole of existence is pretty absurd in some kind of sense."}, {"time": 1044, "text": "But I mean, this is a lot of computation has gone into how can I do more of that with procreation not even being a factor?"}, {"time": 1052, "text": "This is, I think, a very important area of research by NSFW."}, {"time": 1060, "text": "An agency that should receive a lot of funding, especially after this conversation."}, {"time": 1064, "text": "I propose the formation of a new agency."}, {"time": 1068, "text": "What is the most exciting or some of the most exciting things that you see in the future impact of Neuralink, both in the science, the engineering and societal broad impact?"}, {"time": 1079, "text": "Neuralink, I think, at first will solve a lot of brain related diseases."}, {"time": 1079, "text": "So it could be anything from like autism, schizophrenia, memory loss, like everyone experiences memory loss at certain points in age."}, {"time": 1091, "text": "Parents can't remember their kids names and that kind of thing."}, {"time": 1099, "text": "So there's a tremendous amount of good that Neuralink can do in solving critical damage to the brain or the spinal cord."}, {"time": 1114, "text": "There's a lot that can be done to improve quality of life of individuals."}, {"time": 1114, "text": "And those will be steps to address the existential risk associated with digital superintelligence."}, {"time": 1120, "text": "Like we will not be able to be smarter than a digital supercomputer."}, {"time": 1128, "text": "So therefore, if you cannot beat them, join them."}, {"time": 1138, "text": "And at least we won't have that option."}, {"time": 1141, "text": "So you have hope that Neuralink will be able to be a kind of connection to allow us to merge, the wave of the improving AI systems."}, {"time": 1149, "text": "I think the chance is above zero percent."}, {"time": 1155, "text": "So it's non zero."}, {"time": 1155, "text": "There's a chance."}, {"time": 1155, "text": "And that's what I've seen."}, {"time": 1155, "text": "Dumb and Dumber."}, {"time": 1161, "text": "So I'm saying there's a chance."}, {"time": 1161, "text": "He's saying one in a billion or one in a million, whatever it was, a dumb and dumber."}, {"time": 1166, "text": "You know, it went from maybe one in a million to improving."}, {"time": 1171, "text": "Maybe it'll be one in a thousand and then one in a hundred, then one in ten."}, {"time": 1171, "text": "Depends on the rate of improvement of Neuralink and how fast we're able to do make progress."}, {"time": 1181, "text": "Well, I've talked to a few folks here that are quite brilliant engineers, so I'm excited."}, {"time": 1185, "text": "Yeah, I think it's like fundamentally good, you know, giving somebody back full motor control after they've had a spinal cord injury."}, {"time": 1193, "text": "You know, restoring brain functionality after a stroke, solving debilitating genetically oriented brain diseases."}, {"time": 1197, "text": "These are all incredibly great, I think."}, {"time": 1202, "text": "And in order to do these, you have to be able to interface with neurons at a detailed level and you need to be able to fire the right neurons, read the right neurons, and and then effectively you can create a circuit, replace what's broken with with silicon and essentially fill in the missing functionality."}, {"time": 1219, "text": "And then over time, we can develop a tertiary layer."}, {"time": 1226, "text": "So if like the limbic system is the primary layer, then the cortex is like the second layer."}, {"time": 1231, "text": "And as I said, obviously the cortex is vastly more intelligent than the limbic system, but people generally like the fact that they have a limbic system and a cortex."}, {"time": 1240, "text": "I haven't met anyone who wants to delete either one of them."}, {"time": 1240, "text": "They're like, okay, I'll keep them both."}, {"time": 1244, "text": "The limbic system is kind of fun."}, {"time": 1247, "text": "That's where the fun is, absolutely."}, {"time": 1247, "text": "And then people generally don't want to lose their cortex either."}, {"time": 1253, "text": "They're like having the cortex and the limbic system."}, {"time": 1253, "text": "And then there's a tertiary layer, which will be digital superintelligence."}, {"time": 1259, "text": "And I think there's room for optimism given that the cortex, the cortex is very intelligent and limbic system is not, and yet they work together well."}, {"time": 1271, "text": "Perhaps there can be a tertiary layer where digital superintelligence lies, and that will be vastly more intelligent than the cortex, but still coexist peacefully and in a benign manner with the cortex and limbic system."}, {"time": 1284, "text": "That's a super exciting future, both in low level engineering that I saw as being done here and the actual possibility in the next few decades."}, {"time": 1290, "text": "It's important that Neuralink solve this problem sooner rather than later, because the point at which we have digital superintelligence, that's when we pass the singularity and things become just very uncertain."}, {"time": 1305, "text": "It doesn't mean that they're necessarily bad or good."}, {"time": 1305, "text": "For the point at which we pass singularity, things become extremely unstable."}, {"time": 1308, "text": "So we want to have a human brain interface before the singularity, or at least not long after it, to minimize existential risk for humanity and consciousness as we know it."}, {"time": 1321, "text": "So there's a lot of fascinating actual engineering, low level problems here at Neuralink that are quite exciting."}, {"time": 1327, "text": "The problems that we face in Neuralink are material science, electrical engineering, software, mechanical engineering, microfabrication."}, {"time": 1335, "text": "It's a bunch of engineering disciplines, essentially."}, {"time": 1342, "text": "That's what it comes down to, is you have to have a tiny electrode, so small it doesn't hurt neurons, but it's got to last for as long as a person."}, {"time": 1346, "text": "So it's going to last for decades."}, {"time": 1355, "text": "And then you've got to take that signal, you've got to process that signal locally at low power."}, {"time": 1360, "text": "So we need a lot of chip design engineers, because we're going to do signal processing, and do so in a very power efficient way, so that we don't heat your brain up, because the brain is very heat sensitive."}, {"time": 1376, "text": "And then we've got to take those signals and we're going to do something with them."}, {"time": 1381, "text": "And then we've got to stimulate the back to bidirectional communication."}, {"time": 1390, "text": "So somebody's good at material science, software, and we've got to do a lot of that."}, {"time": 1395, "text": "So somebody's good at material science, software, mechanical engineering, electrical engineering, chip design, microfabrication."}, {"time": 1400, "text": "Those are the things we need to work on."}, {"time": 1407, "text": "We need to be good at material science, so that we can have tiny electrodes that last a long time."}, {"time": 1412, "text": "And it's a tough thing with the material science problem, it's a tough one, because you're trying to read and simulate electrically in an electrically active area."}, {"time": 1415, "text": "Your brain is very electrically active and electrochemically active."}, {"time": 1423, "text": "So how do you have a coating on the electrode that doesn't dissolve over time and is safe in the brain?"}, {"time": 1429, "text": "This is a very hard problem."}, {"time": 1439, "text": "And then how do you collect those signals in a way that is most efficient?"}, {"time": 1439, "text": "Because you really just have very tiny amounts of power to process those signals."}, {"time": 1446, "text": "And then we need to automate the whole thing so it's like LASIK."}, {"time": 1452, "text": "If this is done by neurosurgeons, there's no way it can scale to a large number of people."}, {"time": 1460, "text": "And it needs to scale to a large number of people, because I think ultimately we want the future to be determined by a large number of humans."}, {"time": 1464, "text": "Do you think that this has a chance to revolutionize surgery period?"}, {"time": 1472, "text": "So neurosurgery and surgery all across?"}, {"time": 1479, "text": "It's got to be like LASIK."}, {"time": 1479, "text": "If LASIK had to be done by hand by a person, that wouldn't be great."}, {"time": 1485, "text": "It's done by a robot."}, {"time": 1485, "text": "And the ophthalmologist kind of just needs to make sure your head's in the right position, and then they just press a button and go."}, {"time": 1500, "text": "SmartSummon and soon Autopark takes on the full beautiful mess of parking lots and their human to human nonverbal communication."}, {"time": 1505, "text": "I think it has actually the potential to have a profound impact in changing how our civilization looks at AI and robotics, because this is the first time human beings, people that don't own a Tesla may have never seen a Tesla or heard about a Tesla, get to watch hundreds of thousands of cars without a driver."}, {"time": 1524, "text": "Do you see it this way, almost like an education tool for the world about AI?"}, {"time": 1530, "text": "Do you feel the burden of that, the excitement of that, or do you just think it's a smart parking feature?"}, {"time": 1536, "text": "I do think you are getting at something important, which is most people have never really seen a robot."}, {"time": 1542, "text": "And what is the car that is autonomous?"}, {"time": 1547, "text": "It's a four wheeled robot."}, {"time": 1547, "text": "Yeah, it communicates a certain sort of message with everything from safety to the possibility of what AI could bring to its current limitations, its current challenges, it's what's possible."}, {"time": 1559, "text": "Do you feel the burden of that almost like a communicator educator to the world about AI?"}, {"time": 1564, "text": "We were just really trying to make people's lives easier with autonomy."}, {"time": 1569, "text": "But now that you mentioned it, I think it will be an eye opener to people about robotics, because they've really never seen most people never seen a robot."}, {"time": 1575, "text": "And there are hundreds of thousands of Tesla's won't be long before there's a million of them that have autonomous capability, and the drive without a person in it."}, {"time": 1585, "text": "And you can see the kind of evolution of the car's personality and, and thinking with each iteration of autopilot, you can see it's, it's uncertain about this, or it gets it, but now it's more certain."}, {"time": 1600, "text": "Now it's moving in a slightly different way."}, {"time": 1607, "text": "Like, I can tell immediately if a car is on Tesla autopilot, because it's got just little nuances of movement, it just moves in a slightly different way."}, {"time": 1618, "text": "Cars on Tesla autopilot, for example, on the highway are far more precise about being in the center of the lane than a person."}, {"time": 1622, "text": "If you drive down the highway and look at how at where cars are, the human driven cars are within their lane, they're like bumper cars."}, {"time": 1628, "text": "They're like moving all over the place."}, {"time": 1633, "text": "The car in autopilot, dead center."}, {"time": 1633, "text": "Yeah, so the incredible work that's going into that neural network, it's learning fast."}, {"time": 1640, "text": "Autonomy is still very, very hard."}, {"time": 1640, "text": "We don't actually know how hard it is fully, of course."}, {"time": 1647, "text": "You look at the most problems you tackle, this one included, with an exponential lens, but even with an exponential improvement, things can take longer than expected sometimes."}, {"time": 1659, "text": "So where does Tesla currently stand on its quest for full autonomy?"}, {"time": 1667, "text": "When can we see successful deployment of full autonomy?"}, {"time": 1675, "text": "Well, on the highway already, the the probability of intervention is extremely low."}, {"time": 1680, "text": "So for highway autonomy, with the latest release, especially the probability of needing to intervene is really quite low."}, {"time": 1688, "text": "In fact, I'd say for stop and go traffic, it's far safer than a person right now."}, {"time": 1693, "text": "The probability of an injury or impact is much, much lower for autopilot than a person."}, {"time": 1698, "text": "And then with navigating autopilot, you can change lanes, take highway interchanges, and then we're coming at it from the other direction, which is low speed, full autonomy."}, {"time": 1710, "text": "And in a way, this is like, how does a person learn to drive?"}, {"time": 1710, "text": "You learn to drive in the parking lot."}, {"time": 1715, "text": "You know, the first time you learn to drive probably wasn't jumping on August Street in San Francisco."}, {"time": 1720, "text": "That'd be crazy."}, {"time": 1720, "text": "You learn to drive in the parking lot, get things get things right at low speed."}, {"time": 1725, "text": "And then the missing piece that we're working on is traffic lights and stop streets."}, {"time": 1732, "text": "Stop streets, I would say actually also relatively easy, because, you know, you kind of know where the stop street is, worst case in geocoders, and then use visualization to see where the line is and stop at the line to eliminate the GPS error."}, {"time": 1744, "text": "So actually, I'd say it's probably complex traffic lights and very windy roads are the two things that need to get solved."}, {"time": 1759, "text": "What's harder, perception or control for these problems?"}, {"time": 1759, "text": "So being able to perfectly perceive everything, or figuring out a plan once you perceive everything, how to interact with all the agents in the environment in your sense, from a learning perspective, is perception or action harder?"}, {"time": 1775, "text": "And that giant, beautiful multitask learning neural network, the hottest thing is having accurate representation of the physical objects in vector space."}, {"time": 1782, "text": "So transfer taking the visual input, primarily visual input, some sonar and radar, and and then creating the an accurate vector space representation of the objects around you."}, {"time": 1796, "text": "Once you have an accurate vector space representation, the planning and control is relatively easier."}, {"time": 1802, "text": "That is relatively easy."}, {"time": 1808, "text": "Basically, once you have accurate vector space representation, then you're kind of like a video game, like cars and like Grand Theft Auto or something like they work pretty well."}, {"time": 1814, "text": "They drive down the road, they don't crash, you know, pretty much unless you crash into them."}, {"time": 1819, "text": "That's because they've they've got an accurate vector space representation of where the cars are, and they're just and then they're rendering that as the as the output."}, {"time": 1827, "text": "Do you have a sense, high level, that Tesla's on track on being able to achieve full autonomy?"}, {"time": 1833, "text": "So on the highway?"}, {"time": 1842, "text": "And still no driver state, driver sensing?"}, {"time": 1842, "text": "And we have driver sensing with torque on the wheel."}, {"time": 1848, "text": "By the way, just a quick comment on karaoke."}, {"time": 1848, "text": "Most people think it's fun, but I also think it is a driving feature."}, {"time": 1855, "text": "I've been saying for a long time, singing in the car is really good for attention management and vigilance management."}, {"time": 1862, "text": "Tesla karaoke is great."}, {"time": 1862, "text": "It's one of the most fun features of the car."}, {"time": 1862, "text": "Do you think of a connection between fun and safety sometimes?"}, {"time": 1868, "text": "Yeah, you can do both at the same time."}, {"time": 1872, "text": "I just met with Andrew and wife of Carl Sagan, directed Cosmos."}, {"time": 1872, "text": "I'm generally a big fan of Carl Sagan."}, {"time": 1879, "text": "He's super cool."}, {"time": 1879, "text": "And had a great way of putting things."}, {"time": 1879, "text": "All of our consciousness, all civilization, everything we've ever known and done is on this tiny blue dot."}, {"time": 1889, "text": "People also get they get too trapped in there."}, {"time": 1889, "text": "This is like squabbles amongst humans."}, {"time": 1894, "text": "Let's not think of the big picture."}, {"time": 1894, "text": "They take civilization and our continued existence for granted."}, {"time": 1899, "text": "I shouldn't do that."}, {"time": 1899, "text": "Look at the history of civilizations."}, {"time": 1899, "text": "They rise and they fall."}]}]