[{"title": "Jeff Hawkins: The Thousand Brains Theory of Intelligence | Lex Fridman Podcast #208", "id": "Z1KwkpTUbkg", "quotes": [{"time": 317, "text": "We're not just individuals."}, {"time": 317, "text": "We live in society and so on."}, {"time": 324, "text": "From our research point of view, again, let's just talk."}, {"time": 324, "text": "We studied the neocortex."}, {"time": 330, "text": "It's a sheet of neural tissue."}, {"time": 330, "text": "It's about 75% of your brain."}, {"time": 330, "text": "It runs on this very repetitive algorithm."}, {"time": 337, "text": "It's a very repetitive circuit."}, {"time": 337, "text": "You can apply that algorithm to lots of different problems, but underneath, it's the same thing."}, {"time": 344, "text": "We're just building this model."}, {"time": 344, "text": "From our point of view, we wouldn't look for these special circuits someplace buried in your brain that might be related to understanding other humans."}, {"time": 352, "text": "It's more like, how do we build a model of anything?"}, {"time": 358, "text": "How do we understand anything in the world?"}, {"time": 358, "text": "Humans are just another part of the things we understand."}, {"time": 362, "text": "There's nothing to the brain that knows the emergent phenomena of collective intelligence."}, {"time": 368, "text": "Well, I certainly know about that."}, {"time": 368, "text": "I've heard the terms, I've read."}, {"time": 373, "text": "No, but that's as an idea."}, {"time": 376, "text": "Well, I think we have language, which is built into our brains."}, {"time": 376, "text": "That's a key part of collective intelligence."}, {"time": 381, "text": "There are some prior assumptions about the world we're going to live in."}, {"time": 381, "text": "When we're born, we're not just a blank slate."}, {"time": 387, "text": "Did we evolve to take advantage of those situations?"}, {"time": 395, "text": "Again, we study only part of the brain, the neocortex."}, {"time": 395, "text": "There's other parts of the brain that are very much involved in societal interactions and human emotions and how we interact and even societal issues about how we interact with other people, when we support them, when we're greedy and things like that."}, {"time": 413, "text": "Certainly, the brain is a great place where to study intelligence."}, {"time": 420, "text": "I wonder if it's the fundamental atom of intelligence."}, {"time": 426, "text": "Well, I would say it's absolutely in a central component, even if you believe in collective intelligence as, hey, that's where it's all happening."}, {"time": 432, "text": "That's what we need to study, which I don't believe that, by the way."}, {"time": 436, "text": "I think it's really important, but I don't think that is the thing."}, {"time": 439, "text": "Even if you do believe that, then you have to understand how the brain works in doing that."}, {"time": 446, "text": "It's more like we are intelligent individuals and together, we are much more magnified, our intelligence."}, {"time": 452, "text": "We can do things that we couldn't do individually, but even as individuals, we're pretty damn smart and we can model things and understand the world and interact with it."}, {"time": 462, "text": "To me, if you're going to start someplace, you need to start with the brain."}, {"time": 462, "text": "Then you could say, well, how do brains interact with each other?"}, {"time": 468, "text": "What is the nature of language?"}, {"time": 468, "text": "How do we share models that I've learned something about the world, how do I share it with you?"}, {"time": 473, "text": "Which is really what sort of communal intelligence is."}, {"time": 476, "text": "I know something, you know something."}, {"time": 476, "text": "We've had different experiences in the world."}, {"time": 482, "text": "I've learned something about brains."}, {"time": 482, "text": "Maybe I can impart that to you."}, {"time": 482, "text": "You've learned something about physics and you can impart that to me."}, {"time": 486, "text": "Even just the epistemological question of, well, what is knowledge and how do you represent it in the brain?"}, {"time": 495, "text": "That's where it's going to reside for in our writings."}, {"time": 500, "text": "It's obvious that human collaboration, human interaction is how we build societies."}, {"time": 507, "text": "But some of the things you talk about and work on, some of those elements of what makes up an intelligent entity is there with a single person."}, {"time": 520, "text": "I mean, we can't deny that the brain is the core element here."}, {"time": 520, "text": "At least I think it's obvious."}, {"time": 527, "text": "The brain is the core element in all theories of intelligence."}, {"time": 527, "text": "It's where knowledge is represented."}, {"time": 531, "text": "It's where knowledge is created."}, {"time": 531, "text": "We interact, we share, we build upon each other's work."}, {"time": 538, "text": "But without a brain, you'd have nothing."}, {"time": 538, "text": "There would be no intelligence without brains."}, {"time": 543, "text": "And so that's where we start."}, {"time": 543, "text": "I got into this field because I just was curious as to who I am."}, {"time": 551, "text": "How do I think?"}, {"time": 551, "text": "What's going on in my head when I'm thinking?"}, {"time": 551, "text": "What does it mean to know something?"}, {"time": 556, "text": "I can ask what it means for me to know something independent of how I learned it from you or from someone else or from society."}, {"time": 561, "text": "What does it mean for me to know that I have a model of you in my head?"}, {"time": 565, "text": "What does it mean to know I know what this microphone does and how it works physically, even when I can't see right now?"}, {"time": 568, "text": "How do I know that?"}, {"time": 568, "text": "How the neurons do that at the fundamental level of neurons and synapses and so on?"}, {"time": 574, "text": "Those are really fascinating questions."}, {"time": 580, "text": "And I'm happy to be just happy to understand those if I could."}, {"time": 584, "text": "So in your new book, you talk about our brain, our mind as being made up of many brains."}, {"time": 595, "text": "So the book is called A Thousand Brain Theory of Intelligence."}, {"time": 595, "text": "What is the key idea of this book?"}, {"time": 602, "text": "The book has three sections and it has sort of maybe three big ideas."}, {"time": 602, "text": "So the first section is all about what we've learned about the neocortex and that's the thousand brains theory."}, {"time": 609, "text": "Just to complete the picture, the second section is all about AI and the third section is about the future of humanity."}, {"time": 616, "text": "So the thousand brains theory, the big idea there, if I had to summarize into one big idea, is that we think of the brain, the neocortex as learning this model of the world."}, {"time": 633, "text": "But what we learned is actually there's tens of thousands of independent modeling systems going on."}, {"time": 638, "text": "And so each, we call the column in the cortex is about 150,000 of them, is a complete modeling system."}, {"time": 644, "text": "So it's a collective intelligence in your head in some sense."}, {"time": 644, "text": "So the thousand brains theory says, well, where do I have knowledge about this coffee cup or where's the model of this cell phone?"}, {"time": 655, "text": "It's not in one place."}, {"time": 655, "text": "It's in thousands of separate models that are complimentary and they communicate with each other through voting."}, {"time": 659, "text": "So this idea that we feel like we're one person, that's our experience."}, {"time": 664, "text": "But reality, there's lots of these, it's almost like little brains, but they're sophisticated modeling systems, about 150,000 of them in each human brain."}, {"time": 676, "text": "And that's a total different way of thinking about how the neocortex is structured than we or anyone else thought of even just five years ago."}, {"time": 681, "text": "So you mentioned you started this journey just looking in the mirror and trying to understand who you are."}, {"time": 691, "text": "So if you have many brains, who are you then?"}, {"time": 691, "text": "We have a singular perception, right?"}, {"time": 698, "text": "We think, oh, I'm just here."}, {"time": 698, "text": "I'm looking at you."}, {"time": 698, "text": "But it's composed of all these things, like there's sounds and there's vision and there's touch and all kinds of inputs."}, {"time": 702, "text": "Yeah, we have the singular perception."}, {"time": 708, "text": "And what the thousand brain theory says, we have these models that are visual models."}, {"time": 711, "text": "We have a lot of models that are auditory models, models that talk to models and so on, but they vote."}, {"time": 715, "text": "And so these things in the cortex, you can think about these columns as like little grains of rice, 150,000 stacked next to each other."}, {"time": 721, "text": "And each one is its own little modeling system, but they have these long range connections that go between them."}, {"time": 732, "text": "And we call those voting connections or voting neurons."}, {"time": 732, "text": "And so the different columns try to reach a consensus."}, {"time": 740, "text": "Like, what am I looking at?"}, {"time": 740, "text": "Each one has some ambiguity, but they come to a consensus."}, {"time": 744, "text": "Oh, there's a water bottle I'm looking at."}, {"time": 744, "text": "We are only consciously able to perceive the voting."}, {"time": 750, "text": "We're not able to perceive anything that goes on under the hood."}, {"time": 750, "text": "So the voting is what we're aware of."}, {"time": 755, "text": "The results of the vote."}, {"time": 759, "text": "Well, you can imagine it this way."}, {"time": 759, "text": "We were just talking about eye movements a moment ago."}, {"time": 759, "text": "So as I'm looking at something, my eyes are moving about three times a second."}, {"time": 764, "text": "And with each movement, a completely new input is coming into the brain."}, {"time": 769, "text": "It's not repetitive."}, {"time": 769, "text": "It's not shifting it around."}, {"time": 774, "text": "I'm totally unaware of it."}, {"time": 774, "text": "I can't perceive it."}, {"time": 774, "text": "But yet if I looked at the neurons in your brain, they're going on and off, on and off, on and off, on and off."}, {"time": 778, "text": "But the voting neurons are not."}, {"time": 783, "text": "The voting neurons are saying, we all agree, even though I'm looking at different parts of this, this is a water bottle right now."}, {"time": 786, "text": "And that's not changing."}, {"time": 786, "text": "And it's in some position and pose relative to me."}, {"time": 791, "text": "So I have this perception of the water bottle about two feet away from me at a certain pose to me."}, {"time": 795, "text": "That is not changing."}, {"time": 795, "text": "That's the only part I'm aware of."}, {"time": 795, "text": "I can't be aware of the fact that the inputs from the eyes are moving and changing and all this other tapping."}, {"time": 805, "text": "So these long range connections are the part we can be conscious of."}, {"time": 805, "text": "The individual activity in each column doesn't go anywhere else."}, {"time": 811, "text": "It doesn't get shared anywhere else."}, {"time": 811, "text": "There's no way to extract it and talk about it or extract it and even remember it to say, oh, yes, I can recall that."}, {"time": 825, "text": "But these long range connections are the things that are accessible to language and to our, like the hippocampus, our memories, our short term memory systems and so on."}, {"time": 830, "text": "So we're not aware of 95% or maybe it's even 98% of what's going on in your brain."}, {"time": 836, "text": "We're only aware of this sort of stable, somewhat stable voting outcome of all these things that are going on underneath the hood."}, {"time": 849, "text": "So what would you say is the basic element in the thousand brains theory of intelligence of intelligence?"}, {"time": 855, "text": "Like what's the atom of intelligence when you think about it?"}, {"time": 855, "text": "Is it the individual brains and then what is a brain?"}, {"time": 861, "text": "Well, let's, let's, can we just talk about what intelligence is first and then, and then we can talk about the elements are."}, {"time": 865, "text": "So in my, in my book, intelligence is the ability to learn a model of the world, to build internal to your head, a model that represents the structure of everything, you know, to know what this is a table and that's a coffee cup and this is a gooseneck lamp and all this to know these things."}, {"time": 887, "text": "I have to have a model of it in my head."}, {"time": 887, "text": "I just don't look at them and go, what is that?"}, {"time": 890, "text": "I already have internal representations of these things in my head and I had to learn them."}, {"time": 890, "text": "I wasn't born of any of that knowledge."}, {"time": 895, "text": "You were, you know, we have some lights in the room here."}, {"time": 895, "text": "I, you know, that's not part of my evolutionary heritage, right?"}, {"time": 900, "text": "It's not in my genes."}, {"time": 900, "text": "So, um, we have this incredible model and the model includes not only what things look like and feel like, but where they are relative to each other and how they behave."}, {"time": 909, "text": "I've never picked up this water bottle before, but I know that if I took my hand on that blue thing and I turn it, it'll probably make a funny little sound as the little plastic things detach and then it'll rotate and it'll rotate a certain way and it'll come off."}, {"time": 920, "text": "Because I have this model in my head."}, {"time": 924, "text": "So the essence of intelligence as our ability to learn a model and the more sophisticated our model is, the smarter we are."}, {"time": 929, "text": "Uh, not that there is a single intelligence, because you can know about, you know, a lot about things that I don't know."}, {"time": 934, "text": "And I know about things you don't know."}, {"time": 937, "text": "And we can both be very smart, but we both learned a model of the world through interacting with it."}, {"time": 942, "text": "So that is the essence of intelligence."}, {"time": 942, "text": "Then we can ask ourselves, what are the mechanisms in the brain that allow us to do that?"}, {"time": 946, "text": "And what are the mechanisms of learning, not just the neural mechanisms, what are the general process by how we learn a model?"}, {"time": 950, "text": "So that was a big insight for us."}, {"time": 954, "text": "It's like, what are the, what is the actual things that, how do you learn this stuff?"}, {"time": 954, "text": "It turns out you have to learn it through movement."}, {"time": 959, "text": "Um, you can't learn it just by that's how we learn."}, {"time": 959, "text": "We learn through movement."}, {"time": 964, "text": "We learn."}, {"time": 964, "text": "Um, so you build up this model by observing things and touching them and moving them and walking around the world and so on."}, {"time": 967, "text": "So either you move or the thing moves somehow."}, {"time": 971, "text": "You obviously can learn things just by reading a book, something like that."}, {"time": 976, "text": "But think about if I were to say, oh, here's a new house."}, {"time": 976, "text": "I want you to learn, you know, what do you do?"}, {"time": 981, "text": "You have to walk, you have to walk from room to the room."}, {"time": 981, "text": "You have to open the doors, look around, see what's on the left, what's on the right."}, {"time": 985, "text": "As you do this, you're building a model in your head."}, {"time": 989, "text": "It's just, that's what you're doing."}, {"time": 989, "text": "You can't just sit there and say, I'm going to grok the house."}, {"time": 994, "text": "You know, or you can do it."}, {"time": 994, "text": "You don't even want to just sit down and read some description of it, right?"}, {"time": 997, "text": "You literally physically interact."}, {"time": 997, "text": "The same with like a smartphone."}, {"time": 1001, "text": "If I'm going to learn a new app, I touch it and I move things around."}, {"time": 1001, "text": "I see what happens when I, when I do things with it."}, {"time": 1005, "text": "So that's the basic way we learn in the world."}, {"time": 1005, "text": "And by the way, when you say model, you mean something that can be used for prediction in the future."}, {"time": 1014, "text": "It's used for prediction and for behavior and planning."}, {"time": 1014, "text": "And does a pretty good job doing so."}, {"time": 1022, "text": "Here's the way to think about the model."}, {"time": 1022, "text": "A lot of people get hung up on this."}, {"time": 1022, "text": "So you can imagine an architect making a model of a house, right?"}, {"time": 1028, "text": "So there's a physical model that's small."}, {"time": 1033, "text": "And why do they do that?"}, {"time": 1033, "text": "Well, we do that because you can imagine what it would look like from different angles."}, {"time": 1037, "text": "Look from here, look from there."}, {"time": 1037, "text": "And you can also say, well, how, how far to get from the garage to the, to the swimming pool or something like that."}, {"time": 1041, "text": "You can imagine looking at this and you can say, what would be the view from this location?"}, {"time": 1045, "text": "So we build these physical models to let you imagine the future and imagine behaviors."}, {"time": 1049, "text": "Now we can take that same model and put it in a computer."}, {"time": 1054, "text": "So we now, today they'll build models of houses in a computer and they, and they do that using a set of, we'll come back to this term in a moment, reference frames, but basically you assign a reference frame for the palace and you assign different things for the house in different locations."}, {"time": 1069, "text": "And then the computer can generate an image and say, okay, this is what it looks like in this direction."}, {"time": 1073, "text": "The brain is doing something remarkably similar to this surprising."}, {"time": 1076, "text": "It's using reference frames."}, {"time": 1076, "text": "It's building these, it's similar to a model on a computer, which has the same benefits of building a physical model."}, {"time": 1086, "text": "It allows me to say, what would this thing look like if it was in this orientation?"}, {"time": 1086, "text": "What would likely happen if I push this button?"}, {"time": 1090, "text": "I've never pushed this button before, or how would I accomplish something?"}, {"time": 1095, "text": "I want to, I want to convey a new idea I've learned."}, {"time": 1095, "text": "How would I do that?"}, {"time": 1095, "text": "I can imagine in my head, well, I could talk about it."}, {"time": 1101, "text": "I could write a book."}, {"time": 1101, "text": "I could do some podcasts."}, {"time": 1101, "text": "I could, you know, maybe tell my neighbor, you know, and I can imagine the outcomes of all these things before I do any of them."}, {"time": 1112, "text": "That's what the model lets you do."}, {"time": 1112, "text": "It lets us plan the future and imagine the consequences of our actions."}, {"time": 1116, "text": "Prediction, you asked about prediction."}, {"time": 1116, "text": "Prediction is not the goal of the model."}, {"time": 1122, "text": "Prediction is an inherent property of it, and it's how the model corrects itself."}, {"time": 1128, "text": "So prediction is fundamental to intelligence."}, {"time": 1128, "text": "It's fundamental to building a model, and the model's intelligent."}, {"time": 1135, "text": "And let me go back and be very precise about this."}, {"time": 1135, "text": "Prediction, you can think of prediction two ways."}, {"time": 1140, "text": "One is like, hey, what would happen if I did this?"}, {"time": 1140, "text": "That's a type of prediction."}, {"time": 1143, "text": "That's a key part of intelligence."}, {"time": 1143, "text": "But using prediction is like, oh, what's this water bottle going to feel like when I pick it up, you know?"}, {"time": 1147, "text": "And that doesn't seem very intelligent."}, {"time": 1153, "text": "But one way to think about prediction is it's a way for us to learn where our model is wrong."}, {"time": 1160, "text": "So if I picked up this water bottle and it felt hot, I'd be very surprised."}, {"time": 1160, "text": "Or if I picked it up and it was very light, I'd be surprised."}, {"time": 1166, "text": "Or if I turned this top and I had to turn it the other way, I'd be surprised."}, {"time": 1172, "text": "And so all those might have a prediction like, okay, I'm going to do it."}, {"time": 1172, "text": "I'll drink some water."}, {"time": 1178, "text": "I'm okay."}, {"time": 1178, "text": "Okay, I do this."}, {"time": 1178, "text": "I feel opening, right?"}, {"time": 1178, "text": "What if I had to turn it the other way?"}, {"time": 1182, "text": "Or what if it's split in two?"}, {"time": 1182, "text": "Then I say, oh my gosh, I misunderstood this."}, {"time": 1182, "text": "I didn't have the right model of this thing."}, {"time": 1187, "text": "My attention would be drawn to it."}, {"time": 1187, "text": "I'd be looking at it going, well, how the hell did that happen?"}, {"time": 1190, "text": "Why did it open up that way?"}, {"time": 1190, "text": "And I would update my model by doing it."}, {"time": 1195, "text": "Just by looking at it and playing around with that update and say, this is a new type of water bottle."}, {"time": 1198, "text": "So you're talking about sort of complicated things like a water bottle, but this also applies for just basic vision, just like seeing things."}, {"time": 1205, "text": "It's almost like a precondition of just perceiving the world is predicting it."}, {"time": 1210, "text": "So just everything that you see is first passed through your prediction."}, {"time": 1218, "text": "Everything you see and feel."}, {"time": 1218, "text": "In fact, this was the insight I had back in the early 80s."}, {"time": 1223, "text": "And I know that people have reached the same idea is that every sensory input you get, not just vision, but touch and hearing, you have an expectation about it and a prediction."}, {"time": 1237, "text": "Sometimes you can predict very accurately."}, {"time": 1237, "text": "Sometimes you can't."}, {"time": 1243, "text": "I can't predict what next word is going to come out of your mouth."}, {"time": 1243, "text": "But as you start talking, I'll get better and better predictions."}, {"time": 1247, "text": "And if you talk about some topics, I'd be very surprised."}, {"time": 1251, "text": "So I have this sort of background prediction that's going on all the time for all of my senses."}, {"time": 1258, "text": "Again, the way I think about that is this is how we learn."}, {"time": 1258, "text": "It's more about how we learn."}, {"time": 1264, "text": "It's a test of our understanding."}, {"time": 1264, "text": "Our predictions are a test."}, {"time": 1264, "text": "Is this really a water bottle?"}, {"time": 1264, "text": "If it is, I shouldn't see a little finger sticking out the side."}, {"time": 1270, "text": "And if I saw a little finger sticking out, I was like, oh, what the hell's going on?"}, {"time": 1274, "text": "That's not normal."}, {"time": 1274, "text": "I mean, that's fascinating that... Let me linger on this for a second."}, {"time": 1280, "text": "It really honestly feels that prediction is fundamental to everything, to the way our mind operates, to intelligence."}, {"time": 1287, "text": "So it's just a different way to see intelligence, which is like everything starts a prediction."}, {"time": 1295, "text": "And prediction requires a model."}, {"time": 1301, "text": "You can't predict something unless you have a model of it."}, {"time": 1301, "text": "But the action is prediction."}, {"time": 1306, "text": "So the thing the model does is prediction."}, {"time": 1306, "text": "But it also... Yeah."}, {"time": 1306, "text": "But you can then extend it to things like, oh, what would happen if I took this today?"}, {"time": 1313, "text": "I went and did this."}, {"time": 1319, "text": "What would be likely?"}, {"time": 1319, "text": "Or how... You can extend prediction to like, oh, I want to get a promotion at work."}, {"time": 1324, "text": "What action should I take?"}, {"time": 1324, "text": "And you can say, if I did this, I predict what might happen."}, {"time": 1329, "text": "If I spoke to someone, I predict what might happen."}, {"time": 1329, "text": "So it's not just low level predictions."}, {"time": 1333, "text": "It's all predictions."}, {"time": 1333, "text": "It's like this black box so you can ask basically any question, low level or high level."}, {"time": 1337, "text": "So we started off with that observation."}, {"time": 1337, "text": "It's this nonstop prediction."}, {"time": 1341, "text": "And I write about this in the book."}, {"time": 1341, "text": "And then we asked, how do neurons actually make predictions physically?"}, {"time": 1347, "text": "Like what does the neuron do when it makes a prediction?"}, {"time": 1352, "text": "Or the neural tissue does when it makes a prediction."}, {"time": 1352, "text": "And then we asked, what are the mechanisms by how we build a model that allows you to make predictions?"}, {"time": 1355, "text": "So we started with prediction as sort of the fundamental research agenda, if in some sense."}, {"time": 1360, "text": "And say, well, we understand how the brain makes predictions."}, {"time": 1367, "text": "We'll understand how it builds these models and how it learns."}, {"time": 1371, "text": "And that's the core of intelligence."}, {"time": 1371, "text": "So it was the key that got us in the door to say, that is our research agenda."}, {"time": 1375, "text": "Understand predictions."}, {"time": 1379, "text": "So in this whole process, where does intelligence originate, would you say?"}, {"time": 1385, "text": "So if we look at things that are much less intelligence to humans and you start to build up a human through the process of evolution, where's this magic thing that has a prediction model or a model that's able to predict that starts to look a lot more like intelligence?"}, {"time": 1404, "text": "Is there a place where Richard Dawkins wrote an introduction to your book, an excellent introduction?"}, {"time": 1410, "text": "I mean, it's, it puts a lot of things into context and it's funny just looking at parallels for your book and Darwin's Origin of Species."}, {"time": 1416, "text": "So Darwin wrote about the origin of species."}, {"time": 1422, "text": "So what is the origin of intelligence?"}, {"time": 1427, "text": "Well, we have a theory about it and it's just that, it's a theory."}, {"time": 1427, "text": "The theory goes as follows."}, {"time": 1433, "text": "As soon as living things started to move, they're not just floating in sea, they're not just a plant, you know, grounded someplace."}, {"time": 1438, "text": "As soon as they started to move, there was an advantage to moving intelligently, to moving in certain ways."}, {"time": 1443, "text": "And there's some very simple things you can do, you know, bacteria or single cell organisms can move towards the source of gradient of food or something like that."}, {"time": 1454, "text": "But an animal that might know where it is and know where it's been and how to get back to that place, or an animal that might say, oh, there was a source of food someplace, how do I get to it?"}, {"time": 1463, "text": "Or there was a danger, how do I get to it?"}, {"time": 1463, "text": "There was a mate, how do I get to them?"}, {"time": 1469, "text": "There was a big evolutionary advantage to that."}, {"time": 1469, "text": "So early on, there was a pressure to start understanding your environment, like where am I and where have I been?"}, {"time": 1474, "text": "And what happened in those different places?"}, {"time": 1480, "text": "So we still have this neural mechanism in our brains."}, {"time": 1480, "text": "In the mammals, it's in the hippocampus and entorhinal cortex, these are older parts of the brain."}, {"time": 1495, "text": "And these are very well studied."}, {"time": 1495, "text": "We build a map of the of our environment."}, {"time": 1495, "text": "So these neurons in these parts of the brain know where I am in this room, and where the door was and things like that."}, {"time": 1507, "text": "So a lot of other mammals have this?"}, {"time": 1509, "text": "All mammals have this, right?"}, {"time": 1509, "text": "And almost any animal that knows where it is, and get around must have some mapping system, must have some way of saying, I've learned a map of my environment, I have hummingbirds in my backyard."}, {"time": 1521, "text": "And they go to the same places all the time."}, {"time": 1521, "text": "They must know where they are."}, {"time": 1526, "text": "They just know where they are when they're not just randomly flying around."}, {"time": 1530, "text": "They know particular flowers they come back to."}, {"time": 1530, "text": "So we all have this."}, {"time": 1530, "text": "And it turns out it's very tricky to get neurons to do this, to build a map of an environment."}, {"time": 1536, "text": "And so we now know, there's these famous studies that are still very active about place cells and grid cells and these other types of cells in the older parts of the brain, and how they build these maps of the world."}, {"time": 1551, "text": "It's really clever."}, {"time": 1551, "text": "It's obviously been under a lot of evolutionary pressure over a long period of time to get good at this."}, {"time": 1555, "text": "So animals now know where they are."}, {"time": 1555, "text": "What we think has happened, and there's a lot of evidence to suggest this, is that that mechanism we learned to map, like a space, was repackaged."}, {"time": 1566, "text": "The same type of neurons was repackaged into a more compact form."}, {"time": 1577, "text": "And that became the cortical column."}, {"time": 1577, "text": "And it was in some sense, genericized, if that's a word."}, {"time": 1577, "text": "It was turned into a very specific thing about learning maps of environments to learning maps of anything, learning a model of anything, not just your space, but coffee cups and so on."}, {"time": 1588, "text": "And it got sort of repackaged into a more compact version, a more universal version, and then replicated."}, {"time": 1601, "text": "So the reason we're so flexible is we have a very generic version of this mapping algorithm, and we have 150,000 copies of it."}, {"time": 1606, "text": "Sounds a lot like the progress of deep learning."}, {"time": 1612, "text": "How so?"}, {"time": 1612, "text": "So take neural networks that seem to work well for a specific task, compress them, and multiply it by a lot."}, {"time": 1620, "text": "And then you just stack them on top of it."}, {"time": 1620, "text": "It's like the story of transformers in natural language processing."}, {"time": 1627, "text": "But in deep learning networks, they end up, you're replicating an element, but you still need the entire network to do anything."}, {"time": 1638, "text": "Here, what's going on, each individual element is a complete learning system."}, {"time": 1638, "text": "This is why I can take a human brain, cut it in half, and it still works."}, {"time": 1649, "text": "It's fundamentally distributed."}, {"time": 1649, "text": "It's fundamentally distributed, complete modeling systems."}, {"time": 1654, "text": "But that's our story we like to tell."}, {"time": 1654, "text": "I would guess it's likely largely right."}, {"time": 1662, "text": "But there's a lot of evidence supporting that story, this evolutionary story."}, {"time": 1662, "text": "The thing which brought me to this idea is that the human brain got big very quickly."}, {"time": 1670, "text": "So that led to the proposal a long time ago that, well, there's this common element just instead of creating new things, it just replicated something."}, {"time": 1682, "text": "We also are extremely flexible."}, {"time": 1682, "text": "We can learn things that we had no history about."}, {"time": 1687, "text": "And that tells it that the learning algorithm is very generic."}, {"time": 1687, "text": "It's very kind of universal because it doesn't assume any prior knowledge about what it's learning."}, {"time": 1700, "text": "And so you combine those things together and you say, okay, well, how did that come about?"}, {"time": 1700, "text": "Where did that universal algorithm come from?"}, {"time": 1706, "text": "It had to come from something that wasn't universal."}, {"time": 1706, "text": "It came from something that was more specific."}, {"time": 1709, "text": "So anyway, this led to our hypothesis that you would find grid cells and place cell equivalents in the neocortex."}, {"time": 1714, "text": "And when we first published our first papers on this theory, we didn't know of evidence for that."}, {"time": 1718, "text": "It turns out there was some, but we didn't know about it."}, {"time": 1723, "text": "So then we became aware of evidence for grid cells in parts of the neocortex."}, {"time": 1728, "text": "And then now there's been new evidence coming out."}, {"time": 1728, "text": "There's some interesting papers that came out just January of this year."}, {"time": 1733, "text": "So one of our predictions was if this evolutionary hypothesis is correct, we would see grid cell place cell equivalents, cells that work like them through every column in the neocortex."}, {"time": 1744, "text": "And that's starting to be seen."}, {"time": 1744, "text": "What does it mean that, why is it important that they're present?"}, {"time": 1748, "text": "Because it tells us, well, we're asking about the evolutionary origin of intelligence, right?"}, {"time": 1753, "text": "So our theory is that these columns in the cortex are working on the same principles, they're modeling systems."}, {"time": 1759, "text": "And it's hard to imagine how neurons do this."}, {"time": 1765, "text": "And so we said, hey, it's really hard to imagine how neurons could learn these models of things."}, {"time": 1770, "text": "We can talk about the details of that if you want."}, {"time": 1770, "text": "But there's this other part of the brain, we know that learns models of environments."}, {"time": 1776, "text": "So could that mechanism to learn to model this room be used to learn to model the water bottle?"}, {"time": 1781, "text": "Is it the same mechanism?"}, {"time": 1781, "text": "So we said it's much more likely the brain's using the same mechanism, which case it would have these equivalent cell types."}, {"time": 1792, "text": "So it's basically the whole theory is built on the idea that these columns have reference frames and they're learning these models and these grid cells create these reference frames."}, {"time": 1802, "text": "So it's basically the major, in some sense, the major predictive part of this theory is that we will find these equivalent mechanisms in each column in the neocortex, which tells us that that's what they're doing."}, {"time": 1814, "text": "They're learning these sensory motor models of the world."}, {"time": 1814, "text": "So we're pretty confident that would happen, but now we're seeing the evidence."}, {"time": 1821, "text": "So the evolutionary process, nature does a lot of copy and paste and see what happens."}, {"time": 1826, "text": "There's no direction to it."}, {"time": 1826, "text": "But it just found out like, hey, if I took these elements and made more of them, what happens?"}, {"time": 1831, "text": "And let's hook them up to the eyes and let's hook them to ears."}, {"time": 1837, "text": "And that seems to work pretty well for us."}, {"time": 1837, "text": "Again, just to take a quick step back to our conversation of collective intelligence."}, {"time": 1848, "text": "Do you sometimes see that as just another copy and paste aspect is copying and pasting these brains and humans and making a lot of them and then creating social structures that then almost operate as a single brain?"}, {"time": 1864, "text": "I wouldn't have said that, but you said it sounded pretty good."}, {"time": 1868, "text": "So to you, the brain is its own thing."}, {"time": 1875, "text": "I mean, our goal is to understand how the neocortex works."}, {"time": 1875, "text": "We can argue how essential that is to understand the human brain because it's not the entire human brain."}, {"time": 1880, "text": "You can argue how essential that is to understanding human intelligence."}, {"time": 1885, "text": "You can argue how essential this is to sort of communal intelligence."}, {"time": 1889, "text": "Our goal was to understand the neocortex."}, {"time": 1898, "text": "So what is the neocortex and where does it fit in the various aspects of what the brain does?"}, {"time": 1901, "text": "Like how important is it to you?"}, {"time": 1906, "text": "Well, obviously, again, I mentioned again in the beginning, it's about 70 to 75% of the volume of the human brain."}, {"time": 1913, "text": "So it dominates our brain in terms of size."}, {"time": 1913, "text": "Not in terms of number of neurons, but in terms of size."}, {"time": 1920, "text": "Size isn't everything, Jeff."}, {"time": 1922, "text": "I know, but it's not that."}, {"time": 1922, "text": "We know that all high level vision, hearing, and touch happens in the neocortex."}, {"time": 1929, "text": "We know that all language occurs and is understood in the neocortex, whether that's spoken language, written language, sign language, whether it's language of mathematics, language of physics, music."}, {"time": 1937, "text": "We know that all high level planning and thinking occurs in the neocortex."}, {"time": 1943, "text": "If I were to say, what part of your brain designed a computer and understands programming and creates music?"}, {"time": 1947, "text": "It's all the neocortex."}, {"time": 1953, "text": "So then that's an undeniable fact."}, {"time": 1953, "text": "But then there's other parts of our brain are important too, right?"}, {"time": 1959, "text": "Our emotional states, our body regulating our body."}, {"time": 1959, "text": "So the way I like to look at it is, can you understand the neocortex without the rest of the brain?"}, {"time": 1968, "text": "And some people say you can't, and I think absolutely you can."}, {"time": 1973, "text": "It's not that they're not interacting, but you can understand."}, {"time": 1978, "text": "Can you understand the neocortex without understanding the emotions of fear?"}, {"time": 1981, "text": "You can understand how the system works."}, {"time": 1981, "text": "It's just a modeling system."}, {"time": 1981, "text": "I make the analogy in the book that it's like a map of the world, and how that map is used depends on who's using it."}, {"time": 1992, "text": "So how our map of our world in our neocortex, how we manifest as a human depends on the rest of our brain."}, {"time": 1999, "text": "What are our motivations?"}, {"time": 1999, "text": "What are my desires?"}, {"time": 1999, "text": "Am I a nice guy or not a nice guy?"}, {"time": 2003, "text": "Am I a cheater or not a cheater?"}, {"time": 2003, "text": "How important different things are in my life?"}, {"time": 2013, "text": "But the neocortex can be understood on its own."}, {"time": 2013, "text": "And I say that as a neuroscientist, I know there's all these interactions, and I don't want to say I don't know them and we don't think about them."}, {"time": 2023, "text": "But from a layperson's point of view, you can say it's a modeling system."}, {"time": 2027, "text": "I don't generally think too much about the communal aspect of intelligence, which you brought up a number of times already."}, {"time": 2031, "text": "So that's not really been my concern."}, {"time": 2035, "text": "I just wonder if there's a continuum from the origin of the universe, like this pockets of complexities that form living organisms."}, {"time": 2040, "text": "I wonder if we're just, if you look at humans, we feel like we're at the top."}, {"time": 2048, "text": "And I wonder if there's like just, I wonder if there's like just where everybody probably every living type pocket of complexity probably thinks they're the, pardon the French, they're the shit."}, {"time": 2060, "text": "They're at the top of the pyramid."}, {"time": 2066, "text": "Well, if they're thinking."}, {"time": 2066, "text": "Well, then what is thinking?"}, {"time": 2066, "text": "In this sense, the whole point is in their sense of the world, their sense is that they're at the top of it."}, {"time": 2080, "text": "I think what is a turtle, but you're, you're, you're bringing up, you know, the problems of complexity and complexity theory are, you know, it's a huge, interesting problem in science."}, {"time": 2088, "text": "Um, and you know, I think we've made surprisingly little progress and understanding complex systems in general."}, {"time": 2095, "text": "Um, and so, you know, the Santa Fe Institute was founded to study this and even the scientists there will say, it's really hard."}, {"time": 2101, "text": "We haven't really been able to figure out exactly, you know, that science hasn't really congealed yet."}, {"time": 2105, "text": "We're still trying to figure out the basic elements of that science."}, {"time": 2110, "text": "Uh, what, you know, where does complexity come from and what is it and how you define it, whether it's DNA creating bodies or phenotypes or it's individuals creating societies or ants and, you know, markets and so on."}, {"time": 2120, "text": "It's, it's a very complex thing."}, {"time": 2126, "text": "I'm not a complexity theorist person, right?"}, {"time": 2126, "text": "Um, and I, I think you should ask, well, the brain itself is a complex system."}, {"time": 2132, "text": "So can we understand that?"}, {"time": 2132, "text": "Um, I think we've made a lot of progress understanding how the brain works."}, {"time": 2138, "text": "So, uh, but I haven't brought it out to like, oh, well, where are we on the complexity spectrum?"}, {"time": 2142, "text": "You know, it's like, um, it's a great question."}, {"time": 2147, "text": "I'd prefer for that answer to be we're not special."}, {"time": 2147, "text": "It seems like if we're honest, most likely we're not special."}, {"time": 2155, "text": "So if there is a spectrum or probably not in some kind of significant place, there's one thing we could say that we are special."}, {"time": 2161, "text": "And again, only here on earth, I'm not saying is that if we think about knowledge, what we know, um, we clearly human brains have, um, the only brains that have a certain types of knowledge."}, {"time": 2181, "text": "We're the only brains on this earth to understand, uh, what the earth is, how old it is, that the universe is a picture as a whole with the only organisms understand DNA and the origins of, you know, of species."}, {"time": 2190, "text": "Uh, no other species on, on this planet has that knowledge."}, {"time": 2197, "text": "So if we think about, I like to think about, you know, one of the endeavors of humanity is to understand the universe as much as we can."}, {"time": 2203, "text": "Um, I think our species is further along in that undeniably, um, whether our theories are right or wrong, we can debate, but at least we have theories."}, {"time": 2214, "text": "You know, we, we know that what the sun is and how its fusion is and how what black holes are and, you know, we know general theory of relativity and no other animal has any of this knowledge."}, {"time": 2224, "text": "So in that sense that we're special, uh, are we special in terms of the hierarchy of complexity in the universe?"}, {"time": 2230, "text": "Can we look at a neuron?"}, {"time": 2230, "text": "You say that prediction happens in the neuron."}, {"time": 2240, "text": "So the neuron traditionally is seen as the basic element of the brain."}, {"time": 2244, "text": "So we, I mentioned this earlier that prediction was our research agenda."}, {"time": 2251, "text": "We said, okay, um, how does the brain make a prediction?"}, {"time": 2251, "text": "Like I I'm about to grab this water bottle and my brain is predicting what I'm going to feel on, on all my parts of my fingers."}, {"time": 2257, "text": "If I felt something really odd on any part here, I'd notice it."}, {"time": 2262, "text": "So my brain is predicting what it's going to feel as I grab this thing."}, {"time": 2266, "text": "So what does that, how does that manifest itself in neural tissue?"}, {"time": 2271, "text": "We got brains made of neurons and there's chemicals and there's neurons and there's spikes and the connect, you know, where, where is the prediction going on?"}, {"time": 2277, "text": "And one argument could be that, well, when I'm predicting something, um, a neuron must be firing in advance."}, {"time": 2283, "text": "It's like, okay, this neuron represents what you're going to feel and it's firing."}, {"time": 2289, "text": "It's sending a spike."}, {"time": 2293, "text": "And certainly that happens to some extent, but our predictions are so ubiquitous that we're making so many of them, which we're totally unaware of just the vast majority of me have no idea that you're doing this."}, {"time": 2301, "text": "Um, that it, there wasn't really, we were trying to figure, how could this be?"}, {"time": 2307, "text": "Where, where are these, where are these happening?"}, {"time": 2307, "text": "And I won't walk you through the whole story unless you insist upon it."}, {"time": 2311, "text": "But we came to the realization that most of your predictions are occurring inside individual neurons, especially these, the most common are in the parameter cells."}, {"time": 2323, "text": "And there are, there's a property of neurons."}, {"time": 2323, "text": "We, everyone knows, or most people know that a neuron is a cell and it has this spike called an action potential, and it sends information."}, {"time": 2333, "text": "But we now know that there's these spikes internal to the neuron, they're called dendritic spikes."}, {"time": 2338, "text": "They travel along the branches of the neuron and they don't leave the neuron."}, {"time": 2343, "text": "They're just internal only."}, {"time": 2343, "text": "There's far more dendritic spikes than there are action potentials, far more."}, {"time": 2348, "text": "They're happening all the time."}, {"time": 2348, "text": "And what we came to understand that those dendritic spikes, the ones that are occurring are actually a form of prediction."}, {"time": 2354, "text": "They're telling the neuron, the neuron is saying, I expect that I might become active shortly."}, {"time": 2358, "text": "And that internal, so the internal spike is a way of saying, you're going to, you might be generating external spikes soon."}, {"time": 2370, "text": "I predicted you're going to become active."}, {"time": 2370, "text": "And, and we've, we've, we wrote a paper in 2016 which explained how this manifests itself in neural tissue and how it is that this all works together."}, {"time": 2382, "text": "But the vast majority, we think it's, there's a lot of evidence supporting it."}, {"time": 2382, "text": "So we, that's where we think that most of these predictions are internal."}, {"time": 2388, "text": "That's why you can't be, they're internal to the neuron, you can't perceive them."}, {"time": 2394, "text": "Well, from understanding the prediction mechanism of a single neuron, do you think there's deep insights to be gained about the prediction capabilities of the mini brains of the neural brain?"}, {"time": 2405, "text": "Of the mini brains and then the bigger brain and the brain?"}, {"time": 2408, "text": "So having a prediction side of their individual neuron is not that useful."}, {"time": 2412, "text": "The way it manifests itself in neural tissue is that when a neuron, a neuron emits these spikes are a very singular type event."}, {"time": 2422, "text": "If a neuron is predicting that it's going to be active, it emits its spike very, a little bit sooner, just a few milliseconds sooner than it would have been."}, {"time": 2431, "text": "It's like, I give the analogy of the book is like a sprinter on a, on a starting blocks in a, in a race."}, {"time": 2436, "text": "And if someone says, get ready, set, you get up and you're ready to go."}, {"time": 2436, "text": "And then when your race starts, you get a little bit earlier start."}, {"time": 2442, "text": "So that it's that, that ready set is like the prediction and the neurons like ready to go quicker."}, {"time": 2446, "text": "And what happens is when you have a whole bunch of neurons together and they're all getting these inputs, the ones that are in the predictive state, the ones that are anticipating to become active, if they do become active, they, they sooner, they disable everything else."}, {"time": 2459, "text": "And it leads to different representations in the brain."}, {"time": 2459, "text": "So you have to, it's not isolated just to the neuron, the prediction occurs with the neuron, but the network behavior changes."}, {"time": 2469, "text": "So what happens under different predictions, different inputs have different representations."}, {"time": 2474, "text": "So how I, what I predict is going to be different under different contexts, you know, what my input will be is different under different contexts."}, {"time": 2480, "text": "So this is, this is a key to the whole theory, how this works."}, {"time": 2484, "text": "So the theory of the thousand brains, if you were to count the number of brains, how would you do it?"}, {"time": 2490, "text": "The thousand brain theory says that basically every cortical column in the, in your, in your cortex is a complete modeling system."}, {"time": 2502, "text": "And that when I ask, where do I have a model of something like a coffee cup?"}, {"time": 2502, "text": "It's not in one of those models."}, {"time": 2506, "text": "It's in thousands of those models."}, {"time": 2506, "text": "There's thousands of models of coffee cups."}, {"time": 2506, "text": "That's what the thousand brains, then there's a voting mechanism, which you lead, which you're, which is the thing you're, which you're conscious of, which leads to your singular perception."}, {"time": 2516, "text": "That's why you, you perceive something."}, {"time": 2521, "text": "So that's the thousand brains theory."}, {"time": 2521, "text": "The details, how we got to that theory are complicated."}, {"time": 2527, "text": "It wasn't, we just thought of it one day."}, {"time": 2527, "text": "And one of those details that we had to ask, how does a model make predictions?"}, {"time": 2533, "text": "And we've talked about just these predictive neurons."}, {"time": 2538, "text": "That's part of this theory."}, {"time": 2538, "text": "It's like saying, Oh, it's a detail, but it was like a crack in the door."}, {"time": 2542, "text": "It's like, how are we going to figure out how these neurons built through this?"}, {"time": 2542, "text": "You know, what is going on here?"}, {"time": 2544, "text": "So we just looked at prediction as like, well, we know that's ubiquitous."}, {"time": 2550, "text": "We know that every part of the cortex is making predictions."}, {"time": 2550, "text": "Therefore, whatever the predictive system is, it's going to be everywhere."}, {"time": 2554, "text": "We know there's a gazillion predictions happening at once."}, {"time": 2559, "text": "So this is where we can start teasing apart, you know, ask questions about, you know, how could neurons be making these predictions?"}, {"time": 2564, "text": "And that sort of built up to now what we have this thousand brains theory, which is complex."}, {"time": 2568, "text": "You know, it's just, I can state it simply, but we just didn't think of it."}, {"time": 2573, "text": "We had to get there step by step, very, it took years to get there."}, {"time": 2579, "text": "And where does reference frames fit in?"}, {"time": 2584, "text": "So again, a reference frame, I mentioned earlier about the model of a house."}, {"time": 2584, "text": "And I said, if you're going to build a model of a house in a computer, they have a reference frame."}, {"time": 2591, "text": "And you can think of reference frame like Cartesian coordinates, like X, Y, and Z axes."}, {"time": 2594, "text": "So I could say, oh, I'm going to design a house."}, {"time": 2599, "text": "I can say, well, the front door is at this location, X, Y, Z, and the roof is at this location, X, Y, Z, and so on."}, {"time": 2604, "text": "That's a type of reference frame."}, {"time": 2609, "text": "So it turns out for you to make a prediction, and I walk you through the thought experiment in the book where I was predicting what my finger was going to feel when I touched a coffee cup."}, {"time": 2617, "text": "It was a ceramic coffee cup, but this one will do."}, {"time": 2617, "text": "And what I realized is that to make a prediction of what my finger's going to feel, like it's going to feel different than this, what's it feel different if I touch the hole or this thing on the bottom, make that prediction."}, {"time": 2628, "text": "The cortex needs to know where the finger is, the tip of the finger, relative to the coffee cup."}, {"time": 2633, "text": "And exactly relative to the coffee cup."}, {"time": 2639, "text": "And to do that, I have to have a reference frame for the coffee cup."}, {"time": 2639, "text": "It has to have a way of representing the location of my finger to the coffee cup."}, {"time": 2643, "text": "And then we realized, of course, every part of your skin has to have a reference frame relative to things that touch."}, {"time": 2651, "text": "And then we did the same thing with vision."}, {"time": 2651, "text": "So the idea that a reference frame is necessary to make a prediction when you're touching something or when you're seeing something and you're moving your eyes or you're moving your fingers, it's just a requirement to predict."}, {"time": 2664, "text": "If I have a structure, I'm going to make a prediction."}, {"time": 2664, "text": "I have to know where it is I'm looking or touching it."}, {"time": 2669, "text": "So then we said, well, how do neurons make reference frames?"}, {"time": 2676, "text": "X, Y, Z coordinates don't exist in the brain."}, {"time": 2676, "text": "It's just not the way it works."}, {"time": 2676, "text": "So that's when we looked at the older part of the brain, the hippocampus and the anterior cortex, where we knew that in that part of the brain, there's a reference frame for a room or a reference frame for an environment."}, {"time": 2689, "text": "Remember, I talked earlier about how you could make a map of this room."}, {"time": 2689, "text": "So we said, oh, they are implementing reference frames there."}, {"time": 2695, "text": "So we knew that reference frames needed to exist in every quarter of a column."}, {"time": 2701, "text": "And so that was a deductive thing."}, {"time": 2701, "text": "We just deduced it."}, {"time": 2701, "text": "It has to exist."}, {"time": 2707, "text": "So you take the old mammalian ability to know where you are in a particular space and you start applying that to higher and higher levels."}, {"time": 2718, "text": "First you apply it to like where your finger is."}, {"time": 2718, "text": "So here's what I think about it."}, {"time": 2722, "text": "The old part of the brain says, where's my body in this room?"}, {"time": 2722, "text": "The new part of the brain says, where's my finger relative to this object?"}, {"time": 2726, "text": "Where is a section of my retina relative to this object?"}, {"time": 2734, "text": "I'm looking at one little corner."}, {"time": 2734, "text": "Where is that relative to this patch of my retina?"}, {"time": 2740, "text": "And then we take the same thing and apply it to concepts, mathematics, physics, humanity, whatever you want to think about."}, {"time": 2747, "text": "And eventually you're pondering your own mortality."}, {"time": 2750, "text": "Well, whatever."}, {"time": 2750, "text": "But the point is when we think about the world, when we have knowledge about the world, how is that knowledge organized, Lex?"}, {"time": 2755, "text": "Where is it in your head?"}, {"time": 2755, "text": "The answer is it's in reference frames."}, {"time": 2760, "text": "So the way I learned the structure of this water bottle where the features are relative to each other, when I think about history or democracy or mathematics, the same basic underlying structure is happening."}, {"time": 2771, "text": "There's reference frames for where the knowledge that you're assigning things to."}, {"time": 2775, "text": "So in the book, I go through examples like mathematics and language and politics."}, {"time": 2779, "text": "But the evidence is very clear in the neuroscience."}, {"time": 2779, "text": "The same mechanism that we use to model this coffee cup, we're going to use to model high level thoughts."}, {"time": 2790, "text": "Your demise of humanity, whatever you want to think about."}, {"time": 2794, "text": "It's interesting to think about how different are the representations of those higher dimensional concepts, higher level concepts, how different the representation there is in terms of reference frames versus spatial."}, {"time": 2805, "text": "But the interesting thing, it's a different application, but it's the exact same mechanism."}, {"time": 2812, "text": "But isn't there some aspect to higher level concepts that they seem to be hierarchical?"}, {"time": 2819, "text": "Like they just seem to integrate a lot of information into them."}, {"time": 2819, "text": "So is our physical objects."}, {"time": 2825, "text": "So take this water bottle."}, {"time": 2825, "text": "I'm not particular to this brand, but this is a Fiji water bottle and it has a logo on it."}, {"time": 2832, "text": "I use this example in my book, our company's coffee cup has a logo on it."}, {"time": 2838, "text": "But this object is hierarchical."}, {"time": 2838, "text": "It's got like a cylinder and a cap, but then it has this logo on it and the logo has a word, the word has letters, the letters have different features."}, {"time": 2849, "text": "And so I don't have to remember, I don't have to think about this."}, {"time": 2849, "text": "So I say, oh, there's a Fiji logo on this water bottle."}, {"time": 2853, "text": "I don't have to go through and say, oh, what is the Fiji logo?"}, {"time": 2857, "text": "It's the F and I and the J and I, and there's a hibiscus flower."}, {"time": 2857, "text": "And, oh, it has the statement on it."}, {"time": 2863, "text": "I don't have to do that."}, {"time": 2863, "text": "I just incorporate all of that in some sort of hierarchical representation."}, {"time": 2867, "text": "I say, put this logo on this water bottle."}, {"time": 2867, "text": "And then the logo has a word and the word has letters, all hierarchical."}, {"time": 2875, "text": "All that stuff is big."}, {"time": 2875, "text": "It's amazing that the brain instantly just does all that."}, {"time": 2879, "text": "The idea that there's water, it's liquid and the idea that you can drink it when you're thirsty, the idea that there's brands and then there's like all of that information is instantly like built into the whole thing once you proceed."}, {"time": 2891, "text": "So I wanted to get back to your point about hierarchical representation."}, {"time": 2897, "text": "The world itself is hierarchical, right?"}, {"time": 2901, "text": "And I can take this microphone in front of me."}, {"time": 2901, "text": "I know inside there's going to be some electronics."}, {"time": 2905, "text": "I know there's going to be some wires and I know there's going to be a little diaphragm that moves back and forth."}, {"time": 2908, "text": "I don't see that, but I know it."}, {"time": 2908, "text": "So everything in the world is hierarchical."}, {"time": 2913, "text": "You just go into a room."}, {"time": 2913, "text": "It's composed of other components."}, {"time": 2913, "text": "The kitchen has a refrigerator."}, {"time": 2917, "text": "The refrigerator has a door."}, {"time": 2917, "text": "The door has a hinge."}, {"time": 2917, "text": "The hinge has screws and pin."}, {"time": 2923, "text": "So anyway, the modeling system that exists in every cortical column learns the hierarchical structure of objects."}, {"time": 2929, "text": "So it's a very sophisticated modeling system in this grain of rice."}, {"time": 2929, "text": "It's hard to imagine, but this grain of rice can do really sophisticated things."}, {"time": 2934, "text": "It's got 100,000 neurons in it."}, {"time": 2938, "text": "It's very sophisticated."}, {"time": 2938, "text": "So that same mechanism that can model a water bottle or a coffee cup can model conceptual objects as well."}, {"time": 2947, "text": "That's the beauty of this discovery that this guy, Vernon Malmkastel, made many, many years ago, which is that there's a single cortical algorithm underlying everything we're doing."}, {"time": 2958, "text": "So common sense concepts and higher level concepts are all represented in the same way?"}, {"time": 2966, "text": "They're set in the same mechanisms, yeah."}, {"time": 2966, "text": "It's a little bit like computers."}, {"time": 2966, "text": "All computers are universal Turing machines."}, {"time": 2971, "text": "Even the little teeny one that's in my toaster and the big one that's running some cloud server someplace."}, {"time": 2977, "text": "They're all running on the same principle."}, {"time": 2977, "text": "They can apply different things."}, {"time": 2981, "text": "So the brain is all built on the same principle."}, {"time": 2981, "text": "It's all about learning these structured models using movement and reference frames."}, {"time": 2986, "text": "And it can be applied to something as simple as a water bottle and a coffee cup."}, {"time": 2993, "text": "And it can be applied to thinking what's the future of humanity and why do you have a hedgehog on your desk?"}, {"time": 3002, "text": "Well, I think it's a hedgehog."}, {"time": 3002, "text": "It's a hedgehog in the fog."}, {"time": 3009, "text": "It's a Russian reference."}, {"time": 3009, "text": "Does it give you any inclination or hope about how difficult it is to engineer common sense reasoning?"}, {"time": 3016, "text": "So how complicated is this whole process?"}, {"time": 3021, "text": "So looking at the brain, is this a marvel of engineering or is it pretty dumb stuff stuck on top of each other over?"}, {"time": 3028, "text": "Can it be both?"}, {"time": 3028, "text": "Can it be both, right?"}, {"time": 3035, "text": "I don't know if it can be both because if it's an incredible engineering job, that means it's so evolution did a lot of work."}, {"time": 3043, "text": "Yeah, but then it just copied that."}, {"time": 3048, "text": "So as I said earlier, figuring out how to model something like a space is really hard and evolution had to go through a lot of trick."}, {"time": 3055, "text": "And these cells I was talking about, these grid cells and place cells, they're really complicated."}, {"time": 3059, "text": "This is not simple stuff."}, {"time": 3063, "text": "This neural tissue works on these really unexpected, weird mechanisms."}, {"time": 3068, "text": "But it did it."}, {"time": 3068, "text": "But now you could just make lots of copies of it."}, {"time": 3073, "text": "But then finding, yeah, so it's a very interesting idea that's a lot of copies of a basic mini brain."}, {"time": 3078, "text": "But the question is how difficult it is to find that mini brain that you can copy and paste effectively."}, {"time": 3085, "text": "Today, we know enough to build this."}, {"time": 3093, "text": "I'm sitting here with, I know the steps we have to go."}, {"time": 3093, "text": "There's still some engineering problems to solve, but we know enough."}, {"time": 3097, "text": "And this is not like, oh, this is an interesting idea."}, {"time": 3097, "text": "We have to go think about it for another few decades."}, {"time": 3103, "text": "No, we actually understand it pretty well in details."}, {"time": 3108, "text": "So not all the details, but most of them."}, {"time": 3108, "text": "So it's complicated, but it is an engineering problem."}, {"time": 3115, "text": "So in my company, we are working on that."}, {"time": 3115, "text": "We are basically a roadmap of how we do this."}, {"time": 3121, "text": "It's not going to take decades."}, {"time": 3121, "text": "It's a matter of a few years optimistically, but I think that's possible."}, {"time": 3126, "text": "It's, you know, complex things."}, {"time": 3126, "text": "If you understand them, you can build them."}, {"time": 3131, "text": "So in which domain do you think it's best to build them?"}, {"time": 3137, "text": "Are we talking about robotics, like entities that operate in the physical world that are able to interact with that world?"}, {"time": 3143, "text": "Are we talking about entities that operate in the digital world?"}, {"time": 3147, "text": "Are we talking about something more like more specific, like it's done in the machine learning community where you look at natural language or computer vision?"}, {"time": 3153, "text": "Where do you think is easiest?"}, {"time": 3161, "text": "It's the first, it's the first two more than the third one, I would say."}, {"time": 3166, "text": "Again, let's just use computers as an analogy."}, {"time": 3166, "text": "The pioneers in computing, people like John Van Norman and Alan Turing, they created this thing, you know, we now call the universal Turing machine, which is a computer, right?"}, {"time": 3176, "text": "Did they know how it was going to be applied?"}, {"time": 3180, "text": "Where it was going to be used?"}, {"time": 3180, "text": "Could they envision any of the future?"}, {"time": 3180, "text": "They just said, this is like a really interesting computational idea about algorithms and how you can implement them in a machine."}, {"time": 3191, "text": "And we're doing something similar to that today."}, {"time": 3191, "text": "Like we are building this sort of universal learning principle that can be applied to many, many different things."}, {"time": 3204, "text": "But the robotics piece of that, the interactive..."}, {"time": 3207, "text": "Let's be just specific."}, {"time": 3207, "text": "You can think of this cortical column as what we call a sensory motor learning system."}, {"time": 3211, "text": "It has the idea that there's a sensor and then it's moving."}, {"time": 3215, "text": "That sensor can be physical."}, {"time": 3215, "text": "It could be like my finger and it's moving in the world."}, {"time": 3219, "text": "It could be like my eye and it's physically moving."}, {"time": 3223, "text": "It can also be virtual."}, {"time": 3223, "text": "So, it could be, an example would be, I could have a system that lives in the internet that actually samples information on the internet and moves by following links."}, {"time": 3235, "text": "That's a sensory motor system."}, {"time": 3235, "text": "Something that echoes the process of a finger moving along a cortical..."}, {"time": 3242, "text": "But in a very, very loose sense."}, {"time": 3242, "text": "It's like, again, learning is inherently about discovering the structure of the world and discover the structure of the world, you have to move through the world."}, {"time": 3250, "text": "Even if it's a virtual world, even if it's a conceptual world, you have to move through it."}, {"time": 3254, "text": "It doesn't exist in one..."}, {"time": 3254, "text": "It has some structure to it."}, {"time": 3260, "text": "So, here's a couple of predictions at getting what you're talking about."}, {"time": 3267, "text": "In humans, the same algorithm does robotics."}, {"time": 3267, "text": "It moves my arms, my eyes, my body."}, {"time": 3274, "text": "And so, in the future, to me, robotics and AI will merge."}, {"time": 3274, "text": "They're not going to be separate fields because the algorithms for really controlling robots are going to be the same algorithms we have in our brain, these sensory motor algorithms."}, {"time": 3285, "text": "Today, we're not there, but I think that's going to happen."}, {"time": 3290, "text": "But not all AI systems will have to be robotics."}, {"time": 3290, "text": "You can have systems that have very different types of embodiments."}, {"time": 3298, "text": "Some will have physical movements, some will not have physical movements."}, {"time": 3302, "text": "It's a very generic learning system."}, {"time": 3302, "text": "Again, it's like computers."}, {"time": 3302, "text": "The Turing machine, it doesn't say how it's supposed to be implemented, it doesn't tell you how big it is, it doesn't tell you what you can apply it to, but it's a computational principle."}, {"time": 3315, "text": "The cortical column equivalent is a computational principle about learning."}, {"time": 3315, "text": "It's about how you learn and it can be applied to a gazillion things."}, {"time": 3320, "text": "I think this impact of AI is going to be as large, if not larger, than computing has been in the last century, by far, because it's getting at a fundamental thing."}, {"time": 3333, "text": "It's not a vision system or a learning system."}, {"time": 3333, "text": "It's not a vision system or a hearing system."}, {"time": 3337, "text": "It is a learning system."}, {"time": 3337, "text": "It's a fundamental principle, how you learn the structure in the world, how you can gain knowledge and be intelligent."}, {"time": 3341, "text": "That's what the thousand brains says was going on."}, {"time": 3346, "text": "We have a particular implementation in our head, but it doesn't have to be like that at all."}, {"time": 3349, "text": "Do you think there's going to be some kind of impact?"}, {"time": 3349, "text": "Okay, let me ask it another way."}, {"time": 3356, "text": "What do increasingly intelligent AI systems do with us humans in the following way?"}, {"time": 3356, "text": "How hard is the human in the loop problem?"}, {"time": 3365, "text": "How hard is it to interact?"}, {"time": 3365, "text": "The finger on the coffee cup equivalent of having a conversation with a human being."}, {"time": 3373, "text": "How hard is it to fit into our little human world?"}, {"time": 3380, "text": "I think it's a lot of engineering problems."}, {"time": 3380, "text": "I don't think it's a fundamental problem."}, {"time": 3385, "text": "I could ask you the same question."}, {"time": 3385, "text": "How hard is it for computers to fit into a human world?"}, {"time": 3388, "text": "That's essentially what I'm asking."}, {"time": 3388, "text": "How elitist are we as humans?"}, {"time": 3388, "text": "We try to keep out systems."}, {"time": 3400, "text": "I'm not sure that's the right question."}, {"time": 3400, "text": "Let's look at computers as an analogy."}, {"time": 3408, "text": "Computers are a million times faster than us."}, {"time": 3408, "text": "They do things we can't understand."}, {"time": 3412, "text": "Most people have no idea what's going on when they use computers."}, {"time": 3412, "text": "How do we integrate them in our society?"}, {"time": 3417, "text": "Well, we don't think of them as their own entity."}, {"time": 3417, "text": "They're not living things."}, {"time": 3424, "text": "We don't afford them rights."}, {"time": 3424, "text": "We rely on them."}, {"time": 3424, "text": "Our survival as seven billion people or something like that is relying on computers now."}, {"time": 3432, "text": "Don't you think that's a fundamental problem that we see them as something we don't give rights to?"}, {"time": 3442, "text": "Computers?"}, {"time": 3442, "text": "Yeah, computers."}, {"time": 3442, "text": "Robots, computers, intelligence systems."}, {"time": 3445, "text": "It feels like for them to operate successfully, they would need to have a lot of the elements that we would start having to think about."}, {"time": 3457, "text": "Should this entity have rights?"}, {"time": 3457, "text": "I think it's tempting to think that way."}, {"time": 3462, "text": "First of all, hardly anyone thinks that for computers today."}, {"time": 3467, "text": "No one says, oh, this thing needs a right."}, {"time": 3467, "text": "I shouldn't be able to turn it off."}, {"time": 3467, "text": "If I throw it in the trash can and hit it with a sledgehammer, it might form a criminal act."}, {"time": 3472, "text": "No one thinks that."}, {"time": 3479, "text": "Now we think about intelligent machines, which is where you're going."}, {"time": 3485, "text": "All of a sudden, you're like, well, now we can't do that."}, {"time": 3485, "text": "I think the basic problem we have here is that people think intelligent machines will be like us."}, {"time": 3490, "text": "They're going to have the same emotions as we do, the same feelings as we do."}, {"time": 3494, "text": "What if I can build an intelligent machine that absolutely could care less about whether it was on or off or destroyed or not?"}, {"time": 3499, "text": "It just doesn't care."}, {"time": 3499, "text": "It's just like a map."}, {"time": 3503, "text": "There's no desires to live."}, {"time": 3508, "text": "Is it possible to create a system that can model the world deeply and not care about whether it lives or dies?"}, {"time": 3518, "text": "To me, that's not 100% obvious."}, {"time": 3518, "text": "It's obvious to me."}, {"time": 3518, "text": "We can debate it if we want."}, {"time": 3523, "text": "Where does your desire to live come from?"}, {"time": 3523, "text": "It's an old evolutionary design."}, {"time": 3523, "text": "We could argue, does it really matter if we live or not?"}, {"time": 3532, "text": "Objectively, no."}, {"time": 3532, "text": "We're all going to die eventually."}, {"time": 3540, "text": "Evolution makes us want to live."}, {"time": 3540, "text": "Evolution makes us want to fight to live."}, {"time": 3540, "text": "Evolution makes us want to care and love one another and to care for our children and our relatives and our family and so on."}, {"time": 3551, "text": "Those are all good things."}, {"time": 3551, "text": "They come about not because we're smart, because we're animals that grew up."}, {"time": 3558, "text": "The hummingbird in my backyard cares about its offspring."}, {"time": 3558, "text": "Every living thing in some sense cares about surviving."}, {"time": 3565, "text": "When we talk about creating intelligent machines, we're not creating life."}, {"time": 3570, "text": "We're not creating evolving creatures."}, {"time": 3570, "text": "We're not creating living things."}, {"time": 3575, "text": "We're just creating a machine that can learn really sophisticated stuff."}, {"time": 3575, "text": "That machine, it may even be able to talk to us."}, {"time": 3580, "text": "It's not going to have a desire to live unless somehow we put it into that system."}, {"time": 3587, "text": "Well, there's learning, right?"}, {"time": 3587, "text": "The thing is..."}, {"time": 3587, "text": "But you don't learn to want to live."}, {"time": 3592, "text": "It's built into you."}, {"time": 3592, "text": "It's part of your DNA."}, {"time": 3592, "text": "People like Ernest Becker argue, there's the fact of finiteness of life."}, {"time": 3599, "text": "The way we think about it is something we learned, perhaps."}, {"time": 3606, "text": "Some people decide they don't want to live."}, {"time": 3606, "text": "Some people decide the desire to live is built in DNA, right?"}, {"time": 3613, "text": "But I think what I'm trying to get to is in order to accomplish goals, it's useful to have the urgency of mortality."}, {"time": 3618, "text": "It's what the Stoics talked about, is meditating in your mortality."}, {"time": 3623, "text": "It might be a very useful thing to do to die and have the urgency of death and to realize that to conceive yourself as an entity that operates in this world that eventually will no longer be a part of this world and actually conceive of yourself as a conscious entity might be very useful for you to be a system that makes sense of the world."}, {"time": 3643, "text": "Otherwise, you might get lazy."}, {"time": 3649, "text": "We're going to build these machines, right?"}, {"time": 3649, "text": "So we're talking about building AIs."}, {"time": 3655, "text": "But we're building the equivalent of the cortical columns."}, {"time": 3663, "text": "And the question is, where do they arrive at?"}, {"time": 3663, "text": "Because we're not hard coding everything in."}, {"time": 3671, "text": "Well, in terms of if you build the neocortex equivalent, it will not have any of these desires or emotional states."}, {"time": 3677, "text": "Now, you can argue that that neocortex won't be useful unless I give it some agency, unless I give it some desire, unless I give it some motivation."}, {"time": 3688, "text": "Otherwise, you'll be just lazy and do nothing, right?"}, {"time": 3691, "text": "You could argue that."}, {"time": 3691, "text": "But on its own, it's not going to do those things."}, {"time": 3691, "text": "It's just not going to sit there and say, I understand the world."}, {"time": 3697, "text": "Therefore, I care to live."}, {"time": 3697, "text": "No, it's not going to do that."}, {"time": 3701, "text": "It's just going to say, I understand the world."}, {"time": 3701, "text": "Why is that obvious to you?"}, {"time": 3706, "text": "Okay, let me ask it this way."}, {"time": 3706, "text": "Do you think it's possible it will at least assign to itself agency and perceive itself in this world as being a conscious entity as a useful way to operate in the world and to make sense of the world?"}, {"time": 3724, "text": "I think an intelligent machine can be conscious, but that does not, again, imply any of these desires and goals that you're worried about."}, {"time": 3738, "text": "We can talk about what it means for a machine to be conscious."}, {"time": 3740, "text": "By the way, not worry about, but get excited about."}, {"time": 3740, "text": "It's not necessary that we should worry about it."}, {"time": 3744, "text": "I think there's a legitimate problem or not problem, a question asked, if you build this modeling system, what's it going to model?"}, {"time": 3749, "text": "What's its desire?"}, {"time": 3749, "text": "What's its goal?"}, {"time": 3755, "text": "What are we applying it to?"}, {"time": 3755, "text": "One thing, and it depends on the application, it's not something that inherent to the modeling system."}, {"time": 3762, "text": "It's something we apply to the modeling system in a particular way."}, {"time": 3766, "text": "If I wanted to make a really smart car, it would have to know about driving and cars and what's important in driving and cars."}, {"time": 3778, "text": "It's not going to figure that on its own."}, {"time": 3778, "text": "It's not going to sit there and say, I've understood the world and I've decided, no, no, no, no, we're going to have to tell it."}, {"time": 3781, "text": "We're going to have to say, so I imagine I make this car really smart."}, {"time": 3786, "text": "It learns about your driving habits."}, {"time": 3786, "text": "It learns about the world."}, {"time": 3790, "text": "Is it one day going to wake up and say, you know what?"}, {"time": 3790, "text": "I'm tired of driving and doing what you want."}, {"time": 3797, "text": "I think I have better ideas about how to spend my time."}, {"time": 3802, "text": "Well, part of me is playing a little bit of devil's advocate, but part of me is also trying to think through this because I've studied cars quite a bit and I studied pedestrians and cyclists quite a bit."}, {"time": 3812, "text": "And there's part of me that thinks that there needs to be more intelligence than we realize in order to drive successfully."}, {"time": 3826, "text": "That game theory of human interaction seems to require some deep understanding of human nature that, okay."}, {"time": 3834, "text": "When a pedestrian crosses the street, there's some sense."}, {"time": 3834, "text": "They look at a car usually, and then they look away."}, {"time": 3844, "text": "There's some sense in which they say, I believe that you're not going to murder me."}, {"time": 3850, "text": "You don't have the guts to murder me."}, {"time": 3850, "text": "This is the little dance of pedestrian car interaction is saying, I'm going to look away and I'm going to put my life in your hands because I think you're human."}, {"time": 3862, "text": "You're not going to kill me."}, {"time": 3862, "text": "And then the car in order to successfully operate in like Manhattan streets has to say, no, no, no, no."}, {"time": 3868, "text": "I am going to kill you like a little bit."}, {"time": 3874, "text": "There's a little bit of this weird inkling of mutual murder."}, {"time": 3874, "text": "And that's a dance and somehow successfully operate through that."}, {"time": 3880, "text": "Do you think you were born of that?"}, {"time": 3880, "text": "Did you learn that social interaction?"}, {"time": 3884, "text": "I think it might have a lot of the same elements that you're talking about, which is we're leveraging things we were born with and applying them in the context that."}, {"time": 3897, "text": "I would have said that that kind of interaction is learned because people in different cultures to have different interactions like that."}, {"time": 3903, "text": "If you cross the street in different cities and different parts of the world, they have different ways of interacting."}, {"time": 3906, "text": "I would say that's learned."}, {"time": 3910, "text": "And I would say an intelligent system can learn that too, but that does not lead."}, {"time": 3910, "text": "And the intelligent system can understand humans."}, {"time": 3915, "text": "It could understand that just like I can study an animal and learn something about that animal."}, {"time": 3924, "text": "I could study apes and learn something about their culture and so on."}, {"time": 3928, "text": "I don't have to be an ape to know that."}, {"time": 3928, "text": "I may not be completely, but I can understand something."}, {"time": 3934, "text": "So intelligent machine can model that."}, {"time": 3934, "text": "That's just part of the world."}, {"time": 3934, "text": "It's just part of the interactions."}, {"time": 3937, "text": "The question we're trying to get at, will the intelligent machine have its own personal agency that's beyond what we assign to it or its own personal goals or will it evolve and create these things?"}, {"time": 3949, "text": "My confidence comes from understanding the mechanisms I'm talking about creating."}, {"time": 3955, "text": "This is not hand wavy stuff."}, {"time": 3955, "text": "It's down in the details."}, {"time": 3955, "text": "I'm going to build it."}, {"time": 3955, "text": "And I know what it's going to look like."}, {"time": 3960, "text": "And I know what it's going to behave."}, {"time": 3960, "text": "I know what the kind of things it could do and the kind of things it can't do."}, {"time": 3963, "text": "Just like when I build a computer, I know it's not going to, on its own, decide to put another register inside of it."}, {"time": 3968, "text": "It can't do that."}, {"time": 3973, "text": "No matter what your software does, it can't add a register to the computer."}, {"time": 3977, "text": "So in this way, when we build AI systems, we have to make choices about how we embed them."}, {"time": 3986, "text": "So I talk about this in the book."}, {"time": 3986, "text": "I said intelligent system is not just the neocortex equivalent."}, {"time": 3990, "text": "You have to have that."}, {"time": 3990, "text": "But it has to have some kind of embodiment, physical or virtual."}, {"time": 3996, "text": "It has to have some sort of goals."}, {"time": 3996, "text": "It has to have some sort of ideas about dangers, about things it shouldn't do."}, {"time": 4001, "text": "We build in safeguards into systems."}, {"time": 4001, "text": "We have them in our bodies."}, {"time": 4007, "text": "We put them into cars."}, {"time": 4007, "text": "My car follows my directions until the day it sees I'm about to hit something and it ignores my directions and puts the brakes on."}, {"time": 4013, "text": "So we can build those things in."}, {"time": 4018, "text": "So that's a very interesting problem, how to build those in."}, {"time": 4018, "text": "I think my differing opinion about the risks of AI for most people is that people assume that somehow those things will disappear automatically and evolve."}, {"time": 4031, "text": "And intelligence itself begets that stuff or requires it."}, {"time": 4037, "text": "Intelligence of the neocortex equipment doesn't require this."}, {"time": 4037, "text": "The neocortex equipment just says, I'm a learning system."}, {"time": 4041, "text": "Tell me what you want me to learn and ask me questions and I'll tell you the answers."}, {"time": 4046, "text": "And that, again, it's again like a map."}, {"time": 4046, "text": "A map has no intent about things, but you can use it to solve problems."}, {"time": 4053, "text": "So the building, engineering the neocortex in itself is just creating an intelligent prediction system."}, {"time": 4065, "text": "Modeling system."}, {"time": 4065, "text": "Sorry, modeling system."}, {"time": 4065, "text": "You can use it to then make predictions."}, {"time": 4072, "text": "But you can also put it inside a thing that's actually acting in this world."}, {"time": 4076, "text": "You have to put it inside something."}, {"time": 4076, "text": "Again, think of the map analogy, right?"}, {"time": 4076, "text": "A map on its own doesn't do anything."}, {"time": 4082, "text": "It's just inert."}, {"time": 4082, "text": "It can learn, but it's just inert."}, {"time": 4082, "text": "So we have to embed it somehow in something to do something."}, {"time": 4087, "text": "So what's your intuition here?"}, {"time": 4087, "text": "You had a conversation with Sam Harris recently that was sort of, you've had a bit of a disagreement and you're sticking on this point."}, {"time": 4100, "text": "Elon Musk, Stuart Russell kind of have us worry existential threats of AI."}, {"time": 4109, "text": "Why, if we engineer increasingly intelligent neocortex type of system in the computer, why that shouldn't be a thing that we..."}, {"time": 4120, "text": "It was interesting to use the word intuition and Sam Harris used the word intuition too."}, {"time": 4124, "text": "And we didn't use that intuition, that word."}, {"time": 4124, "text": "I immediately stopped and said, oh, that's the crux of the problem."}, {"time": 4127, "text": "He's using intuition."}, {"time": 4127, "text": "I'm not speaking about my intuition."}, {"time": 4132, "text": "I'm speaking about something I understand, something I'm going to build, something I am building, something I understand completely, or at least well enough to know what..."}, {"time": 4136, "text": "I'm guessing, I know what this thing's going to do."}, {"time": 4141, "text": "And I think most people who are worried, they have trouble separating out..."}, {"time": 4148, "text": "They don't have the knowledge or the understanding about what is intelligence, how's it manifest in the brain, how's it separate from these other functions in the brain."}, {"time": 4157, "text": "And so they imagine it's going to be human like or animal like."}, {"time": 4157, "text": "It's going to have the same sort of drives and emotions we have, but there's no reason for that."}, {"time": 4161, "text": "That's just because there's an unknown."}, {"time": 4167, "text": "If the unknown is like, oh my God, I don't know what this is going to do."}, {"time": 4167, "text": "We have to be careful."}, {"time": 4171, "text": "It could be like us, but really smarter."}, {"time": 4171, "text": "I'm saying, no, it won't be like us."}, {"time": 4171, "text": "It'll be really smarter, but it won't be like us at all."}, {"time": 4175, "text": "But I'm coming from that, not because I'm just guessing, I'm not using intuition."}, {"time": 4182, "text": "I'm basing it on like, okay, I understand this thing works."}, {"time": 4182, "text": "This is what it does."}, {"time": 4186, "text": "It makes money to you."}, {"time": 4186, "text": "But to push back, so I also disagree with the intuitions that Sam has, but I also disagree with what you just said, which, you know, what's a good analogy."}, {"time": 4194, "text": "So if you look at the Twitter algorithm in the early days, just recommender systems, you can understand how recommender systems work."}, {"time": 4208, "text": "What you can't understand in the early days is when you apply that recommender system at scale to thousands and millions of people, how that can change societies."}, {"time": 4220, "text": "So the question is, yes, you're just saying this is how an engineer in your cortex works, but the, like when you have a very useful, uh, TikTok type of service that goes viral when your neural cortex goes viral and then millions of people start using it, can that destroy the world?"}, {"time": 4240, "text": "Uh, well, first of all, this is back."}, {"time": 4240, "text": "One thing I want to say is that, um, AI is a dangerous technology."}, {"time": 4244, "text": "I don't, I'm not denying that."}, {"time": 4244, "text": "All technology is dangerous."}, {"time": 4244, "text": "Well, and AI, maybe particularly so."}, {"time": 4248, "text": "So, um, am I worried about it?"}, {"time": 4248, "text": "Yeah, I'm totally worried about it."}, {"time": 4254, "text": "The thing where the narrow component we're talking about now is the existential risk of AI, right?"}, {"time": 4260, "text": "So I want to make that distinction because I think AI can be applied poorly."}, {"time": 4260, "text": "It can be applied in ways that, you know, people are going to understand the consequences of it."}, {"time": 4265, "text": "Um, these are all potentially very bad things, but they're not the AI system creating this existential risk on its own."}, {"time": 4278, "text": "And that's the only place that I disagree with other people."}, {"time": 4278, "text": "So I, I think the existential risk thing is, um, humans are really damn good at surviving."}, {"time": 4283, "text": "So to kill off the human race, it'd be very, very difficult."}, {"time": 4289, "text": "Yes, but you can even, I'll go further."}, {"time": 4289, "text": "I don't think AI systems are ever going to try to, I don't think AI systems are ever going to like say, I'm going to ignore you."}, {"time": 4300, "text": "I'm going to do what I think is best."}, {"time": 4300, "text": "Um, I don't think that's going to happen, at least not in the way I'm talking about it."}, {"time": 4306, "text": "So you, the Twitter recommendation algorithm is an interesting example."}, {"time": 4312, "text": "Let's, let's use computers as an analogy again, right?"}, {"time": 4312, "text": "I build a computer."}, {"time": 4312, "text": "It's a universal computing machine."}, {"time": 4319, "text": "I can't predict what people are going to use it for."}, {"time": 4319, "text": "They can build all kinds of things."}, {"time": 4323, "text": "They can, they can even create computer viruses."}, {"time": 4323, "text": "It's, you know, all kinds of stuff."}, {"time": 4323, "text": "So there's some unknown about its utility and about where it's going to go."}, {"time": 4329, "text": "But on the other hand, I pointed out that once I build a computer, it's not going to fundamentally change how it computes."}, {"time": 4338, "text": "It's like, I use the example of a register, which is a part, internal part of a computer."}, {"time": 4338, "text": "Um, you know, I say it can't just sit there because computers don't evolve."}, {"time": 4343, "text": "They don't replicate, they don't evolve."}, {"time": 4347, "text": "They don't, you know, the physical manifestation of the computer itself is not going to, there's certain things that can't do right."}, {"time": 4351, "text": "So we can break into things like things that are possible to happen."}, {"time": 4356, "text": "We can't predict and things that are just impossible to happen."}, {"time": 4360, "text": "Unless we go out of our way to make them happen, they're not going to happen unless somebody makes them happen."}, {"time": 4364, "text": "So there's, there's a bunch of things to say."}, {"time": 4364, "text": "One is the physical aspect, which you're absolutely right."}, {"time": 4369, "text": "We have to build a thing for it to operate in the physical world and you can just stop building them."}, {"time": 4374, "text": "Uh, you know, the moment they're not doing the thing you want them to do or just change the design or change the design."}, {"time": 4381, "text": "The question is, I mean, there's, uh, it's possible in the physical world."}, {"time": 4385, "text": "This is probably longer term is you automate the building."}, {"time": 4390, "text": "It makes, it makes a lot of sense to automate the building."}, {"time": 4390, "text": "There's a lot of factories that are doing more and more and more automation to go from raw resources to the final product."}, {"time": 4399, "text": "It's possible to imagine that obviously much more efficient to keep, to create a factory that's creating robots that do something, uh, you know, that do something extremely useful for society."}, {"time": 4410, "text": "It could be a personal assistance."}, {"time": 4410, "text": "It could be, uh, it could, it could be your toaster, but a toaster as much as deeper knowledge of your culinary preferences."}, {"time": 4415, "text": "And that could, uh, I think now you've hit on the right thing."}, {"time": 4421, "text": "The real thing we need to be worried about is self replication."}, {"time": 4426, "text": "That is the thing that we're in the physical world or even the virtual world self replication because self replication is dangerous."}, {"time": 4431, "text": "It's probably more likely to be killed by a virus, you know, or a human hand veneered virus."}, {"time": 4436, "text": "Anybody can create a, you know, there's the technology is getting so almost anybody, but not anybody, but a lot of people could create a human engineered virus that could wipe out humanity."}, {"time": 4445, "text": "That is really dangerous."}, {"time": 4445, "text": "No intelligence required, just self replication."}, {"time": 4451, "text": "So, um, so we need to be careful about that."}, {"time": 4458, "text": "So when I think about, you know, AI, I'm not thinking about robots, building robots."}, {"time": 4464, "text": "Don't build a, you know, just, well, that's because you're interesting creating intelligence."}, {"time": 4468, "text": "It seems like self replication is a good way to make a lot of money."}, {"time": 4468, "text": "Well, fine."}, {"time": 4475, "text": "But so is, you know, maybe editing viruses is a good way too."}, {"time": 4475, "text": "The point is, if as a society, when we want to look at existential risks, the existential risks we face that we can control almost all evolve around self replication."}, {"time": 4486, "text": "The question is, I don't see a good, uh, way to make a lot of money by engineering viruses and deploying them on the world."}, {"time": 4494, "text": "There could be, there could be applications that are useful, but let's separate out, let's separate out."}, {"time": 4504, "text": "I mean, you don't need to, you only need some, you know, terrorists who wants to do it."}, {"time": 4504, "text": "Cause it doesn't take a lot of money to make viruses."}, {"time": 4508, "text": "Um, let's just separate out what's risky and what's not risky."}, {"time": 4513, "text": "I'm arguing that the intelligence side of this equation is not risky."}, {"time": 4513, "text": "It's not risky at all."}, {"time": 4518, "text": "It's the self replication side of the equation that's risky."}, {"time": 4518, "text": "And I'm arguing that it's not risky."}, {"time": 4523, "text": "And I'm not dismissing that."}, {"time": 4523, "text": "I'm scared as hell."}, {"time": 4523, "text": "It's like the paperclip maximizer thing."}, {"time": 4528, "text": "Those are often like talked about in the same conversation."}, {"time": 4535, "text": "Um, I think you're right."}, {"time": 4535, "text": "Like creating ultra intelligent, super intelligent systems is not necessarily coupled with a self replicating arbitrarily self replicating systems."}, {"time": 4542, "text": "And you don't get evolution unless you're self replicating."}, {"time": 4547, "text": "And so I think that's the gist of this argument that people have trouble separating those two out."}, {"time": 4552, "text": "They just think, Oh yeah, intelligence looks like us."}, {"time": 4556, "text": "And look how, look at the damage we've done to this planet, like how we've, you know, destroyed all these other species."}, {"time": 4560, "text": "Well we replicate, which the 8 billion of us are 7 billion of us now."}, {"time": 4564, "text": "So, um, I think the idea is that the, the more intelligent we're able to build systems, the more tempting it becomes from a capitalist perspective of creating products, the more tempting it becomes to create self, uh, reproducing systems."}, {"time": 4581, "text": "So let's say that's true."}, {"time": 4581, "text": "So does that mean we don't build intelligent systems?"}, {"time": 4586, "text": "No, that means we regulate, we, we understand the risks."}, {"time": 4586, "text": "Uh, we regulate them."}, {"time": 4586, "text": "Uh, you know, look, there's a lot of things we could do as society, which have some sort of financial benefit to someone, which could do a lot of harm."}, {"time": 4597, "text": "And we have to learn how to regulate those things."}, {"time": 4602, "text": "We have to learn how to deal with those things."}, {"time": 4602, "text": "I will argue this."}, {"time": 4602, "text": "I would say the opposite."}, {"time": 4602, "text": "Like I would say having intelligent machines at our disposal will actually help us in the end more, because it'll help us understand these risks better."}, {"time": 4612, "text": "It'll help us mitigate these risks better."}, {"time": 4615, "text": "It might be ways of saying, oh, well, how do we solve climate change problems?"}, {"time": 4615, "text": "You know, how do we do this?"}, {"time": 4619, "text": "Or how do we do that?"}, {"time": 4619, "text": "Um, that just like computers are dangerous in the hands of the wrong people, but they've been so great for so many other things."}, {"time": 4625, "text": "We live with those dangers."}, {"time": 4629, "text": "And I think we have to do the same with intelligent machines."}, {"time": 4629, "text": "We just, but we have to be constantly vigilant about this idea of a bad actors doing bad things with them and be, um, don't ever, ever create a self replicating system."}, {"time": 4639, "text": "Um, uh, and, and by the way, I don't even know if you could create a self replicating system that uses a factory."}, {"time": 4650, "text": "You know, nature's way of self replicating is so amazing."}, {"time": 4650, "text": "Um, you know, it doesn't require anything."}, {"time": 4656, "text": "It just, you know, the thing and resources and it goes right."}, {"time": 4656, "text": "Um, if I said to you, you know what we have to build, uh, our goal is to build a factory that can make that builds new factories and it has to end to end supply chain."}, {"time": 4666, "text": "It has to bind the resources, get the energy."}, {"time": 4674, "text": "I mean, that's really hard."}, {"time": 4674, "text": "It's, you know, no one's doing that in the next, you know, a hundred years."}, {"time": 4680, "text": "I've been extremely impressed by the efforts of Elon Musk and Tesla to try to do exactly that."}, {"time": 4686, "text": "Not, not from raw resource."}, {"time": 4686, "text": "Well, he actually, I think states the goal is to go from raw resource to the, uh, the final car in one factory."}, {"time": 4692, "text": "That's the main goal."}, {"time": 4692, "text": "Of course, it's not currently possible, but they're taking huge leaps."}, {"time": 4699, "text": "Well, he's not the only one to do that."}, {"time": 4703, "text": "This has been a goal for many industries for a long, long time."}, {"time": 4703, "text": "Um, it's difficult to do."}, {"time": 4708, "text": "Well, a lot of people, what they do is instead they have like a million suppliers and then they like there's everybody's, they all co locate them and they, and they tie the systems together."}, {"time": 4720, "text": "It's a fundamental, I think that's, that also is not getting at the issue I was just talking about, um, which is self replication."}, {"time": 4725, "text": "It's, um, I mean, self replication means there's no entity involved other than the entity that's replicating."}, {"time": 4733, "text": "Um, right."}, {"time": 4733, "text": "And so if there are humans in this, in the loop, that's not really self replicating, right?"}, {"time": 4738, "text": "It's unless somehow we're duped into doing it."}, {"time": 4744, "text": "But it's also, I don't necessarily agree with you because you've kind of mentioned that AI will not say no to us."}, {"time": 4756, "text": "I just think they will."}, {"time": 4756, "text": "So like, uh, I think it's a useful feature to build in."}, {"time": 4756, "text": "I'm just trying to like, uh, put myself in the mind of engineers to sometimes say no, you know, if you, I gave the example earlier, right?"}, {"time": 4772, "text": "I gave the example of my car, right?"}, {"time": 4772, "text": "My car turns the wheel and, and applies the accelerator and the brake as I say, until it decides there's something dangerous."}, {"time": 4783, "text": "And then it doesn't do that."}, {"time": 4783, "text": "Now that was something it didn't decide to do."}, {"time": 4783, "text": "It's something we programmed into the car."}, {"time": 4790, "text": "And so good."}, {"time": 4790, "text": "It was a good idea, right?"}, {"time": 4790, "text": "The question again, isn't like if we create an intelligent system, will it ever ignore our commands?"}, {"time": 4797, "text": "And sometimes is it going to do it because it came up, came up with its own goals that serve its purposes and it doesn't care about our purposes?"}, {"time": 4808, "text": "No, I don't think that's going to happen."}, {"time": 4812, "text": "So let me ask you about these, uh, super intelligent cortical systems that we engineer and us humans, do you think, uh, with these entities operating out there in the world, what is the future most promising future look like?"}, {"time": 4824, "text": "Is it us merging with them or is it us?"}, {"time": 4833, "text": "Like, how do we keep us humans around when you have increasingly intelligent beings?"}, {"time": 4833, "text": "Is it, uh, one of the dreams is to upload our minds in the digital space."}, {"time": 4838, "text": "So can we just give our minds to these, uh, systems so they can operate on them?"}, {"time": 4842, "text": "Is there some kind of more interesting merger or is there more, more communication?"}, {"time": 4848, "text": "I talked about all these scenarios and let me just walk through them."}, {"time": 4852, "text": "Um, the uploading the mind one."}, {"time": 4852, "text": "Extremely, really difficult to do."}, {"time": 4860, "text": "Like, like, we have no idea how to do this even remotely right now."}, {"time": 4860, "text": "Um, so it would be a very long way away, but I make the argument you wouldn't like the result."}, {"time": 4871, "text": "Um, and you wouldn't be pleased with the result."}, {"time": 4871, "text": "It's really not what you think it's going to be."}, {"time": 4876, "text": "Um, imagine I could upload your brain into a, into a computer right now."}, {"time": 4876, "text": "And now the computer sitting there going, Hey, I'm over here."}, {"time": 4880, "text": "Get rid of that old bio person."}, {"time": 4880, "text": "I don't need them."}, {"time": 4884, "text": "You're still sitting here."}, {"time": 4884, "text": "No, no, that's not me."}, {"time": 4888, "text": "Are you going to feel satisfied then?"}, {"time": 4888, "text": "Then you, but people imagine, look, I'm on my deathbed and I'm about to, you know, expire and I pushed the button and now I'm uploaded."}, {"time": 4893, "text": "But think about it a little differently."}, {"time": 4898, "text": "And, and so I don't think it's going to be a thing because people, by the time we're able to do this, if ever, because you have to replicate the entire body, not just the brain."}, {"time": 4907, "text": "It's, it's really, it's, I walked through the issues."}, {"time": 4907, "text": "It's really substantial."}, {"time": 4912, "text": "Um, do you have a sense of what makes us us?"}, {"time": 4912, "text": "Is there, is there a shortcut to what can only save a certain part that makes us truly ours?"}, {"time": 4919, "text": "No, but I think that machine would feel like it's you too."}, {"time": 4924, "text": "You have two people, just like I have a child, I have a child, right?"}, {"time": 4924, "text": "I have two daughters."}, {"time": 4928, "text": "They're independent people."}, {"time": 4928, "text": "I created them."}, {"time": 4928, "text": "Well, partly."}, {"time": 4928, "text": "And, um, uh, I don't, just because they're somewhat like me, I don't feel on them and they don't feel like I'm me."}, {"time": 4936, "text": "So if you split apart, you have two people."}, {"time": 4940, "text": "So we can tell them, come back to what, what makes, what consciousness do you want?"}, {"time": 4944, "text": "We can talk about that, but we don't have like remote consciousness."}, {"time": 4948, "text": "I'm not sitting there going, Oh, I'm conscious of that."}, {"time": 4948, "text": "You know, I mean, that system of, so let's say, let's, let's stay on our topic."}, {"time": 4952, "text": "One was uploading a brand."}, {"time": 4952, "text": "It ain't gonna happen in a hundred years, maybe a thousand, but I don't think people are going to want to do it."}, {"time": 4958, "text": "The merging your mind with, uh, you know, the neural link thing, right?"}, {"time": 4964, "text": "Like again, really, really difficult."}, {"time": 4970, "text": "It's, it's one thing to make progress, to control a prosthetic arm."}, {"time": 4970, "text": "It's another to have like a billion or several billion, you know, things and understanding what those signals mean."}, {"time": 4978, "text": "Like it's the one thing that like, okay, I can learn to think some patterns to make something happen."}, {"time": 4983, "text": "It's quite another thing to have a system, a computer, which actually knows exactly what cells it's talking to and how it's talking to them and interacting in a way like that."}, {"time": 4988, "text": "Very, very difficult."}, {"time": 4992, "text": "We're not getting anywhere closer to that."}, {"time": 4992, "text": "Um, interesting."}, {"time": 4992, "text": "Can I, can I, uh, can I ask a question here?"}, {"time": 4998, "text": "What, so for me, what makes that merger very difficult practically in the next 10, 20, 50 years is like literally the biology side of it, which is like, it's just hard to do that kind of surgery in a safe way."}, {"time": 5012, "text": "But your intuition is even the machine learning part of it, where the machine has to learn what the heck it's talking to."}, {"time": 5018, "text": "That's even hard."}, {"time": 5018, "text": "I think it's even harder."}, {"time": 5023, "text": "And it's not, it's, it's easy to do when you're talking about hundreds of signals."}, {"time": 5023, "text": "It's, it's a totally different thing to say, talking about billions of years."}, {"time": 5029, "text": "It's, it's a totally different thing to say, talking about billions of signals."}, {"time": 5033, "text": "So you don't think it's the raw, the it's a machine learning problem."}, {"time": 5037, "text": "You don't think it could be learned?"}, {"time": 5037, "text": "Well, I'm just saying, no, I think you'd have to have detailed knowledge."}, {"time": 5041, "text": "You'd have to know exactly what the types of neurons you're connecting to."}, {"time": 5045, "text": "I mean, in the brain, there's these, there are all different types of things."}, {"time": 5049, "text": "It's not like a neural network."}, {"time": 5049, "text": "It's a very complex organism system up here."}, {"time": 5049, "text": "We talked about the grid cells or the place cells, you know, you have to know what kind of cells you're talking to and what they're doing and how their timing works and all, all this stuff, which you can't today."}, {"time": 5060, "text": "There's no way of doing that."}, {"time": 5060, "text": "But I think it's, I think it's a, I think the problem you're right."}, {"time": 5064, "text": "That the biological aspect of like who wants to have a surgery and have this stuff inserted in your brain."}, {"time": 5068, "text": "But this is when we solve that problem."}, {"time": 5072, "text": "I think the, the information coding aspect is much worse."}, {"time": 5072, "text": "I think that's much worse."}, {"time": 5078, "text": "It's not like what they're doing today."}, {"time": 5078, "text": "It's simple machine learning stuff because you're doing simple things."}, {"time": 5082, "text": "But if you want to merge your brain, like I'm thinking on the internet, I'm merged my brain with the machine and we're both doing, that's a totally different issue."}, {"time": 5091, "text": "I tend to think if the, okay."}, {"time": 5091, "text": "If you have a super clean signal from a bunch of neurons at the start, you don't know what those neurons are."}, {"time": 5097, "text": "I think that's much easier than the getting of the clean signal."}, {"time": 5104, "text": "I think if you think about today's machine learning, that's what you would conclude."}, {"time": 5110, "text": "I'm thinking about what's going on in the brain and I don't reach that conclusion."}, {"time": 5114, "text": "So we'll have to see."}, {"time": 5114, "text": "But I don't think even, even then, I think this kind of a sad future."}, {"time": 5120, "text": "Like, you know, do I, do I have to like plug my brain into a computer?"}, {"time": 5126, "text": "I'm still a biological organism."}, {"time": 5126, "text": "I assume I'm still going to die."}, {"time": 5130, "text": "So what have I achieved?"}, {"time": 5130, "text": "You know, what have I achieved?"}, {"time": 5130, "text": "Oh, I disagree that we don't know what those are, but it seems like there could be a lot of different applications."}, {"time": 5136, "text": "It's like virtual reality is to expand your brain's capability to, to like, to read Wikipedia."}, {"time": 5147, "text": "But, but fine."}, {"time": 5147, "text": "But, but you're still a biological organism."}, {"time": 5150, "text": "You know, you're still, you're still mortal."}, {"time": 5150, "text": "So, so what are you accomplishing?"}, {"time": 5153, "text": "You're making your life in this short period of time better."}, {"time": 5158, "text": "Just like having the internet made our life better."}, {"time": 5158, "text": "So I think that's of, of, if I think about all the possible gains we can have here, that's a marginal one."}, {"time": 5168, "text": "It's an individual, Hey, I'm better, you know, I'm smarter."}, {"time": 5168, "text": "But you know, fine."}, {"time": 5168, "text": "I'm not against it."}, {"time": 5175, "text": "I just don't think it's earth changing."}, {"time": 5175, "text": "I, but, but it w so this is the true of the internet."}, {"time": 5180, "text": "When each of us individuals are smarter, we get a chance to then share our smartness."}, {"time": 5184, "text": "We get smarter and smarter together as like, as a collective, this is kind of like this ant colony."}, {"time": 5188, "text": "Why don't I just create an intelligent machine that doesn't have any of this biological nonsense that has all the same."}, {"time": 5192, "text": "It's everything except don't burden it with my brain."}, {"time": 5199, "text": "It has a brain."}, {"time": 5199, "text": "It is smart."}, {"time": 5199, "text": "It's like my child, but it's much, much smarter than me."}, {"time": 5203, "text": "So I have a choice between doing some implant, doing some hybrid, weird, you know, biological thing that bleeding and all these problems and limited by my brain or creating a system, which is super smart that I can talk to."}, {"time": 5213, "text": "Um, that helps me understand the world that can read the internet, you know, read Wikipedia and talk to me."}, {"time": 5218, "text": "I guess my, the open questions there are what does the men manifestation of super intelligence look like?"}, {"time": 5223, "text": "So like, what are we going to, you, you talked about why do I want to merge with AI?"}, {"time": 5230, "text": "Like what, what's the actual marginal benefit here?"}, {"time": 5234, "text": "If I, if we have a super intelligent system, how will it make our life better?"}, {"time": 5243, "text": "So let's, let's, that's a great question, but let's break it down to little pieces."}, {"time": 5248, "text": "On the one hand, it can make our life better in lots of simple ways."}, {"time": 5248, "text": "You mentioned like a care robot or something that helps me do things."}, {"time": 5252, "text": "It cooks."}, {"time": 5252, "text": "I don't know what it does."}, {"time": 5256, "text": "Little things like that."}, {"time": 5256, "text": "We have super better, smarter cars."}, {"time": 5256, "text": "We can have, you know, better agents aids helping us in our work environment and things like that."}, {"time": 5262, "text": "To me, that's like the easy stuff, the simple stuff in the beginning."}, {"time": 5267, "text": "Um, um, and so in the same way that computers made our lives better in ways, many, many ways, I will have those kinds of things."}, {"time": 5273, "text": "To me, the really exciting thing about AI is the sort of it's transcendent, transcendent quality in terms of humanity."}, {"time": 5280, "text": "We're still biological organisms."}, {"time": 5285, "text": "We're still stuck here on earth."}, {"time": 5285, "text": "It's going to be hard for us to live anywhere else."}, {"time": 5289, "text": "Uh, I don't think you and I are going to want to live on Mars anytime soon."}, {"time": 5289, "text": "Um, um, and, um, and we're flawed, you know, we may end up destroying ourselves."}, {"time": 5294, "text": "It's totally possible."}, {"time": 5303, "text": "Uh, we, if not completely, we could destroy our civilizations."}, {"time": 5303, "text": "You know, it's this face the fact we have issues here, but we can create intelligent machines that can help us in various ways."}, {"time": 5308, "text": "For example, one example I gave, and that sounds a little sci fi, but I believe this."}, {"time": 5313, "text": "If we really wanted to live on Mars, we'd have to have intelligent systems that go there and build the habitat for us, not humans."}, {"time": 5322, "text": "Humans are never going to do this."}, {"time": 5322, "text": "It's just too hard."}, {"time": 5322, "text": "Um, but could we have a thousand or 10,000, you know, engineer workers up there doing this stuff, building things, terraforming Mars?"}, {"time": 5333, "text": "Maybe we can move Mars."}, {"time": 5333, "text": "But then if we want to, if we want to go around the universe, should I send my children around the universe or should I send some intelligent machine, which is like a child that represents me and understands our needs here on earth that could travel through space."}, {"time": 5347, "text": "Um, so it's sort of, it, in some sense, intelligence allows us to transcend our, the limitations of our biology, uh, with, and, and don't think of it as a negative thing."}, {"time": 5359, "text": "It's in some sense, my children transcend my, the, my biology too, cause they, they live beyond me."}, {"time": 5366, "text": "Um, and we impart, they represent me and they also have their own knowledge and I can impart knowledge to them."}, {"time": 5370, "text": "So intelligent machines will be like that too, but not limited like us."}, {"time": 5374, "text": "I mean, but the question is, um, there's so many ways that transcendence can happen and the merger with AI and humans is one of those ways."}, {"time": 5380, "text": "So you said intelligent, basically beings or systems propagating throughout the universe, representing us humans."}, {"time": 5393, "text": "They represent us humans in the sense they represent our knowledge and our history, not us individually."}, {"time": 5396, "text": "But I mean, the question is, is it just a database with, uh, with the really damn good, uh, model of the world?"}, {"time": 5409, "text": "It's conscious, it's conscious just like us."}, {"time": 5409, "text": "But just different?"}, {"time": 5412, "text": "They're different."}, {"time": 5412, "text": "Uh, just like my children are different."}, {"time": 5412, "text": "They're like me, but they're different."}, {"time": 5416, "text": "Um, these are more different."}, {"time": 5416, "text": "I guess maybe I've already, I kind of, I take a very broad view of our life here on earth."}, {"time": 5422, "text": "I say, you know, why are we living here?"}, {"time": 5428, "text": "Are we just living because we live?"}, {"time": 5428, "text": "Is it, are we surviving because we can survive?"}, {"time": 5428, "text": "Are we fighting just because we want to just keep going?"}, {"time": 5432, "text": "What's the point of it?"}, {"time": 5432, "text": "So to me, the point, if I asked myself, what's the point of life is what's transcends that ephemeral sort of biological experience is to me, this is my answer is the acquisition of knowledge to understand more about the universe, uh, and to explore."}, {"time": 5453, "text": "And that's partly to learn more."}, {"time": 5453, "text": "Um, I don't view it as a terrible thing."}, {"time": 5461, "text": "If the ultimate outcome of humanity is we create systems that are intelligent that are offspring, but they're not like us at all."}, {"time": 5469, "text": "And we stay, we stay here and live on earth as long as we can, which won't be forever, but as long as we can and, but that would be a great thing to do."}, {"time": 5480, "text": "It's not a, it's not like a negative thing."}, {"time": 5480, "text": "Well, would, uh, you be okay then if, uh, the human species vanishes, but our knowledge is preserved and keeps being expanded by intelligence systems."}, {"time": 5497, "text": "I want our knowledge to be preserved and expanded."}, {"time": 5497, "text": "Am I okay with humans dying?"}, {"time": 5497, "text": "No, I don't want that to happen."}, {"time": 5504, "text": "But if it, if it does happen, what if we were sitting here and this is all the real, the last two people on earth and we're saying, Lex, we blew it."}, {"time": 5513, "text": "Wouldn't I feel better if I knew that our knowledge was preserved and that we had agents that knew about that, that were trans, you know, there were that left earth."}, {"time": 5520, "text": "I wouldn't want that."}, {"time": 5524, "text": "It's better than not having that, you know, I make the analogy of like, you know, the dinosaurs, the poor dinosaurs, they live for, you know, tens of millions of years."}, {"time": 5531, "text": "They raised their kids."}, {"time": 5531, "text": "They, you know, they, they fought to survive."}, {"time": 5531, "text": "They were hungry."}, {"time": 5531, "text": "They, they did everything we do."}, {"time": 5535, "text": "And then they're all gone."}, {"time": 5535, "text": "Like, you know, and, and if we didn't discover their bones, nobody would ever know that they ever existed."}, {"time": 5540, "text": "Do we want to be like that?"}, {"time": 5547, "text": "I don't want to be like that."}, {"time": 5547, "text": "There's a sad aspect to it."}, {"time": 5547, "text": "And it's kind of, it's jarring to think about that."}, {"time": 5552, "text": "It's possible that a human like intelligence civilization has previously existed on earth."}, {"time": 5559, "text": "The reason I say this is like, it is jarring to think that we would not, if they went extinct, we wouldn't be able to find evidence of them after a sufficient amount of time."}, {"time": 5566, "text": "Of course, there's like, like basically humans, like if we destroy ourselves now, the human civilization destroyed ourselves."}, {"time": 5578, "text": "Now, after a sufficient amount of time, we would not be, we'd find evidence of the dinosaurs would not find evidence of humans."}, {"time": 5583, "text": "That's kind of an odd thing to think about."}, {"time": 5588, "text": "Although I'm not sure if we have enough knowledge about species going back for billions of years, but we could, we could, we might be able to eliminate that possibility, but it's an interesting question."}, {"time": 5598, "text": "Of course, this is a similar question to, you know, there were lots of intelligent species throughout our galaxy that have all disappeared."}, {"time": 5603, "text": "That's super sad that they're, exactly that there may have been much more intelligent alien civilizations in our galaxy that are no longer there."}, {"time": 5616, "text": "You actually talked about this, that humans might destroy ourselves and how we might preserve our knowledge and advertise that knowledge to other."}, {"time": 5622, "text": "Advertise is a funny word to use."}, {"time": 5633, "text": "From a PR perspective."}, {"time": 5633, "text": "There's no financial gain in this."}, {"time": 5640, "text": "You know, like make it like from a tourism perspective, make it interesting."}, {"time": 5640, "text": "Can you describe how you think about this problem?"}, {"time": 5644, "text": "Well, there's a couple things."}, {"time": 5644, "text": "I broke it down into two parts, actually three parts."}, {"time": 5647, "text": "One is, you know, there's a lot of things we know that, what if, what if we were, what if we ended, what if our civilization collapsed?"}, {"time": 5654, "text": "I'm not talking tomorrow."}, {"time": 5659, "text": "We could be a thousand years from now, like, so, you know, we don't really know, but, but historically it would be likely at some point."}, {"time": 5662, "text": "Time flies when you're having fun."}, {"time": 5666, "text": "You know, could we, and then intelligent life evolved again on this planet."}, {"time": 5673, "text": "Wouldn't they want to know a lot about us and what we knew?"}, {"time": 5673, "text": "Wouldn't they wouldn't be able to ask us questions?"}, {"time": 5677, "text": "So one very simple thing I said, how would we archive what we know?"}, {"time": 5682, "text": "That was a very simple idea."}, {"time": 5682, "text": "I said, you know what, that wouldn't be that hard to put a few satellites, you know, going around the sun and we'd upload Wikipedia every day and that kind of thing."}, {"time": 5691, "text": "So, you know, if we end up killing ourselves, well, it's up there and the next intelligent species will find it and learn something."}, {"time": 5695, "text": "They would like that."}, {"time": 5695, "text": "They would appreciate that."}, {"time": 5698, "text": "Um, uh, so that's one thing."}, {"time": 5698, "text": "The next thing I said, well, what if, you know, how outside, outside of our solar system, we have the SETI program."}, {"time": 5705, "text": "We're looking for these intelligent signals from everybody."}, {"time": 5709, "text": "And if you do a little bit of math, which I did in the book, uh, and you say, well, what if intelligent species only live for 10,000 years before, you know, technologically intelligent species, like ones are really able to do the stuff we're just starting to be able to do."}, {"time": 5722, "text": "Um, well, the chances are we wouldn't be able to see any of them because they would have all been disappeared by now."}, {"time": 5726, "text": "Um, they would, they've lived for 10,000 years and now they're gone."}, {"time": 5731, "text": "And so we're not going to find these signals being sent from these people because, um, but I said, what kind of signal could you create that would last a million years or a billion years that someone would say, dammit, someone smart lived there that we know that that would be a life changing event for us to figure that out."}, {"time": 5746, "text": "Well, what we're looking for today in the study program, isn't that we're looking for very coded signals in some sense."}, {"time": 5749, "text": "Um, and so I asked myself, what would be a different type of signal one could create?"}, {"time": 5754, "text": "Um, I've always thought about this throughout my life."}, {"time": 5758, "text": "And in the book, I gave one, one possible suggestion, which was, um, uh, we now detect planets going around other, other suns, uh, other stars, uh, excuse me."}, {"time": 5764, "text": "And we do that by seeing this, the, the slight dimming of the light as the planets move in front of them."}, {"time": 5774, "text": "That's how, uh, we detect, uh, planets elsewhere in our galaxy."}, {"time": 5774, "text": "Um, what if we created something like that, that just rotated around our, our, our, around the sun and it blocked out a little bit of light in a particular pattern that someone said, Hey, that's not a planet."}, {"time": 5786, "text": "That is a sign that someone was once there."}, {"time": 5791, "text": "You can say, what if it's beating up pie, you know, three point, whatever."}, {"time": 5796, "text": "Um, so I did it from a distance."}, {"time": 5796, "text": "Broadly broadcast takes no continue activation on our part."}, {"time": 5804, "text": "This is the key, right?"}, {"time": 5804, "text": "No one has to be senior running a computer and supplying it with power."}, {"time": 5808, "text": "It just goes on."}, {"time": 5808, "text": "So we go, it's continuous."}, {"time": 5808, "text": "And, and I argued that part of the study program should be looking for signals like that."}, {"time": 5815, "text": "And to look for signals like that, you ought to figure out what the, how would we create a signal?"}, {"time": 5818, "text": "Like what would we create that would be like that, that would persist for millions of years that would be broadcast broadly."}, {"time": 5823, "text": "You could see from a distance that was unequivocal, came from an intelligent species."}, {"time": 5827, "text": "And so I gave that one example."}, {"time": 5833, "text": "Um, cause they don't know what I know of actually."}, {"time": 5833, "text": "And then, and then finally, right."}, {"time": 5839, "text": "If, if our, ultimately our solar system will die at some point in time, you know, how do we go beyond that?"}, {"time": 5846, "text": "And I think it's possible if it all possible, we'll have to create intelligent machines that travel throughout the, throughout the solar system or the galaxy."}, {"time": 5851, "text": "And I don't think that's going to be humans."}, {"time": 5856, "text": "I don't think it's going to be biological organisms."}, {"time": 5856, "text": "So these are just things to think about, you know, like, what's the old, you know, I don't want to be like the dinosaur."}, {"time": 5861, "text": "I don't want to just live in, okay, that was it."}, {"time": 5864, "text": "You know, well, there is a kind of presumption that we're going to live forever, which, uh, I think it is a bit sad to imagine that the message we send as, as you talk about is that we were once here instead of we are here."}, {"time": 5883, "text": "Well, it could be, we are still here."}, {"time": 5883, "text": "Uh, but it's more of a, it's more of an insurance policy in case we're not here, you know?"}, {"time": 5889, "text": "Well, I don't know, but there is something I think about, we as humans don't often think about this, but it's like, like whenever I, um, record a video, I've done this a couple of times in my life."}, {"time": 5903, "text": "I've recorded a video for my future self, just for personal, just for fun."}, {"time": 5908, "text": "And it's always just fascinating to think about that preserving yourself for future civilizations."}, {"time": 5914, "text": "For me, it was preserving myself for a future me, but that's a little, that's a little fun example of archival."}, {"time": 5926, "text": "Well, these podcasts are, are, are preserving you and I in a way."}, {"time": 5926, "text": "For future, hopefully well after we're gone."}, {"time": 5931, "text": "But you don't often, we're sitting here talking about this."}, {"time": 5936, "text": "You are not thinking about the fact that you and I are going to die and there'll be like 10 years after somebody watching this and we're still alive."}, {"time": 5942, "text": "You know, in some sense I do."}, {"time": 5942, "text": "I'm here cause I want to talk about ideas and these ideas transcend me and they transcend this time and, and on our planet."}, {"time": 5956, "text": "Um, we're talking here about ideas that could be around a thousand years from now."}, {"time": 5963, "text": "Or a million years from now."}, {"time": 5963, "text": "I, when I wrote my book, I had an audience in mind and one of the clearest audiences was aliens."}, {"time": 5969, "text": "Were people reading this a hundred years from now?"}, {"time": 5975, "text": "I said to myself, how do I make this book relevant to someone reading this a hundred years from now?"}, {"time": 5979, "text": "What would they want to know that we were thinking back then?"}, {"time": 5979, "text": "What would make it like, that was an interesting, it's still an interesting book."}, {"time": 5984, "text": "I'm not sure I can achieve that, but that was how I thought about it because these ideas, like especially in the third part of the book, the ones we were just talking about, you know, these crazy, sounds like crazy ideas about, you know, storing our knowledge and, and, you know, merging our brains with computers and, and sending, you know, our machines out into space."}, {"time": 6001, "text": "It's not going to happen in my lifetime."}, {"time": 6001, "text": "Um, and they may not have been happening in the next hundred years."}, {"time": 6007, "text": "They may not happen for a thousand years."}, {"time": 6010, "text": "Uh, but we have the unique opportunity right now."}, {"time": 6010, "text": "We, you, me, and other people in the world, right now, we, you, me, and other people like this, um, to sort of at least propose the agenda, um, that might impact the future like that."}, {"time": 6024, "text": "That's a fascinating way to think, uh, both like writing or creating, try to make, try to create ideas, try to create things that, uh, hold up in time."}, {"time": 6038, "text": "You know, when understanding how the brain works, we're going to figure that out once."}, {"time": 6042, "text": "It's going to be figured out once."}, {"time": 6042, "text": "And after that, that's the answer."}, {"time": 6042, "text": "And people will, people will study that thousands of years now."}, {"time": 6046, "text": "We still, we still, you know, venerate Newton and, and Einstein and, um, and, you know, because, because ideas are exciting, even well into the future."}, {"time": 6059, "text": "Well, the interesting thing is like big ideas, even if they're wrong, are still useful."}, {"time": 6065, "text": "Like, yeah, especially if they're not completely wrong, right?"}, {"time": 6072, "text": "Newton's laws are not wrong."}, {"time": 6072, "text": "They're just Einstein's they're better."}, {"time": 6072, "text": "Um, so yeah, I mean, but we're talking with Newton and Einstein, we're talking about physics."}, {"time": 6079, "text": "I wonder if we'll ever achieve that kind of clarity, but understanding, um, like complex systems and the, this particular manifestation of complex systems, which is the human brain."}, {"time": 6090, "text": "I'm totally optimistic."}, {"time": 6096, "text": "I mean, we're making progress at it."}, {"time": 6096, "text": "I don't see any reasons why we can't completely."}, {"time": 6096, "text": "I mean, completely understand in the sense, um, you know, we don't really completely understand what all the molecules in this water bottle are doing, but, you know, we have laws that sort of capture it pretty good."}, {"time": 6110, "text": "Um, and, uh, so we'll have that kind of understanding."}, {"time": 6110, "text": "I mean, it's not like you're gonna have to know what every neuron in your brain is doing."}, {"time": 6114, "text": "Um, but enough to, um, first of all, to build it."}, {"time": 6120, "text": "And second of all, to do, you know, do what physics does, which is like have, uh, concrete experiments where we can validate this is happening right now."}, {"time": 6126, "text": "Like it's not, this is not some future thing."}, {"time": 6132, "text": "Um, you know, I'm very optimistic about it because I know about our, our work and what we're doing."}, {"time": 6137, "text": "We'll have to prove it to people."}, {"time": 6137, "text": "Um, but, um, I, I consider myself a rational person and, um, you know, until fairly recently, I wouldn't have said that, but right now I'm, where I'm sitting right now, I'm saying, you know, we, we could, this is going to happen."}, {"time": 6153, "text": "There's no big obstacles to it."}, {"time": 6153, "text": "Um, we finally have a framework for understanding what's going on in the cortex and, um, and that's liberating."}, {"time": 6159, "text": "It's, it's like, Oh, it's happening."}, {"time": 6164, "text": "So I can't see why we wouldn't be able to understand it."}, {"time": 6170, "text": "So, I mean, on that topic, let me ask you to play devil's advocate."}, {"time": 6174, "text": "Is it possible for you to imagine, look, look a hundred years from now and looking at your book, uh, in which ways might your ideas be wrong?"}, {"time": 6182, "text": "Oh, I worry about this all the time."}, {"time": 6182, "text": "Um, yeah, it's still useful."}, {"time": 6195, "text": "I think there's, you know, um, well I can, I can best relate it to like things I'm worried about right now."}, {"time": 6204, "text": "So we talked about this voting idea, right?"}, {"time": 6204, "text": "It's happening."}, {"time": 6209, "text": "It's happening, but it could be far more, um, um, there's, there's enough things I don't know about it that it might be working into ways differently than I'm thinking about the kind of what's voting, who's voting, you know, where are representations?"}, {"time": 6221, "text": "I talked about, like, you have a thousand models of a coffee cup like that."}, {"time": 6225, "text": "That could turn out to be wrong."}, {"time": 6225, "text": "Um, because it may be, maybe there are a thousand models that are sub models, but not really a single model of the coffee cup."}, {"time": 6232, "text": "Um, I mean, there's things, these are all sort of on the edges, things that I present as like, Oh, it's so simple and clean."}, {"time": 6242, "text": "Well, it's not that it's always going to be more complex."}, {"time": 6245, "text": "And, um, and there's parts of the theory, which I don't understand the complexity well."}, {"time": 6245, "text": "So I think, I think the idea that this brain is a distributed modeling system is not controversial at all."}, {"time": 6259, "text": "It's not, that's well understood by many people."}, {"time": 6259, "text": "The question then is, are each quarter of a column an independent modeling system?"}, {"time": 6262, "text": "Um, I could be wrong about that."}, {"time": 6269, "text": "Um, I don't think so, but I worry about it."}, {"time": 6269, "text": "My intuition, not even thinking why you could be wrong is the same intuition I have about any sort of physicist, uh, like string theory that we as humans desire for a clean explanation."}, {"time": 6282, "text": "And, uh, a hundred years from now, uh, intelligent systems might look back at us and laugh at how we try to get rid of the whole mess by having simple explanation when the reality is it's way messier."}, {"time": 6296, "text": "And in fact, it's impossible to understand."}, {"time": 6303, "text": "You can only build it."}, {"time": 6303, "text": "It's like this idea of complex systems and cellular automata is you can only launch the thing."}, {"time": 6308, "text": "You cannot understand it."}, {"time": 6308, "text": "I think that, you know, the history of science suggests that's not likely to occur."}, {"time": 6313, "text": "Um, the history of science suggests that as a theorist and we're theorists, you look for simple explanations, right?"}, {"time": 6320, "text": "Fully knowing that whatever simple explanation you're going to come up with is not going to be completely correct."}, {"time": 6330, "text": "I mean, it can't be, I mean, it's just, it's just more complexity, but that's the role of theorists play."}, {"time": 6335, "text": "They, they sort of, they give you a framework on which you now can talk about a problem and figure out, okay, now we can start digging more details."}, {"time": 6341, "text": "The best frameworks stick around while the details change."}, {"time": 6346, "text": "You know, again, you know, the classic example is Newton and Einstein, right?"}, {"time": 6346, "text": "You know, um, Newton's theories are still used."}, {"time": 6353, "text": "They're still valuable."}, {"time": 6353, "text": "They're still practical."}, {"time": 6353, "text": "They're not like wrong."}, {"time": 6360, "text": "It's just, they've been refined."}, {"time": 6360, "text": "But that's in physics."}, {"time": 6360, "text": "It's not obvious, by the way, it's not obvious for physics either that the universe should be such that's amenable to these simple."}, {"time": 6370, "text": "But it's so far, it appears to be as far as we can tell."}, {"time": 6370, "text": "I mean, but as far as we could tell, and, but it's also an open question whether the brain is amenable to such clean theories."}, {"time": 6383, "text": "That's the, uh, not the brain, but intelligence."}, {"time": 6383, "text": "Well, I, I, I don't know."}, {"time": 6383, "text": "I would take intelligence out of it."}, {"time": 6388, "text": "Just say, you know, um, well, okay."}, {"time": 6388, "text": "Um, the evidence we have suggests that the human brain is, is a, at the one time extremely messy and complex, but there's some parts that are very regular and structured."}, {"time": 6402, "text": "That's why we started the neocortex."}, {"time": 6402, "text": "It's extremely regular in its structure."}, {"time": 6408, "text": "And unbelievably so."}, {"time": 6408, "text": "And then I mentioned earlier, the other thing is it's, it's universal abilities."}, {"time": 6413, "text": "It is so flexible to learn so many things."}, {"time": 6413, "text": "We don't, we haven't figured out what it can't learn yet."}, {"time": 6420, "text": "We don't know, but we haven't figured it out yet, but it can learn things that it never was evolved to learn."}, {"time": 6423, "text": "So those give us hope."}, {"time": 6423, "text": "Um, that's why I went into this field because I said, you know, this regular structure, it's doing this amazing number of things."}, {"time": 6434, "text": "There's gotta be some underlying principles that are, that are common and other, other scientists have come up with the same conclusions."}, {"time": 6439, "text": "Um, and so it's promising and, um, and that's, and whether the theories play out exactly this way or not, that is the role that theorists play."}, {"time": 6452, "text": "And so far it's worked out well, even though, you know, maybe, you know, we don't understand all the laws of physics, but so far it's been pretty damn useful."}, {"time": 6458, "text": "The ones we have are our theories are pretty useful."}, {"time": 6462, "text": "You mentioned that, uh, we should not necessarily be, at least to the degree that we are worried about the existential risks of artificial intelligence relative to, uh, human risks from human nature being existential risk."}, {"time": 6482, "text": "What aspect of human nature worries you the most in terms of the survival of the human species?"}, {"time": 6487, "text": "I mean, I'm disappointed in humanity, humans."}, {"time": 6487, "text": "I mean, all of us, I'm one."}, {"time": 6487, "text": "So I'm disappointed myself too."}, {"time": 6495, "text": "Um, it's kind of a sad state."}, {"time": 6495, "text": "There's two things that disappoint me."}, {"time": 6495, "text": "One is how it's difficult for us to separate our rational component of ourselves from our evolutionary heritage, which is, you know, not always pretty, you know, um, uh, rape is a, is an evolutionary good strategy for reproduction."}, {"time": 6518, "text": "Murder can be at times too, you know, making other people miserable at times is a good strategy for reproduction."}, {"time": 6525, "text": "It's just, and it's just, and, and so now that we know that, and yet we have this sort of, you know, we, you and I can have this very rational discussion talking about, you know, intelligence and brains and life and so on."}, {"time": 6534, "text": "So many, it seems like it's so hard."}, {"time": 6539, "text": "It's just a big, big transition to get humans, all humans to, to make the transition from be like, let's pay no attention to all that ugly stuff over here."}, {"time": 6545, "text": "Let's just focus on the interesting."}, {"time": 6551, "text": "What's unique about humanity is our knowledge and our intellect."}, {"time": 6551, "text": "But the fact that we're striving is in itself amazing, right?"}, {"time": 6556, "text": "The fact that we're able to overcome that part."}, {"time": 6562, "text": "And it seems like we are more and more becoming successful at overcoming that part."}, {"time": 6562, "text": "That is the optimistic view."}, {"time": 6568, "text": "And I agree with you, but I worry about it."}, {"time": 6568, "text": "I'm not saying I'm worrying about it."}, {"time": 6568, "text": "I think that was your question."}, {"time": 6573, "text": "I still worry about it."}, {"time": 6573, "text": "You know, we could be in tomorrow because some terrorists could get nuclear bombs and, you know, blow us all up."}, {"time": 6578, "text": "The other thing I think I'm disappointed is, and it's just, I understand it."}, {"time": 6583, "text": "It's, I guess you can't really be disappointed."}, {"time": 6587, "text": "It's just a fact is that we're so prone to false beliefs that we, you know, we have a model in our head, the things we can interact with directly, physical objects, people, that model is pretty good."}, {"time": 6600, "text": "And we can test it all the time, right?"}, {"time": 6600, "text": "I touch something, I look at it, talk to you, see if my model is correct."}, {"time": 6604, "text": "But so much of what we know is stuff I can't directly interact with."}, {"time": 6609, "text": "I only know because someone told me about it."}, {"time": 6609, "text": "And so we're prone, inherently prone to having false beliefs because if I'm told something, how am I going to know it's right or wrong?"}, {"time": 6620, "text": "And so then we have the scientific process, which says we are inherently flawed."}, {"time": 6626, "text": "So the only way we can get closer to the truth is by looking for contrary evidence."}, {"time": 6634, "text": "Like this conspiracy theory, this theory that scientists keep telling me about that the earth is round."}, {"time": 6641, "text": "As far as I can tell, when I look out, it looks pretty flat."}, {"time": 6646, "text": "So, yeah, there is a tension, but it's also, I tend to believe that we haven't figured out most of this thing, right?"}, {"time": 6655, "text": "Most of nature around us is a mystery."}, {"time": 6655, "text": "And so it..."}, {"time": 6662, "text": "But that doesn't, does that worry you?"}, {"time": 6662, "text": "I mean, it's like, oh, that's like a pleasure, more to figure out, right?"}, {"time": 6666, "text": "But I'm saying like there's going to be a lot of quote unquote, wrong ideas."}, {"time": 6669, "text": "I mean, I've been thinking a lot about engineering systems like social networks and so on."}, {"time": 6676, "text": "And I've been worried about censorship and thinking through all that kind of stuff, because there's a lot of wrong ideas."}, {"time": 6681, "text": "There's a lot of dangerous ideas, but then I also read a history, read history and see when you censor ideas that are wrong."}, {"time": 6693, "text": "Now this could be a small scale censorship, like a young grad student who comes up, who like raises their hand and says some crazy idea."}, {"time": 6699, "text": "A form of censorship could be, I shouldn't use the word censorship, but like de incentivize them from no, no, no, no, this is the way it's been done."}, {"time": 6712, "text": "You're a foolish kid."}, {"time": 6712, "text": "Don't think that's it."}, {"time": 6714, "text": "You're foolish."}, {"time": 6714, "text": "So in some sense, those wrong ideas, most of the time end up being wrong, but sometimes end up being I agree with you."}, {"time": 6725, "text": "So I don't like the word censorship."}, {"time": 6725, "text": "Um, at the very end of the book, I, I ended up with a sort of a, um, a plea or a recommended force of action."}, {"time": 6731, "text": "Um, the best way I could, I know how to deal with this issue that you bring up is if everybody understood as part of your upbringing in life, something about how your brain works, that it builds a model of the world, uh, how it works, you know, how basically it builds that model of the world and that the model is not the real world."}, {"time": 6754, "text": "It's just a model and it's never going to reflect the entire world."}, {"time": 6754, "text": "And it can be wrong and it's easy to be wrong."}, {"time": 6759, "text": "And here's all the ways you can get a wrong model in your head."}, {"time": 6764, "text": "It's not prescribed what's right or wrong."}, {"time": 6764, "text": "Just understand that process."}, {"time": 6764, "text": "If we all understood the processes and I got together and you say, I disagree with you, Jeff."}, {"time": 6770, "text": "And I said, Lex, I disagree with you that at least we understand that we're both trying to model something."}, {"time": 6779, "text": "We both have different information, which leads to our different models."}, {"time": 6779, "text": "And therefore I shouldn't hold it against you and you shouldn't hold it against me."}, {"time": 6783, "text": "And we can at least agree that, well, what can we look for in that's common ground to test our, our beliefs, as opposed to so much, uh, as we raise our kids on dogma, which is this is a fact, this is a fact, and these people are bad."}, {"time": 6800, "text": "And, and, and, you know, where every, if everyone knew just to, to be skeptical of every belief and why, and how their brains do that, I think we might have a better world."}, {"time": 6816, "text": "Do you think the human mind is able to comprehend reality?"}, {"time": 6816, "text": "So you talk about this creating models how close do you think we get to, uh, to reality?"}, {"time": 6825, "text": "There's so the wildest ideas is like Donald Hoffman saying, we're very far away from reality."}, {"time": 6831, "text": "Do you think we're getting close to reality?"}, {"time": 6836, "text": "Well, it depends on what you define reality."}, {"time": 6836, "text": "Uh, we are getting, we have a model of the world that's very useful, right?"}, {"time": 6842, "text": "For, for basic goals."}, {"time": 6842, "text": "Well, for our survival and our pleasure right now."}, {"time": 6850, "text": "Um, so that's useful."}, {"time": 6850, "text": "Um, I mean, it's really useful."}, {"time": 6850, "text": "Oh, we can build planes."}, {"time": 6850, "text": "We can build computers."}, {"time": 6850, "text": "We can do these things."}, {"time": 6857, "text": "Uh, I don't think, I don't know the answer to that question."}, {"time": 6857, "text": "Um, I think that's part of the question we're trying to figure out, right?"}, {"time": 6864, "text": "Like, you know, obviously if you end up with a theory of everything that really is a theory of everything and all of a sudden everything comes into play and there's no room for something else, then you might feel like we have a good model of the world."}, {"time": 6877, "text": "But if we have a theory of everything and somehow, first of all, you'll never be able to really conclusively say it's a theory of everything, but say somehow we are very damn sure it's a theory of everything."}, {"time": 6886, "text": "We understand what happened at the big bang and how just the entirety of the physical process."}, {"time": 6891, "text": "I'm still not sure that gives us an understanding of, uh, the next many layers of the hierarchy of abstractions that form."}, {"time": 6898, "text": "Well, also what if string theory turns out to be true?"}, {"time": 6903, "text": "And then you say, well, we have no reality, no modeling what's going on in those other dimensions that are wrapped into it on each other."}, {"time": 6909, "text": "Or, or the multiverse, you know, I honestly don't know how for us, for human interaction, for ideas of intelligence, how it helps us to understand that we're made up of vibrating strings that are like 10 to the whatever times smaller than us."}, {"time": 6926, "text": "I don't, you know, you could probably build better weapons, a better rockets, but you're not going to be able to understand intelligence."}, {"time": 6933, "text": "I guess, I guess maybe better computers."}, {"time": 6937, "text": "No, you won't be."}, {"time": 6937, "text": "I think it's just more purely knowledge."}, {"time": 6941, "text": "You might lead to a better understanding of the, of the beginning of the universe, right?"}, {"time": 6946, "text": "It might lead to a better understanding of, uh, I don't know."}, {"time": 6946, "text": "I guess I think the acquisition of knowledge has always been one where you, you pursue it for its own pleasure."}, {"time": 6952, "text": "Um, and you don't always know what is going to make a difference."}, {"time": 6961, "text": "Uh, you're pleasantly surprised by the, the weird things you find."}, {"time": 6966, "text": "Do you think, uh, for the, for the neocortex in general, do you, do you think there's a lot of innovation to be done on the machine side?"}, {"time": 6971, "text": "You know, you use the computer as a metaphor quite a bit."}, {"time": 6976, "text": "Is there different types of computer that would help us build intelligence manifestations of intelligent machines?"}, {"time": 6981, "text": "Or is it, oh no, it's going to be totally crazy."}, {"time": 6986, "text": "Uh, we have no idea how this is going to look out yet."}, {"time": 6992, "text": "You can already see this."}, {"time": 6992, "text": "Um, today we've, of course, we model these things on traditional computers and now, now GPUs are really popular with, with, uh, you know, neural networks and so on."}, {"time": 7003, "text": "Um, but there are companies coming up with fundamentally new physical substrates, um, that are just really cool."}, {"time": 7010, "text": "I don't know if they're going to work or not."}, {"time": 7010, "text": "Um, but I think there'll be decades of innovation here."}, {"time": 7015, "text": "Do you think the final thing will be messy, like our biology is messy?"}, {"time": 7021, "text": "Or do you think, uh, it's, it's the, it's the old bird versus airplane question, or do you think we could just, um, build airplanes that, that fly way better than birds in the same way we could build, uh, uh, electrical neocortex?"}, {"time": 7036, "text": "You know, can I, can I, can I riff on the bird thing a bit?"}, {"time": 7043, "text": "Because I think that's interesting."}, {"time": 7047, "text": "People really misunderstand this."}, {"time": 7047, "text": "The Wright brothers, um, the problem they were trying to solve was controlled flight, how to turn an airplane, not how to propel an airplane."}, {"time": 7058, "text": "They weren't worried about that."}, {"time": 7058, "text": "They already had, at that time, there was already wing shapes, which they had from studying birds."}, {"time": 7061, "text": "There was already gliders that carry people."}, {"time": 7065, "text": "The problem was if you put a rudder on the back of a glider and you turn it, the plane falls out of the sky."}, {"time": 7069, "text": "So the problem was how do you control flight?"}, {"time": 7069, "text": "And they studied birds and they actually had birds in captivity."}, {"time": 7075, "text": "They watched birds in wind tunnels."}, {"time": 7075, "text": "They observed them in the wild and they discovered the secret was the birds twist their wings when they turn."}, {"time": 7085, "text": "And so that's what they did on the Wright brothers flyer."}, {"time": 7085, "text": "They had these sticks that you would twist the wing."}, {"time": 7087, "text": "And that was the, that was their innovation, not the propeller."}, {"time": 7092, "text": "And today airplanes still twist their wings."}, {"time": 7092, "text": "We don't twist the entire wing."}, {"time": 7092, "text": "We just twist the tail end of it, the flaps, which is the same thing."}, {"time": 7096, "text": "So today's airplanes fly on the same principles as birds would observe."}, {"time": 7102, "text": "So everyone get that analogy wrong, but let's step back from that."}, {"time": 7106, "text": "Once you understand the principles of flight, you can choose how to implement them."}, {"time": 7112, "text": "No one's going to use bones and feathers and muscles, but they do have wings and we don't flap them."}, {"time": 7119, "text": "We have propellers."}, {"time": 7119, "text": "So when we have the principles of computation that goes on to modeling the world in a brain, we understand those principles very clearly."}, {"time": 7130, "text": "We have choices on how to implement them."}, {"time": 7130, "text": "And some of them will be biological like and some won't."}, {"time": 7134, "text": "And, but I do think there's going to be a huge amount of innovation here."}, {"time": 7139, "text": "Just think about the innovation when in the computer, they had to invent the transistor, they invented the Silicon chip."}, {"time": 7143, "text": "They had to invent, you know, then this software."}, {"time": 7143, "text": "I mean, it's millions of things they had to do, memory systems."}, {"time": 7149, "text": "We're going to do, it's going to be similar."}, {"time": 7153, "text": "Well, it's interesting that the deep learning, the effectiveness of deep learning for specific tasks is driving a lot of innovation in the hardware, which may have effects for actually allowing us to discover intelligence systems that operate very differently or at least much bigger than deep learning."}, {"time": 7171, "text": "So ultimately it's good to have an application that's making our life better now because the capitalist process, if you can make money."}, {"time": 7182, "text": "That works."}, {"time": 7182, "text": "I mean, the other way, I mean, Neil deGrasse Tyson writes about this is the other way we fund science, of course, is through military."}, {"time": 7188, "text": "So like, yeah."}, {"time": 7188, "text": "Conquests."}, {"time": 7193, "text": "So here's an interesting thing we're doing on this regard."}, {"time": 7193, "text": "So we've decided, we used to have a series of these biological principles and we can see how to build these intelligent machines, but we've decided to apply some of these principles to today's machine learning techniques."}, {"time": 7207, "text": "So one of the, we didn't talk about this principle."}, {"time": 7207, "text": "One is a sparsity in the brain, um, most of the neurons are active at any point in time."}, {"time": 7211, "text": "It's sparse and the connectivity is sparse and that's different than deep learning networks."}, {"time": 7215, "text": "Um, so we've already shown that we can speed up existing deep learning networks, uh, anywhere from 10 to a factor of a hundred."}, {"time": 7220, "text": "I mean, literally a hundred, um, and make a more robust at the same time."}, {"time": 7226, "text": "So this is commercially very, very valuable."}, {"time": 7231, "text": "Um, and so, you know, if we can prove this actually in the largest systems that are commercially applied today, there's a big commercial desire to do this."}, {"time": 7238, "text": "Well, sparsity is something that doesn't run really well on existing hardware."}, {"time": 7244, "text": "It doesn't really run really well, um, on, um, GPUs, um, and on CPUs."}, {"time": 7250, "text": "And so that would be a way of sort of bringing more, more brain principles into the existing system on a, on a commercially valuable basis."}, {"time": 7263, "text": "Another thing we can think we can do is we're going to use these dendrites, um, models that we, uh, I talked earlier about the prediction occurring inside a neuron that that basic property can be applied to existing neural networks and allow them to learn continuously, which is something they don't do today."}, {"time": 7278, "text": "And so the dendritic spikes that you were talking about."}, {"time": 7282, "text": "Well, we wouldn't model the spikes, but the idea that you have that neuron today's neural networks have this company called the point neurons is a very simple model of a neuron."}, {"time": 7290, "text": "And, uh, by adding dendrites to them at just one more level of complexity, uh, that's in biological systems, you can solve problems in continuous learning, um, and rapid learning."}, {"time": 7301, "text": "So we're trying to take, we're trying to bring the existing field, and we'll see if we can do it."}, {"time": 7307, "text": "We're trying to bring the existing field of machine learning, um, commercially along with us, you brought up this idea of keeping, you know, paying for it commercially along with us as we move towards the ultimate goal of a true AI system."}, {"time": 7320, "text": "Even small innovations on your own networks are really, really exciting."}, {"time": 7324, "text": "Is it seems like such a trivial model of the brain and applying different insights that just even, like you said, continuous, uh, learning or, uh, making it more asynchronous or maybe making more dynamic or like, uh, incentivizing, making it robust and making it somehow much better incentivizing sparsity, uh, somehow."}, {"time": 7348, "text": "Well, if you can make things a hundred times faster, then there's plenty of incentive."}, {"time": 7355, "text": "People, people are spending millions of dollars, you know, just training some of these networks."}, {"time": 7360, "text": "Now these, uh, these transforming networks, let me ask you the big question for young people listening to this today in high school and college, what advice would you give them in terms of, uh, which career path to take and, um, maybe just about life in general?"}, {"time": 7377, "text": "Well, in my case, um, I didn't start life with any kind of goals."}, {"time": 7386, "text": "I was, when I was going to college, it's like, Oh, what do I study?"}, {"time": 7391, "text": "Well, maybe I'll do this electrical engineering stuff, you know?"}, {"time": 7391, "text": "Um, it wasn't like, you know, today you see some of these young kids are so motivated, like I'm changing the world."}, {"time": 7395, "text": "I was like, you know, whatever."}, {"time": 7398, "text": "And, um, but then I did fall in love with something besides my wife, but I fell in love with this, like, Oh my God, it would be so cool to understand how the brain works."}, {"time": 7410, "text": "And then I, I said to myself, that's the most important thing I could work on."}, {"time": 7410, "text": "I can't imagine anything more important because if we understand how the brains work, you build tells the machines and they could figure out all the other big questions of the world."}, {"time": 7418, "text": "So, and then I said, but I want to understand how I work."}, {"time": 7422, "text": "So I fell in love with this idea and I became passionate about it."}, {"time": 7426, "text": "And this is a trope."}, {"time": 7426, "text": "People say this, but it was, it's true because I was passionate about it."}, {"time": 7434, "text": "I was able to put up almost so much crap, you know, you know, I was, I was in that, you know, I was like person said, you can't do this."}, {"time": 7441, "text": "I was, I was a graduate student at Berkeley when they said, you can't study this problem, you know, no one's can solve this or you can't get funded for it."}, {"time": 7449, "text": "You know, then I went into do mobile computing and it was like, people say, you can't do that."}, {"time": 7453, "text": "You can't build a cell phone, you know?"}, {"time": 7453, "text": "So, but all along I kept being motivated because I wanted to work on this problem."}, {"time": 7458, "text": "I said, I want to understand the brain works."}, {"time": 7458, "text": "And I got myself, you know, I got one lifetime."}, {"time": 7462, "text": "I'm going to figure it out, do the best I can."}, {"time": 7462, "text": "So by having that, cause you know, it's really, as you pointed out, Lex, it's really hard to do these things."}, {"time": 7473, "text": "People, it just, there's so many downers along the way."}, {"time": 7473, "text": "So many ways, obstacles to get in your way."}, {"time": 7478, "text": "I'm sitting here happy all the time, but trust me, it's not always like that."}, {"time": 7482, "text": "Well, that's, I guess the happiness, the passion is a prerequisite for surviving the whole thing."}, {"time": 7487, "text": "And so I don't want to sit to someone and say, you know, you need to find a passion and do it."}, {"time": 7493, "text": "No, maybe you don't."}, {"time": 7493, "text": "But if you do find something you're passionate about, then you can follow it as far as your passion will let you put up with it."}, {"time": 7504, "text": "Do you remember how you found it?"}, {"time": 7504, "text": "How the spark happened?"}, {"time": 7509, "text": "Why specifically for me?"}, {"time": 7510, "text": "Cause you said it's such an interesting, so like almost like later in life, by later, I mean like not when you were five, you didn't really know."}, {"time": 7515, "text": "And then all of a sudden you fell in love with that idea."}, {"time": 7521, "text": "There was two separate events that compounded one another."}, {"time": 7525, "text": "One, when I was probably a teenager, it might've been 17 or 18, I made a list of the most interesting problems I could think of."}, {"time": 7531, "text": "First was why does the universe exist?"}, {"time": 7531, "text": "It seems like not existing is more likely."}, {"time": 7536, "text": "The second one was, well, given it exists, why does it behave the way it does?"}, {"time": 7541, "text": "Laws of physics, why is it equal MC squared, not MC cubed?"}, {"time": 7545, "text": "The third one was like, what's the origin of life?"}, {"time": 7545, "text": "And the fourth one was, what's intelligence?"}, {"time": 7551, "text": "And I stopped there."}, {"time": 7551, "text": "I said, well, that's probably the most interesting one."}, {"time": 7551, "text": "And I put that aside as a teenager."}, {"time": 7556, "text": "But then when I was 22 and I was reading the, no, excuse me, it was 1979, excuse me, 1979, I was reading, so I was, at that time I was 22, I was reading the September issue of Scientific American, which is all about the brain."}, {"time": 7573, "text": "And then the final essay was by Francis Crick, who of DNA fame, and he had taken his interest to studying the brain now."}, {"time": 7579, "text": "And he said, you know, there's something wrong here."}, {"time": 7585, "text": "He says, we got all this data, all this fact, this is 1979, all these facts about the brain, tons and tons of facts about the brain."}, {"time": 7593, "text": "Do we need more facts?"}, {"time": 7593, "text": "Or do we just need to think about a way of rearranging the facts we have?"}, {"time": 7599, "text": "Maybe we're just not thinking about the problem correctly."}, {"time": 7602, "text": "Cause he says, this shouldn't be like this."}, {"time": 7602, "text": "So I read that and I said, wow."}, {"time": 7611, "text": "I said, I don't have to become like an experimental neuroscientist."}, {"time": 7611, "text": "I could just take, look at all those facts and try and become a theoretician and try to figure it out."}, {"time": 7617, "text": "And I said that I felt like it was something I would be good at."}, {"time": 7624, "text": "I said, I wouldn't be a good experimentalist."}, {"time": 7628, "text": "I don't have the patience for it, but I'm a good thinker and I love puzzles."}, {"time": 7628, "text": "And this is like the biggest puzzle in the world."}, {"time": 7634, "text": "It's the biggest puzzle of all time."}, {"time": 7634, "text": "And I got all the puzzle pieces in front of me."}, {"time": 7638, "text": "Damn, that was exciting."}, {"time": 7638, "text": "And there's something obviously you can't convert into words that just kind of sparked this passion."}, {"time": 7643, "text": "And I have that a few times in my life, just something just like you, it grabs you."}, {"time": 7649, "text": "I felt it was something that was both important and that I could make a contribution to."}, {"time": 7657, "text": "And so all of a sudden it felt like, oh, it gave me purpose in life."}, {"time": 7661, "text": "I honestly don't think it has to be as big as one of those four questions."}, {"time": 7666, "text": "I think you can find those things in the smallest."}, {"time": 7666, "text": "David Foster Wallace said like the key to life is to be unboreable."}, {"time": 7674, "text": "I think it's very possible to find that intensity of joy in the smallest thing."}, {"time": 7681, "text": "I'm just, you asked me my story."}, {"time": 7681, "text": "No, but I'm actually speaking to the audience."}, {"time": 7686, "text": "It doesn't have to be those four."}, {"time": 7686, "text": "You happen to get excited by one of the bigger questions of in the universe, but even the smallest things and watching the Olympics now, just giving yourself life, giving your life over to the study and the mastery of a particular sport is fascinating."}, {"time": 7705, "text": "And if it sparks joy and passion, you're able to, in the case of the Olympics, basically suffer for like a couple of decades to achieve."}, {"time": 7712, "text": "I mean, you can find joy and passion just being a parent."}, {"time": 7717, "text": "I mean, yeah, the parenting one is funny."}, {"time": 7717, "text": "So I was, not always, but for a long time, wanted kids and get married and stuff."}, {"time": 7723, "text": "And especially that has to do with the fact that I've seen a lot of people that I respect get a whole nother level of joy from kids."}, {"time": 7728, "text": "And at first is like, you're thinking is, well, like I don't have enough time in the day, right?"}, {"time": 7738, "text": "If I have this passion to solve, but like, if I want to solve intelligence, how's this kid situation going to help me?"}, {"time": 7753, "text": "But then you realize that, you know, like you said, the things that sparks joy, and it's very possible that kids can provide even a greater or deeper, more meaningful joy than those bigger questions when they enrich each other."}, {"time": 7768, "text": "And that seemed like, obviously when I was younger, it's probably a counterintuitive notion because there's only so many hours in the day, but then life is finite and you have to pick the things that give you joy."}, {"time": 7784, "text": "But you also understand you can be patient too."}, {"time": 7784, "text": "I mean, it's finite, but we do have, you know, whatever, 50 years or something."}, {"time": 7790, "text": "So in my case, I had to give up on my dream of the neuroscience because I was a graduate student at Berkeley and they told me I couldn't do this and I couldn't get funded."}, {"time": 7802, "text": "And so I went back in the computing industry for a number of years."}, {"time": 7802, "text": "I thought it would be four, but it turned out to be more."}, {"time": 7809, "text": "But I said, I'll come back."}, {"time": 7809, "text": "I'm definitely going to come back."}, {"time": 7814, "text": "I know I'm going to do this computer stuff for a while, but I'm definitely coming back."}, {"time": 7817, "text": "Everyone knows that."}, {"time": 7817, "text": "And it's like raising kids."}, {"time": 7817, "text": "Well, yeah, you have to spend a lot of time with your kids."}, {"time": 7822, "text": "It's fun, enjoyable."}, {"time": 7822, "text": "But that doesn't mean you have to give up on other dreams."}, {"time": 7822, "text": "It just means that you may have to wait a week or two to work on that next idea."}, {"time": 7828, "text": "Well, you talk about the darker side of me, disappointing sides of human nature that we're hoping to overcome so that we don't destroy ourselves."}, {"time": 7842, "text": "I tend to put a lot of value in the broad general concept of love, of the human capacity of compassion towards each other, of just kindness, whatever that longing of like just the human to human connection."}, {"time": 7858, "text": "It connects back to our initial discussion."}, {"time": 7858, "text": "I tend to see a lot of value in this collective intelligence aspect."}, {"time": 7865, "text": "I think some of the magic of human civilization happens when there's a party is not as fun when you're alone."}, {"time": 7869, "text": "I totally agree with you on these issues."}, {"time": 7876, "text": "Do you think from a neocortex perspective, what role does love play in the human condition?"}, {"time": 7884, "text": "Well, those are two separate things from a neocortex point of view."}, {"time": 7884, "text": "It doesn't impact our thinking about the neocortex."}, {"time": 7889, "text": "From a human condition point of view, I think it's core."}, {"time": 7894, "text": "I mean, we get so much pleasure out of loving people and helping people."}, {"time": 7894, "text": "I'll rack it up to old brain stuff and maybe we can throw it under the bus of evolution if you want."}, {"time": 7912, "text": "It doesn't impact how I think about how we model the world, but from a humanity point of view, I think it's essential."}, {"time": 7917, "text": "Well, I tend to give it to the new brain and also I tend to give it to the old brain."}, {"time": 7923, "text": "Also, I tend to think that some aspects of that need to be engineered into AI systems, both in their ability to have compassion for other humans and their ability to maximize love in the world between humans."}, {"time": 7941, "text": "I'm more thinking about social networks."}, {"time": 7941, "text": "Whenever there's a deep AI systems in humans, specific applications where it's AI and humans, I think that's something that often not talked about in terms of metrics over which you try to maximize, like which metric to maximize in a system."}, {"time": 7964, "text": "It seems like one of the most powerful things in societies is the capacity to love."}, {"time": 7975, "text": "I think it's a great way of thinking about it."}, {"time": 7975, "text": "I have been thinking more of these fundamental mechanisms in the brain as opposed to the social interaction between humans and AI systems in the future."}, {"time": 7986, "text": "If you think about that, you're absolutely right."}, {"time": 7986, "text": "That's a complex system."}, {"time": 7993, "text": "I can have intelligent systems that don't have that component, but they're not interacting with people."}, {"time": 7997, "text": "They're just running something or building some place or something."}, {"time": 8001, "text": "But if you think about interacting with humans, yeah, but it has to be engineered in there."}, {"time": 8001, "text": "I don't think it's going to appear on its own."}, {"time": 8010, "text": "Well, we could, we'll leave that open."}, {"time": 8010, "text": "In terms of, from a reinforcement learning perspective, whether the darker sides of human nature or the better angels of our nature win out, statistically speaking, I don't know."}, {"time": 8026, "text": "I tend to be optimistic and hope that love wins out in the end."}, {"time": 8032, "text": "You've done a lot of incredible stuff and your book is driving towards this fourth question that you started with on the nature of intelligence."}, {"time": 8041, "text": "What do you hope your legacy for people reading a hundred years from now?"}, {"time": 8048, "text": "How do you hope they remember your work?"}, {"time": 8048, "text": "How do you hope they remember this book?"}, {"time": 8054, "text": "Well, I think as an entrepreneur or a scientist or any human who's trying to accomplish some things, I have a view that really all you can do is accelerate the inevitable."}, {"time": 8061, "text": "It's like, you know, if we didn't figure out, if we didn't study the brain, someone else will study the brain."}, {"time": 8073, "text": "If, you know, if Elon didn't make electric cars, someone else would do it eventually."}, {"time": 8078, "text": "And if, you know, if Thomas Edison didn't invent a light bulb, we wouldn't be using candles today."}, {"time": 8082, "text": "So, what you can do as an individual is you can accelerate something that's beneficial and make it happen sooner than it would have."}, {"time": 8088, "text": "That's really it."}, {"time": 8088, "text": "That's all you can do."}, {"time": 8093, "text": "You can't create a new reality that it wasn't going to happen."}, {"time": 8093, "text": "So, from that perspective, I would hope that our work, not just me, but our work in general, people would look back and said, hey, they really helped make this better future happen sooner."}, {"time": 8107, "text": "They, you know, they helped us understand the nature of false beliefs sooner than they might have."}, {"time": 8114, "text": "Now we're so happy that we have these intelligent machines doing these things, helping us that maybe that solved the climate change problem and they made it happen sooner."}]}]