[{"title": "Rosalind Picard: Affective Computing, Emotion, Privacy, and Health | Lex Fridman Podcast #24", "id": "kq0VO1FqE6I", "quotes": [{"time": 326, "text": "Yeah, well."}, {"time": 327, "text": "Or hasn't gotten better."}, {"time": 328, "text": "Let's just say there's a lot more variety among computer scientists these days."}, {"time": 332, "text": "Computer scientists are a much more diverse group today than they were 25 years ago."}, {"time": 337, "text": "And that's good."}, {"time": 339, "text": "We need all kinds of people to become computer scientists so that computer science reflects more what society needs."}, {"time": 345, "text": "And there's brilliance among every personality type."}, {"time": 349, "text": "So it need not be limited to people who prefer computers to other people."}, {"time": 354, "text": "How hard do you think it is?"}, {"time": 355, "text": "Your view of how difficult it is to recognize emotion or to create a deeply emotionally intelligent interaction."}, {"time": 363, "text": "Has it gotten easier or harder as you've explored it further?"}, {"time": 367, "text": "And how far away are we from cracking this?"}, {"time": 372, "text": "If you think of the Turing test solving the intelligence, looking at the Turing test for emotional intelligence."}, {"time": 380, "text": "I think it is as difficult as I thought it was gonna be."}, {"time": 385, "text": "I think my prediction of its difficulty is spot on."}, {"time": 389, "text": "I think the time estimates are always hard because they're always a function of society's love and hate of a particular topic."}, {"time": 399, "text": "If society gets excited and you get thousands of researchers working on it for a certain application, that application gets solved really quickly."}, {"time": 412, "text": "The general intelligence, the computer's complete lack of ability to have awareness of what it's doing, the fact that it's not conscious, the fact that there's no signs of it becoming conscious, the fact that it doesn't read between the lines, those kinds of things that we have to teach it explicitly, what other people pick up implicitly."}, {"time": 437, "text": "We don't see that changing yet."}, {"time": 440, "text": "There aren't breakthroughs yet that lead us to believe that that's gonna go any faster, which means that it's still gonna be kind of stuck with a lot of limitations where it's probably only gonna do the right thing in very limited, narrow, prespecified contexts where we can prescribe pretty much what's gonna happen there."}, {"time": 462, "text": "So I don't see the, it's hard to predict a date because when people don't work on it, it's infinite."}, {"time": 471, "text": "When everybody works on it, you get a nice piece of it well solved in a short amount of time."}, {"time": 478, "text": "I actually think there's a more important issue right now than the difficulty of it."}, {"time": 484, "text": "And that's causing some of us to put the brakes on a little bit."}, {"time": 487, "text": "Usually we're all just like step on the gas, let's go faster."}, {"time": 491, "text": "This is causing us to pull back and put the brakes on."}, {"time": 494, "text": "And that's the way that some of this technology is being used in places like China right now."}, {"time": 501, "text": "And that worries me so deeply that it's causing me to pull back myself on a lot of the things that we could be doing."}, {"time": 510, "text": "And try to get the community to think a little bit more about, okay, if we're gonna go forward with that, how can we do it in a way that puts in place safeguards that protects people?"}, {"time": 521, "text": "So the technology we're referring to is just when a computer senses the human being, like the human face, right?"}, {"time": 528, "text": "So there's a lot of exciting things there, like forming a deep connection with the human being."}, {"time": 533, "text": "So what are your worries, how that could go wrong?"}, {"time": 537, "text": "Is it in terms of privacy?"}, {"time": 539, "text": "Is it in terms of other kinds of more subtle things?"}, {"time": 542, "text": "But let's dig into privacy."}, {"time": 544, "text": "So here in the US, if I'm watching a video of say a political leader, and in the US we're quite free as we all know to even criticize the president of the United States, right?"}, {"time": 557, "text": "Here that's not a shocking thing."}, {"time": 559, "text": "It happens about every five seconds, right?"}, {"time": 562, "text": "But in China, what happens if you criticize the leader of the government, right?"}, {"time": 570, "text": "And so people are very careful not to do that."}, {"time": 574, "text": "However, what happens if you're simply watching a video and you make a facial expression that shows a little bit of skepticism, right?"}, {"time": 585, "text": "Well, and here we're completely free to do that."}, {"time": 587, "text": "In fact, we're free to fly off the handle and say anything we want, usually."}, {"time": 594, "text": "I mean, there are some restrictions when the athlete does this as part of the national broadcast."}, {"time": 600, "text": "Maybe the teams get a little unhappy about picking that forum to do it, right?"}, {"time": 605, "text": "But that's more a question of judgment."}, {"time": 608, "text": "We have these freedoms, and in places that don't have those freedoms, what if our technology can read your underlying affective state?"}, {"time": 619, "text": "What if our technology can read it even noncontact?"}, {"time": 622, "text": "What if our technology can read it without your prior consent?"}, {"time": 628, "text": "And here in the US, in my first company we started, Affectiva, we have worked super hard to turn away money and opportunities that try to read people's affect without their prior informed consent."}, {"time": 641, "text": "And even the software that is licensable, you have to sign things saying you will only use it in certain ways, which essentially is get people's buy in, right?"}, {"time": 652, "text": "Don't do this without people agreeing to it."}, {"time": 656, "text": "There are other countries where they're not interested in people's buy in."}, {"time": 659, "text": "They're just gonna use it."}, {"time": 661, "text": "They're gonna inflict it on you."}, {"time": 663, "text": "And if you don't like it, you better not scowl in the direction of any censors."}, {"time": 668, "text": "So one, let me just comment on a small tangent."}, {"time": 671, "text": "Do you know with the idea of adversarial examples and deep fakes and so on, what you bring up is actually, in that one sense, deep fakes provide a comforting protection that you can no longer really trust that the video of your face was legitimate."}, {"time": 694, "text": "And therefore you always have an escape clause if a government is trying, if a stable, balanced, ethical government is trying to accuse you of something, at least you have protection."}, {"time": 707, "text": "You can say it was fake news, as is a popular term now."}, {"time": 710, "text": "Yeah, that's the general thinking of it."}, {"time": 712, "text": "We know how to go into the video and see, for example, your heart rate and respiration and whether or not they've been tampered with."}, {"time": 722, "text": "And we also can put like fake heart rate and respiration in your video now too."}, {"time": 726, "text": "We decided we needed to do that."}, {"time": 730, "text": "After we developed a way to extract it, we decided we also needed a way to jam it."}, {"time": 735, "text": "And so the fact that we took time to do that other step too, that was time that I wasn't spending making the machine more affectively intelligent."}, {"time": 745, "text": "And there's a choice in how we spend our time, which is now being swayed a little bit less by this goal and a little bit more like by concern about what's happening in society and what kind of future do we wanna build."}, {"time": 758, "text": "And as we step back and say, okay, we don't just build AI to build AI to make Elon Musk more money or to make Amazon Jeff Bezos more money."}, {"time": 768, "text": "Good gosh, you know, that's the wrong ethic."}, {"time": 772, "text": "Why are we building it?"}, {"time": 774, "text": "What is the point of building AI?"}, {"time": 777, "text": "It used to be, it was driven by researchers in academia to get papers published and to make a career for themselves and to do something cool, right?"}, {"time": 785, "text": "Like, cause maybe it could be done."}, {"time": 788, "text": "Now we realize that this is enabling rich people to get vastly richer, the poor are, the divide is even larger."}, {"time": 799, "text": "And is that the kind of future that we want?"}, {"time": 802, "text": "Maybe we wanna think about, maybe we wanna rethink AI."}, {"time": 805, "text": "Maybe we wanna rethink the problems in society that are causing the greatest inequity and rethink how to build AI that's not about a general intelligence, but that's about extending the intelligence and capability of the have nots so that we close these gaps in society."}, {"time": 823, "text": "Do you hope that kind of stepping on the brake happens organically?"}, {"time": 827, "text": "Because I think still majority of the force behind AI is the desire to publish papers, is to make money without thinking about the why."}, {"time": 835, "text": "Do you hope it happens organically?"}, {"time": 837, "text": "Is there room for regulation?"}, {"time": 841, "text": "Yeah, yeah, yeah, great questions."}, {"time": 842, "text": "I prefer the, you know, they talk about the carrot versus the stick."}, {"time": 847, "text": "I definitely prefer the carrot to the stick."}, {"time": 849, "text": "And, you know, in our free world, we, there's only so much stick, right?"}, {"time": 854, "text": "You're gonna find a way around it."}, {"time": 857, "text": "I generally think less regulation is better."}, {"time": 861, "text": "That said, even though my position is classically carrot, no stick, no regulation, I think we do need some regulations in this space."}, {"time": 869, "text": "I do think we need regulations around protecting people with their data, that you own your data, not Amazon, not Google."}, {"time": 878, "text": "I would like to see people own their own data."}, {"time": 880, "text": "I would also like to see the regulations that we have right now around lie detection being extended to emotion recognition in general, that right now you can't use a lie detector on an employee when you're, on a candidate when you're interviewing them for a job."}, {"time": 894, "text": "I think similarly, we need to put in place protection around reading people's emotions without their consent and in certain cases, like characterizing them for a job and other opportunities."}, {"time": 906, "text": "So I'm also, I also think that when we're reading emotion that's predictive around mental health, that that should, even though it's not medical data, that that should get the kinds of protections that our medical data gets."}, {"time": 953, "text": "If you're likely to be sick or healthy, happy or sad, stressed or calm."}, {"time": 958, "text": "Especially when you're tracking data over time."}, {"time": 960, "text": "Especially when we're tracking a week of your data or more."}, {"time": 963, "text": "Do you have an optimism towards, you know, a lot of people on our phones are worried about this camera that's looking at us."}, {"time": 970, "text": "For the most part, on balance, are you optimistic about the benefits that can be brought from that camera that's looking at billions of us?"}, {"time": 979, "text": "Or should we be more worried?"}, {"time": 984, "text": "I think we should be a little bit more worried about who's looking at us and listening to us."}, {"time": 992, "text": "The device sitting on your countertop in your kitchen, whether it's, you know, Alexa or Google Home or Apple, Siri, these devices want to listen while they say ostensibly to help us."}, {"time": 1009, "text": "And I think there are great people in these companies who do want to help people."}, {"time": 1014, "text": "Let me not brand them all bad."}, {"time": 1016, "text": "I'm a user of products from all of these companies I'm naming all the A companies, Alphabet, Apple, Amazon."}, {"time": 1024, "text": "They are awfully big companies, right?"}, {"time": 1029, "text": "They have incredible power."}, {"time": 1031, "text": "And you know, what if China were to buy them, right?"}, {"time": 1037, "text": "And suddenly all of that data were not part of free America, but all of that data were part of somebody who just wants to take over the world and you submit to them."}, {"time": 1047, "text": "And guess what happens if you so much as smirk the wrong way when they say something that you don't like?"}, {"time": 1054, "text": "Well, they have reeducation camps, right?"}, {"time": 1057, "text": "That's a nice word for them."}, {"time": 1059, "text": "By the way, they have a surplus of organs for people who have surgery these days."}, {"time": 1063, "text": "They don't have an organ donation problem because they take your blood and they know you're a match."}, {"time": 1068, "text": "And the doctors are on record of taking organs from people who are perfectly healthy and not prisoners."}, {"time": 1075, "text": "They're just simply not the favored ones of the government."}, {"time": 1079, "text": "And you know, that's a pretty freaky evil society."}, {"time": 1084, "text": "And we can use the word evil there."}, {"time": 1086, "text": "I was born in the Soviet Union."}, {"time": 1087, "text": "I can certainly connect to the worry that you're expressing."}, {"time": 1093, "text": "At the same time, probably both you and I and you very much so, you know, there's an exciting possibility that you can have a deep connection with a machine."}, {"time": 1110, "text": "Those of us, I've admitted students who say that they, you know, when you list like, who do you most wish you could have lunch with or dinner with, right?"}, {"time": 1121, "text": "And they'll write like, I don't like people."}, {"time": 1123, "text": "I just like computers."}, {"time": 1124, "text": "And one of them said to me once when I had this party at my house, I want you to know, this is my only social event of the year, my one social event of the year."}, {"time": 1135, "text": "Like, okay, now this is a brilliant machine learning person, right?"}, {"time": 1139, "text": "And we need that kind of brilliance in machine learning."}, {"time": 1141, "text": "And I love that computer science welcomes people who love people and people who are very awkward around people."}, {"time": 1148, "text": "I love that this is a field that anybody could join."}, {"time": 1152, "text": "We need all kinds of people and you don't need to be a social person."}, {"time": 1156, "text": "I'm not trying to force people who don't like people to suddenly become social."}, {"time": 1161, "text": "At the same time, if most of the people building the AIs of the future are the kind of people who don't like people, we've got a little bit of a problem."}, {"time": 1171, "text": "Well, hold on a second."}, {"time": 1171, "text": "So let me push back on that."}, {"time": 1173, "text": "So don't you think a large percentage of the world can, you know, there's loneliness."}, {"time": 1180, "text": "There is a huge problem with loneliness that's growing."}, {"time": 1184, "text": "And so there's a longing for connection."}, {"time": 1189, "text": "If you're lonely, you're part of a big and growing group."}, {"time": 1192, "text": "So we're in it together, I guess."}, {"time": 1194, "text": "If you're lonely, join the group."}, {"time": 1196, "text": "You're not alone."}, {"time": 1200, "text": "But do you think there's... You talked about some worry, but do you think there's an exciting possibility that something like Alexa and these kinds of tools can alleviate that loneliness in a way that other humans can't?"}, {"time": 1216, "text": "Yeah, yeah, definitely."}, {"time": 1218, "text": "I mean, a great book can kind of alleviate loneliness because you just get sucked into this amazing story and you can't wait to go spend time with that character."}, {"time": 1227, "text": "And they're not a human character."}, {"time": 1230, "text": "There is a human behind it."}, {"time": 1233, "text": "But yeah, it can be an incredibly delightful way to pass the hours and it can meet needs."}, {"time": 1239, "text": "Even, you know, I don't read those trashy romance books, but somebody does, right?"}, {"time": 1244, "text": "And what are they getting from this?"}, {"time": 1246, "text": "Well, probably some of that feeling of being there, right?"}, {"time": 1250, "text": "Being there in that social moment, that romantic moment or connecting with somebody."}, {"time": 1256, "text": "I've had a similar experience reading some science fiction books, right?"}, {"time": 1259, "text": "And connecting with the character."}, {"time": 1260, "text": "Orson Scott Card, you know, just amazing writing and Ender's Game and Speaker for the Dead, terrible title."}, {"time": 1267, "text": "But those kind of books that pull you into a character and you feel like you're, you feel very social."}, {"time": 1273, "text": "It's very connected, even though it's not responding to you."}, {"time": 1277, "text": "And a computer, of course, can respond to you."}, {"time": 1279, "text": "So it can deepen it, right?"}, {"time": 1281, "text": "You can have a very deep connection, much more than the movie Her, you know, plays up, right?"}, {"time": 1289, "text": "Well, much more."}, {"time": 1290, "text": "I mean, movie Her is already a pretty deep connection, right?"}, {"time": 1294, "text": "Well, but it's just a movie, right?"}, {"time": 1296, "text": "It's scripted."}, {"time": 1297, "text": "It's just, you know, but I mean, like there can be a real interaction where the character can learn and you can learn."}, {"time": 1306, "text": "You could imagine it not just being you and one character."}, {"time": 1309, "text": "You could imagine a group of characters."}, {"time": 1311, "text": "You can imagine a group of people and characters, human and AI connecting, where maybe a few people can't sort of be friends with everybody, but the few people and their AIs can befriend more people."}, {"time": 1327, "text": "There can be an extended human intelligence in there where each human can connect with more people that way."}, {"time": 1334, "text": "But it's still very limited, but there are just, what I mean is there are many more possibilities than what's in that movie."}, {"time": 1342, "text": "So there's a tension here."}, {"time": 1344, "text": "So one, you expressed a really serious concern about privacy, about how governments can misuse the information, and there's the possibility of this connection."}, {"time": 1354, "text": "So let's look at Alexa."}, {"time": 1356, "text": "So personal assistance."}, {"time": 1357, "text": "For the most part, as far as I'm aware, they ignore your emotion."}, {"time": 1362, "text": "They ignore even the context or the existence of you, the intricate, beautiful, complex aspects of who you are, except maybe aspects of your voice that help it recognize for speech recognition."}, {"time": 1378, "text": "Do you think they should move towards trying to understand your emotion?"}, {"time": 1383, "text": "All of these companies are very interested in understanding human emotion."}, {"time": 1387, "text": "They want, more people are telling Siri every day they want to kill themselves."}, {"time": 1393, "text": "Apple wants to know the difference between if a person is really suicidal versus if a person is just kind of fooling around with Siri, right?"}, {"time": 1401, "text": "The words may be the same, the tone of voice and what surrounds those words is pivotal to understand if they should respond in a very serious way, bring help to that person, or if they should kind of jokingly tease back, ah, you just want to sell me for something else, right?"}, {"time": 1424, "text": "Like, how do you respond when somebody says that?"}, {"time": 1427, "text": "Well, you do want to err on the side of being careful and taking it seriously."}, {"time": 1433, "text": "People want to know if the person is happy or stressed in part, well, so let me give you an altruistic reason and a business profit motivated reason."}, {"time": 1448, "text": "And there are people in companies that operate on both principles."}, {"time": 1452, "text": "The altruistic people really care about their customers and really care about helping you feel a little better at the end of the day."}, {"time": 1460, "text": "And it would just make those people happy if they knew that they made your life better."}, {"time": 1464, "text": "If you came home stressed and after talking with their product, you felt better."}, {"time": 1469, "text": "There are other people who maybe have studied the way affect affects decision making and prices people pay."}, {"time": 1476, "text": "And they know, I don't know if I should tell you, like the work of Jen Lerner on heartstrings and purse strings, you know, if we manipulate you into a slightly sadder mood, you'll pay more, right?"}, {"time": 1490, "text": "You'll pay more to change your situation."}, {"time": 1493, "text": "You'll pay more for something you don't even need to make yourself feel better."}, {"time": 1498, "text": "So, you know, if they sound a little sad, maybe I don't want to cheer them up."}, {"time": 1501, "text": "Maybe first I want to help them get something, a little shopping therapy, right?"}, {"time": 1507, "text": "That helps them."}, {"time": 1508, "text": "Which is really difficult for a company that's primarily funded on advertisement."}, {"time": 1512, "text": "So they're encouraged to get you to offer you products or Amazon that's primarily funded on you buying things from their store."}, {"time": 1520, "text": "So I think we should be, you know, maybe we need regulation in the future to put a little bit of a wall between these agents that have access to our emotion and agents that want to sell us stuff."}, {"time": 1532, "text": "Maybe there needs to be a little bit more of a firewall in between those."}, {"time": 1538, "text": "So maybe digging in a little bit on the interaction with Alexa, you mentioned, of course, a really serious concern about like recognizing emotion, if somebody is speaking of suicide or depression and so on, but what about the actual interaction itself?"}, {"time": 1555, "text": "Do you think, so if I, you know, you mentioned Clippy and being annoying, what is the objective function we're trying to optimize?"}, {"time": 1564, "text": "Is it minimize annoyingness or minimize or maximize happiness?"}, {"time": 1569, "text": "Or if we look at human to human relations, I think that push and pull, the tension, the dance, you know, the annoying, the flaws, that's what makes it fun."}, {"time": 1579, "text": "So is there a room for, like what is the objective function?"}, {"time": 1584, "text": "There are times when you want to have a little push and pull, I think of kids sparring, right?"}, {"time": 1589, "text": "You know, I see my sons and they, one of them wants to provoke the other to be upset and that's fun."}, {"time": 1594, "text": "And it's actually healthy to learn where your limits are, to learn how to self regulate."}, {"time": 1600, "text": "You can imagine a game where it's trying to make you mad and you're trying to show self control."}, {"time": 1605, "text": "And so if we're doing a AI human interaction that's helping build resilience and self control, whether it's to learn how to not be a bully or how to turn the other cheek or how to deal with an abusive person in your life, then you might need an AI that pushes your buttons, right?"}, {"time": 1624, "text": "But in general, do you want an AI that pushes your buttons?"}, {"time": 1630, "text": "Probably depends on your personality."}, {"time": 1632, "text": "I don't, I want one that's respectful, that is there to serve me and that is there to extend my ability to do things."}, {"time": 1643, "text": "I'm not looking for a rival, I'm looking for a helper."}, {"time": 1647, "text": "And that's the kind of AI I'd put my money on."}, {"time": 1650, "text": "Your sense is for the majority of people in the world, in order to have a rich experience, that's what they're looking for as well."}, {"time": 1657, "text": "So they're not looking, if you look at the movie Her, spoiler alert, I believe the program that the woman in the movie Her leaves the person for somebody else, says they don't wanna be dating anymore, right?"}, {"time": 1674, "text": "Like, do you, your sense is if Alexa said, you know what, I'm actually had enough of you for a while, so I'm gonna shut myself off."}, {"time": 1684, "text": "You don't see that as..."}, {"time": 1687, "text": "I'd say you're trash, cause I paid for you, right?"}, {"time": 1690, "text": "You, we've got to remember, and this is where this blending human AI as if we're equals is really deceptive because AI is something at the end of the day that my students and I are making in the lab."}, {"time": 1708, "text": "And we're choosing what it's allowed to say, when it's allowed to speak, what it's allowed to listen to, what it's allowed to act on given the inputs that we choose to expose it to, what outputs it's allowed to have."}, {"time": 1725, "text": "It's all something made by a human."}, {"time": 1729, "text": "And if we wanna make something that makes our lives miserable, fine."}, {"time": 1732, "text": "I wouldn't invest in it as a business, unless it's just there for self regulation training."}, {"time": 1739, "text": "But I think we need to think about what kind of future we want."}, {"time": 1742, "text": "And actually your question, I really like the, what is the objective function?"}, {"time": 1746, "text": "Is it to calm people down?"}, {"time": 1750, "text": "Is it to always make people happy and calm them down?"}, {"time": 1754, "text": "Well, there was a book about that, right?"}, {"time": 1756, "text": "The brave new world, make everybody happy, take your Soma if you're unhappy, take your happy pill."}, {"time": 1762, "text": "And if you refuse to take your happy pill, well, we'll threaten you by sending you to Iceland to live there."}, {"time": 1769, "text": "I lived in Iceland three years."}, {"time": 1770, "text": "It's a great place."}, {"time": 1771, "text": "Don't take your Soma, then go to Iceland."}, {"time": 1775, "text": "A little TV commercial there."}, {"time": 1777, "text": "Now I was a child there for a few years."}, {"time": 1779, "text": "It's a wonderful place."}, {"time": 1780, "text": "So that part of the book never scared me."}, {"time": 1783, "text": "But really like, do we want AI to manipulate us into submission, into making us happy?"}, {"time": 1789, "text": "Well, if you are a, you know, like a power obsessed sick dictator individual who only wants to control other people to get your jollies in life, then yeah, you wanna use AI to extend your power and your scale to force people into submission."}, {"time": 1807, "text": "If you believe that the human race is better off being given freedom and the opportunity to do things that might surprise you, then you wanna use AI to extend people's ability to build, you wanna build AI that extends human intelligence, that empowers the weak and helps balance the power between the weak and the strong, not that gives more power to the strong."}, {"time": 1832, "text": "So in this process of empowering people and sensing people, what is your sense on emotion in terms of recognizing emotion?"}, {"time": 1842, "text": "The difference between emotion that is shown and emotion that is felt."}, {"time": 1846, "text": "So yeah, emotion that is expressed on the surface through your face, your body, and various other things, and what's actually going on deep inside on the biological level, on the neuroscience level, or some kind of cognitive level."}, {"time": 1865, "text": "Whoa, no easy questions here."}, {"time": 1867, "text": "Well, yeah, I'm sure there's no definitive answer, but what's your sense?"}, {"time": 1872, "text": "How far can we get by just looking at the face?"}, {"time": 1876, "text": "We're very limited when we just look at the face, but we can get further than most people think we can get."}, {"time": 1881, "text": "People think, hey, I have a great poker face, therefore all you're ever gonna get from me is neutral."}, {"time": 1888, "text": "Well, that's naive."}, {"time": 1890, "text": "We can read with the ordinary camera on your laptop or on your phone."}, {"time": 1894, "text": "We can read from a neutral face if your heart is racing."}, {"time": 1899, "text": "We can read from a neutral face if your breathing is becoming irregular and showing signs of stress."}, {"time": 1906, "text": "We can read under some conditions that maybe I won't give you details on, how your heart rate variability power is changing."}, {"time": 1917, "text": "That could be a sign of stress, even when your heart rate is not necessarily accelerating."}, {"time": 1923, "text": "Sorry, from physio sensors or from the face?"}, {"time": 1926, "text": "From the color changes that you cannot even see, but the camera can see."}, {"time": 1932, "text": "So you can get a lot of signal, but..."}, {"time": 1935, "text": "So we get things people can't see using a regular camera."}, {"time": 1938, "text": "And from that, we can tell things about your stress."}, {"time": 1941, "text": "So if you were just sitting there with a blank face thinking nobody can read my emotion, well, you're wrong."}, {"time": 1950, "text": "Right, so that's really interesting, but that's from sort of visual information from the face."}, {"time": 1954, "text": "That's almost like cheating your way to the physiological state of the body, by being very clever with what you can do with vision."}, {"time": 1962, "text": "With signal processing."}, {"time": 1964, "text": "So that's really impressive."}, {"time": 1965, "text": "But if you just look at the stuff we humans can see, the poker, the smile, the smirks, the subtle, all the facial actions."}, {"time": 1974, "text": "So then you can hide that on your face for a limited amount of time."}, {"time": 1977, "text": "Now, if you're just going in for a brief interview and you're hiding it, that's pretty easy for most people."}, {"time": 1983, "text": "If you are, however, surveilled constantly everywhere you go, then it's gonna say, gee, you know, Lex used to smile a lot and now I'm not seeing so many smiles."}, {"time": 1995, "text": "And Roz used to laugh a lot and smile a lot very spontaneously."}, {"time": 2002, "text": "And now I'm only seeing these not so spontaneous looking smiles."}, {"time": 2006, "text": "And only when she's asked these questions."}, {"time": 2008, "text": "You know, that's something's changed here."}, {"time": 2011, "text": "Probably not getting enough sleep."}, {"time": 2013, "text": "We could look at that too."}, {"time": 2015, "text": "So now I have to be a little careful too."}, {"time": 2017, "text": "When I say we, you think we can't read your emotion and we can, it's not that binary."}, {"time": 2022, "text": "What we're reading is more some physiological changes that relate to your activation."}, {"time": 2028, "text": "Now, that doesn't mean that we know everything about how you feel."}, {"time": 2032, "text": "In fact, we still know very little about how you feel."}, {"time": 2034, "text": "Your thoughts are still private."}, {"time": 2036, "text": "Your nuanced feelings are still completely private."}, {"time": 2041, "text": "We can't read any of that."}, {"time": 2042, "text": "So there's some relief that we can't read that."}, {"time": 2047, "text": "Even brain imaging can't read that."}, {"time": 2049, "text": "Wearables can't read that."}, {"time": 2052, "text": "However, as we read your body state changes and we know what's going on in your environment and we look at patterns of those over time, we can start to make some inferences about what you might be feeling."}, {"time": 2066, "text": "And that is where it's not just the momentary feeling but it's more your stance toward things."}, {"time": 2074, "text": "And that could actually be a little bit more scary with certain kinds of governmental control freak people who want to know more about are you on their team or are you not?"}, {"time": 2088, "text": "And getting that information through over time."}, {"time": 2090, "text": "So you're saying there's a lot of signal by looking at the change over time."}, {"time": 2094, "text": "So you've done a lot of exciting work both in computer vision and physiological sense like wearables."}, {"time": 2100, "text": "What do you think is the best modality for, what's the best window into the emotional soul?"}, {"time": 2108, "text": "Is it the face?"}, {"time": 2109, "text": "Is it the voice?"}, {"time": 2110, "text": "Depends what you want to know."}, {"time": 2111, "text": "It depends what you want to know."}, {"time": 2113, "text": "Everything is informative."}, {"time": 2115, "text": "Everything we do is informative."}, {"time": 2117, "text": "So for health and wellbeing and things like that, do you find the wearable physiotechnical, measuring physiological signals is the best for health based stuff?"}, {"time": 2129, "text": "So here I'm going to answer empirically with data and studies we've been doing."}, {"time": 2134, "text": "We've been doing studies."}, {"time": 2136, "text": "Now these are currently running with lots of different kinds of people but where we've published data and I can speak publicly to it, the data are limited right now to New England college students."}, {"time": 2147, "text": "So that's a small group."}, {"time": 2150, "text": "Among New England college students, when they are wearing a wearable like the empathic embrace here that's measuring skin conductance, movement, temperature."}, {"time": 2161, "text": "And when they are using a smartphone that is collecting their time of day of when they're texting, who they're texting, their movement around it, their GPS, the weather information based upon their location."}, {"time": 2178, "text": "And when it's using machine learning and putting all of that together and looking not just at right now but looking at your rhythm of behaviors over about a week."}, {"time": 2188, "text": "When we look at that, we are very accurate at forecasting tomorrow's stress, mood and happy, sad mood and health."}, {"time": 2198, "text": "And when we look at which pieces of that are most useful, first of all, if you have all the pieces, you get the best results."}, {"time": 2208, "text": "If you have only the wearable, you get the next best results."}, {"time": 2212, "text": "And that's still better than 80% accurate at forecasting tomorrow's levels."}, {"time": 2220, "text": "Isn't that exciting because the wearable stuff with physiological information, it feels like it violates privacy less than the noncontact face based methods."}, {"time": 2232, "text": "Yeah, it's interesting."}, {"time": 2234, "text": "I think what people sometimes don't, it's funny in the early days people would say, oh, wearing something or giving blood is invasive, right?"}, {"time": 2242, "text": "Whereas a camera is less invasive because it's not touching you."}, {"time": 2246, "text": "I think on the contrary, the things that are not touching you are maybe the scariest because you don't know when they're on or off."}, {"time": 2253, "text": "And you don't know who's behind it, right?"}, {"time": 2259, "text": "A wearable, depending upon what's happening to the data on it, if it's just stored locally or if it's streaming and what it is being attached to, in a sense, you have the most control over it because it's also very easy to just take it off, right?"}, {"time": 2279, "text": "Now it's not sensing me."}, {"time": 2281, "text": "So if I'm uncomfortable with what it's sensing, now I'm free, right?"}, {"time": 2287, "text": "If I'm comfortable with what it's sensing, then, and I happen to know everything about this one and what it's doing with it, so I'm quite comfortable with it, then I have control, I'm comfortable."}, {"time": 2300, "text": "Control is one of the biggest factors for an individual in reducing their stress."}, {"time": 2306, "text": "If I have control over it, if I know all there is to know about it, then my stress is a lot lower and I'm making an informed choice about whether to wear it or not, or when to wear it or not."}, {"time": 2318, "text": "I wanna wear it sometimes, maybe not others."}, {"time": 2320, "text": "Right, so that control, yeah, I'm with you."}, {"time": 2322, "text": "That control, even if, yeah, the ability to turn it off, that is a really important thing."}, {"time": 2329, "text": "And we need to, maybe, if there's regulations, maybe that's number one to protect is people's ability to, it's easy to opt out as to opt in."}, {"time": 2339, "text": "Right, so you've studied a bit of neuroscience as well."}, {"time": 2344, "text": "How have looking at our own minds, sort of the biological stuff or the neurobiological, the neuroscience to get the signals in our brain, helped you understand the problem and the approach of effective computing, so?"}, {"time": 2361, "text": "Originally, I was a computer architect and I was building hardware and computer designs and I wanted to build ones that worked like the brain."}, {"time": 2368, "text": "So I've been studying the brain as long as I've been studying how to build computers."}, {"time": 2373, "text": "Have you figured out anything yet?"}, {"time": 2377, "text": "It's so amazing."}, {"time": 2379, "text": "You know, they used to think like, oh, if you remove this chunk of the brain and you find this function goes away, well, that's the part of the brain that did it."}, {"time": 2385, "text": "And then later they realized if you remove this other chunk of the brain, that function comes back and, oh no, we really don't understand it."}, {"time": 2392, "text": "Brains are so interesting and changing all the time and able to change in ways that will probably continue to surprise us."}, {"time": 2402, "text": "When we were measuring stress, you may know the story where we found an unusual big skin conductance pattern on one wrist in one of our kids with autism."}, {"time": 2414, "text": "And in trying to figure out how on earth you could be stressed on one wrist and not the other, like how can you get sweaty on one wrist, right?"}, {"time": 2420, "text": "When you get stressed with that sympathetic fight or flight response, like you kind of should like sweat more in some places than others, but not more on one wrist than the other."}, {"time": 2427, "text": "That didn't make any sense."}, {"time": 2430, "text": "We learned that what had actually happened was a part of his brain had unusual electrical activity and that caused an unusually large sweat response on one wrist and not the other."}, {"time": 2444, "text": "And since then we've learned that seizures cause this unusual electrical activity."}, {"time": 2449, "text": "And depending where the seizure is, if it's in one place and it's staying there, you can have a big electrical response we can pick up with a wearable at one part of the body."}, {"time": 2458, "text": "You can also have a seizure that spreads over the whole brain, generalized grand mal seizure."}, {"time": 2462, "text": "And that response spreads and we can pick it up pretty much anywhere."}, {"time": 2501, "text": "Most of the time they're not seizing, most of the time they're fine."}, {"time": 2504, "text": "And so we are now working on mapping those deep brain regions that you can't even usually get with EEG scalp electrodes because the changes deep inside don't reach the surface."}, {"time": 2518, "text": "But interesting when some of those regions are activated, we see a big skin conductance response."}, {"time": 2524, "text": "Who would have thunk it, right?"}, {"time": 2525, "text": "Like nothing here, but something here."}, {"time": 2527, "text": "In fact, right after seizures that we think are the most dangerous ones that precede what's called SUDEP, Sudden Unexpected Death and Epilepsy, there's a period where the brainwaves go flat and it looks like the person's brain has stopped, but it hasn't."}, {"time": 2543, "text": "The activity has gone deep into a region that can make the cortical activity look flat, like a quick shutdown signal here."}, {"time": 2552, "text": "It can unfortunately cause breathing to stop if it progresses long enough."}, {"time": 2558, "text": "Before that happens, we see a big skin conductance response in the data that we have."}, {"time": 2563, "text": "The longer this flattening, the bigger our response here."}, {"time": 2566, "text": "So we have been trying to learn, you know, initially, like why are we getting a big response here when there's nothing here?"}, {"time": 2572, "text": "Well, it turns out there's something much deeper."}, {"time": 2575, "text": "So we can now go inside the brains of some of these individuals, fabulous people who usually aren't seizing, and get this data and start to map it."}, {"time": 2585, "text": "So that's the active research that we're doing right now with top medical partners."}, {"time": 2589, "text": "So this wearable sensor that's looking at skin conductance can capture sort of the ripples of the complexity of what's going on in our brain."}, {"time": 2598, "text": "So this little device, you have a hope that you can start to get the signal from the interesting things happening in the brain."}, {"time": 2607, "text": "Yeah, we've already published the strong correlations between the size of this response and the flattening that happens afterwards."}, {"time": 2615, "text": "And unfortunately, also in a real SUDEP case where the patient died because the, well, we don't know why."}, {"time": 2622, "text": "We don't know if somebody was there, it would have definitely prevented it."}, {"time": 2625, "text": "But we know that most SUDEPs happen when the person's alone."}, {"time": 2628, "text": "And in this case, a SUDEP is an acronym, S U D E P. And it stands for the number two cause of years of life lost actually among all neurological disorders."}, {"time": 2641, "text": "Stroke is number one, SUDEP is number two, but most people haven't heard of it."}, {"time": 2645, "text": "Actually, I'll plug my TED talk, it's on the front page of TED right now that talks about this."}, {"time": 2651, "text": "And we hope to change that."}, {"time": 2653, "text": "I hope everybody who's heard of SIDS and stroke will now hear of SUDEP because we think in most cases it's preventable if people take their meds and aren't alone when they have a seizure."}, {"time": 2666, "text": "Not guaranteed to be preventable."}, {"time": 2667, "text": "There are some exceptions, but we think most cases probably are."}, {"time": 2671, "text": "So you had this embrace now in the version two wristband, right, for epilepsy management."}, {"time": 2679, "text": "That's the one that's FDA approved?"}, {"time": 2682, "text": "Which is kind of a clear."}, {"time": 2683, "text": "FDA cleared, they say."}, {"time": 2686, "text": "No, it's okay."}, {"time": 2686, "text": "It essentially means it's approved for marketing."}, {"time": 2690, "text": "Just a side note, how difficult is that to do?"}, {"time": 2692, "text": "It's essentially getting FDA approval for computer science technology."}, {"time": 2697, "text": "It's so agonizing."}, {"time": 2698, "text": "It's much harder than publishing multiple papers in top medical journals."}, {"time": 2704, "text": "Yeah, we've published peer reviewed top medical journal neurology, best results, and that's not good enough for the FDA."}, {"time": 2710, "text": "Is that system, so if we look at the peer review of medical journals, there's flaws, there's strengths, is the FDA approval process, how does it compare to the peer review process?"}, {"time": 2721, "text": "Does it have the strength?"}, {"time": 2723, "text": "I'll take peer review over FDA any day."}, {"time": 2725, "text": "But is that a good thing?"}, {"time": 2726, "text": "Is that a good thing for FDA?"}, {"time": 2728, "text": "You're saying, does it stop some amazing technology from getting through?"}, {"time": 2732, "text": "Yeah, it does."}, {"time": 2733, "text": "The FDA performs a very important good role in keeping people safe."}, {"time": 2737, "text": "They keep things, they put you through tons of safety testing and that's wonderful and that's great."}, {"time": 2744, "text": "I'm all in favor of the safety testing."}, {"time": 2746, "text": "But sometimes they put you through additional testing that they don't have to explain why they put you through it and you don't understand why you're going through it and it doesn't make sense."}, {"time": 2758, "text": "And that's very frustrating."}, {"time": 2760, "text": "And maybe they have really good reasons and they just would, it would do people a service to articulate those reasons."}, {"time": 2769, "text": "Be more transparent."}, {"time": 2772, "text": "So as part of Empatica, you have sensors."}, {"time": 2775, "text": "So what kind of problems can we crack?"}, {"time": 2777, "text": "What kind of things from seizures to autism to I think I've heard you mentioned depression."}, {"time": 2788, "text": "What kind of things can we alleviate?"}, {"time": 2789, "text": "Can we detect?"}, {"time": 2790, "text": "What's your hope of what, how we can make the world a better place with this wearable tech?"}, {"time": 2795, "text": "I would really like to see my fellow brilliant researchers step back and say, what are the really hard problems that we don't know how to solve that come from people maybe we don't even see in our normal life because they're living in the poor places."}, {"time": 2814, "text": "They're stuck on the bus."}, {"time": 2816, "text": "They can't even afford the Uber or the Lyft or the data plan or all these other wonderful things we have that we keep improving on."}, {"time": 2824, "text": "Meanwhile, there's all these folks left behind in the world and they're struggling with horrible diseases with depression, with epilepsy, with diabetes, with just awful stuff that maybe a little more time and attention hanging out with them and learning what are their challenges in life?"}, {"time": 2842, "text": "What are their needs?"}, {"time": 2844, "text": "How do we help them have job skills?"}, {"time": 2845, "text": "How do we help them have a hope and a future and a chance to have the great life that so many of us building technology have?"}, {"time": 2854, "text": "And then how would that reshape the kinds of AI that we build?"}, {"time": 2857, "text": "How would that reshape the new apps that we build or the maybe we need to focus on how to make things more low cost and green instead of thousand dollar phones?"}, {"time": 2869, "text": "I mean, come on, why can't we be thinking more about things that do more with less for these folks?"}, {"time": 2876, "text": "Quality of life is not related to the cost of your phone."}, {"time": 2880, "text": "It's not something that, it's been shown that what about $75,000 of income and happiness is the same, okay?"}, {"time": 2888, "text": "However, I can tell you, you get a lot of happiness from helping other people."}, {"time": 2892, "text": "You get a lot more than $75,000 buys."}, {"time": 2895, "text": "So how do we connect up the people who have real needs with the people who have the ability to build the future and build the kind of future that truly improves the lives of all the people that are currently being left behind?"}, {"time": 2908, "text": "So let me return just briefly on a point, maybe in the movie, Her."}, {"time": 2915, "text": "So do you think if we look farther into the future, you said so much of the benefit from making our technology more empathetic to us human beings would make them better tools, empower us, make our lives better."}, {"time": 2930, "text": "Well, if we look farther into the future, do you think we'll ever create an AI system that we can fall in love with?"}, {"time": 2936, "text": "That we can fall in love with and loves us back on a level that is similar to human to human interaction, like in the movie Her or beyond?"}, {"time": 2947, "text": "I think we can simulate it in ways that could, you know, sustain engagement for a while."}, {"time": 2957, "text": "Would it be as good as another person?"}, {"time": 2960, "text": "I don't think so, if you're used to like good people."}, {"time": 2964, "text": "Now, if you've just grown up with nothing but abuse and you can't stand human beings, can we do something that helps you there that gives you something through a machine?"}, {"time": 2974, "text": "Yeah, but that's pretty low bar, right?"}, {"time": 2976, "text": "If you've only encountered pretty awful people."}, {"time": 2979, "text": "If you've encountered wonderful, amazing people, we're nowhere near building anything like that."}, {"time": 2984, "text": "And I would not bet on building it."}, {"time": 2989, "text": "I would bet instead on building the kinds of AI that helps kind of raise all boats, that helps all people be better people, helps all people figure out if they're getting sick tomorrow and helps give them what they need to stay well tomorrow."}, {"time": 3005, "text": "That's the kind of AI I wanna build that improves human lives, not the kind of AI that just walks on The Tonight Show and people go, wow, look how smart that is."}, {"time": 3015, "text": "And then it goes back in a box, you know?"}, {"time": 3018, "text": "So on that point, if we continue looking a little bit into the future, do you think an AI that's empathetic and does improve our lives need to have a physical presence, a body?"}, {"time": 3031, "text": "And even let me cautiously say the C word consciousness and even fear of mortality."}, {"time": 3040, "text": "So some of those human characteristics, do you think it needs to have those aspects or can it remain simply a machine learning tool that learns from data of behavior that learns to make us, based on previous patterns, feel better?"}, {"time": 3060, "text": "Or does it need those elements of consciousness?"}, {"time": 3062, "text": "It depends on your goals."}, {"time": 3063, "text": "If you're making a movie, it needs a body."}, {"time": 3066, "text": "It needs a gorgeous body."}, {"time": 3068, "text": "It needs to act like it has consciousness."}, {"time": 3070, "text": "It needs to act like it has emotion, right?"}, {"time": 3071, "text": "Because that's what sells."}, {"time": 3073, "text": "That's what's gonna get me to show up and enjoy the movie."}, {"time": 3077, "text": "In real life, does it need all that?"}, {"time": 3079, "text": "Well, if you've read Orson Scott Card, Ender's Game, Speaker of the Dead, it could just be like a little voice in your earring, right?"}, {"time": 3086, "text": "And you could have an intimate relationship and it could get to know you."}, {"time": 3089, "text": "And it doesn't need to be a robot."}, {"time": 3094, "text": "But that doesn't make this compelling of a movie, right?"}, {"time": 3097, "text": "I mean, we already think it's kind of weird when a guy looks like he's talking to himself on the train, even though it's earbuds."}, {"time": 3103, "text": "So we have these, embodied is more powerful."}, {"time": 3109, "text": "Embodied, when you compare interactions with an embodied robot versus a video of a robot versus no robot, the robot is more engaging."}, {"time": 3120, "text": "The robot gets our attention more."}, {"time": 3121, "text": "The robot, when you walk in your house, is more likely to get you to remember to do the things that you asked it to do, because it's kind of got a physical presence."}, {"time": 3129, "text": "You can avoid it if you don't like it."}, {"time": 3130, "text": "It could see you're avoiding it."}, {"time": 3132, "text": "There's a lot of power to being embodied."}, {"time": 3134, "text": "There will be embodied AIs."}, {"time": 3137, "text": "They have great power and opportunity and potential."}, {"time": 3142, "text": "There will also be AIs that aren't embodied, that just are little software assistants that help us with different things that may get to know things about us."}, {"time": 3153, "text": "Will they be conscious?"}, {"time": 3154, "text": "There will be attempts to program them to make them appear to be conscious."}, {"time": 3159, "text": "We can already write programs that make it look like, oh, what do you mean?"}, {"time": 3162, "text": "Of course I'm aware that you're there, right?"}, {"time": 3163, "text": "I mean, it's trivial to say stuff like that."}, {"time": 3165, "text": "It's easy to fool people, but does it actually have conscious experience like we do?"}, {"time": 3173, "text": "Nobody has a clue how to do that yet."}, {"time": 3175, "text": "That seems to be something that is beyond what any of us knows how to build now."}, {"time": 3181, "text": "Will it have to have that?"}, {"time": 3183, "text": "I think you can get pretty far with a lot of stuff without it."}, {"time": 3187, "text": "But will we accord it rights?"}, {"time": 3190, "text": "Well, that's more a political game than it is a question of real consciousness."}, {"time": 3196, "text": "Yeah, can you go to jail for turning off Alexa is the question for an election maybe a few decades from now."}, {"time": 3204, "text": "Well, Sophia Robot's already been given rights as a citizen in Saudi Arabia, right?"}, {"time": 3210, "text": "Even before women have full rights."}, {"time": 3213, "text": "Then the robot was still put back in the box to be shipped to the next place where it would get a paid appearance, right?"}, {"time": 3222, "text": "Yeah, it's dark and almost comedic, if not absurd."}, {"time": 3230, "text": "So I've heard you speak about your journey in finding faith."}, {"time": 3235, "text": "And how you discovered some wisdoms about life and beyond from reading the Bible."}, {"time": 3243, "text": "And I've also heard you say that, you said scientists too often assume that nothing exists beyond what can be currently measured."}, {"time": 3251, "text": "Yeah, materialism."}, {"time": 3252, "text": "Materialism."}, {"time": 3253, "text": "And scientism, yeah."}, {"time": 3254, "text": "So in some sense, this assumption enables the near term scientific method, assuming that we can uncover the mysteries of this world by the mechanisms of measurement that we currently have."}, {"time": 3268, "text": "But we easily forget that we've made this assumption."}, {"time": 3273, "text": "So what do you think we miss out on by making that assumption?"}, {"time": 3278, "text": "It's fine to limit the scientific method to things we can measure and reason about and reproduce."}, {"time": 3289, "text": "I think we have to recognize that sometimes we scientists also believe in things that happen historically."}, {"time": 3295, "text": "Like I believe the Holocaust happened."}, {"time": 3297, "text": "I can't prove events from past history scientifically."}, {"time": 3303, "text": "You prove them with historical evidence, right?"}, {"time": 3306, "text": "With the impact they had on people, with eyewitness testimony and things like that."}, {"time": 3311, "text": "So a good thinker recognizes that science is one of many ways to get knowledge."}, {"time": 3319, "text": "It's not the only way."}, {"time": 3321, "text": "And there's been some really bad philosophy and bad thinking recently, you can call it scientism, where people say science is the only way to get to truth."}, {"time": 3331, "text": "And it's not, it just isn't."}, {"time": 3333, "text": "There are other ways that work also."}, {"time": 3335, "text": "Like knowledge of love with someone."}]}]