[{"title": "Noam Chomsky: Language, Cognition, and Deep Learning | Lex Fridman Podcast #53", "id": "cMscNuSUy0I", "quotes": [{"time": 379, "text": "It determines the sound and meaning of the infinite number of expressions of your language."}, {"time": 387, "text": "It's localized."}, {"time": 388, "text": "It's not on your foot, obviously, it's in your brain."}, {"time": 391, "text": "If you look more closely, it's in specific configurations of your brain."}, {"time": 396, "text": "And that's essentially like the internal structure of your laptop, whatever programs it has are in there."}, {"time": 404, "text": "Now, one of the things you can do with language, it's a marginal thing, in fact, is use it to externalize what's in your head."}, {"time": 414, "text": "Actually, most of your use of language is thought, internal thought."}, {"time": 418, "text": "But you can do what you and I are now doing."}, {"time": 420, "text": "We can externalize it."}, {"time": 422, "text": "Well, the set of things that we're externalizing are an external system."}, {"time": 427, "text": "They're noises in the atmosphere."}, {"time": 431, "text": "And you can call that language in some other sense of the word."}, {"time": 434, "text": "But it's not a set of alternatives."}, {"time": 436, "text": "These are just different concepts."}, {"time": 438, "text": "So how deep do the roots of language go in our brain?"}, {"time": 443, "text": "Our mind, is it yet another feature like vision, or is it something more fundamental from which everything else springs in the human mind?"}, {"time": 451, "text": "Well, in a way, it's like vision."}, {"time": 453, "text": "There's something about our genetic endowment that determines that we have a mammalian rather than an insect visual system."}, {"time": 464, "text": "And there's something in our genetic endowment that determines that we have a human language faculty."}, {"time": 471, "text": "No other organism has anything remotely similar."}, {"time": 475, "text": "So in that sense, it's internal."}, {"time": 478, "text": "Now there is a long tradition, which I think is valid going back centuries to the early scientific revolution, at least that holds that language is the sort of the core of human cognitive nature."}, {"time": 493, "text": "It's the source, it's the mode for constructing thoughts and expressing them."}, {"time": 499, "text": "That is what forms thought."}, {"time": 502, "text": "And it's got fundamental creative capacities."}, {"time": 507, "text": "It's free, independent, unbounded, and so on."}, {"time": 511, "text": "And undoubtedly, I think the basis for our creative capacities and the other remarkable human capacities that lead to the unique achievements and not so great achievements of the species."}, {"time": 531, "text": "The capacity to think and reason, do you think that's deeply linked with language?"}, {"time": 536, "text": "Do you think the way we, the internal language system is essentially the mechanism by which we also reason internally?"}, {"time": 544, "text": "It is undoubtedly the mechanism by which we reason."}, {"time": 546, "text": "There may also be other fact, there are undoubtedly other faculties involved in reasoning."}, {"time": 554, "text": "We have a kind of scientific faculty, nobody knows what it is, but whatever it is that enables us to pursue certain lines of endeavor and inquiry and to decide what makes sense and doesn't make sense and to achieve a certain degree of understanding of the world, that uses language, but goes beyond it."}, {"time": 577, "text": "Just as using our capacity for arithmetic is not the same as having the capacity."}, {"time": 584, "text": "The idea of capacity, our biology, evolution, you've talked about it defining essentially our capacity, our limit and our scope."}, {"time": 595, "text": "Can you try to define what limit and scope are?"}, {"time": 598, "text": "And the bigger question, do you think it's possible to find the limit of human cognition?"}, {"time": 609, "text": "It's commonly believed, most scientists believe that human intelligence can answer any question in principle."}, {"time": 619, "text": "I think that's a very strange belief."}, {"time": 621, "text": "If we're biological organisms, which are not angels, then our capacities ought to have scope and limits which are interrelated."}, {"time": 634, "text": "Can you define those two terms?"}, {"time": 636, "text": "Well, let's take a concrete example."}, {"time": 640, "text": "Your genetic endowment determines that you can have a male in visual system, arms and legs and so on, but it therefore become a rich, complex organism."}, {"time": 653, "text": "But if you look at that same genetic endowment, it prevents you from developing in other directions."}, {"time": 659, "text": "There's no kind of experience which would yield the embryo to develop an insect visual system or to develop wings instead of arms."}, {"time": 671, "text": "So the very endowment that confers richness and complexity also sets bounds on what can be attained."}, {"time": 683, "text": "Now, I assume that our cognitive capacities are part of the organic world."}, {"time": 689, "text": "Therefore, they should have the same properties."}, {"time": 692, "text": "If they had no built in capacity to develop a rich and complex structure, we would understand nothing."}, {"time": 701, "text": "Just as if your genetic endowment did not compel you to develop arms and legs, you would just be some kind of random amoeboid creature with no structure at all."}, {"time": 716, "text": "So I think it's plausible to assume that there are limits and I think we even have some evidence as to what they are."}, {"time": 723, "text": "So for example, there's a classic moment in the history of science at the time of Newton."}, {"time": 731, "text": "There was a from Galileo to Newton modern science developed on a fundamental assumption which Newton also accepted."}, {"time": 740, "text": "Namely that the world is an entire universe is a mechanical object."}, {"time": 746, "text": "And by mechanical, they meant something like the kinds of artifacts that were being developed by skilled artisans all over Europe, the gears, levers and so on."}, {"time": 757, "text": "And their belief was well, the world is just a more complex variant of this."}, {"time": 762, "text": "Newton, to his astonishment and distress, proved that there are no machines, that there's interaction without contact."}, {"time": 774, "text": "His contemporaries like Leibniz and Huygens just dismissed this as returning to the mysticism of the neo scholastics."}, {"time": 783, "text": "And Newton agreed."}, {"time": 785, "text": "He said it is totally absurd."}, {"time": 788, "text": "No person of any scientific intelligence could ever accept this for a moment."}, {"time": 793, "text": "In fact, he spent the rest of his life trying to get around it somehow, as did many other scientists."}, {"time": 800, "text": "That was the very criterion of intelligibility for say Galileo or Newton."}, {"time": 807, "text": "Theory did not produce an intelligible world unless you could duplicate it in a machine."}, {"time": 814, "text": "He showed you can't, there are no machines, any."}, {"time": 817, "text": "Finally, after a long struggle, took a long time, scientists just accepted this as common sense."}, {"time": 825, "text": "But that's a significant moment."}, {"time": 827, "text": "That means they abandoned the search for an intelligible world."}, {"time": 831, "text": "And the great philosophers of the time understood that very well."}, {"time": 837, "text": "So for example, David Hume in his encomium to Newton wrote that who was the greatest thinker ever and so on."}, {"time": 845, "text": "He said that he unveiled many of the secrets of nature, but by showing the imperfections of the mechanical philosophy, mechanical science, he left us with, he showed that there are mysteries which ever will remain."}, {"time": 863, "text": "And science just changed its goals."}, {"time": 866, "text": "It abandoned the mysteries."}, {"time": 868, "text": "It can't solve it, we'll put it aside."}, {"time": 871, "text": "We only look for intelligible theories."}, {"time": 874, "text": "Newton's theories were intelligible."}, {"time": 876, "text": "It's just what they described wasn't."}, {"time": 879, "text": "Well, Locke said the same thing."}, {"time": 882, "text": "I think they're basically right."}, {"time": 884, "text": "And if so, that showed something about the limits of human cognition."}, {"time": 889, "text": "We cannot attain the goal of understanding the world, of finding an intelligible world."}, {"time": 898, "text": "This mechanical philosophy Galileo to Newton, there's a good case that can be made that that's our instinctive conception of how things work."}, {"time": 910, "text": "So if say infants are tested with things that, if this moves and then this moves, they kind of invent something that must be invisible that's in between them that's making them move and so on."}, {"time": 924, "text": "Yeah, we like physical contact."}, {"time": 926, "text": "Something about our brain seeks."}, {"time": 928, "text": "Makes us want a world like that."}, {"time": 931, "text": "Just like it wants a world that has regular geometric figures."}, {"time": 936, "text": "So for example, Descartes pointed this out that if you have an infant who's never seen a triangle before and you draw a triangle, the infant will see a distorted triangle, not whatever crazy figure it actually is."}, {"time": 956, "text": "Three lines not coming quite together, one of them a little bit curved and so on."}, {"time": 960, "text": "We just impose a conception of the world in terms of geometric, perfect geometric objects."}, {"time": 969, "text": "It's now been shown that goes way beyond that."}, {"time": 972, "text": "That if you show on a tachistoscope, let's say a couple of lights shining, you do it three or four times in a row."}, {"time": 980, "text": "What people actually see is a rigid object in motion, not whatever's there."}, {"time": 986, "text": "We all know that from a television set basically."}, {"time": 991, "text": "So that gives us hints of potential limits to our cognition."}, {"time": 995, "text": "I think it does, but it's a very contested view."}, {"time": 999, "text": "If you do a poll among scientists, it's impossible we can understand anything."}, {"time": 1006, "text": "Let me ask and give me a chance with this."}, {"time": 1008, "text": "So I just spent a day at a company called Neuralink and what they do is try to design what's called the brain machine, brain computer interface."}, {"time": 1019, "text": "So they try to do thousands readings in the brain, be able to read what the neurons are firing and then stimulate back, so two way."}, {"time": 1028, "text": "Do you think their dream is to expand the capacity of the brain to attain information, sort of increase the bandwidth of which we can search Google kind of thing?"}, {"time": 1042, "text": "Do you think our cognitive capacity might be expanded our linguistic capacity, our ability to reason might be expanded by adding a machine into the picture?"}, {"time": 1053, "text": "Can be expanded in a certain sense, but a sense that was known thousands of years ago."}, {"time": 1059, "text": "A book expands your cognitive capacity."}, {"time": 1063, "text": "Okay, so this could expand it too."}, {"time": 1066, "text": "But it's not a fundamental expansion."}, {"time": 1067, "text": "It's not totally new things could be understood."}, {"time": 1070, "text": "Well, nothing that goes beyond their native cognitive capacities."}, {"time": 1076, "text": "Just like you can't turn the visual system into an insect system."}, {"time": 1080, "text": "Well, I mean, the thought is, the thought is perhaps you can't directly, but you can map sort of."}, {"time": 1088, "text": "You couldn't, but we already, we know that without this experiment."}, {"time": 1092, "text": "You could map what a bee sees and present it in a form so that we could follow it."}, {"time": 1097, "text": "In fact, every bee scientist does that."}, {"time": 1099, "text": "But you don't think there's something greater than bees that we can map and then all of a sudden discover something, be able to understand a quantum world, quantum mechanics, be able to start to be able to make sense."}, {"time": 1115, "text": "Students at MIT study and understand quantum mechanics."}, {"time": 1121, "text": "But they always reduce it to the infant, the physical."}, {"time": 1125, "text": "I mean, they don't really understand."}, {"time": 1126, "text": "Oh, you don't, there's thing, that may be another area where there's just a limit to understanding."}, {"time": 1132, "text": "We understand the theories, but the world that it describes doesn't make any sense."}, {"time": 1138, "text": "So, you know, the experiment, Schrodinger's cat, for example, can understand the theory, but as Schrodinger pointed out, it's an unintelligible world."}, {"time": 1149, "text": "One of the reasons why Einstein was always very skeptical about quantum theory, was that he described himself as a classical realist, in one's intelligibility."}, {"time": 1163, "text": "He has something in common with infants in that way."}, {"time": 1167, "text": "So, back to linguistics."}, {"time": 1170, "text": "If you could humor me, what are the most beautiful or fascinating aspects of language or ideas in linguistics or cognitive science that you've seen in a lifetime of studying language and studying the human mind?"}, {"time": 1184, "text": "Well, I think the deepest property of language and puzzling property that's been discovered is what is sometimes called structure dependence."}, {"time": 1197, "text": "We now understand it pretty well, but it was puzzling for a long time."}, {"time": 1201, "text": "I'll give you a concrete example."}, {"time": 1203, "text": "So, suppose you say the guy who fixed the car carefully packed his tools, it's ambiguous."}, {"time": 1213, "text": "He could fix the car carefully or carefully pack his tools."}, {"time": 1217, "text": "Suppose you put carefully in front, carefully the guy who fixed the car packed his tools, then it's carefully packed, not carefully fixed."}, {"time": 1229, "text": "And in fact, you do that even if it makes no sense."}, {"time": 1232, "text": "So, suppose you say carefully, the guy who fixed the car is tall."}, {"time": 1239, "text": "You have to interpret it as carefully he's tall, even though that doesn't make any sense."}, {"time": 1244, "text": "And notice that that's a very puzzling fact because you're relating carefully not to the linearly closest verb, but to the linearly more remote verb."}, {"time": 1257, "text": "A linear closeness is an easy computation, but here you're doing a much more, what looks like a more complex computation."}, {"time": 1266, "text": "You're doing something that's taking you essentially to the more remote thing."}, {"time": 1273, "text": "It's now, if you look at the actual structure of the sentence, where the phrases are and so on, turns out you're picking out the structurally closest thing, but the linearly more remote thing."}, {"time": 1287, "text": "But notice that what's linear is 100% of what you hear."}, {"time": 1292, "text": "You never hear structure, can't."}, {"time": 1295, "text": "So, what you're doing is, and certainly this is universal, all constructions, all languages, and what we're compelled to do is carry out what looks like the more complex computation on material that we never hear, and we ignore 100% of what we hear and the simplest computation."}, {"time": 1317, "text": "By now, there's even a neural basis for this that's somewhat understood, and there's good theories by now that explain why it's true."}, {"time": 1326, "text": "That's a deep insight into the surprising nature of language with many consequences."}, {"time": 1334, "text": "Let me ask you about a field of machine learning, deep learning."}, {"time": 1338, "text": "There's been a lot of progress in neural networks based, neural network based machine learning in the recent decade."}, {"time": 1346, "text": "Of course, neural network research goes back many decades."}, {"time": 1350, "text": "What do you think are the limits of deep learning, of neural network based machine learning?"}, {"time": 1358, "text": "Well, to give a real answer to that, you'd have to understand the exact processes that are taking place, and those are pretty opaque."}, {"time": 1367, "text": "So, it's pretty hard to prove a theorem about what can be done and what can't be done, but I think it's reasonably clear."}, {"time": 1376, "text": "I mean, putting technicalities aside, what deep learning is doing is taking huge numbers of examples and finding some patterns."}, {"time": 1387, "text": "Okay, that could be interesting in some areas it is, but we have to ask here a certain question."}, {"time": 1395, "text": "Is it engineering or is it science?"}, {"time": 1398, "text": "Engineering in the sense of just trying to build something that's useful, or science in the sense that it's trying to understand something about elements of the world."}, {"time": 1408, "text": "So, take, say, a Google parser."}, {"time": 1411, "text": "We can ask that question."}, {"time": 1413, "text": "Is it useful, yeah, it's pretty useful."}, {"time": 1416, "text": "I use a Google translator, so on engineering grounds, it's kind of worth having, like a bulldozer."}, {"time": 1425, "text": "Does it tell you anything about human language?"}, {"time": 1428, "text": "Zero, nothing, and in fact, it's very striking."}, {"time": 1434, "text": "From the very beginning, it's just totally remote from science."}, {"time": 1440, "text": "So, what is a Google parser doing?"}, {"time": 1442, "text": "It's taking an enormous text, let's say the Wall Street Journal corpus, and asking how close can we come to getting the right description of every sentence in the corpus."}, {"time": 1456, "text": "Well, every sentence in the corpus is essentially an experiment."}, {"time": 1461, "text": "Each sentence that you produce is an experiment which says, am I a grammatical sentence?"}, {"time": 1467, "text": "The answer is usually yes."}, {"time": 1469, "text": "So, most of the stuff in the corpus is grammatical sentences."}, {"time": 1473, "text": "But now, ask yourself, is there any science which takes random experiments which are carried out for no reason whatsoever and tries to find out something from them?"}, {"time": 1486, "text": "Like if you're, say, a chemistry PhD student, you wanna get a thesis, can you say, well, I'm just gonna mix a lot of things together, no purpose, and maybe I'll find something."}, {"time": 1499, "text": "You'd be laughed out of the department."}, {"time": 1502, "text": "Science tries to find critical experiments, ones that answer some theoretical question."}, {"time": 1509, "text": "Doesn't care about coverage of millions of experiments."}, {"time": 1512, "text": "So, it just begins by being very remote from science and it continues like that."}, {"time": 1518, "text": "So, the usual question that's asked about, say, a Google parser is how well does it do, or some parser, how well does it do on a corpus?"}, {"time": 1528, "text": "But there's another question that's never asked."}, {"time": 1531, "text": "How well does it do on something that violates all the rules of language?"}, {"time": 1536, "text": "So, for example, take the structure dependence case that I mentioned."}, {"time": 1539, "text": "Suppose there was a language in which you used linear proximity as the mode of interpretation."}, {"time": 1549, "text": "These deep learning would work very easily on that."}, {"time": 1551, "text": "In fact, much more easily on an actual language."}, {"time": 1554, "text": "Is that a success?"}, {"time": 1555, "text": "No, that's a failure from a scientific point of view."}, {"time": 1559, "text": "It's a failure."}, {"time": 1560, "text": "It shows that we're not discovering the nature of the system at all, because it does just as well or even better on things that violate the structure of the system."}, {"time": 1570, "text": "And it goes on from there."}, {"time": 1572, "text": "It's not an argument against doing it."}, {"time": 1574, "text": "It is useful to have devices like this."}, {"time": 1577, "text": "So, yes, so neural networks are kind of approximators that look, there's echoes of the behavioral debates, right?"}, {"time": 1584, "text": "Behavioralism."}, {"time": 1586, "text": "More than echoes."}, {"time": 1587, "text": "Many of the people in deep learning say they've vindicated Terry Sanyosky, for example, in his recent books, as this vindicates Skinnerian behaviors."}, {"time": 1599, "text": "It doesn't have anything to do with it."}, {"time": 1601, "text": "Yes, but I think there's something actually fundamentally different when the data set is huge."}, {"time": 1608, "text": "But your point is extremely well taken."}, {"time": 1611, "text": "But do you think we can learn, approximate that interesting complex structure of language with neural networks that will somehow help us understand the science?"}, {"time": 1624, "text": "I mean, you find patterns that you hadn't noticed, let's say, could be."}, {"time": 1629, "text": "In fact, it's very much like a kind of linguistics that's done, what's called corpus linguistics."}, {"time": 1638, "text": "When you, suppose you have some language where all the speakers have died out, but you have records."}, {"time": 1645, "text": "So you just look at the records and see what you can figure out from that."}, {"time": 1650, "text": "It's much better than, it's much better to have actual speakers where you can do critical experiments."}, {"time": 1656, "text": "But if they're all dead, you can't do them."}, {"time": 1658, "text": "So you have to try to see what you can find out from just looking at the data that's around."}, {"time": 1663, "text": "You can learn things."}, {"time": 1665, "text": "Actually, paleoanthropology is very much like that."}, {"time": 1668, "text": "You can't do a critical experiment on what happened two million years ago."}, {"time": 1673, "text": "So you're kind of forced just to take what data's around and see what you can figure out from it."}, {"time": 1679, "text": "Okay, it's a serious study."}, {"time": 1681, "text": "So let me venture into another whole body of work and philosophical question."}, {"time": 1688, "text": "You've said that evil in society arises from institutions, not inherently from our nature."}, {"time": 1695, "text": "Do you think most human beings are good, they have good intent?"}, {"time": 1699, "text": "Or do most have the capacity for intentional evil that depends on their upbringing, depends on their environment, on context?"}, {"time": 1707, "text": "I wouldn't say that they don't arise from our nature."}, {"time": 1710, "text": "Anything we do arises from our nature."}, {"time": 1714, "text": "And the fact that we have certain institutions, not others, is one mode in which human nature has expressed itself."}, {"time": 1723, "text": "But as far as we know, human nature could yield many different kinds of institutions."}, {"time": 1730, "text": "The particular ones that have developed have to do with historical contingency, who conquered whom, and that sort of thing."}, {"time": 1740, "text": "They're not rooted in our nature in the sense that they're essential to our nature."}, {"time": 1746, "text": "So it's commonly argued that these days that something like market systems is just part of our nature."}, {"time": 1755, "text": "But we know from a huge amount of evidence that that's not true."}, {"time": 1759, "text": "There's all kinds of other structures."}, {"time": 1761, "text": "It's a particular fact of a moment of modern history."}, {"time": 1766, "text": "Others have argued that the roots of classical liberalism actually argue that what's called sometimes an instinct for freedom, the instinct to be free of domination by illegitimate authority is the core of our nature."}, {"time": 1783, "text": "That would be the opposite of this."}, {"time": 1785, "text": "And we don't know."}, {"time": 1787, "text": "We just know that human nature can accommodate both kinds."}, {"time": 1792, "text": "If you look back at your life, is there a moment in your intellectual life or life in general that jumps from memory that brought you happiness that you would love to relive again?"}]}]