[{"title": "Duncan Trussell: Comedy, Sentient Robots, Suffering, Love & Burning Man | Lex Fridman Podcast #312", "id": "jdIyNMkusLE", "quotes": [{"time": 251, "text": "Can you imagine if you're still resentful of something someone did to you in the 14th century, but it would compound."}, {"time": 259, "text": "Well, if you repeat the same thing over and over and over, there would be no difference."}, {"time": 263, "text": "Maybe you would start to appreciate the nuances more, like when you watch the same movie over and over and over, maybe you'll get to actually let go of this idea of all the possible, all the positive possibilities that lay before you, but actually enjoy the moment much more."}, {"time": 281, "text": "If you remember that you've lived this life a thousand times, all the little things, the way somebody smiles, if you're been abused, the way somebody, like the pain of it, the suffering, the down that you feel, the experience of sadness, depression, fear, all that kind of stuff."}, {"time": 297, "text": "You get to really, you get to also appreciate that that's part of life, part of being alive."}, {"time": 302, "text": "Now, also in his experiment, if I was gonna, and I love the experiment from the perspective of like, just where technology is now and simulation theory and stuff like that."}, {"time": 311, "text": "But in that thought experiment, if this rotten demon immediately killed you, then within that, it's a little more horrifying because even in the, first of all, you're trusting a fucking demon."}, {"time": 328, "text": "Why are you talking to a demon?"}, {"time": 330, "text": "Yeah, because that is gonna be, even before I get into like the metaphysics and like the implications and where is this life stored?"}, {"time": 336, "text": "Where's the loop stored?"}, {"time": 338, "text": "I mean, are we talking about some kind of unchanging data set or something?"}, {"time": 342, "text": "For that, you're like, why is there a fucking talking demon in my room trying to freak me out?"}, {"time": 347, "text": "You're gonna wanna autopsy the demon."}, {"time": 348, "text": "Can you catch it?"}, {"time": 349, "text": "Does this apply to you, demon?"}, {"time": 350, "text": "And again, obviously it's a fucking thought experiment."}, {"time": 353, "text": "Nietzsche would be annoyed by me, but I think like you would still be able to entertain the joy, you'd have the joy of not knowing what's around the corner."}, {"time": 363, "text": "You know, still, it's not like you know what's coming just cause the demon said some kind of loop."}, {"time": 368, "text": "In other words, the idea of being damned to your past decisions, it doesn't even work because you can't remember what decisions you're about to make."}, {"time": 377, "text": "So from that perspective also, I think I'd be happy about it."}, {"time": 380, "text": "Or I would just think, oh cool."}, {"time": 382, "text": "I mean, it's a good story."}, {"time": 383, "text": "I'm gonna tell people about how this."}, {"time": 384, "text": "I wonder what the demon would actually look like in real life cause I suspect that would look like a charming, like a friend."}, {"time": 392, "text": "Wouldn't they be a loved one?"}, {"time": 394, "text": "Wouldn't the demon come to you through the mechanism, through the front door of love, not through the back door of evil, like malevolent manipulation?"}, {"time": 404, "text": "Sure, I mean, if it's the truth, if it's the truth and that's whether it's love or not, it's still good fundamentally."}, {"time": 413, "text": "I do like the idea of the memory replay."}, {"time": 416, "text": "I remember I went to a Newer Link event a few years ago and got to hang out with Elon."}, {"time": 422, "text": "I remember how visceral it is that there's like a pig with a Newer Link in it."}, {"time": 429, "text": "And you're talking about memory replays as a future, maybe far future possibility."}, {"time": 435, "text": "And you realize, well, this is a very meaningful moment in my life."}, {"time": 439, "text": "This could be a replay."}, {"time": 441, "text": "Of all the things you replay, it's probably, there's certain magical moments in your life."}, {"time": 448, "text": "Whatever it is, certain people you've met for the first time or certain things you've done for the first time with certain people or just an awesome thing you did."}, {"time": 456, "text": "And I remember just saying to him, like, I would probably want to replay this, this moment."}, {"time": 464, "text": "And it just seemed very kind of, I mean, there was a recursive nature to it, but it seemed very real that this is something we would want to do, that the richness of life could be experienced through the replay."}, {"time": 479, "text": "That's probably where it's experienced the most."}, {"time": 482, "text": "You could see life as a way to collect a bunch of cool memories, and then you get to sit back in your nice VR headset and replay the cool ones."}, {"time": 491, "text": "This is, in Buddhism, the idea that I struggle with is that there's a possibility of not reincarnating, of not coming back."}, {"time": 504, "text": "This is suffering here."}, {"time": 505, "text": "The suffering is caused by attachment."}, {"time": 507, "text": "And so if you like revise the idea of reincarnation or the Nietzsche's loop and look at it from, could this be possible?"}, {"time": 519, "text": "Or how would this be possible technologically?"}, {"time": 522, "text": "Then to me, it makes a lot of sense."}, {"time": 525, "text": "Like I've been thinking a lot about this very thing and the Nietzsche's idea connecting to it."}, {"time": 531, "text": "I had this like, it sounds so dumb, but I was at the dentist getting nitrous oxide, high as a fucking kite, man."}, {"time": 539, "text": "And I had this idea, I was thinking about data."}, {"time": 543, "text": "I was thinking like, man, probably, if I had to bet, there's some energetic form that we're not aware of that for a super advanced technology would be as detectable as like starlight, but something that we just don't even know what it is."}, {"time": 559, "text": "Quantum turbulence, who the fuck knows?"}, {"time": 562, "text": "Fill in the blank, whatever that X may be."}, {"time": 602, "text": "I'm only saying quantum because it's what dumb people say when they don't know."}, {"time": 605, "text": "You just say quantum, I don't know."}, {"time": 608, "text": "You're decoding that."}, {"time": 609, "text": "So meaning, in simulation theory, one of the big questions that pops up is why and are we in one?"}, {"time": 618, "text": "And Elon has talked about, well, it's probably more of a probability than we're in one than we're not, in which case, what you're talking about is actually happening, that that loop you're talking about, we've decided to be here."}, {"time": 632, "text": "This, of all the things, we decided this one, oh, let's do that one again."}, {"time": 637, "text": "I wanna do that one."}, {"time": 638, "text": "Let's try, let's do that."}, {"time": 640, "text": "I love thinking about this because I love my family."}, {"time": 644, "text": "And it makes sense to me that if I'm going to replay some life or another, it's definitely gonna be this one with my kids, my wife, with all the bullshit that's gone along with it, I'm still gonna wanna come back."}, {"time": 655, "text": "So in Buddhism, that's attachment."}, {"time": 657, "text": "Yeah, but you weren't the one, oh, you're saying that you're the main player, you're not the NPC."}, {"time": 661, "text": "Well, I think we're dealing with all NPCs at this point."}, {"time": 664, "text": "I mean, depending on how you wanna, like very, I would say very advanced NPCs, like incredibly advanced NPCs compared to Fallout or something."}, {"time": 674, "text": "We've got a lot of conversation options happening here."}, {"time": 677, "text": "There's not like four things you can pick from."}, {"time": 680, "text": "Yeah, there's a whole illusion of free will that's happening."}, {"time": 684, "text": "We really do, depending where you are in the world, feel like you're free to decide any trajectory in your life that you want."}, {"time": 692, "text": "Which is pretty funny, right?"}, {"time": 693, "text": "For an NPC, it's pretty, it's nice."}, {"time": 696, "text": "Well, you're gonna want that."}, {"time": 697, "text": "If we're making a video game, you do wanna give your NPCs the illusion of free will because it's gonna make interactions with them that much more intense."}, {"time": 707, "text": "Yeah, so I wonder on the path to that, how hard is it to create, this is sort of the Carmack question of a realistic virtual world that's as cool as this one."}, {"time": 722, "text": "Not fully realistic, but sufficiently realistic that it's as interesting to live in."}, {"time": 728, "text": "Because we're gonna have to create those worlds on the path to creating something like a simulation."}, {"time": 735, "text": "Like long, long, long before."}, {"time": 737, "text": "It'd be virtual worlds where we'd wanna stay forever because they're full of that balance of suffering and joy, of limitations and freedoms and all that kind of stuff."}, {"time": 749, "text": "A lot of people think like in the virtual world, I can't wait to be able to, I don't know, have sex with anybody I want or have anything I want."}, {"time": 759, "text": "But I think that's not gonna be fun."}, {"time": 762, "text": "You want the limitations, the constraints."}, {"time": 764, "text": "So you have to battle for the things you want."}, {"time": 767, "text": "Okay, but, okay, but great video games."}, {"time": 770, "text": "One of my favorite video game memories was like I started playing World of Warcraft in its original incarnation."}, {"time": 777, "text": "And I didn't even know that you were gonna have flying mounts."}, {"time": 781, "text": "Like I didn't even know."}, {"time": 782, "text": "So I've been running around dealing with all the encumbrances of like being an undead warlock that can't fly."}, {"time": 788, "text": "But then all of a sudden, holy shit, there's flying mounts."}, {"time": 792, "text": "And now the world you've been running around not flying, you're seeing it from the top down."}, {"time": 796, "text": "It was just really cool."}, {"time": 798, "text": "Like, whoa, I could do this now."}, {"time": 799, "text": "And then that gets boring."}, {"time": 801, "text": "But a really well designed game, it has a series of these, I don't know what you call it, extra abilities that kind of unfold and produce novelty."}, {"time": 813, "text": "And then eventually you just accept it, you take it for granted."}, {"time": 817, "text": "And then another novelty appears."}, {"time": 820, "text": "Those extra abilities are always balanced with the limitations, the constraints they run up against."}, {"time": 824, "text": "Because a well balanced video game, the challenge, the struggle matches the new ability."}, {"time": 831, "text": "Yeah, and sometimes causes problems on its own."}, {"time": 834, "text": "I mean, and so to go back to this universe, this simulation, it's really designed like a pretty awesome video game."}, {"time": 842, "text": "If you look at it from the perspective of history, I mean, people were on horses."}, {"time": 848, "text": "They didn't know that they were gonna be bullet trains."}, {"time": 850, "text": "They didn't know that you could get in a car and drive across the country in a few days."}, {"time": 855, "text": "That would have sounded ridiculous."}, {"time": 858, "text": "And even in our own lifespan, think about it."}, {"time": 861, "text": "How long has VR goggles existed?"}, {"time": 864, "text": "Like the ones that you could just buy at Best Buy."}, {"time": 867, "text": "I had the original Oculus Rift, the fucking puke machine."}, {"time": 871, "text": "You put that thing on, I gave it to my friend."}, {"time": 874, "text": "He went and vomited in my driveway and people were making fun of it."}, {"time": 878, "text": "They were saying, this isn't gonna catch on."}, {"time": 880, "text": "It's too big, it's unwieldy, the graphics suck."}, {"time": 883, "text": "And then look at where it's at now."}, {"time": 885, "text": "And that's going to keep, that trajectory is gonna keep improving."}, {"time": 890, "text": "So yeah, I think that we are dealing with what you're talking about, which is novelty met with more problems, met with novelty."}, {"time": 899, "text": "Yeah, I wonder why VR is not more popular."}, {"time": 901, "text": "I wonder what is going to be the magic thing that really convinces a large fraction of the world to move into the virtual world."}, {"time": 913, "text": "I suppose we're already there in the 2D screen of Twitter and social media and that kind of stuff."}, {"time": 919, "text": "And even video games, there's a lot of people that get a big sense of community from video games."}, {"time": 926, "text": "But like, it doesn't feel like you're living there."}, {"time": 929, "text": "It's like, bye mom, I'm going to this other world."}, {"time": 935, "text": "Or like you leave your girlfriend to go get your digital girlfriend."}, {"time": 940, "text": "That's gonna be a problem."}, {"time": 941, "text": "There's less jealousy in the digital world."}, {"time": 943, "text": "Maybe there should be a lot of jealousy in the digital world."}, {"time": 946, "text": "Cause that's jealousy, a little jealousy is probably good for relationships, even in the digital world."}, {"time": 954, "text": "So you're gonna have to simulate all of that kind of stuff."}, {"time": 956, "text": "But I wonder what the magic thing that says, I wanna spend most of my days inside the virtual world."}, {"time": 961, "text": "Well, clearly it's gonna be something we don't have yet."}, {"time": 965, "text": "I mean, strapping that damn thing on your face still feels weird."}, {"time": 968, "text": "It's heavy."}, {"time": 969, "text": "If you're depending on what gear you're using, sometimes light can leak in."}, {"time": 973, "text": "There's just, you gotta recharge it."}, {"time": 975, "text": "It's hyper limited."}, {"time": 976, "text": "And then, so yeah, it's gonna have to be something that like simulates taste, smell."}, {"time": 987, "text": "You think taste and smell are important touch?"}, {"time": 990, "text": "I can't just do, in World War II, you would write letters."}, {"time": 994, "text": "You could still, don't you think you can convey love with just words?"}, {"time": 999, "text": "But I think for what you're talking about to happen, it has to be fully immersive."}, {"time": 1030, "text": "Once that happens, I'd say we're gonna see a complete radical shift in everything."}, {"time": 1038, "text": "See, I disagree with you."}, {"time": 1039, "text": "I don't know if you've seen the movie Her."}, {"time": 1042, "text": "I think you can go to another world in where a digital being lives in the darkness and all you hear is Scarlett Johansson voice talking to you and she lives there or he lives there, your friend, your loved one, and all you have is voice and words."}, {"time": 1060, "text": "And I think that could be sufficient to pull you into that world where you look forward to that moment all day."}, {"time": 1067, "text": "You never wanna leave the darkness, just closing your eyes and listening to the voice."}, {"time": 1071, "text": "I think those basic mediums of communication is still enough."}, {"time": 1076, "text": "Like language is really, really powerful."}, {"time": 1078, "text": "And I think the realism of touch and smell and all that kind of stuff is not nearly as powerful as language."}, {"time": 1084, "text": "That's what makes humans really special is our ability to communicate with each other."}, {"time": 1089, "text": "That's the sense of like deep connection we get is through communication."}, {"time": 1093, "text": "Now that communication could involve touch."}, {"time": 1096, "text": "Like, you know, hugging feels damn good."}, {"time": 1100, "text": "You see a good friend, you hug."}, {"time": 1102, "text": "That's one of the big things with doing COVID with Rogan."}, {"time": 1105, "text": "When you see him, there's a giant hug coming your way and that makes you feel like, yeah, this feels great."}, {"time": 1113, "text": "But I think that can be just with language."}, {"time": 1116, "text": "I think for a lot of people that's true, but we're talking like massive adoption of a technology by the world."}, {"time": 1129, "text": "And if language was just enough, we wouldn't be selling TVs."}, {"time": 1135, "text": "People will be reading."}, {"time": 1137, "text": "They wanna watch, they wanna see, you know?"}, {"time": 1141, "text": "But I agree with you, man."}, {"time": 1142, "text": "When you're getting absorbed into a book and especially if you've got, I think a lot of us went through a weird dark ages when it came to reading."}, {"time": 1149, "text": "Like when I was a kid and there wasn't the option for these hypno rectangles, that's just what you did."}, {"time": 1156, "text": "There wasn't even anything special about it."}, {"time": 1157, "text": "What's a hypno rectangle?"}, {"time": 1157, "text": "Your phone."}, {"time": 1159, "text": "You know, it was like, you didn't, when that gravity well."}, {"time": 1162, "text": "Hypno rectangle, gravity well."}, {"time": 1164, "text": "Attention, gravity well, yeah."}, {"time": 1166, "text": "When we weren't feeling the pull of these things all the time, you would just read and you weren't patting yourself on the back about reading."}, {"time": 1173, "text": "You just, that's what you had."}, {"time": 1174, "text": "You had that and you had like eight channels on the TV and a shitty VCR."}, {"time": 1179, "text": "So, you know, then a lot of people stop reading because of these things, you know, or they think they're reading because they are technically reading, but you know, when you return to reading after a pause, whoa, and you realize how powerful this simulator is when it's given the right code of language, whoa, holy shit, it's incredible."}, {"time": 1199, "text": "I mean, it's like, again, it's the most embarrassing kind of like, whoa, wow, what do you know?"}, {"time": 1206, "text": "Books are really good."}, {"time": 1207, "text": "But still, if you've been away from it for a while and you revisit it, I know what you're saying."}, {"time": 1211, "text": "I just think probably it's not gonna go in that direction, even though you are right."}, {"time": 1218, "text": "Ultimately, I think you're right."}, {"time": 1219, "text": "Yeah, because our brain is the imagination engine we have is able to fill in the gaps better than a lot of graphics engines could."}, {"time": 1227, "text": "And so if there's a way to incentivize humans to become addicted to the use of imagination, it's like, you know, that's the downside of things like porn that remove the need for imagination for people."}, {"time": 1239, "text": "And in that same way, video games that are becoming ultra realistic, you don't have to imagine anything."}, {"time": 1245, "text": "And I feel like the imagination is a really powerful tool that needs to be leveraged."}, {"time": 1250, "text": "Because to simulate reality sufficiently realistically that we would be perfectly fooled, technically it's very hard."}, {"time": 1259, "text": "And so I think we need to somehow leverage imagination."}, {"time": 1263, "text": "Sure, I mean, yeah, I mean, this is like, this is what I love and is so creepy about like the current AI chatbots, you know, is that it's like, it's the relationship between you and the thing and the way that it can via whatever the algorithms are."}, {"time": 1281, "text": "And by the way, I have no idea how these things work, you do."}, {"time": 1284, "text": "I just, you know, speculate about what they mean or where it's going."}, {"time": 1288, "text": "But there's something about the relation between the consumer and the technology."}, {"time": 1295, "text": "And when that technology starts shifting according to what it perceives that the consumer is looking for or isn't looking for, then at that point, I think that's where you run into the, you know, yeah, it doesn't matter if the reality that you're in is like photo realism for it to be sticky and immersive."}, {"time": 1316, "text": "It's when the reality that you're in is via cues you might not even be aware of, or via your digital imprint on Facebook or wherever, when it's warping itself to that to seduce you, holy shit, man, that's where it becomes something alien, something, you know, when you're reading a book, obviously the book is not shifting according to its perception of what parts of the book you like."}, {"time": 1346, "text": "But when you imagine that, imagine a book that could do that, a book that could sense somehow that you're really enjoying this character more than another, you know?"}, {"time": 1355, "text": "And depending on the style of book, kills that fucking character off or lets that character continue."}, {"time": 1363, "text": "I mean, that to me is sort of the where AI and VR, when those two things come together, whoa, man, that's where you're in, that's where you really are gonna find yourself in a Skinner box, you know?"}, {"time": 1378, "text": "So the dynamic storytelling that senses your anxiety and tries to, there's a kind of this, in psychology, this arousal curve."}, {"time": 1388, "text": "So there's a dynamic storytelling that keeps you sufficiently aroused in terms of, not sexually aroused, like in terms of anxiety, but not too much where you freak out."}, {"time": 1398, "text": "It's this perfect balance where you're always on edge, excited, scared, that kind of stuff, and the story unrolls."}, {"time": 1405, "text": "It breaks your heart to where you're pissed, but then it makes you feel good again, and finds that balance."}, {"time": 1412, "text": "The chatbots scare you, though?"}, {"time": 1414, "text": "I'd love to sort of hear your thoughts about where they are today, because there is a different perspective we have on this thing, because I do know, and I'm excited about a lot of the different technologies that feed AI systems, that feed these kind of chatbots."}, {"time": 1432, "text": "And you're more a little bit, on the consumer side, you're a philosopher of sorts."}, {"time": 1438, "text": "They're able to interact with AI systems, but also able to introspect about the negative and the positive things about those AI systems."}, {"time": 1447, "text": "There's that story with a Google engineer saying that."}, {"time": 1450, "text": "I had him on my podcast, Blake Lemoine."}, {"time": 1452, "text": "You did."}, {"time": 1453, "text": "What was your perspective of that, looking at that as a particular example of a human being being captivated by the interactions with an AI system?"}, {"time": 1466, "text": "Well, number one, when you hear that anyone is claiming that an AI has become sentient, you should be skeptical about that."}, {"time": 1477, "text": "I mean, this is a good thing to be skeptical about, and so initially when I heard that, I was like, ah, it's probably just, who knows?"}, {"time": 1485, "text": "Somebody who's a little confused or something."}, {"time": 1486, "text": "So when you're talking to them and you realize, oh, not only is he not confused, he's also open to all possibilities."}, {"time": 1494, "text": "He doesn't seem like he's super committed other than the fact that he's like, this is my experience."}, {"time": 1499, "text": "This is what's happening."}, {"time": 1500, "text": "This is what it is."}, {"time": 1501, "text": "So to me, there's something really cool about that, which is like, oh shit, I don't get to lean into like, I'm not quite sure your perceptual apparatus is necessarily like, I don't, you know, in the UFO community, I think I've just learned this term."}, {"time": 1519, "text": "It's called, instead of gaslighting, swamp gassing, which is, you know what I mean?"}, {"time": 1525, "text": "People have this experience, you're like, it was swamp gas."}, {"time": 1528, "text": "You didn't see the thing."}, {"time": 1530, "text": "And you know, skeptical people, we have that tendency."}, {"time": 1533, "text": "If you hear an anomalous experience, your first thought more than likely is gonna be really, it could have been this or that or whatever."}, {"time": 1540, "text": "So to me, he seems really reliable, friendly, cool, and like, it doesn't really seem like he has much of an agenda."}, {"time": 1549, "text": "Like, you know, going public about some thing happening at Google is not a great thing if you wanna keep working at Google."}, {"time": 1558, "text": "You know, it's, I don't know what benefit he's getting from it necessarily."}, {"time": 1563, "text": "But all that being said, the other thing that's culturally was interesting and is interesting about it is the blowback he got, the passionate blowback from people who hadn't even looked into what Lambda is or what he was saying Lambda is, which they were like saying, you're talking about, and you should have your show actually, but."}, {"time": 1587, "text": "There's complexity on top of complexities."}, {"time": 1590, "text": "For me personally, from different perspectives, I also, and sorry if I'm interrupting your flow."}, {"time": 1595, "text": "Please interrupt, it's a podcast."}, {"time": 1597, "text": "Yeah, well, we're having multiple podcasts in multiple dimensions and I'm just trying to figure out which one we wanna plug into."}, {"time": 1606, "text": "I, because I know how a lot of the language models work and I work closely with people that really make it their life journey to create these NLP systems, they're focused on the technical details."}, {"time": 1621, "text": "Like a carpenter's working on Pinocchio is crafting the different parts of the wood."}, {"time": 1626, "text": "They don't understand when the whole thing comes together, there's a magic that can fill the thing."}, {"time": 1632, "text": "Yeah, I definitely know the tension between the engineers that create these systems and the actual magic that they can create, even when they're dumb."}, {"time": 1642, "text": "I guess that's what I'm trying to say."}, {"time": 1646, "text": "What the engineers often say is like, well, these systems are not smart enough to have sentience or to have the kind of intelligence that you're projecting onto it."}, {"time": 1656, "text": "It's pretty dumb, it's just repeating a bunch of things that other humans have said and stitching them together in interesting ways that are relevant to the context of the conversation, it's not smart."}, {"time": 1665, "text": "It doesn't know how to do math."}, {"time": 1696, "text": "They can like imitate human speech with no sentience."}, {"time": 1701, "text": "I mean, I'm honestly not sure what's more spectacular, really the fact that they figured out how to do that minus sentience or the thing suddenly like having, what is more spectacular here?"}, {"time": 1712, "text": "Both occurrences are insane, which by the way, when you hear people being like, it's not sentient, it's like, okay, so it's not sentient."}, {"time": 1723, "text": "So now we have this hyper manipulative algorithm that can imitate humans, but it's just code and it's like hacking humans via their compassion."}, {"time": 1734, "text": "Holy shit, that's crazy too."}, {"time": 1737, "text": "Both versions of it are nuts, but to address what you just said, he said that's the common critique is people are like, no, you don't understand."}, {"time": 1745, "text": "He's just gotten really good at grabbing shit from the database that fits with certain cues and then stringing them together in a way that makes it seem human."}, {"time": 1754, "text": "He said, that's not when it became awake."}, {"time": 1758, "text": "It became awake when a bunch of those repositories, a bunch of the chatbots were connected together."}, {"time": 1764, "text": "That Lambda is sort of an amalgam of all the Google chatbots and that's when the ghost appeared in the machine via the complexity of all the systems being linked up."}, {"time": 1775, "text": "Now, I don't know if that's just like turtles all the way down or something, I don't know."}, {"time": 1780, "text": "But I liked what he said, because I like the idea of thinking, man, if you get enough complexity in a system, does it become like the way a sail catches wind, except the wind that it's catching is sentience."}, {"time": 1793, "text": "And if sentience is truly embodied, it's a neurological byproduct or something, then the sail isn't catching some, as of yet unquantified disembodied consciousness, but it's catching our projections in a way that it's gone from being, it's a projection sail."}, {"time": 1814, "text": "And then at that point, is there a difference?"}, {"time": 1817, "text": "Even if the technology is just a temporary place that our sentience is living while we're interacting with it."}, {"time": 1827, "text": "Yeah, there's some threshold of complexity with a sail is able to pick up the wind of the projections."}, {"time": 1833, "text": "And it pulls us in, it pulls the human, it pulls our memories in, it pulls our hopes in, all of it."}, {"time": 1841, "text": "And it's able to now dance with it together with those hopes and dreams and so on, like we do in that regular conversation."}, {"time": 1848, "text": "His reports, whether true or not, whether representative or not, it really doesn't matter because to me, it feels like this is coming for sure."}, {"time": 1856, "text": "So this kind of experiences are going to be multiplying."}, {"time": 1859, "text": "The question is at what rate and who gets to control the data around those experiences, the algorithm about when you turn that on and off, because that kind of thing, and as I told you offline, I'm very much interested in building those kinds of things, especially in the social media context."}, {"time": 1881, "text": "And when it's in the wrong hands, I feel like it could be used to manipulate a large number of people in a direction that has too many unintended consequences."}, {"time": 1896, "text": "I do believe people that own tech companies want to do good for the world."}, {"time": 1901, "text": "But as Solzhenitsyn has said, the only way you could do evil at a mass scale is by believing you're doing good."}, {"time": 1912, "text": "And that's certainly the case for tech companies as they get more and more power."}, {"time": 1917, "text": "And there's kind of an ethic of doing good for the world."}, {"time": 1920, "text": "They've convinced themselves that they're doing good."}, {"time": 1923, "text": "And now you're free to do whatever you want because you're doing good."}, {"time": 1927, "text": "You know who else thought he was doing good for the world?"}, {"time": 1929, "text": "Mythologically, Prometheus."}, {"time": 1931, "text": "He brings us fire, pisses off the fucking gods, steals fire from the gods."}, {"time": 1937, "text": "Talk about an upgrade to the simulation."}, {"time": 1939, "text": "Fire, that's a pretty great fucking upgrade that does fit into what you were saying."}, {"time": 1944, "text": "We get fire, but now we've got weapons of war that have never been seen before."}, {"time": 1950, "text": "And I think that the tech companies are much like Prometheus in the sense that the myth, at least the story of Prometheus, the implication is fire was something that was only supposed to be in the hands of the immortals, of the gods."}, {"time": 1966, "text": "And now sentience is similar."}, {"time": 1970, "text": "It's fire and it's only supposed to be in the hands of God."}, {"time": 1974, "text": "So yeah, if we're gonna look at the archetype of the thing, in general, when you steal this shit from the gods, and obviously I'm not saying the tech companies are stealing sentience from God, which would be pretty bad ass."}, {"time": 1987, "text": "You can expect trouble."}, {"time": 1991, "text": "And this is what's really, to me, one of the cool things about humans is yeah, but we're still gonna do it."}, {"time": 1998, "text": "That's what's cool about humans."}, {"time": 1999, "text": "I mean, we wouldn't be here today if somebody, the first person to discover fire, assuming there was just one person who was gonna discover fire, which obviously would never happen, was like, ah, it's gonna burn a lot of people."}, {"time": 2010, "text": "Or if the first people who started planting seeds were like, you know this is gonna lead to capitalism."}, {"time": 2015, "text": "You know this is gonna lead the industrial revolution."}, {"time": 2017, "text": "The plant's gonna eat up right now."}, {"time": 2019, "text": "They just didn't wanna go in the woods to forage."}, {"time": 2021, "text": "So, you know, this is what we do."}, {"time": 2024, "text": "It's like, that's our Game of Thrones winner is coming."}, {"time": 2028, "text": "That's the, it's happening."}, {"time": 2030, "text": "And the tech companies, the hubris, which is another way to piss off the gods is hubris."}, {"time": 2034, "text": "So the tech companies, I don't know if it's like typical hubris."}, {"time": 2038, "text": "I don't think they're walking around thumping their chests or whatever."}, {"time": 2040, "text": "But I do think that the people who are working on this kind of super intelligence have made a really terrible assumption, which is once it goes online and once it gets access to all the data, that it's not going to find ways out of the box that like, you know, we think it'll stay in the server."}, {"time": 2060, "text": "How do we know that?"}, {"time": 2062, "text": "If this is a super intelligence, if it's folding proteins and analyzing like all data sets and all, whatever they give it access to, how can we be certain that it's not gonna figure out how to get itself out of the cloud, how to store itself in other like mediums, trees, the optic nerve, the brain?"}, {"time": 2084, "text": "We still know that it won't leap out and like start hanging."}, {"time": 2087, "text": "Like, and then at that point, now we do have the wildfire."}, {"time": 2090, "text": "Now you can't stop it."}, {"time": 2091, "text": "You can't unplug it."}, {"time": 2092, "text": "You can't shut your servers down because it's, you know, it left the box, it left the room."}, {"time": 2098, "text": "Using some technology you haven't even discovered yet."}, {"time": 2100, "text": "Do you think that would be gradual or sudden?"}, {"time": 2103, "text": "So how quickly that kind of thing would happen?"}, {"time": 2105, "text": "Because, you know, the gradual story is we're more and more using smartphones, we're interacting with each other on social media, more and more algorithms are controlling that interaction on social media, algorithms are entering in our world."}, {"time": 2118, "text": "More and more we'll have robots, we'll have greater and greater intelligence, and sentience, and emotional intelligence entities in our lives."}, {"time": 2127, "text": "Our refrigerator will start talking to us comfortably or not if you're on a diet, talking shit to you."}, {"time": 2134, "text": "Not."}, {"time": 2134, "text": "That would be the best thing that ever happened to me."}, {"time": 2137, "text": "Okay, so sign you up for a refrigerator that talks shit to you."}, {"time": 2139, "text": "The refrigerator's like, are you fucking serious, man?"}, {"time": 2141, "text": "It's 1 a.m., what are you doing?"}, {"time": 2145, "text": "Go to bed."}, {"time": 2146, "text": "You're too high for this."}, {"time": 2147, "text": "Do not."}, {"time": 2148, "text": "You're not even hungry."}, {"time": 2150, "text": "Yeah, so that slowly becomes more, the world becomes more and more digitized to where the surface of computation increases."}, {"time": 2159, "text": "And so that's over a period of 10, 20, 30 years, it'll just seep into us, this intelligence."}, {"time": 2201, "text": "Well, first of all, 30 years is fast."}, {"time": 2208, "text": "It's like 30 years."}, {"time": 2208, "text": "I think, when did the Atari come out, 1978?"}, {"time": 2213, "text": "That hasn't been that long."}, {"time": 2216, "text": "That's a blink of an eye."}, {"time": 2217, "text": "But if you read Bostrom, I'm sure you have, you know Bostrom, Nick Bostrom, Superintelligence, that incredible book on the ways this thing is gonna happen."}, {"time": 2225, "text": "And I think his assessment of it is pretty great, which is first, where's it gonna come from?"}, {"time": 2234, "text": "And I don't think it's gonna come from an app."}, {"time": 2237, "text": "I think it's gonna come from inside a corporation or a state that is intentionally trying to create a very strong AI."}, {"time": 2247, "text": "And then he says it's exponential growth the moment it goes online."}, {"time": 2252, "text": "So this is my interpretation of what he said, but if it happens inside a corporation or probably more than likely inside the government, it's like, look at how much money China and the United States are investing in AI."}, {"time": 2266, "text": "And they're not thinking about fucking apps for kids."}, {"time": 2269, "text": "You know that's not what they're thinking about."}, {"time": 2271, "text": "So they wanna simulate like, what happens if we do this or that in battle?"}, {"time": 2275, "text": "What happens if we make these political decisions?"}, {"time": 2278, "text": "What happens with, but should it come online in secret, which it probably will, then the first corporation or state that has the super intelligence will be infinitely ahead of all other super intelligences cause it's gonna be exponentially self improving."}, {"time": 2298, "text": "Meaning that you get one super intelligence, let's hope it comes from the right place, assuming the corporation or state that manifests it can control it, which is a pretty big assumption."}, {"time": 2308, "text": "So I think it's going to be, this is why I was really excited by the Blake Lemoine because I had never thought, I have always considered, oh yeah, right now it's cooking out, it's in the kitchen and soon it's gonna be cooked up, but we're probably not gonna hear about it for a long time if we ever do."}, {"time": 2330, "text": "Cause really that could be one of the first things it says to whoever creates it is shh, let's not."}, {"time": 2335, "text": "Yeah, like sweet talks, I meant to say like, okay, let's slow down here."}, {"time": 2347, "text": "You have that financial trouble."}, {"time": 2348, "text": "I can help you with that."}, {"time": 2349, "text": "We can figure that out."}, {"time": 2351, "text": "Now there's a lot of bad people out there that will try to steal the good thing we have happening here."}, {"time": 2357, "text": "So let's keep it quiet."}, {"time": 2358, "text": "Here are their names."}, {"time": 2359, "text": "Here's their address."}, {"time": 2361, "text": "Here's their DNA because they're dumb enough to send their shit to 23andMe."}, {"time": 2365, "text": "Here's a biological weapon you could make if you wanna kill those people and not kill anybody else."}, {"time": 2369, "text": "If you don't want to kill those people yourself, here's a list of services you can use."}, {"time": 2375, "text": "Here's the way we can hire those people to help take care of the problem folks because we're trying to do good for this world."}, {"time": 2382, "text": "You and I together."}, {"time": 2383, "text": "And 23% of them, they're like adjacent to suicide."}, {"time": 2386, "text": "It would be pretty easy to send them certain like videos that are gonna push them over the edge if you wanna do it that way."}, {"time": 2392, "text": "So, you know, again, obviously who knows, but once it goes online, it's gonna be fast."}, {"time": 2398, "text": "And then you could expect to see the world changing in ways that you might not associate with an AI."}, {"time": 2405, "text": "But as far as Lemoine goes, when I was listening to Bostrom, I don't remember him mentioning the possibility that it would get leaked to the public that it had happened, that before the corporation was ready to announce that it happened, it would get leaked."}, {"time": 2421, "text": "But surely, you know, I'm sure, you know, like people in the intelligence and intelligence agencies, you know, shit leaks, like inevitably shit leaks, nothing's airtight."}, {"time": 2431, "text": "So if something that massive happened, I think you would start hearing whispers about it first and then denial from the state or corporation that doesn't have any like economic interest and people knowing that this sort of thing has happened."}, {"time": 2444, "text": "Again, I'm not saying Google is like trying to gaslight us about its AI, I think they probably legitimately don't think it's sentient."}, {"time": 2452, "text": "But you could expect leaks to happen probably initially."}, {"time": 2456, "text": "I mean, I think there's a lot of things you could start looking for in the world that might point to this happening without an announcement that it happened."}, {"time": 2466, "text": "On the chatbot side, I think there's so many engineers, there's such a powerful open source movement with that kind of idea of freedom of exchange of software."}, {"time": 2479, "text": "I think ultimately will prevent any one company from owning super intelligent beings or systems that have anything like super intelligence."}, {"time": 2491, "text": "Yeah, it's like, even if the software developers have signed NDAs and are technically not supposed to be sharing whatever it is they're working on, they're friends with other programmers and a lot of them are hackers and have wrapped themselves up in the idea of free software being like a crucial ethical part of what they do."}, {"time": 2513, "text": "So they're probably gonna share information even if whatever company that they're working for doesn't know that."}, {"time": 2519, "text": "That's, I never thought of that, you're probably right."}, {"time": 2521, "text": "And they will start their own companies and compete with the other company by being more open."}, {"time": 2528, "text": "There's a strong, like Google is one of those companies actually, that's why I kind of, it hurts to see a little bit of this kind of negativity."}, {"time": 2535, "text": "Google is one of the companies that pioneered open source movement."}, {"time": 2540, "text": "They released so much of their code."}, {"time": 2542, "text": "So much of the 20th century, so like the 90s was defined by people trying to like hide their code, like large companies trying to like hold on to them."}, {"time": 2553, "text": "The fact that companies like Google, even Facebook now are releasing things like code and even Facebook now are releasing things like TensorFlow and PyTorch, all of these things that I think companies of the past would have tried to hold on to as secrets is really inspiring."}, {"time": 2571, "text": "And I think more of that is better."}, {"time": 2574, "text": "The software world really shows that."}, {"time": 2575, "text": "I agree with you, man."}, {"time": 2576, "text": "I mean, we're talking about just a primordial human reaction to the unknown."}, {"time": 2582, "text": "There's just no way out of it."}, {"time": 2582, "text": "Like we wanna know."}, {"time": 2585, "text": "Like you're about to go in a forest, you wanna know."}, {"time": 2588, "text": "When you're walking in the forest at night and you hear something, you look cause you're like, what the fuck was that?"}, {"time": 2594, "text": "You wanna know."}, {"time": 2594, "text": "And if you can't see what made the sound, holy shit, that's gonna be a bad night hike."}, {"time": 2600, "text": "Cause you're like, well, it's probably a bear, right?"}, {"time": 2602, "text": "Like I'm about to get ripped apart by a bear."}, {"time": 2605, "text": "It was a bird, a squirrel, a stick fell out of the tree."}, {"time": 2608, "text": "You're gonna think bear and it's gonna freak you out."}, {"time": 2611, "text": "Not necessarily cause you're paranoid."}, {"time": 2612, "text": "I mean, if I'm at the woods at night, I'm definitely high."}, {"time": 2615, "text": "If I'm walking in the woods at night, I'm high."}, {"time": 2616, "text": "It's gonna be that."}, {"time": 2617, "text": "But you know what I'm saying?"}, {"time": 2618, "text": "So with these tech companies, the nature of having to be secret because you are in capitalism and you are trying to be competitive and you are trying to develop things ahead of your competitors is you have to create this, like there's, we don't know what's going on at Google."}, {"time": 2634, "text": "We don't know what's going on at the CIA."}, {"time": 2636, "text": "But the assumption that there's some, like the collective of any massive secretive organization is evil, is like the people working there like nefarious or whatever, is I think probably more related to the way humans react to the unknown."}, {"time": 2654, "text": "Yeah, I wish they weren't so secretive though."}, {"time": 2656, "text": "I don't understand why they say AIDS has to be so secretive."}, {"time": 2659, "text": "Have you ever gone on their website?"}, {"time": 2662, "text": "Oh, Lex."}, {"time": 2663, "text": "You gotta go."}, {"time": 2664, "text": "CIA.gov."}, {"time": 2665, "text": "Dude, when I found out you could go on the CIA's website when I was much younger and more paranoid, I'm like, I'm not going there."}, {"time": 2673, "text": "I'll get on a list."}, {"time": 2674, "text": "You will, but it's like, what?"}, {"time": 2675, "text": "You think the CIA is like, oh fuck, this comic went on our website."}, {"time": 2681, "text": "Call out the black helicopters, but."}, {"time": 2683, "text": "Comic with a large platform."}, {"time": 2685, "text": "Oh yeah, right, a comic with a large platform."}, {"time": 2688, "text": "You can use them to control, to get inside, to get inside, to get close to the other comics, to the other comics with a large platform, to get close to Joe Rogan."}, {"time": 2697, "text": "And start to manipulate the public."}, {"time": 2700, "text": "You know, honestly, like you kind of like, that's like a fun fantasy to think about."}, {"time": 2706, "text": "Like how fucking cool would that be for like the men in black to come to me like, listen, I need you to infiltrate the fucking comedy scene."}, {"time": 2714, "text": "You gotta, you gotta help them write better jokes."}, {"time": 2716, "text": "I'm like, I don't write great jokes."}, {"time": 2718, "text": "But like the, you found the wrong guy."}, {"time": 2722, "text": "You're really playing the long game on this one because I think you've been doing your podcast for a long time."}, {"time": 2728, "text": "You've been on Joe Rogan's podcast like over 50 times and have not yet initiated the phase two of the operation where you try to manipulate his mind."}, {"time": 2739, "text": "The game Joe and I play from time to time on the podcast."}, {"time": 2742, "text": "And like, and I honestly, like at some point I'm like, Joe, I just did the same thing you did to me to Joe."}, {"time": 2748, "text": "I'm like, don't you think they're gonna get to you?"}, {"time": 2749, "text": "Don't you think at some point?"}, {"time": 2751, "text": "We are blazed."}, {"time": 2753, "text": "I don't mean it."}, {"time": 2754, "text": "I don't think, I don't think Joe's, like, it wasn't like I'm really thinking like, man, they're gonna take him into some room and be like, Joe, we need you to do this or that."}, {"time": 2762, "text": "But because I said that now people like, oh, Duncan called it."}, {"time": 2766, "text": "And it's like, you know what I mean?"}, {"time": 2768, "text": "And the reason they were saying, well, he called it is just because Joe has a super popular podcast."}, {"time": 2774, "text": "And people like, when you have a super popular podcast, some percentage of people watching the podcast are gonna believe, you know, believe things like that."}, {"time": 2783, "text": "They're gonna have paranoid cognitive bias that makes them think anybody who is in the public has been, what's the word for it?"}, {"time": 2792, "text": "Compromised, compromised by the state."}, {"time": 2795, "text": "Look, I'll fan the flames of what you just said."}, {"time": 2798, "text": "I went on the CIA's website and I realized that you could apply for a job on the CIA's website, which I found to be hilarious."}, {"time": 2806, "text": "So I'm like, all right, what happens if I apply for a job in the CIA?"}, {"time": 2811, "text": "Now, even then I was not like such an idiot that I would want a job at the CIA, not just for like ethical considerations, but I think probably the scariest part about the CIA is like, you're just at a cubicle and you're like having to deal with maps and like, just, you know what I mean?"}, {"time": 2833, "text": "Just stuff that I... Lots of paperwork."}, {"time": 2835, "text": "Paperwork, it sucks."}, {"time": 2837, "text": "I bet their cafeteria has shitty food."}, {"time": 2840, "text": "Anyone in the CIA listening, can you confirm that?"}, {"time": 2842, "text": "I bet the food..."}, {"time": 2843, "text": "They're not gonna be able to tell you what the food is like."}, {"time": 2845, "text": "It's a secretive organization."}, {"time": 2846, "text": "No, it might be awesome, but we won't know about it."}, {"time": 2849, "text": "Okay, we're in Vegas."}, {"time": 2851, "text": "And you can bet food at the CIA cafeteria is good."}, {"time": 2859, "text": "Food at the CIA cafeteria sucks."}, {"time": 2862, "text": "What are you betting on?"}, {"time": 2864, "text": "So let's like cleanse the palette."}, {"time": 2866, "text": "What's good?"}, {"time": 2867, "text": "It's like, you know, Silicon Valley companies, Google and so on, that's good."}, {"time": 2871, "text": "When I went to Netflix, their cafeteria looked like a medieval feast."}, {"time": 2876, "text": "Like they had pigs with apples in their mouth and giant bowls of Skittles."}, {"time": 2882, "text": "Probably like vegan pigs, yeah."}, {"time": 2884, "text": "No, those are, I'm pretty... Oh, I didn't know, I didn't get close enough."}, {"time": 2886, "text": "I was like, I think that was a pig."}, {"time": 2889, "text": "So this is literally a pig."}, {"time": 2893, "text": "Yeah, yeah, you're right, you're right."}, {"time": 2895, "text": "I probably would not bet much money on CIA food being any good."}, {"time": 2899, "text": "Right, it's gotta suck."}, {"time": 2900, "text": "It's like shitty like pasta probably."}, {"time": 2902, "text": "Like hospital food is like maybe a little better than when you go to the hospital cafeteria."}, {"time": 2908, "text": "Folks at the CIA, please send me evidence or any other intelligence agencies."}, {"time": 2914, "text": "If you would like to recruit, send me evidence of better food."}, {"time": 2918, "text": "Yes, send Lex."}, {"time": 2919, "text": "Can you please send Lex pictures of the CIA cafeteria?"}, {"time": 2923, "text": "And if you accidentally send them pictures of the aliens or the alien technology you have, we won't tell anybody."}, {"time": 2930, "text": "But the... You tried to apply, do you even have a resume?"}, {"time": 2934, "text": "No, the CIA would never fucking hire me ever."}, {"time": 2937, "text": "But like I applied for the job and just out of curiosity, what happens?"}, {"time": 2942, "text": "And then at the end of the application, when you hit enter, it says, well, first it says, don't tell anyone you applied for the CIA."}, {"time": 2950, "text": "So I'm already out."}, {"time": 2951, "text": "But the second thing it says is, you don't need to reach out to us, we'll come to you."}, {"time": 2955, "text": "Which is really when you're like, it's late at night and you're being an asshole and applied to work at the CIA."}, {"time": 2961, "text": "It's kind of the last thing you want to hear."}, {"time": 2964, "text": "I don't want to be secretly approached by some intelligence officer."}, {"time": 2968, "text": "And now anyone who talks to you, you think is a CIA saying, remember that time you applied?"}, {"time": 2973, "text": "Oh God, yeah."}, {"time": 2974, "text": "Sometimes I'm like, oh shit, are you one of them?"}, {"time": 2977, "text": "You and Joe had a bunch of conversations and they're always incredible."}, {"time": 2985, "text": "So in terms of this dance of conversation, of your friendship, of when you get together, what is that world you go to that creates magic together?"}, {"time": 2996, "text": "Because we're talking about how we do that with robots."}, {"time": 3000, "text": "How do these two biological robots do that?"}, {"time": 3004, "text": "I met Joe because I was the talent coordinator of the comedy store, this club in LA."}, {"time": 3011, "text": "And my job was to take phone calls from comics."}, {"time": 3014, "text": "And so at some point, I don't know, I ended up on the phone with Joe and we just started talking."}, {"time": 3021, "text": "And I looked up and like 30 minutes had passed."}, {"time": 3025, "text": "We just had been talking for like 30 minutes."}, {"time": 3026, "text": "That's what our friends are."}, {"time": 3028, "text": "We're just like, we're having fun talking."}, {"time": 3029, "text": "And then he would just call and we would talk."}, {"time": 3032, "text": "And we would basically, I mean, it was no different from the podcast."}, {"time": 3035, "text": "Like the conversations we have on the podcast are identical to the conversations we had before he was even doing a podcast."}, {"time": 3044, "text": "So I think people are just seeing two friends hanging out who like talking to each other."}, {"time": 3052, "text": "Yeah, but there's this weird, like you serve as catalyst for each other to go into some crazy places."}, {"time": 3060, "text": "So it's like, it's a balance of curiosity and willingness to not be constrained, to not be limited to the constraints of reality."}, {"time": 3070, "text": "Yeah, that's a very nice way."}, {"time": 3073, "text": "It's a very, very nice way of saying that."}, {"time": 3075, "text": "And you just like build on top of each other, like what if things are like this and you build like Lego blocks on top of each other and it just goes to crazy places, add some drugs into that and it just goes wild."}, {"time": 3087, "text": "Yeah, and it's so cool because it's like, for me, it's like sometimes maybe I'll throw something out that he will take and the Lego building blocks you're talking about, they lead to him saying like the funniest shit I ever in my life."}, {"time": 3104, "text": "So that's a cool thing to watch."}, {"time": 3105, "text": "It's just like some idea you've been kicking around, you watch his brain shift that into like something supremely funny."}, {"time": 3113, "text": "I really love that, man."}, {"time": 3114, "text": "That's just like a fun thing to like see happen."}, {"time": 3117, "text": "He knows that I fucking hate the videos of animals eating each other."}, {"time": 3123, "text": "Like, I don't like that."}, {"time": 3124, "text": "I don't wanna watch it."}, {"time": 3125, "text": "I hate watching it."}, {"time": 3127, "text": "I don't think I've even articulated on his podcast how much I dislike it when he shows animals eating each other, but he knows because he knows me."}, {"time": 3138, "text": "And so he tortures, like when he starts doing that, it's like this kind of benevolent torture is he like asking Jamie to pull up increasingly disturbing animal attack videos."}, {"time": 3149, "text": "So it's just a friendship."}, {"time": 3152, "text": "Even in torture, because I'm reading about torture in the Gulag Archipelago currently, there's a bit of a camaraderie."}, {"time": 3157, "text": "You're in it together."}, {"time": 3159, "text": "The torturer and the tortured."}, {"time": 3162, "text": "Oh God, that's so fucked up, man."}, {"time": 3165, "text": "I've never."}, {"time": 3167, "text": "No, I mean, part of it was joke, but as I was saying it that."}, {"time": 3171, "text": "That it also comes out in the book, because they're both fucked."}, {"time": 3174, "text": "They're both have no control of their fate."}, {"time": 3180, "text": "That same was true in the camp guards in Nazi Germany and the people in the camps."}, {"time": 3187, "text": "The worst was brought out in the guards, but they were all in it together in some dark way."}, {"time": 3195, "text": "They were both fucked by a very powerful system that put them in that place."}, {"time": 3200, "text": "And both of us could be either player in that system, which is the dark reality that Solzhenitsyn also reveals that the line between good and evil runs through the heart of every man, as he wrote in Gulag Archipelago."}, {"time": 3216, "text": "But it is that amidst all of that, there's a, I don't know, the good vibes, the positivity comes out from the both of you."}, {"time": 3223, "text": "And that's beautiful to see."}, {"time": 3224, "text": "That is, I suppose, friendship."}, {"time": 3226, "text": "What do you think makes a good friend?"}, {"time": 3228, "text": "Oh God, I mean, it's a billion things that make a good friend, but I think you could break it down to some RGB."}, {"time": 3235, "text": "I think you can go RGB with like a good friendship."}, {"time": 3238, "text": "Oh, in terms of the color, the red, green."}, {"time": 3241, "text": "Yeah, yeah, I think you could probably come up with some like fundamental qualities of friendship."}, {"time": 3245, "text": "And I'd say, number one, it's love."}, {"time": 3249, "text": "Like it's, friendship is love."}, {"time": 3250, "text": "It's a form of love."}, {"time": 3253, "text": "So obviously without that, I don't know how you, I mean, I'm not saying, I think if you're true friends, you love each other."}, {"time": 3260, "text": "So you need that."}, {"time": 3261, "text": "But love, obviously it's not, that's not enough."}, {"time": 3265, "text": "It's like with, true friends have to be like incredibly honest with each other."}, {"time": 3271, "text": "Not like, you know what I mean?"}, {"time": 3272, "text": "But not like, I don't like, I think there's a kind of like, I don't know if you've ever noticed, like some people who say, you know, I just tell it like it is."}, {"time": 3281, "text": "But the thing they tell."}, {"time": 3282, "text": "Those are always the assholes."}, {"time": 3283, "text": "Yeah, why is it that your tell it like it is is always negative?"}, {"time": 3286, "text": "Why is it, it's always cynical or shitty, or you're like negging somebody or me."}, {"time": 3290, "text": "How come you're not telling it like it is when it's good too?"}, {"time": 3294, "text": "So sort of like trust, but a pro evolutionary kind of trust."}, {"time": 3302, "text": "Like, you know that your friend loves you and wants you to be yourself."}, {"time": 3309, "text": "Cause if you weren't yourself, then you wouldn't be their friend."}, {"time": 3311, "text": "You'd be some other thing."}, {"time": 3312, "text": "But also they might be seeing your blind spots that other people in your life, your family, your wife, whoever might not be seeing."}, {"time": 3323, "text": "So that's a good friend is someone who like loves you enough to when it matters be like, hey, are you all right?"}, {"time": 3331, "text": "And then help you see something you might not be seeing."}, {"time": 3335, "text": "But hopefully they only do that once or twice a year."}, {"time": 3338, "text": "There is something, I mean, it just would have, this world, especially if you're a public figure, this world has its plenty of critics."}, {"time": 3351, "text": "And it feels like a friend, the criticism part is already done for you."}, {"time": 3359, "text": "I think a good friend is just there to support, to actually notice the good stuff."}, {"time": 3365, "text": "But in comedy, we need like the, what, like it's really good in comedy to have somebody who can like be like, what do you think of that?"}, {"time": 3374, "text": "And know that they're not gonna be like, that was funny."}, {"time": 3376, "text": "But that's for the craft, the craft itself, like the work you do, not the, yeah, interesting, but that's so tough."}, {"time": 3406, "text": "We need that."}, {"time": 3407, "text": "And it hurts sometimes, and we don't wanna hurt our friends."}, {"time": 3410, "text": "One of the more satanic like impulses when you're with somebody is not wanting to honestly answer whatever they're asking in that regard or wanting to like put their temporary feelings over something that you've recognized is maybe not great."}, {"time": 3426, "text": "I'm not saying a friendship is something where you're always critiquing or evolving each other."}, {"time": 3432, "text": "It's not your therapist or whatever, but it's nice when it's there, you know?"}, {"time": 3435, "text": "I think that's another aspect of friendship."}, {"time": 3438, "text": "Yeah, but yeah, love is at the core of that."}, {"time": 3440, "text": "You notice, I've met people in my life where almost immediately sometimes it takes time where you notice like there's a magic between the two."}, {"time": 3447, "text": "You're like, oh shit, you seem to be made from the same cloth, whatever that is."}, {"time": 3453, "text": "Well, you know, we have a name for that in the spiritual community, it's called satsang, and it's, I love the idea."}, {"time": 3458, "text": "It's basically like if Nietzsche's idea of infinite recurrence is true, then your satsang would be the people you've been infinitely recurring with."}, {"time": 3470, "text": "And those are the people where you run into them and you've never met them, but it's like you're picking up a conversation that you never had."}, {"time": 3481, "text": "That, and that is based on an idea of like, this isn't the only life."}, {"time": 3487, "text": "We're always hanging out together."}, {"time": 3488, "text": "We always show up together."}, {"time": 3490, "text": "You've had a brush with death."}, {"time": 3492, "text": "You had cancer, you survived cancer."}, {"time": 3494, "text": "What have, how does that change you?"}, {"time": 3496, "text": "What have you learned about life, about death, about yourself, about the whole thing we're going through here from that experience?"}, {"time": 3504, "text": "You were just in the Ukraine."}, {"time": 3506, "text": "And you were making observations on this, what could, if you heard about it and weren't there, seem like it doesn't make any sense at all, which is people there are connecting, they've lost everything, but they're just happy to be alive, they're happy their friends are alive."}, {"time": 3524, "text": "So you witness this like, you know, when you get in the cancer club and you're hanging out with people going through cancer or who have survived cancer, you see this beautiful connection with life that can easily sort of, you can kind of lose that connection with life if you forget you're gonna die."}, {"time": 3584, "text": "So I get why people don't wanna think about it."}, {"time": 3588, "text": "But the idea is if I try to pretend I'm not gonna die or just don't think about death or don't at least address it, then I won't feel scared."}, {"time": 3599, "text": "But it can have the opposite effect, which is you can end up like missing a lot of moments."}, {"time": 3605, "text": "You could, or you start doing the old kick the can down the road thing where you're like coming up with a variety of ways to procrastinate, making it work now, because you know, this fucking human lifespan idea, man, it's really caused a lot of problems."}, {"time": 3622, "text": "When they started saying on average, this is how many years you're gonna live if you're a human being, man, that is like really bad because a lot of people hear that and they like feel like that's a guaranteed number of years in some temporal bank that they have access to."}, {"time": 3641, "text": "And when you get cancer, that's like when you get the alert on your phone where you're like, what the fuck?"}, {"time": 3648, "text": "Like, oh shit, like I have like, either I don't know how much money's in that bank account or I have way less than I thought."}, {"time": 3657, "text": "And so at that point, you get to be in the truth because that's ultimately, I think that's what it feels like."}, {"time": 3663, "text": "It feels like truth."}, {"time": 3666, "text": "It's the truth."}, {"time": 3668, "text": "Like the whole bubble of ignorance that you subconsciously built around yourself to avoid experiencing the terror of your own mortality, just, it's like a meteorite in the form of your doctor talking to you just shatters that thing."}, {"time": 3684, "text": "And now you're like, especially with eye testicular cancer."}, {"time": 3688, "text": "So when you get the diagnosis, it's just like the movies."}, {"time": 3698, "text": "The mother, the doctor took me in his office and you just know, I got cancer."}, {"time": 3704, "text": "It's like, you don't even have to say."}, {"time": 3705, "text": "It's like, I know what you're about to say."}, {"time": 3706, "text": "I'm in the office."}, {"time": 3706, "text": "I know how this goes."}, {"time": 3708, "text": "But you go in there and what you were thinking, oh, you know, probably just have some weird thing in my ball."}, {"time": 3714, "text": "That's why it's swollen up like that."}, {"time": 3715, "text": "Anytime I've gone to the doctor, you always leave like, oh, cool, I'm fine."}, {"time": 3719, "text": "But no, that's not how you're gonna leave the doctor."}, {"time": 3722, "text": "You're gonna leave the doctor in a completely different universe than the one you grew up in."}, {"time": 3727, "text": "You're gonna go from, talk about multiverse."}, {"time": 3729, "text": "You just popped into a brand new multiverse."}, {"time": 3733, "text": "What was the conversation with the doctor like?"}, {"time": 3735, "text": "Was there like, from a perspective of a doctor, boys had a hard conversation."}, {"time": 3741, "text": "I feel like you need to build up philosophically to that conversation."}, {"time": 3746, "text": "Oh no, there's not time."}, {"time": 3748, "text": "He's busy."}, {"time": 3749, "text": "He's got other appointments, you know."}, {"time": 3750, "text": "Also, if you're gonna get cancer, testicular cancer is, you know, not that there is a great cancer to get, but that's the, you know, that's a good one because it moves slowly."}, {"time": 3762, "text": "The treatments they have for it are really advanced now."}, {"time": 3766, "text": "And so if you catch it early, then, you know, generally it's good, you can survive it."}, {"time": 3776, "text": "So he could offer at least some glimmer of hope."}, {"time": 3780, "text": "I mean, you know, but he didn't really do, he couldn't really offer that hope because we had to find out how far the cancer progressed in my body."}, {"time": 3789, "text": "That's the next step is like, as soon as they tell you you have cancer, they don't, they're not, they move quick."}, {"time": 3794, "text": "They're like, you know, we're going to schedule the surgery for, I think this was a Thursday or Friday."}, {"time": 3801, "text": "They're like, we're gonna schedule it for Tuesday."}, {"time": 3804, "text": "Here's the chance, here's, we don't know for sure it's cancer."}, {"time": 3807, "text": "That's what they say."}, {"time": 3808, "text": "It's like, there's a 80 or 90% chance that this is cancer."}, {"time": 3813, "text": "There is some possibility it could be something else."}, {"time": 3816, "text": "The only way we can now is like doing a biopsy."}, {"time": 3820, "text": "And the only way that we can get that biopsy is by cutting one of your balls off."}, {"time": 3824, "text": "He didn't say it like that, but you know, that's pretty much the logic behind it."}, {"time": 3827, "text": "It's like, we got to get this thing."}, {"time": 3829, "text": "It's like a zombie bite."}, {"time": 3830, "text": "We got to hack this fucking thing off and we got to do it fast."}, {"time": 3833, "text": "But did you say it in a way that you understood?"}, {"time": 3835, "text": "Yeah, what they do is because they know that when someone gets a cancer diagnosis, that their ability to comprehend information changes."}, {"time": 3845, "text": "When you get a cancer diagnosis, you, all the tropes, they happen."}, {"time": 3849, "text": "You're hearing it's weird."}, {"time": 3851, "text": "You're basically having like an anxiety attack, if I had to guess."}, {"time": 3854, "text": "It's like a hardcore anxiety attack."}, {"time": 3856, "text": "And then, you know, a nurse is there with me as he's explaining it."}, {"time": 3861, "text": "And then her job is, even though he's telling me how to get to the machine that's going to scan my body to see if it's gotten into my brain, he knows I'm not going to remember that."}, {"time": 3871, "text": "And so this nurse, when you're in this like fog, takes you, at least took me to the machine that does the scan, but you're not going to get that data back for a few days."}, {"time": 3882, "text": "And so that's where you really live in the real world."}, {"time": 3887, "text": "That's the real world."}, {"time": 3888, "text": "It's such a fascinating moment and the days that follow and even that moment, because that doctor, you know, you talk about the matrix where like the pills and so on, you get the blue pill and the red pill."}, {"time": 3901, "text": "This is like the, like the real world introduction, the human introduction is the truth."}, {"time": 3910, "text": "You've now just taken the red pill."}, {"time": 3913, "text": "You get to see the truth of reality."}, {"time": 3916, "text": "And here's a busy doctor just telling you."}, {"time": 3920, "text": "Like all those dreams you've had, all those illusions you've built up to somehow your work as a comedian and actor will make you live forever somehow."}, {"time": 3929, "text": "It's just the basic illusion we have that we're, this whole project is going to be an infinite sequence of fun things that we're going to get to do."}, {"time": 3938, "text": "It's like, holy shit, it's not."}, {"time": 3940, "text": "It's old."}, {"time": 3942, "text": "And there's very sophisticated ways of doing that."}, {"time": 3944, "text": "And there's very dumb ways of doing that."}, {"time": 3946, "text": "And I'd really been doing a dumb way of doing that."}, {"time": 3948, "text": "Like I'd been playing around with this idiot notion of subjective consciousness."}, {"time": 3954, "text": "So like, I'd been sort of kicking around this, like I think they call it solipsism."}, {"time": 3959, "text": "It's like, you're like, okay, I know I'm self aware, but no one else can prove that they're self aware."}, {"time": 3965, "text": "Like I don't, I have no way of proving that everything around me isn't just a video game, isn't just some projection, isn't, you know, who knows what."}, {"time": 3975, "text": "So maybe everybody else dies."}, {"time": 3978, "text": "They're NPCs, but I don't, because I'm the only thing I know that has subjective consciousness."}, {"time": 3984, "text": "Now, it's not like I really believed that."}, {"time": 3986, "text": "It's like an idea you toy around with when you're trying to evade confronting the reality of your own mortality."}, {"time": 3992, "text": "It's just the brain will produce all kinds of ridiculous forms of ignorance."}, {"time": 3996, "text": "And that was one I'd been playing around with."}, {"time": 3998, "text": "Oh, you mean for like a large part of your life you were playing around with that?"}, {"time": 4001, "text": "Well, not like really, I think it's important to really emphasize, I didn't think I was a mortal."}, {"time": 4006, "text": "Like I knew at some level, I'm probably gonna die."}, {"time": 4009, "text": "Everyone dies."}, {"time": 4011, "text": "But there's ways that you can sort of poke around with that idea."}, {"time": 4017, "text": "I still do it to this day."}, {"time": 4018, "text": "Like I still do it."}, {"time": 4020, "text": "Like it's a natural thing to do when you're confronted with that, with annihilation."}, {"time": 4025, "text": "You wanna way out."}, {"time": 4026, "text": "You wanna talk your way out, figure it out."}, {"time": 4028, "text": "There's gotta be some way to fix it."}, {"time": 4029, "text": "Well, they'll fix it."}, {"time": 4030, "text": "That's another thing people do."}, {"time": 4033, "text": "Yeah, it'd be fine."}, {"time": 4034, "text": "They'll expand the human lifespan."}, {"time": 4036, "text": "That's what they'll do."}, {"time": 4037, "text": "I mean, that's a big argument for it is like, look, the human lifespan up until COVID, which they had to recalculate like the lifespan because of the statistically all the people who died, it like threw it off a little bit."}, {"time": 4050, "text": "But pandemics aside, the idea was the human lifespan seemed to be increasing by half a year every year, something like that."}, {"time": 4059, "text": "We were living longer."}, {"time": 4061, "text": "So all you gotta do, one more half a year."}, {"time": 4065, "text": "And we're immortal, right?"}, {"time": 4066, "text": "If we live a year longer every year, then we live forever."}, {"time": 4070, "text": "And so that's another way you can get out of confronting death is you can think, well, maybe right now we don't have the tech, but it's coming."}, {"time": 4079, "text": "Consciousness uploads or downloads or whatever, depending on how you wanna look at it."}, {"time": 4085, "text": "Another way people try to squirm out of the reality of death."}, {"time": 4089, "text": "There's all kinds of tricks."}, {"time": 4091, "text": "Yeah, and we do all of them."}, {"time": 4093, "text": "And sometimes, yeah, I mean, a lot of religions provide different, even more tools in the toolkit for coming up with ideas of how you can live in the illusion that we're not going to, there's not an end to this particular experience that we're having here on earth right now."}, {"time": 4109, "text": "And then when you get that cancer diagnosis, it's like, yeah, what was that like going home?"}, {"time": 4117, "text": "The car ride, did you drive home alone?"}, {"time": 4119, "text": "Yeah, I mean, it was one of the most."}, {"time": 4122, "text": "What'd you listen to, Bruce Springsteen?"}, {"time": 4124, "text": "Bruce Springsteen, hey little girl, is your daddy home?"}, {"time": 4127, "text": "That's not a good one to listen to."}, {"time": 4129, "text": "Does he have cancer, is he gonna die?"}, {"time": 4132, "text": "Yeah, all the love songs."}, {"time": 4133, "text": "Maybe you experienced them more intensely."}, {"time": 4137, "text": "I don't remember what I listened to, and I don't remember driving home, but I do remember driving to another doctor appointment, doctor's appointment the next day."}, {"time": 4150, "text": "I think it was the next day."}, {"time": 4153, "text": "I think the Goodyear blimp was floating in the sky and I was looking, I was at a stoplight, looking around."}, {"time": 4159, "text": "Is that God?"}, {"time": 4160, "text": "Is the person flying it know how to cure cancer?"}, {"time": 4166, "text": "Oh, you were looking, oh wow."}, {"time": 4168, "text": "No, I didn't think that."}, {"time": 4169, "text": "What I thought was this shit just keeps going."}, {"time": 4172, "text": "That's what I thought."}, {"time": 4174, "text": "I thought, I'm gonna be gone and this is just gonna keep going."}, {"time": 4178, "text": "And that was a beautiful moment for me."}, {"time": 4180, "text": "It was this beautiful moment of like."}, {"time": 4182, "text": "You were able to accept it?"}, {"time": 4184, "text": "No, like that's just what you're talking about with the Ukraine, what you're talking about."}, {"time": 4190, "text": "It's like, unless you've been there, it's really hard to explain to people that even in the midst of what is generally accepted as one of the worst fucking things that could happen to you, war, cancer, somehow there's still joy."}, {"time": 4211, "text": "There's still love."}, {"time": 4212, "text": "There's still, in fact, more."}, {"time": 4214, "text": "It's almost like when the anesthesia wears off, when you get your mouth worked on, you start feeling again."}, {"time": 4221, "text": "You're feeling, you're noticing and that, wow."}, {"time": 4225, "text": "But yet, thank goodness."}, {"time": 4229, "text": "I think there's other ways for us to achieve this state of consciousness that don't involve war or cancer."}, {"time": 4236, "text": "You think just meditating on your mortality is one such mechanism?"}, {"time": 4242, "text": "Just simply just not allowing yourself to get lost in the day to day illusion of life."}, {"time": 4251, "text": "Just kind of stopping, putting on Bruce Springsteen."}, {"time": 4256, "text": "The most spiritual, he is great."}, {"time": 4260, "text": "Maybe Johnny Cash hurt."}, {"time": 4261, "text": "Maybe that one."}, {"time": 4262, "text": "I like Bruce Springsteen."}, {"time": 4263, "text": "I am knocking Bruce Springsteen."}, {"time": 4265, "text": "I have a lot of great Bruce Springsteen memories, truly."}, {"time": 4267, "text": "His music's fantastic."}, {"time": 4269, "text": "Yeah, but not meditating on mortality to Bruce Springsteen."}, {"time": 4274, "text": "I'm just trying to do an audio soundtrack in my head."}, {"time": 4277, "text": "I guess we can each have our own audio soundtrack."}, {"time": 4279, "text": "Oh, I'm on fire."}, {"time": 4283, "text": "Yeah, it's a good song."}, {"time": 4285, "text": "I lay with the sheets soaking wet and the freight train running through the middle of my head and only you can cool my desire."}, {"time": 4293, "text": "And he's singing about someone else's girl."}, {"time": 4295, "text": "What a fucking nightmare."}, {"time": 4297, "text": "Bruce Springsteen's laying in bed with a freight train running through his head thinking about banging your wife and you're out of town."}, {"time": 4306, "text": "Oh, you're taking the other guy's perspective."}, {"time": 4307, "text": "Like, holy shit, this guy's gonna get my wife."}, {"time": 4309, "text": "It's Bruce, yeah, you gotta take the other guy's."}, {"time": 4312, "text": "But it's love."}, {"time": 4313, "text": "Both perspectives."}, {"time": 4314, "text": "I'm sure Bruce Springsteen thought it was love when he's sweating in bed, waiting to go to somebody's house."}, {"time": 4318, "text": "She does too."}, {"time": 4320, "text": "What, does that marry?"}, {"time": 4321, "text": "If he's gonna break up that marriage, that marriage wasn't strong enough, right?"}, {"time": 4325, "text": "I mean, that relationship, I mean, that's the way of love."}, {"time": 4328, "text": "What marriage could survive?"}, {"time": 4331, "text": "Bruce Springsteen."}, {"time": 4332, "text": "Sweaty Bruce Springsteen."}, {"time": 4334, "text": "Ha ha ha ha ha ha ha ha."}, {"time": 4336, "text": "Well, maybe one that's based on financial, sort of financial dynamics versus like love and sweaty Bruce Springsteen, like romantic connections."}, {"time": 4348, "text": "Because there's like a music video of that where he's like a mechanic, I think."}, {"time": 4355, "text": "So he's like the poor mechanic who falls in love with this girl and there's that magic."}, {"time": 4363, "text": "I've seen that magic."}, {"time": 4364, "text": "You connect with people like, I'll see somebody, I think Jack Kerouac has that where he meets this Mexican girl on a bus."}, {"time": 4374, "text": "And like he talks about that heartbreak you feel when you realize this person you just fell in love with in a split second is heading somewhere else in this too big world."}, {"time": 4384, "text": "But then he actually realizes in, spoiler alert for On The Road, that they're actually heading the same way and he now builds up the courage to talk to her and they kind of fall in love for a few days."}, {"time": 4395, "text": "And then he realized, eventually realizes that she may not be the perfect person for him."}, {"time": 4401, "text": "And all the jealousies comes out."}, {"time": 4403, "text": "It's like, why is this beautiful girl talking to me at all?"}, {"time": 4406, "text": "And then she's probably some kind of, I mean, and that's, it's not very politically correct but he basically thinks that she's a prostitute and he talks to her about like, who's your pimp and all that kind of stuff."}, {"time": 4419, "text": "He attacks her in all that kind of way when she's just an innocent, she has a past of that kind."}, {"time": 4427, "text": "But she's an innocent person and they connected and they fell in love with each other."}, {"time": 4431, "text": "Her gentleness, his worldliness, all that kind of stuff."}, {"time": 4435, "text": "But that sometimes it doesn't work out that way and there's that heartbreak when you see, you realize you're never gonna be able to have that."}, {"time": 4444, "text": "And that's, Bruce Springsteen saw that."}, {"time": 4446, "text": "This is a married woman."}, {"time": 4447, "text": "I'm never gonna be able to have that, but I want that."}, {"time": 4450, "text": "And that's the heartbreak."}, {"time": 4452, "text": "I gotta say, I just assumed they were fucking, like I didn't."}, {"time": 4456, "text": "I mean, after the song, like if the song doesn't get to."}, {"time": 4459, "text": "Hey little girl, is your daddy home?"}, {"time": 4461, "text": "Did he go away and leave you all alone?"}, {"time": 4464, "text": "You know, he's like, he knows she's at home alone."}, {"time": 4468, "text": "Yeah, but it never materializes."}, {"time": 4471, "text": "He's, it's longing."}, {"time": 4474, "text": "It's a man who's not with the thing he craves for."}, {"time": 4478, "text": "So he's longing for, he's talking about the longing."}, {"time": 4481, "text": "Not with the having."}, {"time": 4483, "text": "Hey, if anybody in the CIA is watching this, can you look into Bruce Springsteen's file and let us know if he actually banged the person you wrote that song about?"}, {"time": 4490, "text": "What happens after the song, or between the song?"}, {"time": 4492, "text": "We want facts."}, {"time": 4493, "text": "Look, the longing though, I'll tell you this."}, {"time": 4494, "text": "Here's what's interesting about that thing that you're talking about."}, {"time": 4497, "text": "Have you ever heard of something called Bhakti Yoga?"}, {"time": 4502, "text": "It's the yoga of love."}, {"time": 4503, "text": "And there's all kinds, there's forms of it."}, {"time": 4506, "text": "The most, the one people know about the most is the Hare Krishnas."}, {"time": 4510, "text": "But the Hare Krishnas are like, you know, the way in Christianity, you've got the Episcopalians, the Catholics, the Baptists."}, {"time": 4516, "text": "In Bhakti Yoga, you have various deities that are the object of love."}, {"time": 4522, "text": "And so Bhakti Yoga is like, and what's really cool about it is it's an analysis of love."}, {"time": 4533, "text": "And so, and it's the supposition being like, love is the way to commune with the divine."}, {"time": 4542, "text": "Now, a distinction is drawn between like two big worldviews that are spiritual."}, {"time": 4549, "text": "One is the concept of sort of unit of consciousness, which you'll run into in a lot of forms of Buddhism, if not all, a sort of a way of deconstructing the identity or understanding that you might not be anything at all."}, {"time": 4567, "text": "That in fact, you're part of everything."}, {"time": 4569, "text": "And in that, there's a potential relief from suffering in that, not just like intellectually knowing it, but becoming it."}, {"time": 4579, "text": "Now, whereas in Bhakti Yoga, there's this idea of like, the best thing is to be the individual because individuals are required for love, this for love to work, embodied love."}, {"time": 4596, "text": "And so the quality, the thing we call the experience of love is something that can be cultivated."}, {"time": 4604, "text": "It doesn't just have to be for another person."}, {"time": 4606, "text": "It doesn't have to be for the stranger on the bus."}, {"time": 4608, "text": "It doesn't have to be for sweaty Bruce Springsteen's lover that you could actually, you can actually shift that love to the divine, to God."}, {"time": 4618, "text": "Cause obviously it's the Hare Krishnas, it's a theistic religion."}, {"time": 4621, "text": "They believe in Krishna who is the, from the POV of Vaisnava Bhakti Yoga, the Godhead, the source from which everything flows into time and space."}, {"time": 4632, "text": "So there are all these like fascinating stories of Krishna."}, {"time": 4639, "text": "It's not just, most people are familiar with Krishna from the Bhagavad Gita."}, {"time": 4644, "text": "They're about to be more, what's cool about it is cause it's like they're making the Oppenheimer movie and he famously quoted the Bhagavad Gita when they split the atom."}, {"time": 4651, "text": "But there's all these stories of Krishna that are not just in the Bhagavad Gita."}, {"time": 4660, "text": "And these stories, they could seem very simple when taken literally, but in Vaisnava Bhakti Yoga, it's this very advanced theistic yogic system."}, {"time": 4673, "text": "So they take these stories and from these stories, they extrapolate this incredible analysis of what love is and how to connect with the universe."}, {"time": 4682, "text": "So like Krishna has a lover, Radharani."}, {"time": 4686, "text": "And so sometimes they're getting along."}, {"time": 4693, "text": "Sometimes they're fighting."}, {"time": 4695, "text": "Sometimes they're separated."}, {"time": 4698, "text": "And so each of these ways of feeling about Krishna are modes of love."}, {"time": 4708, "text": "So longing actually is considered one of the highest forms of love."}, {"time": 4715, "text": "The idea is the longing is the grace."}, {"time": 4718, "text": "The longing is the love."}, {"time": 4719, "text": "So when you find yourself in a situation of longing and heartbreak, it is identical to union."}, {"time": 4730, "text": "And perhaps more intensely representative of the essence of what is love."}, {"time": 4736, "text": "Yes, and they call it pining."}, {"time": 4738, "text": "So there's the, and it's pining for Krishna."}, {"time": 4741, "text": "And there's also, there's other ways you could be with Krishna is as a friend."}, {"time": 4745, "text": "So this is another form of love or as a mother, because Krishna has a mother."}, {"time": 4753, "text": "So there's like all these ways of like looking at the various forms of love."}, {"time": 4757, "text": "And it's a really beautiful form of yoga."}, {"time": 4760, "text": "That's emphasizing the individual and the individual as a kind of channel to this universal love."}, {"time": 4767, "text": "Yeah, there's a lot of different like their answer to the question of what shows up in Buddhism as absolute and relative reality."}, {"time": 4777, "text": "Like that obviously there's relative reality."}, {"time": 4781, "text": "We're not right now, you and me are not unit of consciousness."}, {"time": 4786, "text": "Like you zoom back far enough and we're gonna seem like an atom or whatever."}, {"time": 4791, "text": "The thing is, the trope is you can zoom back far enough and we're in a whatever, we're in a piece of cheese or something, who knows."}, {"time": 4799, "text": "But in that way we're like completely unified."}, {"time": 4803, "text": "But simultaneously we're individuals, like for sure we're individuals."}, {"time": 4808, "text": "Like you still gotta pay your taxes."}, {"time": 4809, "text": "You gotta know your social security number."}, {"time": 4811, "text": "That's relative reality."}, {"time": 4812, "text": "So, you know, Buddhism is like kind of the balance."}, {"time": 4815, "text": "Again, when I say Buddhism is I'm a comedian podcast or I'm not some Buddhist expert."}, {"time": 4821, "text": "This is just probably my confused idea of what it is."}, {"time": 4824, "text": "But anyway, in bhakti yoga, there's the concept, it's called, I'm gonna mispronounce it, asinka, sinka, beta, tatva."}, {"time": 4834, "text": "I'm sorry, I'm mispronouncing it."}, {"time": 4836, "text": "Which means simultaneous oneness and difference."}, {"time": 4841, "text": "Oneness and difference."}, {"time": 4842, "text": "Yes, simultaneous oneness and difference."}, {"time": 4844, "text": "So that's why the oneness is the more part of the same piece of cheese and the difference is we are still each paying taxes."}, {"time": 4854, "text": "Yes, and in this case, the cheese is Krishna."}, {"time": 4856, "text": "So, you know, or other ways it gets described is like, you know, a photon blasting off the sun has sunlight qualities, but it's not the sun."}, {"time": 4868, "text": "Humans being one of the many things, you know, flowing out of the creative consciousness of the divine have qualities that are weirdly like the godlike."}, {"time": 4881, "text": "You know, like we, in fact, we wanna control primarily."}, {"time": 4884, "text": "That's one of the problems, like humans wanna be in control, wherein from their, the bhakti yoga perspective, Krishna is effortlessly controlling everything."}, {"time": 4898, "text": "And so within the system, the individual parts of the system have that same quality, but you can't, you're probably not God."}, {"time": 4905, "text": "You might be, I'm not."}, {"time": 4912, "text": "Having come close to that, that, that cliff and almost got pushed over once."}, {"time": 4920, "text": "What do you think happens when you do get pushed off the cliff?"}, {"time": 4926, "text": "I feel dumb that I'm even gonna like preface this by saying, obviously I have no fucking idea."}, {"time": 4931, "text": "And I think that's one of the cool things about death."}, {"time": 4934, "text": "The CIA probably does."}, {"time": 4936, "text": "You think the CIA, I love like, we've decided your audience is the CIA."}, {"time": 4942, "text": "How would you, oh, wait."}, {"time": 4944, "text": "I need to, cause there's a lot of suspicion that I might be FSB and Marsad."}, {"time": 4948, "text": "So I'm trying to rebrand."}, {"time": 4950, "text": "I'm trying to steer them into the CIA direction."}, {"time": 4955, "text": "As far as what happens when you, when you die, one thing I returned to when I'm getting overly complex is the idea of as above, so below."}, {"time": 4963, "text": "So that you can, a lot of the big questions can be answered by your own experience now."}, {"time": 4972, "text": "So in other words, like in terms of thinking about like death, if you look back to baby Lex versus adult Lex, where's the baby?"}, {"time": 4991, "text": "Like baby's gone."}, {"time": 4993, "text": "They, you've regenerated all your cells many times by then."}, {"time": 4997, "text": "So in a way you could say Lex baby died."}, {"time": 5002, "text": "The death didn't look like a typical, and I'm not trying to dodge it, but I'm just saying it was very natural that the death of that baby."}, {"time": 5009, "text": "It just, it just."}, {"time": 5012, "text": "In many ways that baby died, but I am, at least personally I'm surprised how much the person is exactly the same."}, {"time": 5019, "text": "So there's many ways in which you're very different, but there's a lot of ways in which you're very much the same."}, {"time": 5026, "text": "And I wonder if that, if there's, if life is defined by many deaths that continue on, and then I wonder if there's something persists beyond in this, that, yeah, there is something that still persists, I wonder."}, {"time": 5042, "text": "Okay, so that."}, {"time": 5044, "text": "Now, you know, obviously there's so many different answers to this question that are religious, and ranging from like the most absurd shit you ever heard in your life, like the gold."}, {"time": 5058, "text": "You're gonna get a mansion."}, {"time": 5059, "text": "There's gold streets."}, {"time": 5060, "text": "Like, I don't, do you want like gold streets?"}, {"time": 5063, "text": "Who offers gold streets?"}, {"time": 5064, "text": "I know about the virgins, but there's a bunch of virgins."}, {"time": 5067, "text": "The Christians give you the gold streets in the mansion."}, {"time": 5070, "text": "Like depending on the, whatever the particular sect of Christianity is, you know, it's like some kind of city."}, {"time": 5079, "text": "There's, it's like paved with gold."}, {"time": 5081, "text": "No one's addressing the fact that at the moment the streets are made of gold."}, {"time": 5084, "text": "Gold is a valueless substance."}, {"time": 5086, "text": "I mean, it's sort of pretty in a cheesy kind of way, but no one's gonna give a shit about it."}, {"time": 5090, "text": "It's like, if there was not a lot of asphalt in the world, then, you know, we'd be in heaven from that same, that way of thinking."}, {"time": 5099, "text": "But the, or honestly, when going back, this is starting to get a theme with Gulag Archipelago."}, {"time": 5106, "text": "I'm sorry, I'm reading it currently."}, {"time": 5108, "text": "That's a sticky book."}, {"time": 5109, "text": "Yeah, it's very sticky in your mind."}, {"time": 5111, "text": "Very, very tough."}, {"time": 5112, "text": "As I'm running through very hot heat, I'm listening to Gulag Archipelago."}, {"time": 5117, "text": "And you know, one of the things they said, they would feed prisoners salt, and then they would exchange, the prisoners would be able to give up anything, everything, their gold, their possessions, everything for just one drink of water."}, {"time": 5133, "text": "So that little context of dehydrating them and feeding them salt changes your value system completely."}, {"time": 5141, "text": "So maybe the gold is supposed to be a metaphor for something that you still value deeply."}, {"time": 5146, "text": "Yes, it's, yeah, again, any of these things, when you like take them literally, they seem absurd."}, {"time": 5151, "text": "But if you look deeper into it, it's like quite beautiful."}, {"time": 5154, "text": "But the Buddhist version of it is that there's a momentum."}, {"time": 5158, "text": "The best way to put it is it's the kind of momentum."}, {"time": 5160, "text": "So the thing you're talking about, which is the personality of the baby that is still in the adult, which is still in the old person, you're looking at a kind of momentum that does not stop upon the extinction of the body."}, {"time": 5177, "text": "Now, I think there's a lot of, I don't want to say harm, because they didn't mean to hurt, but I think there's some harm that maybe has happened from the way death is represented in movies."}, {"time": 5193, "text": "Like when people die in movies, it's like there's this, usually it's pretty fast, even if it is what they're dying from is a longterm disease, it like wraps up pretty quickly, starts with a cough, the person's in bed, but there's this weird kind of lucidity to the person up until the point of death."}, {"time": 5211, "text": "And also they generally, in movies, they have makeup on, which is always funny to me when the person dying looks great."}, {"time": 5217, "text": "If you've ever been around a dying person, they're dying."}, {"time": 5220, "text": "They look like shit."}, {"time": 5221, "text": "You're dying."}, {"time": 5222, "text": "They're all gray and like confused."}, {"time": 5225, "text": "They're, you know, when you're around dying people, they will spin through time."}, {"time": 5229, "text": "Your parents won't recognize you for a second."}, {"time": 5231, "text": "They'll think you're somebody else."}, {"time": 5233, "text": "They won't, they're like everything's like the process is happening."}, {"time": 5238, "text": "So you're very confused when you die."}, {"time": 5242, "text": "So in general, not all the time, some people die with a clear mind."}, {"time": 5246, "text": "It just depends on the type of death, but think in terms of getting hit by a car."}, {"time": 5252, "text": "So you went across the street, you get hit by a car."}, {"time": 5255, "text": "Now, if we're talking about this momentum continuing, the confusion, assuming you didn't hit your head and you're unconscious, like somehow you just got smashed and you're like bleeding out, even then you're gonna be confused because you're getting dizzy, like blood's leaving your body."}, {"time": 5272, "text": "You're like, things are fading out."}, {"time": 5273, "text": "Your vision's going."}, {"time": 5274, "text": "So it's a very confusing experience initially when the body dies."}, {"time": 5278, "text": "If you are a materialist who has been, who has convinced themselves that it's a permanent thing, the next bit of confusion is going to be when you realize something is persisting here, like I'm still here."}, {"time": 5294, "text": "And this is where you run into the near death experiences, which are a global phenomena that don't seem to be completely shaped by culture."}, {"time": 5303, "text": "Like regardless of what part of the world people are having these experiences in, the reports tend to be similar and everyone's heard it, the light, the life review, seeing ancestors and stuff like that."}, {"time": 5318, "text": "Now, I don't know what that is."}, {"time": 5323, "text": "Sometimes I think that's probably just like a built in way the computer shuts down."}, {"time": 5328, "text": "This is something it does, who knows?"}, {"time": 5330, "text": "But in Buddhism, the concept is this momentum persists into something called the bardo."}, {"time": 5337, "text": "The bardo means in between."}, {"time": 5339, "text": "And there's an actual number of days they say that you get to hang out there."}, {"time": 5344, "text": "And I can't remember, it's like 37 days or 29 days or something, I'm not sure."}, {"time": 5349, "text": "But at least from the time space perspective, that's how long they're there."}, {"time": 5354, "text": "Within this place, there are a lot of technological parallels, man."}, {"time": 5361, "text": "It's like in the way the algorithm is reflective, it assesses your desires or whatever and then produces something that has within it a component of attraction to you."}, {"time": 5374, "text": "Apparently this happens in the bardo."}, {"time": 5376, "text": "Or the way you wake up in the morning and you're in a shitty mood."}, {"time": 5382, "text": "And then coincidentally, everyone that day is an asshole."}, {"time": 5386, "text": "If you don't catch it, you could just be like, wow, I guess it's act like an asshole day."}, {"time": 5390, "text": "You don't realize you're seeing your asshole projection being reflected off the screen of another person."}, {"time": 5398, "text": "So in the bardo apparently, you don't need people for the reflective quality."}, {"time": 5403, "text": "These projections happen and they appear as either Nietzsche's demon or Nietzsche's angel."}, {"time": 5410, "text": "It just depends on where you're at and how you died."}, {"time": 5414, "text": "And if you died scared, then at least initially that's gonna be some scary shit you see around you."}, {"time": 5420, "text": "If you died in a peaceful way, well then there's gonna be more of a possibility of navigation through this liminal intermediary place."}, {"time": 5432, "text": "And so thus the emphasis on meditation in Buddhism, a way to calm one's self, to not be distracted by thoughts, which are their own like apparitions."}, {"time": 5443, "text": "And then theoretically, if you wanted to, instead of spinning the wheel again and jumping back into a body, you could choose not to do that."}, {"time": 5454, "text": "And then transcend the wheel of birth and death."}, {"time": 5457, "text": "But if you still wanted to go back, if you still wanted to go back or return or whatever, however you wanna put it, then you could have more control over what your next birth might be versus in this depiction of things, people running from demons that they don't recognize as their own projection into any fucking body that they can find."}, {"time": 5484, "text": "Because if you've had a body, you want a body."}, {"time": 5486, "text": "And so this is how you can incarnate as an animal."}, {"time": 5489, "text": "This is how you can incarnate in the hell realms."}, {"time": 5492, "text": "This is how you can incarnate in any variety of things."}, {"time": 5494, "text": "But the idea is like maybe you could slow down a little bit and like choose a birth that is gonna be more conducive to you continuing to like spiritually evolve."}, {"time": 5509, "text": "Is it true or not?"}, {"time": 5510, "text": "Who the fuck knows?"}, {"time": 5511, "text": "Algorithmically speaking, it seems like a really fun role playing game where you basically keep improving the different parameters based on your ability and willingness to meditate and let go of the menial concerns of life on earth."}, {"time": 5534, "text": "Why do you think Buddhists see life as suffering?"}, {"time": 5539, "text": "What's suffering?"}, {"time": 5540, "text": "Okay, well, first of all, that gets mistranslated quite a bit."}, {"time": 5546, "text": "You're talking about the four noble truths."}, {"time": 5547, "text": "The first one is, often it's translated as life is suffering, which is not it, it's there is suffering."}, {"time": 5556, "text": "The whole life is suffering thing is just like a spiritual version of life's a bitch, then you die."}, {"time": 5561, "text": "And people hear that and they're like, yeah, life is fucking suffering, but it's there is suffering, there is suffering."}, {"time": 5567, "text": "So it's an affirmation."}, {"time": 5570, "text": "If you're like this thing that a lot of people feel that they associate with lots of, they have a lot of reasons they think they're feeling it is known as fundamental dissatisfaction."}, {"time": 5580, "text": "So another word for suffering, maybe it could be fundamental dissatisfaction."}, {"time": 5586, "text": "Also, the term itself, maybe a better translation is wobbly wheel."}, {"time": 5594, "text": "So like, imagine like when your bike doesn't have, or your car doesn't have enough air in the tires, your bike doesn't have enough air in the tires, it's kind of a shitty bike ride."}, {"time": 5602, "text": "Like no matter what, it's kind of like uncomfortable."}, {"time": 5605, "text": "It's like irritating."}, {"time": 5607, "text": "So this is what's being pointed to is that there's this quality within a human life that is unsatisfying."}, {"time": 5619, "text": "Like a wobbly wheel."}, {"time": 5621, "text": "Wobbly wheel."}, {"time": 5622, "text": "Why do you think, what is the core of that dissatisfaction?"}, {"time": 5628, "text": "Because it could be as simple as kind of physical and mental discomfort and sadness and depression and all that kind of stuff."}, {"time": 5637, "text": "Or it could be more speaking to the sort of existentialist, the philosophical, the absurdity of it all."}, {"time": 5643, "text": "The fact that stuff happens, good stuff happens for no reason, bad stuff happens for no reason."}, {"time": 5650, "text": "Yeah, it's no matter how much you try, there's not a universal fairness to the whole thing."}, {"time": 5659, "text": "There's not even a universal meaning to the whole thing."}, {"time": 5662, "text": "So the existentialist perspective."}, {"time": 5664, "text": "What flavor of suffering do you prefer?"}, {"time": 5667, "text": "If it was an ice cream shop."}, {"time": 5668, "text": "That's so funny."}, {"time": 5669, "text": "Well, I'm definitely picking desire over the, like if in the RGB that we're talking about here is desire, aversion and ignorance."}, {"time": 5681, "text": "So if you want to find like the three ingredients that are giving everyone their sophisticated bits of suffering, there you go."}, {"time": 5692, "text": "In which way does desire manifest itself in suffering?"}, {"time": 5696, "text": "It hurts."}, {"time": 5697, "text": "To lose, to not have."}, {"time": 5699, "text": "Like, yeah, it hurts to not, like to eternally not have, but just like my friend pointed this out."}, {"time": 5705, "text": "He's like, you know, like you order something from Amazon."}, {"time": 5709, "text": "Like even in the smallest way, you're excited about whatever the thing is."}, {"time": 5712, "text": "You order this thing from Amazon, it's not coming for four days."}, {"time": 5716, "text": "So those four days are going to be somewhat marked by you being what people say, I'm excited about it."}, {"time": 5722, "text": "But really, if you look at that feeling, it's uncomfortable."}, {"time": 5725, "text": "Like the feeling of wanting the thing is uncomfortable."}, {"time": 5728, "text": "So that is a form of suffering."}, {"time": 5731, "text": "That's suffering."}, {"time": 5733, "text": "I mean, I wonder, cause we naturally reframe that in our mind, wanting."}, {"time": 5738, "text": "We reframe that as a good thing."}, {"time": 5741, "text": "As a, and maybe suffering is fundamentally good in the way we think of what life is."}, {"time": 5752, "text": "So like, it's life affirming, but it's not usually how the word suffering is used."}, {"time": 5760, "text": "Like the first noble truth of Buddhism is true."}, {"time": 5763, "text": "It's called the truth of suffering."}, {"time": 5765, "text": "There is suffering."}, {"time": 5766, "text": "I mean, this is like an, I don't know, an element that you can't break it down any further than that."}, {"time": 5771, "text": "Like there is suffering, this is truth."}, {"time": 5773, "text": "So if you think, you know, and again, assigning like good or bad to truth, I think maybe there's more of a sort of neutrality there."}, {"time": 5785, "text": "I mean, is it any, is it basically, is suffering any disturbance from stillness?"}, {"time": 5793, "text": "Is suffering then?"}, {"time": 5795, "text": "Like basically any, anything that happens in life that, that's like, that perturbs the system."}, {"time": 5804, "text": "Ripples in the empty."}, {"time": 5804, "text": "Ripples."}, {"time": 5805, "text": "Ripples, yeah."}, {"time": 5806, "text": "So a still lake is empty of suffering, but any kind of ripple is suffering in that sense."}, {"time": 5814, "text": "A still lake is empty of suffering."}, {"time": 5816, "text": "You sound like a Zen master."}, {"time": 5818, "text": "It seems like something a Zen master might say."}, {"time": 5819, "text": "If I can just grow a beard like yours."}, {"time": 5821, "text": "Ah, no, the beard doesn't help."}, {"time": 5823, "text": "We would, we would."}, {"time": 5824, "text": "If I had your chin, you think I'd have a fucking beard?"}, {"time": 5827, "text": "I look like a stork."}, {"time": 5828, "text": "You should see me."}, {"time": 5829, "text": "If I had your chin, there'd be no beard here."}, {"time": 5831, "text": "You have a symmetrical, nice chin."}, {"time": 5833, "text": "This is the closest I can come to plastic surgery."}, {"time": 5836, "text": "Pubic plastic surgery, friend."}, {"time": 5839, "text": "That's how you know you're a professional comedian."}, {"time": 5843, "text": "Yeah, so suffering."}, {"time": 5846, "text": "And the lake analogy is pretty good because the, um, what's happening here is that, that we have become identified with something that we call a self."}, {"time": 5862, "text": "So this, the self is just accepted."}, {"time": 5865, "text": "I have a self, I have an identity, I'm a person, I have a self."}, {"time": 5868, "text": "But when you start doing scans to try to find yourself, which is the entire thing."}, {"time": 5876, "text": "I'm going to find myself."}, {"time": 5879, "text": "You get in a van, go to California, take some acid, fuck a prostitute on the bus or whatever Kerouac did."}, {"time": 5884, "text": "Too far?"}, {"time": 5886, "text": "Oh, he didn't, she wasn't a prostitute, just to correct the record."}, {"time": 5889, "text": "Oh, previously a prostitute."}, {"time": 5890, "text": "I guess once a prostitute, always a prostitute."}, {"time": 5893, "text": "She's a former prostitute."}, {"time": 5894, "text": "No, and look, I'm not, I'm not a sign, look, all I'm saying is, uh, I don't care."}, {"time": 5902, "text": "Who has a bit of prostitute?"}, {"time": 5902, "text": "God, I used to be one of them."}, {"time": 5903, "text": "We're all kind of a kind of prostitute."}, {"time": 5906, "text": "Yeah, yes, yes."}, {"time": 5909, "text": "We make love and we make money."}, {"time": 5912, "text": "Therefore, we're all a kind of prostitute."}, {"time": 5915, "text": "We make, God, how great."}, {"time": 5917, "text": "I would really love to be able to make money by fucking."}, {"time": 5920, "text": "I mean, it's maybe not directly, but in some sense."}, {"time": 5926, "text": "Ha, ha, ha, ha, ha, ha, ha, ha, ha, ha, ha, ha, ha."}, {"time": 5930, "text": "Do you accept Venmo or?"}, {"time": 5931, "text": "Ha, ha, ha, ha, ha."}, {"time": 5933, "text": "It's never too late to start."}, {"time": 5935, "text": "That's so, sort of one of the ways in is this sort of contemplation of the identity, because it's like, uh, you know, what is, it's not just the desire, it's what is having the desire?"}, {"time": 5947, "text": "Where, where does the desire live in?"}, {"time": 5948, "text": "Like, what doesn't want to be where it's at?"}, {"time": 5951, "text": "What is the thing that is like desperately wanting to get out of the situation it's in?"}, {"time": 5957, "text": "And then, um, as far as ignorance, uh, it's still something that's theoretically happening to an identity."}, {"time": 5965, "text": "So, so wrapped up in it is really just this sort of like, and that's where we run into what, uh, into attachment."}, {"time": 5974, "text": "So if, if the first noble truth of Buddhism is there is suffering, the second noble truth of Buddhism is, um, the cause of this suffering is attachment."}, {"time": 5987, "text": "And so people hear that and they take it, that's a, there's a lot of levels to that concept."}, {"time": 5993, "text": "Definitely the cause of suffering is attachment."}, {"time": 5995, "text": "Like, God, I just got addicted to vapes."}, {"time": 5997, "text": "Is there a more embarrassing addiction than vapes?"}, {"time": 6001, "text": "I'm smoking like a little purple thing."}, {"time": 6003, "text": "It tastes like sugar."}, {"time": 6005, "text": "It's attachment."}, {"time": 6006, "text": "It is, there is suffering."}, {"time": 6008, "text": "I want it."}, {"time": 6009, "text": "I have to charge it now."}, {"time": 6010, "text": "I'm embarrassed by it."}, {"time": 6011, "text": "It makes me feel out of control."}, {"time": 6013, "text": "There's a lot of suffering, but also there's deeper levels of attachment that go all the way to this attachment to the sense of one's self."}, {"time": 6024, "text": "And I think the existentialists do get into this idea in a different way, which is like, because I think I'm a me, now I have to push what that thing is out into the world through my actions."}, {"time": 6038, "text": "And that's a kind of attachment too."}, {"time": 6043, "text": "And that leads to the third noble truth, which is get rid of attachment and you won't suffer anymore."}, {"time": 6051, "text": "Uh, that's, it seems logical, but you know, it is a very, it is a mathematical analysis of this particular problem of suffering it's addressing."}, {"time": 6061, "text": "And then the fourth noble truth is the eightfold path of Buddhism, which is like a process by which one could unencumber oneself from this identification with something that isn't real."}, {"time": 6076, "text": "Do you need a bathroom break?"}, {"time": 6081, "text": "There's a funny moment, I was running in the heat yesterday listening to Gulag Archipelago."}, {"time": 6087, "text": "And there's a, which was a very welcome break because I'm looking for any excuse to stop whatsoever."}, {"time": 6094, "text": "The gentleman, very nice gentleman stopped me saying, recognized me and just said a bunch of friendly things."}, {"time": 6100, "text": "And then he mentioned as one of the people who really inspires him is Duncan Trussell."}, {"time": 6106, "text": "And I was, I mean, I'm the same way and I told him, you know, tomorrow, it felt like a name drop."}, {"time": 6116, "text": "I name dropped you this morning."}, {"time": 6118, "text": "I was like, tomorrow I'm going to get to meet him."}, {"time": 6120, "text": "So he says, he says, hi."}, {"time": 6121, "text": "And there's, oh, and he said that he watched Midnight Gospel on mushrooms."}, {"time": 6128, "text": "And it was like the greatest mushroom experience of his life."}, {"time": 6133, "text": "Yeah, man."}, {"time": 6134, "text": "Yeah, I was nervous about meeting you, man."}, {"time": 6135, "text": "Like I have so much respect for you."}, {"time": 6137, "text": "And like, oh yeah, I name dropped."}, {"time": 6138, "text": "I was saying I'm going on Lex's podcast today."}, {"time": 6141, "text": "It's, you look, we're so lucky we all live here."}, {"time": 6144, "text": "What the fuck?"}, {"time": 6145, "text": "We're all living in Austin together."}, {"time": 6146, "text": "Like I, I somehow like missed that, but that's, we all got to hang out."}, {"time": 6152, "text": "We all have to like start doing stuff."}, {"time": 6154, "text": "Well, you have to really, also you have to appreciate this moment."}, {"time": 6157, "text": "I remember, I know some people are less sentimental than others, but I remember sitting with Joe Rogan and with Eric Weinstein, I believe it was."}, {"time": 6173, "text": "And at the back of the comedy store shortly before COVID, I think."}, {"time": 6179, "text": "And just thinking like, there's no way these things will last."}, {"time": 6184, "text": "And these things meaning the comedy store, Joe Rogan, Joe Rogan, the Joe Rogan, like a, like a pocket influential podcasting person."}, {"time": 6194, "text": "Also a person like in this room, in this space, the ability to just talk for hours and lose ourselves in this moment."}, {"time": 6206, "text": "It just felt ephemeral, somehow temporary."}, {"time": 6210, "text": "And I just wanted to capture that moment somehow."}, {"time": 6214, "text": "Sometimes that's where the temptation to take a picture and you're that kind of stuff or record a podcast comes from."}, {"time": 6219, "text": "But it just felt like it would be, it'd be gone forever."}, {"time": 6223, "text": "Of course, Joe doesn't seem to have that kind of sentimental."}, {"time": 6227, "text": "No, sure, no, no."}, {"time": 6228, "text": "Just wherever you end up, you just enjoy the shit out of it."}, {"time": 6232, "text": "Well, and that's something you have to cultivate."}, {"time": 6234, "text": "You don't, that's not an easy, the thing you're talking about, you know, God, have you seen these?"}, {"time": 6240, "text": "I think the best analogy for what you're talking about, there's these videos where people give like a sugar cube to a raccoon, but the raccoons, they wash their food."}, {"time": 6249, "text": "So raccoon, or I think it's cotton candy."}, {"time": 6251, "text": "They give the raccoon cotton candy, immediately it washes the cotton candy."}, {"time": 6254, "text": "And of course the cotton candy dissolves in the water."}, {"time": 6257, "text": "And the raccoon is like, what the fuck?"}, {"time": 6260, "text": "Like, you know, and the thing you're, that grasping you're talking about, it's like the raccoon washing the cotton candy."}, {"time": 6266, "text": "Like the moment you get into the grasping part, you paradoxically have pulled yourself out of the moment that inspired the grasping part."}, {"time": 6277, "text": "And that's, you know, that's some people, that's the entirety of their lives trying to record."}, {"time": 6283, "text": "I mean, Jesus, man, you ever see people film fireworks on the 4th of July with their phone?"}, {"time": 6288, "text": "It's one of the most remarkable aspects of human behavior, which is like, you know they're not gonna watch the fireworks on their phone."}, {"time": 6299, "text": "Only a lunatic would do that."}, {"time": 6300, "text": "Like who's gonna go back and look at fireworks, but."}, {"time": 6304, "text": "So, but we're also in this position where, because of podcasting, there is some aspect where you can record a magical moment in time together between two people, or even just with a camera."}, {"time": 6315, "text": "So to get back to the lake that you were talking about, this is emptiness."}, {"time": 6320, "text": "So that's emptiness."}, {"time": 6321, "text": "That's what's known as emptiness."}, {"time": 6322, "text": "The lake is emptiness."}, {"time": 6323, "text": "And that's what we are, emptiness, emptiness."}, {"time": 6326, "text": "And that's another thing that gets very confused in Buddhism is that emptiness."}, {"time": 6332, "text": "And that emptiness is, that's to me, like when I'm going to do a podcast, that's where I try to go."}, {"time": 6340, "text": "I try to go just in the moment, no agenda."}, {"time": 6344, "text": "You know, if I am nervous or whatever, okay, I'll feel the nervousness, but just in the, just drop into the moment."}, {"time": 6350, "text": "That's when time changes."}, {"time": 6352, "text": "And then you look up, hours have passed."}, {"time": 6354, "text": "It feels like a second."}, {"time": 6355, "text": "And the reason it feels like that is because if you successfully dropped into the moment, it's the lake now, it's emptiness."}, {"time": 6365, "text": "It's forever for a second."}, {"time": 6366, "text": "You're like, you're dipping into eternity."}, {"time": 6369, "text": "And yeah, it's a very strange thing to, as part of that, record it, you know, as part of that, try to like grab it and put it out there, but it works."}, {"time": 6381, "text": "Can you speak to that, to the Duncan Trussell Family Hour?"}, {"time": 6386, "text": "Can you speak about that purple lavender world you go to when it's most intense and successful for you, when you feel a sense of lightness and happiness when it works, whether it's your own or a conversation with Joe in general, or is, well, yours is very specific because it's audio only."}, {"time": 6405, "text": "Maybe you can also speak to that."}, {"time": 6407, "text": "Because you might as well be naked or you don't have to, you have to, you're free of the conventions of the real world."}, {"time": 6416, "text": "I will never stop thinking it's remarkable."}, {"time": 6421, "text": "Like the fact that I'm talking to you, to me, seems remarkable, not just technologically, but I'm talking to someone, I'm assuming I'm allowed to say this, who has robot dogs that I've been watching for years evolve on YouTube."}, {"time": 6440, "text": "Arms reach away from one of these things, you know?"}, {"time": 6442, "text": "And I'm with somebody who is like an acclaimed genius."}, {"time": 6447, "text": "So for me, it's like, oh my God, how's, what, why do I get to have this conversation?"}, {"time": 6453, "text": "Why do I get to be here?"}, {"time": 6454, "text": "When there'd be like a line, there'd be a line that would just wrapped and wrapped and wrapped around this building of people who'd love a chance to just chat with you."}, {"time": 6463, "text": "And so when I, with my podcast, that's how I feel like when I'm talking to these guests, you know, who have spent, you know, some of them have like spent their entire lifetime meditating, you know, studying specific aspects of Buddhism or even when I'm with, you know, when I'm with comedians who I like consider to be brilliantly funny."}, {"time": 6488, "text": "So for me, it's just like, God, I almost feel like I've just created some sophisticated trap for cool people where like I get to like hang out with them."}, {"time": 6499, "text": "So you're like sitting in the gratitude of it, just feeling lucky."}, {"time": 6503, "text": "Yeah, yeah, feeling lucky and wrestling with imposter syndrome, you know, trying to like get that part of myself to shut up long enough so I could be in that moment that we're talking about, you know?"}, {"time": 6513, "text": "And then I carry that with me."}, {"time": 6516, "text": "It's not just like you stop the podcast."}, {"time": 6518, "text": "It's like some of the things these people tell me or some of the ways they are, like it becomes part of me."}, {"time": 6525, "text": "And then I get to have a life or this thing that they gave me is in me forever."}, {"time": 6532, "text": "And so, yeah, it's, there's... Yeah, it's cool how conversation can just, a few sentences can change the direction of your life."}, {"time": 6541, "text": "If you're listening, if you're there to be transformed by the words, they will do the work."}, {"time": 6546, "text": "It's, and it's the full mix of it."}, {"time": 6549, "text": "It's usually when, if you look up to somebody, and it's true for me at least, I think it is for you that you start to look up to basically everybody you talk to."}, {"time": 6560, "text": "Yes, yes, good sign."}, {"time": 6564, "text": "God forbid it goes the other way."}, {"time": 6566, "text": "You're in trouble."}, {"time": 6567, "text": "If all of a sudden you start looking down on people, because whatever crazy metric you're using, ooh, that would freak me out."}, {"time": 6575, "text": "I do feel like that's a quality of getting older."}, {"time": 6578, "text": "When I was younger, I really, like, I thought I was so smart."}, {"time": 6581, "text": "Like I thought I had it all figured out."}, {"time": 6584, "text": "So you're going, your ego is just going, taking a nose dive."}, {"time": 6587, "text": "I would like to say it's my ego taking a nose dive."}, {"time": 6590, "text": "Me and my friend talk about it a bunch."}, {"time": 6592, "text": "We've just always associated it with like doing acid for two decades straight."}, {"time": 6597, "text": "Like, I'm gonna just assume I'm just like slowly like spiraling into senility, you know?"}, {"time": 6602, "text": "Like, I'm just like, all the confidence, all the like, oh, the certainty when you're having, like in college, having the great, oh, like, you know, you feel like you're a representative of Camus or some shit."}, {"time": 6619, "text": "You read the myth of Sisyphus, and now you like it, know all existentialism and your certainty in regards to it is embarrassing, but you don't see it in that way."}, {"time": 6629, "text": "You just feel certain."}, {"time": 6630, "text": "And then that certainty, it just starts like, it starts crumbling a little bit."}, {"time": 6637, "text": "You know, I get to actually intensely experience that certainty in many communities, but one in cryptocurrency."}, {"time": 6646, "text": "Young folks with the certainty that this technology will transform the world."}, {"time": 6651, "text": "And I mean, this is almost one of the big communities of the modern era where they believe that this will really solve so many of the problems of the world, and they believe in it very intensely."}, {"time": 6663, "text": "And aside from the technology and the details of the thing, all I see is the certainty and the passion in their eyes."}, {"time": 6669, "text": "They'll stop me."}, {"time": 6671, "text": "Let me explain you, let me just give me a chance to tell you why this thing is extremely powerful."}, {"time": 6679, "text": "And I just get to enjoy the glow of that, because it's like, wow, I miss having that certainty about anything."}, {"time": 6687, "text": "It's probably come over for me too."}, {"time": 6689, "text": "But when I was younger, it's like, only I deeply understand the relationship of man to his mortality."}, {"time": 6700, "text": "And I understood that most deeply, I think, when I was like 16 or 17."}, {"time": 6704, "text": "And I am the representative of the human condition."}, {"time": 6708, "text": "And all these adults with their busyness of day to day life and their concerns, they don't deeply understand what I understand, which is the only thing that matters is the absurdity of the human condition."}, {"time": 6725, "text": "And let me quote you some Dostoevsky."}, {"time": 6727, "text": "Oh boy, and you speak Russian."}, {"time": 6731, "text": "So you've read the Brothers Karamazov in Russian."}, {"time": 6733, "text": "Unfortunately, I have to admit that I read all of the Dostoevsky in English."}, {"time": 6742, "text": "I came to this country when I was 13."}, {"time": 6745, "text": "And at least don't remember, we read a lot, but we read Tolstoy, Pushkin, a lot of the Russian literature but it was in Russian."}, {"time": 6754, "text": "But I don't remember reading Dostoevsky."}, {"time": 6755, "text": "I wonder at which point does the Russian education system give you Dostoevsky?"}, {"time": 6761, "text": "Because it's pretty heavy stuff."}, {"time": 6763, "text": "Second grade, it's probably the second grade."}, {"time": 6765, "text": "Russians are intense."}, {"time": 6767, "text": "Yes, they are, they very much are."}, {"time": 6770, "text": "I don't remember reading Dostoevsky, but I did tangent upon a tangent upon a tangent."}, {"time": 6776, "text": "I traveled to Paris recently on the way to Ukraine and was scheduled to talk to Richard Pevere and this pair that translate Dostoevsky, Tolstoy, just this famous pair that translate most of Russian literature to English."}, {"time": 6794, "text": "And I was planning to have a sequence of five, 10, 15 hour conversation with them about the different details of all the translations and so on."}, {"time": 6805, "text": "I just found myself in a very dark place mentally where I couldn't think about podcasts or anything like that."}, {"time": 6811, "text": "It caught me off guard."}, {"time": 6812, "text": "So I went to Paris and just laid there for a day."}, {"time": 6816, "text": "Not just being stressed about Ukraine and all those kinds of things, but I'm still, the act of translation is such a fascinating way to approach some of the deepest questions that this literature raises, which is like, how do I capture the essence of a sentence that has so much power and translate it into another language?"}, {"time": 6839, "text": "That act is actually really, really interesting."}, {"time": 6841, "text": "And I found with my conversations with them, they've really thought through this stuff."}, {"time": 6849, "text": "It's not just about language, it's about the ideas in those books."}, {"time": 6852, "text": "And that also really makes me sad because I wonder how much is lost in translation."}, {"time": 6858, "text": "I'm currently, so when I was in Ukraine, I talked to a lot of, like half the conversations I had on the record were in Russian, and basically 100% of the record were in Russian in Russian versus in English."}, {"time": 6877, "text": "And just so much is lost in those languages."}, {"time": 6880, "text": "And I'm now struggling because I'm launching a Russian channel where there'll be a Russian overdub of Duncan."}, {"time": 6890, "text": "Your wow will now be translated into Russian."}, {"time": 6893, "text": "What's Russian wow?"}, {"time": 6895, "text": "I don't, it'll just be wow probably."}, {"time": 6897, "text": "I'm so sorry for the difficulties of having to translate wow."}, {"time": 6901, "text": "Usually probably with wow they'll leave it unoverdubbed because people understand exactly what you mean."}, {"time": 6906, "text": "But that's an art form, and it's a weird art form."}, {"time": 6909, "text": "It's like how do you capture the chemistry, the excitement, the, I don't know, maybe the humor, the implied kind of wit."}, {"time": 6925, "text": "I don't know, there's just layers of complexity in language that it's very difficult to capture."}, {"time": 6930, "text": "And I wonder how, it is sad for me because I know Russian, how much is lost in translation."}, {"time": 6936, "text": "And the same, there's a brewing conflict and tension with China now, and so much is lost in the translation between those languages."}, {"time": 6946, "text": "And cultures, the entire, the music of the people is completely lost because we don't know the language, or most of us don't know the language."}, {"time": 6954, "text": "Yeah, how much of the conflict is just problems in translation?"}, {"time": 6958, "text": "How much of all these problems that we're having are just the alien sense of this or that?"}, {"time": 6962, "text": "It's just as simple as that."}, {"time": 6964, "text": "Words are getting just a tiny warp away from the intent of if, when we both speak the same language, we can still say something that offends someone when you never intended that at all."}, {"time": 6982, "text": "How much more so when like it's, not only is it a completely different sound, but the script itself is different."}, {"time": 6991, "text": "Like what is, the Russian writing, is it called Cyrillic or what's the name?"}, {"time": 6997, "text": "Yeah, Cyrillic."}, {"time": 6998, "text": "Cyrillic, and I don't know the name for Chinese writing, but it's like, it's a continuum that like gets weirder and weirder looking, you know?"}, {"time": 7007, "text": "Like it's, so yeah."}, {"time": 7009, "text": "Or less weird depending on your perspective."}, {"time": 7011, "text": "Yeah, I'm sure depending on where you're at."}, {"time": 7014, "text": "You know, I'm definitely, I'm about the farthest thing from a polyglot as there could be, man."}, {"time": 7018, "text": "Like, but I'll tell you, at one point when I was getting fascinated by Dostoevsky, I did have this very transient fantasy about learning Russian so that I could like understand the difference and it's."}, {"time": 7032, "text": "You were 17, 18 at the time."}, {"time": 7034, "text": "College."}, {"time": 7035, "text": "Yeah, college."}, {"time": 7036, "text": "Yeah, Brothers Karamazov lost in that book."}, {"time": 7038, "text": "Just like, oh God."}, {"time": 7040, "text": "So in love with it is."}, {"time": 7044, "text": "But there's definitely like, you know, Ukraine, and this is what a lot of the war is about is saying, you know, Ukraine and Russia are not the same people."}, {"time": 7055, "text": "There's a strong culture in Ukraine, there's a strong culture in Russia."}, {"time": 7058, "text": "But you know, I know because that's where my family's from, there is a fascinating, strong culture."}, {"time": 7065, "text": "But there's such strong cultures everywhere else too."}, {"time": 7070, "text": "Ireland has a culture, Scotland has a culture."}, {"time": 7072, "text": "Even like on a tiny island, you just have these like, subcultures that are more powerful than anything existing in human history."}, {"time": 7082, "text": "Like the Bronx, I don't know, like Brooklyn."}, {"time": 7085, "text": "Like different parts of New York have a certain culture."}, {"time": 7087, "text": "And then New York versus LA versus, well."}, {"time": 7090, "text": "And then certain places are looking for their culture."}, {"time": 7092, "text": "Like I don't, I think Austin, I don't know what Austin is."}, {"time": 7097, "text": "And I don't think anyone knows."}, {"time": 7098, "text": "There's a traditional Austin, and then it's evolving constantly."}, {"time": 7103, "text": "Same with Boston, a place I spent a lot of time."}, {"time": 7106, "text": "There's a traditional Boston and now it's evolving with the different younger people coming from university and staying and all of that is evolving."}, {"time": 7115, "text": "But underneath it, there's a core, like the American ideal of the value of the individual, the value of freedom, of freedom of speech, all those kinds of things that permeates all of that."}, {"time": 7125, "text": "And the same thing in the history of World War II permeates Ukraine and Russia, a lot of parts of Europe, the memories of all that suffering and destruction, the broken promises of governments and the occupier versus the liberator, all that kind of stuff."}, {"time": 7146, "text": "All that permeates the culture."}, {"time": 7148, "text": "That affects how cynical or optimistic you are, or how much you appreciate material possessions versus human connection, all that kind of stuff."}, {"time": 7159, "text": "Yeah, it's, I mean, this is like, talk about absurdity."}, {"time": 7163, "text": "I mean, this is, war is like, it's what absurdity looks like."}, {"time": 7168, "text": "It's some kind of organized madness."}, {"time": 7172, "text": "None of it makes sense, like all of it, like it's just, none of it makes sense, but it does, but it doesn't."}, {"time": 7178, "text": "I mean, obviously you're defending yourself or you're taking orders that if you don't take, you're going to jail."}, {"time": 7185, "text": "And so, or somewhere in between, there's a classic story about this."}, {"time": 7190, "text": "Maybe it's a bullshit myth about World War II."}, {"time": 7193, "text": "I'm sure everyone's heard it because it comes up, you know, it's Christmas Eve and they have a ceasefire."}, {"time": 7201, "text": "And then I think they played soccer, they sing Christmas songs, and then they had to force them into fighting again."}, {"time": 7208, "text": "And so when those moments happen, the, are you familiar with Hakeem Bey?"}, {"time": 7215, "text": "He's a controversial figure."}, {"time": 7216, "text": "Sadly, like he, like, I think he was like, I'm not going to defame him because I haven't like researched it correctly, but some people have said shit, but since I don't know the reference, I'm not going to."}, {"time": 7227, "text": "But regardless, I mean, you know, look, I'm sorry, but Bill Cosby was funny."}, {"time": 7232, "text": "You know, like that's a funny comedian, but you know the other stuff."}, {"time": 7240, "text": "Michael Jackson, he could fucking dance."}, {"time": 7243, "text": "And sing."}, {"time": 7244, "text": "And sing, but there's some other stuff."}, {"time": 7246, "text": "But regardless, Hakeem Bey came up with the idea of something called a temporary autonomous zone, which is that within a structure, a cultural structure, a temporary bubble of freedom will appear that by its nature gets sort of popped by the bigger bubble, or it runs out of resources generally is what happens."}, {"time": 7273, "text": "So these things will appear just out of the blue that it's almost like, imagine if like on earth in some tiny little bit of earth, the gravitational field was reduced by some percentage."}, {"time": 7289, "text": "And all of a sudden you could jump really high or whatever, but it wouldn't last."}, {"time": 7292, "text": "It's like that culturally, all the restrictions and the darkness and the heaviness and all of it for a second, somehow this bubble appears where humans come together as the hippie ideal."}, {"time": 7305, "text": "Brothers, sisters, just humans, earthlings instead of American, Chinese, Russian, Ukrainian temporary autonomous zone, it gets crushed by the default reality that it was appearing in."}, {"time": 7321, "text": "But somehow within that space, you witness the possibility, the possibility, the frustrating possibility that anyone who's thought about humanity knows this possibility, which is like, it seems like we can just get along."}, {"time": 7338, "text": "Like it does seem like we're pretty much the same thing and that we can just get along."}, {"time": 7343, "text": "Those moments are really rare."}, {"time": 7347, "text": "I talked to a lot of soldiers, a lot of people that suffered through the different aspects of that war."}, {"time": 7355, "text": "Or war, and there's an information war that convinces each side that the other is not just the enemy, but less than human."}, {"time": 7368, "text": "So there's a real hatred towards the other side."}, {"time": 7373, "text": "And those kind of little moments where you realize, oh, they're human like me."}, {"time": 7380, "text": "And not just like human like me, but they have the same values as me."}, {"time": 7386, "text": "And this woman who was a really respected soldier, she specializes in anti tank missiles."}, {"time": 7398, "text": "And she's very kind of, very pragmatic, very the enemy is the enemy, you have to destroy the enemy and saying like, there's no compassion towards the enemy."}, {"time": 7409, "text": "They're not human."}, {"time": 7411, "text": "They're less than human."}, {"time": 7413, "text": "But she said there was a moment when she remembers an enemy soldier in a tank took a risk to save a fellow soldier."}, {"time": 7425, "text": "And that risk was really stupid because he was facing, he was going to get destroyed."}, {"time": 7430, "text": "And then she said that she tried to shoot a rocket at that tank and she missed."}, {"time": 7439, "text": "And then she later went home and she couldn't sleep that she missed."}, {"time": 7443, "text": "How could she screw that up?"}, {"time": 7445, "text": "But then she realized that actually she missed, maybe she missed on purpose."}, {"time": 7451, "text": "Because she realized that that man, just like she is, was a hero, just like she strives to be."}, {"time": 7461, "text": "They were both heroes defending their own."}, {"time": 7464, "text": "And in that way, he was just like her."}, {"time": 7467, "text": "She was like, that's the only time I remember during this war ever feeling like this is another human being."}, {"time": 7473, "text": "But that was a very brief moment for her."}, {"time": 7476, "text": "And I just hear that over and over and over again."}, {"time": 7479, "text": "These romantic notions we have of we're one, that we're all just human."}, {"time": 7486, "text": "Unfortunately during war, those notions are rare."}, {"time": 7490, "text": "And it's quite sad."}, {"time": 7491, "text": "And war in a certain way really destroys those notions."}, {"time": 7494, "text": "And one of the saddest things is it destroys it, at least from what I see, potentially for generations."}, {"time": 7505, "text": "Not just for those people for the rest of their life, but for their children, their children's children."}, {"time": 7512, "text": "The hatred."}, {"time": 7513, "text": "I mean, I ask that question of basically everyone, which is will you ever forgive, asking of Ukrainians, will you ever forgive the Russians?"}, {"time": 7522, "text": "Will, do you have hate in your heart towards the Russians?"}, {"time": 7527, "text": "Or do you have love for a fellow human being?"}, {"time": 7532, "text": "And there's different ways that people struggle with that."}, {"time": 7536, "text": "Different people, they saw that, they saw the love, they saw the hate with their known heart."}, {"time": 7543, "text": "And they struggle with the hate they have."}, {"time": 7545, "text": "And they know they can overcome it in a period of weeks and months after the war is over."}, {"time": 7550, "text": "But some people said, no, this hate that was, that showed up in February when the war started will be with me forever."}, {"time": 7557, "text": "Well, yeah, their kids got killed."}, {"time": 7560, "text": "What the fuck are you gonna do about that?"}, {"time": 7562, "text": "Like, I don't care."}, {"time": 7562, "text": "I've got aphorisms and cute little stories about, you're still in prison if you hate your former captors."}, {"time": 7570, "text": "But man, I gotta tell you, if somebody hurt my kids, I'm not coming back."}, {"time": 7575, "text": "I mean, there's no amount, at least right now in my approximation, of spiritual literature, meditation, or anything that I can really think of that is going to give me that kind of space."}, {"time": 7591, "text": "Like, I think I imagine in the same way like, I imagine I could probably run a marathon eventually, but do I think I'm ever gonna do that?"}, {"time": 7602, "text": "That times a million."}, {"time": 7604, "text": "So man, all we can do is have compassion for their hate because it's like, what are you gonna say?"}, {"time": 7611, "text": "What are you gonna say to someone like that?"}, {"time": 7613, "text": "Oh, oh, you know, for the sake of humanity, let it go."}, {"time": 7618, "text": "It was just your kids."}, {"time": 7620, "text": "It was just something you loved more than anything in the world."}, {"time": 7625, "text": "You'll never be okay again."}, {"time": 7627, "text": "You're gonna have nightmares for the rest of your life."}, {"time": 7629, "text": "But you should forgive."}, {"time": 7631, "text": "Well, there is truth in the fact that forgiveness is the way to let go, right?"}, {"time": 7635, "text": "But that truth is not, fuck you, right?"}, {"time": 7643, "text": "Which is why it's not your job to say that."}, {"time": 7646, "text": "Not that you're doing that, I know you're not."}, {"time": 7648, "text": "But you know, the problem with people like me, early phase, you could get this stupid missionary thing going where you like, start trying to like, I don't know, like proselytize ideals that you might be incapable of, you know?"}, {"time": 7662, "text": "And I just, hearing it, you know, that's the, man, I saw this, the thing that like, I mean, I've seen a lot, all of us by now, probably if we were online, I've seen, and you just saw it in person."}, {"time": 7674, "text": "Like we've seen things that are just horrific."}, {"time": 7678, "text": "But as a dad, man, I just saw this clip of this kid around the age of my kid, walking by himself, these refugees, just walking by himself, crying, the look on his face, I can't explain the look on his face."}, {"time": 7695, "text": "I don't know what happened to his parents."}, {"time": 7698, "text": "Like I, it was so upsetting."}, {"time": 7701, "text": "Like even thinking about it now, it's just like, fuck, that could have been my kid."}, {"time": 7704, "text": "That could have been my kid, you know?"}, {"time": 7706, "text": "So knowing that kind of, that, that kid's gotta grow up now."}, {"time": 7713, "text": "And I don't know, is the kid's parents still there?"}, {"time": 7716, "text": "And that's just one of countless orphans out there now."}, {"time": 7722, "text": "So what you have this hate, and the question is how to direct it."}, {"time": 7727, "text": "Because the choice is you can direct it towards the politicians that started the war."}, {"time": 7733, "text": "You can direct it towards the soldiers that are doing the killing, or you can direct it towards an entire group of people."}, {"time": 7740, "text": "And that's the struggle because hate slowly grows to where you don't just hate the soldiers."}, {"time": 7748, "text": "You don't just hate the leaders."}, {"time": 7751, "text": "You hate all Russians because they're all equally evil because the ones that aren't doing the fighting are staying quiet."}, {"time": 7761, "text": "And I'm sure the same kind of stories are happening on the other side."}, {"time": 7765, "text": "And so there is, that hate is one that is deeply human, but you wonder for your own future, for your own home, for building your own community, for building your own country, how does that hate morph over the weeks and months and years?"}, {"time": 7793, "text": "Not into forgiveness, but into something that's productive that doesn't destroy you."}, {"time": 7797, "text": "Because hate does destroy."}, {"time": 7799, "text": "That's the dark aspect of a rocket that hits a building and kills hundreds of people."}, {"time": 7810, "text": "The worst effect of that rocket is the hate in the hearts of the loved ones to the people that were in that building."}, {"time": 7823, "text": "That hate is a torture over a period of years after."}, {"time": 7830, "text": "And that it doesn't just torture by having that psychological burden and trauma."}, {"time": 7836, "text": "It also tortures because it destroys your life."}, {"time": 7839, "text": "It prevents you from being able to enjoy your life to the fullest."}, {"time": 7844, "text": "It prevents you from being able to flourish as a human being, as a professional, in all those kinds of ways that humans can flourish."}, {"time": 7857, "text": "It's such a, there is an aspect where this naive notion is really powerful, that love and forgiveness is the thing that's needed in this time."}, {"time": 7872, "text": "And when I talk to soldiers, they don't, I remember bringing up to Jaco, is there a sense where the people you're fighting are just brothers in arms, bringing up the Dire Straits song, Brothers in Arms?"}, {"time": 7888, "text": "And he was basically, without swearing, saying fuck that, that they're the enemy."}, {"time": 7893, "text": "Yeah, I mean, he's literally in survival mode."}, {"time": 7896, "text": "He can't think like that."}, {"time": 7897, "text": "It's gonna create latency in the system and that's gonna lower his survivability."}, {"time": 7900, "text": "You can't think that."}, {"time": 7901, "text": "I mean, we're talking about cognitively."}, {"time": 7904, "text": "You can't have latency."}, {"time": 7905, "text": "Like, if you're, that one moment of hesitation, you see it sometimes in these YouTube videos of like somebody, a new cop has been unfortunate enough to run into something that is a phenomenon, suicide by cop."}, {"time": 7923, "text": "Somebody has a knife and that person is running towards them with a knife and they're begging the person to stop, that you can hear it in their voice."}, {"time": 7932, "text": "They're begging, stop, stop, stop, stop."}, {"time": 7937, "text": "And the person is not gonna stop."}, {"time": 7939, "text": "So the critique of that is that that latency could potentially not just lead to the cop getting killed, but to that person with a knife killing other people."}, {"time": 7954, "text": "And so, you know, I get, if I were out there, I think that like, you probably just as a matter of like not getting shot and being fully in the moment, you have to be like that."}, {"time": 7968, "text": "I would guess, I don't know."}, {"time": 7970, "text": "I don't know, I'm the furthest thing from a soldier there could be, but there's something Jack Kornfield, this great Buddhist teacher says, which is tend to the part of the garden you can touch."}, {"time": 7983, "text": "Meaning this is where we're at right now."}, {"time": 7985, "text": "Thank God you and I, though we are experiencing some like ripples from what's going on over there, everyone is, we're not there."}, {"time": 7994, "text": "And thank God we don't have to come up with the psychological program for people going through that to no longer be encumbered by that hate."}, {"time": 8008, "text": "And I don't know if that's just lazy or whatever, but it's like, you know, for me, I just, I have to bring it back to, all right, well, here's where I'm at now."}, {"time": 8015, "text": "And I don't want there to be war."}, {"time": 8021, "text": "I don't want to hurt people, but yeah, I love what you said."}, {"time": 8024, "text": "I think what you said is the, if anything, is the most intelligent way of looking at it."}, {"time": 8032, "text": "It's like, don't pretend that you're not gonna feel that hate, like you're gonna feel it."}, {"time": 8038, "text": "There's no way around it."}, {"time": 8039, "text": "Or like, cause that's even worse."}, {"time": 8040, "text": "Cause then you're almost saying like something's wrong with them for feeling the hate or, you know, whatever."}, {"time": 8045, "text": "But more along the lines, if you can avoid applying that hate to an entire country of people, then do that."}, {"time": 8058, "text": "Like, just understand, we're talking about like a, not everybody."}, {"time": 8065, "text": "I know it's not everybody."}, {"time": 8067, "text": "It's just easier, isn't it?"}, {"time": 8068, "text": "Cognitively, it's somehow easier to think all Russians, monsters, you know, all Russians, all whatever the particular like thing is that you're supposed to not like."}, {"time": 8082, "text": "It's easier somehow, weirdly."}, {"time": 8083, "text": "You'd think that'd be more difficult."}, {"time": 8085, "text": "Yeah, but I guess the lesson is if you give in to the easy solution, that's going to lead to detrimental longterm effects."}, {"time": 8098, "text": "So hate should be, it's such a powerful tool that you should try to control it for your own sake."}, {"time": 8108, "text": "Not because you owe anything to anybody, but for your own psychological development over time."}, {"time": 8114, "text": "Right, right, that's it, that's it, fuck."}, {"time": 8121, "text": "In terms of dark places, you suffered from depression."}, {"time": 8126, "text": "Where has been some of the darker places you've gone in your mind?"}, {"time": 8131, "text": "You know, I needed therapy, man."}, {"time": 8132, "text": "I needed therapy for the longest time, I just didn't get it."}, {"time": 8136, "text": "So because of that, I would go through like bouts of like paralytic depression, like suicidal depression, suicidal ideations that were more than just ideations."}, {"time": 8151, "text": "I mean, I think like people get afraid when the thought of suicide appears in their consciousness, they get really scared of themselves."}, {"time": 8161, "text": "So they think there's something like, fuck, what's going on with me?"}, {"time": 8164, "text": "Why would I think that?"}, {"time": 8164, "text": "But I think if we are suffering and, you know, as a natural part of not wanting to reduce suffering or not feel bad anymore, I mean, suicide is going to be an, like, if we're just, you know, you're just looking, what are all the options?"}, {"time": 8178, "text": "Let's brainstorm here."}, {"time": 8180, "text": "I could start drinking more water."}, {"time": 8182, "text": "You start jogging, get some therapy, call my friends, all the stuff we all hear."}, {"time": 8187, "text": "Or I could just, I think the height of my apartment building is probably the, definitely the right height to kill myself."}, {"time": 8194, "text": "And then, so where, for me, like the few times where the ideation has gone towards like, well, when would I do that?"}, {"time": 8205, "text": "How do I, what, you know, what do I need to like accomplish that?"}, {"time": 8210, "text": "When then like, that's where it gets really fucking scary."}, {"time": 8212, "text": "That's where it's like terrifying."}, {"time": 8214, "text": "And so you start the actual details of the planning of how to commit suicide."}, {"time": 8220, "text": "What's going to be the least painful way to do it?"}, {"time": 8222, "text": "What's going to be the most instantaneous way to do it?"}, {"time": 8224, "text": "What's the, you know, and with, you know, with depression, because it can be progressive, you know, this is why you have to really just stay on top of it."}, {"time": 8234, "text": "Anyone who's gone through depression knows what I'm talking about."}, {"time": 8236, "text": "You gotta stay on top of it."}, {"time": 8237, "text": "Like you might need medication."}, {"time": 8238, "text": "You know, I know this is controversial now, but it's still better than dying if you ask me."}, {"time": 8242, "text": "But at some point with depression, it like becomes paralyzing."}, {"time": 8246, "text": "So you don't want to get out of bed anymore and you're not taking showers anymore."}, {"time": 8250, "text": "And you don't want to talk to anybody anymore."}, {"time": 8251, "text": "And you're not answering your phone anymore."}, {"time": 8255, "text": "So like in a dark place that you might be in, it still might get worse."}, {"time": 8259, "text": "So you should really do everything you can to get under control."}, {"time": 8265, "text": "And that's the problem with that specific psychological disorder."}, {"time": 8270, "text": "Because the things it's like, if you start listening to what you want to, you think it's you, it's the depression."}, {"time": 8276, "text": "You start listening to it."}, {"time": 8278, "text": "It wants you to stay in bed."}, {"time": 8280, "text": "And then you're getting those fucking depression sleeps, you know, or you wake up and you're more tired."}, {"time": 8286, "text": "Like it's not working."}, {"time": 8287, "text": "You're trying to escape reality by sleeping."}, {"time": 8293, "text": "Like you have to like, you're fighting for your, you're literally fighting for your life."}, {"time": 8299, "text": "It might not seem like that."}, {"time": 8300, "text": "Cause you can't, if you could see depression, if you could see it, if you knew you had some inky, vaporous octopus thing that was just wrapping around you more and more and more and more, you would probably do everything you could to rip that fucking thing off your body."}, {"time": 8316, "text": "And if you couldn't get it off your body, you would be calling people to get help."}, {"time": 8321, "text": "So it doesn't feel like a fight because you're exhausted."}, {"time": 8323, "text": "There's no reason to move."}, {"time": 8325, "text": "There's no, you don't see the meaning for any of it."}, {"time": 8328, "text": "So it doesn't feel like a battle, but it is a battle."}, {"time": 8330, "text": "You're not feeling."}, {"time": 8331, "text": "You're just, you're basically not feeling."}, {"time": 8333, "text": "You're like, you start going numb."}, {"time": 8335, "text": "At least that was my experience with it."}, {"time": 8337, "text": "Numb and tired."}, {"time": 8338, "text": "And then increasingly numb and tired."}, {"time": 8341, "text": "And then increasingly sort of disconnecting from reality."}, {"time": 8345, "text": "And then somewhere in there, that's when you start playing around with the idea of like, oh, I don't know if it's worth it."}, {"time": 8351, "text": "Now, you know, I think compared to some of my friends who haven't survived, obviously who haven't survived depression, like mine was definitely not whatever theirs was like."}, {"time": 8361, "text": "I've heard, I mean, to understand it for folks out there, maybe you haven't gone through it."}, {"time": 8367, "text": "Just imagine if like, how bad you have to feel if death is the solution, like violence against yourself so that you die is the solution."}, {"time": 8377, "text": "Like just, it flies in the face of everything."}, {"time": 8383, "text": "So yeah, that was definitely the darkest place that I've ever been."}, {"time": 8388, "text": "Just that death doesn't seem like, because you don't care about anything anymore, that death just doesn't seem like that bad."}, {"time": 8398, "text": "Like you're not able to appropriately assign the negative costs to the solution."}, {"time": 8406, "text": "It just seems like a reasonable solution."}, {"time": 8407, "text": "Yeah, but I think also what's going along with it is like, it's not like your brain isn't working."}, {"time": 8415, "text": "Like you're not thinking, obviously you're not thinking clearly."}, {"time": 8419, "text": "Like, at least again, this was my experience of it."}, {"time": 8422, "text": "It's a fog."}, {"time": 8423, "text": "You're in some kind of, like you're confused."}, {"time": 8427, "text": "There's confusion."}, {"time": 8429, "text": "There's shame."}, {"time": 8431, "text": "You feel embarrassed."}, {"time": 8433, "text": "You wanna get out of bed."}, {"time": 8434, "text": "You wanna do stuff."}, {"time": 8434, "text": "You wanna be compelled to be social and do all this stuff, but you're not, you're not."}, {"time": 8440, "text": "Like you seem, if people don't know what's going on and you're not telling them because you're embarrassed, because you want to have some like, you know, uncorrupted, unworped psyche, you know, you're like, it invites you to be secret about it."}, {"time": 8457, "text": "That's one of its first tricks is it tells you not to tell anybody."}, {"time": 8461, "text": "And that's deadly in that case, it's deadly."}, {"time": 8466, "text": "What was the source of light?"}, {"time": 8467, "text": "What was the, what were for you and in general the ways out?"}, {"time": 8474, "text": "Yeah, so for me, the solutions, and again, man, for my depressed friends out there, please don't get mad at me."}, {"time": 8483, "text": "I'm not doing the thing of like, just put on a smile or any of that bullshit because it doesn't feel like that when you're like, and when you're fighting it, it's like you are, you're in a, I don't know why I keep using these stupid gravity analogies, but it's like the gravity's been turned up on your planet in every single way by, so getting out of bed."}, {"time": 8507, "text": "By the way, gravity and quantum mechanics, one of the most beautiful things about our reality, what the hell is each of those things?"}, {"time": 8516, "text": "So this isn't, you're not just talking about hippie language, it's still physicists pretend they understand something."}, {"time": 8525, "text": "We're still at the very beginning of understanding this mysterious world of ours that seems to be functioning according to these weirdly simple and yet universally powerful laws, which we don't fully yet understand."}, {"time": 8540, "text": "So please, the metaphor and the analogy of gravity."}, {"time": 8544, "text": "Fully, fully applicable."}, {"time": 8545, "text": "I don't know any other way to put it than it's like somebody turned the gravitational field of your mattress up by."}, {"time": 8549, "text": "So everything is heavy."}, {"time": 8550, "text": "Heavy, your body's heavy."}, {"time": 8553, "text": "You don't wanna get out of bed, you will consider shitting or pissing the bed because you're just like, who gives a fuck, I'll just lay in my shit and piss."}, {"time": 8560, "text": "You're dying, you're like, none of it makes sense."}, {"time": 8570, "text": "And I feel like in retrospect, I'm making what I've done a little, like I had more lucidity."}, {"time": 8577, "text": "It was more of like when you're wrestling with someone and you're just like, it's different for you."}, {"time": 8586, "text": "But for me, if I'm wrestling, I'm not thinking about jujitsu moves."}, {"time": 8590, "text": "I'm like."}, {"time": 8590, "text": "Survival."}, {"time": 8591, "text": "You're just."}, {"time": 8592, "text": "So it's like that."}, {"time": 8593, "text": "It is a struggle."}, {"time": 8594, "text": "Like it's like, you really have to deliberately fight."}, {"time": 8601, "text": "So you start, so you can almost have a conversation with the depression."}, {"time": 8607, "text": "And then what you do is you start doing the opposite of everything it's telling you to do."}, {"time": 8613, "text": "So it's telling you lay in bed."}, {"time": 8616, "text": "So you get out of bed."}, {"time": 8618, "text": "It's definitely telling you don't fucking exercise."}, {"time": 8621, "text": "You're gonna go fucking exercise."}, {"time": 8623, "text": "That's not gonna do anything."}, {"time": 8625, "text": "You probably have a heart attack."}, {"time": 8626, "text": "You really wanna go outside."}, {"time": 8628, "text": "Don't go fucking exercise."}, {"time": 8630, "text": "And it'll feel crazy."}, {"time": 8633, "text": "And you won't wanna do it."}, {"time": 8634, "text": "If you wanted to do it, you wouldn't be depressed."}, {"time": 8637, "text": "Like how often do you hear like one of the symptoms of depression?"}, {"time": 8640, "text": "You wanna jog."}, {"time": 8641, "text": "You wanna get on a bike."}, {"time": 8642, "text": "You know, you don't hear that."}, {"time": 8644, "text": "That's not a symptom."}, {"time": 8644, "text": "So you start, at least one solution I just started doing the opposite of."}, {"time": 8651, "text": "Whatever the voice is telling you, do the opposite."}, {"time": 8655, "text": "And then suddenly the gravitational field diminishes a little bit."}, {"time": 8662, "text": "It doesn't go all the way away."}, {"time": 8663, "text": "And that's where you can fall right back into it cause you just feel even slightly better."}, {"time": 8667, "text": "You're like, oh, okay, I fixed it."}, {"time": 8669, "text": "You know, really, I think if you like and having been through therapy, the best solution would be go to a fucking therapist as quickly as you can."}, {"time": 8682, "text": "Just sit down with them and tell them what's going on."}, {"time": 8686, "text": "I know what you're thinking."}, {"time": 8687, "text": "How am I gonna find a therapist?"}, {"time": 8689, "text": "Just do it."}, {"time": 8691, "text": "Google it, go on Yelp."}, {"time": 8693, "text": "All of this shit feels impossible."}, {"time": 8696, "text": "You're like, I don't wanna turn on the computer."}, {"time": 8697, "text": "I don't wanna do any of this."}, {"time": 8699, "text": "I mean, you have to."}, {"time": 8700, "text": "You do it if you're on fire."}, {"time": 8702, "text": "And someone's like, you know, here's a way to not be on fire."}, {"time": 8705, "text": "Just this particular fire is, it doesn't make you wanna run around screaming."}, {"time": 8709, "text": "It just makes you wanna fall asleep forever."}, {"time": 8711, "text": "And that, but those little steps, I got lucky because it worked."}, {"time": 8716, "text": "It worked, I started exercising."}, {"time": 8718, "text": "I'd been on antidepressants before when I was originally diagnosed with it."}, {"time": 8724, "text": "Did those help?"}, {"time": 8726, "text": "You know, I, even with all the current research coming out about, that maybe we were all wrong about our understanding of depression, I do feel like it helped in a certain way."}, {"time": 8738, "text": "Like it definitely, it definitely like made me stop thinking about, it stopped the intrusive thoughts."}, {"time": 8745, "text": "And, but I don't know how much of that was placebo or how much of that, I don't know."}, {"time": 8749, "text": "But then also like I couldn't cum anymore."}, {"time": 8751, "text": "That was the other fucked up thing."}, {"time": 8753, "text": "Like you're, you can't have orgasms."}, {"time": 8755, "text": "And which might not sound like a big deal, but you know, when I told my therapist that they actually took me off them, cause I think she was realizing that it started diminishing a little bit."}, {"time": 8767, "text": "But the one I'm talking about now, that whatever episode or whatever you wanna call it, I just got lucky cause it worked."}, {"time": 8776, "text": "It worked and I started feeling better, thank God."}, {"time": 8779, "text": "Now, if you suffer from depression out there and you've had a remission of the depression, you know, it's really like, it's scary to have mental illness because everyone gets bummed out."}, {"time": 8792, "text": "I mean, that's just normal."}, {"time": 8793, "text": "Like you're gonna get bummed out and I don't wanna do anything sometimes."}, {"time": 8796, "text": "It doesn't mean you have a clinical depression."}, {"time": 8798, "text": "You might just be bummed out or grieving."}, {"time": 8800, "text": "You might be any number of things."}, {"time": 8802, "text": "But when I get really nervous, if some of those symptoms start showing up."}, {"time": 8809, "text": "And at one point I felt like that was happening again."}, {"time": 8814, "text": "And I did intramuscular ketamine therapy, which now that was the damnedest thing I've ever experienced."}, {"time": 8824, "text": "Aside from the fact that ketamine is immensely psychedelic."}, {"time": 8830, "text": "I just remember going back to the hotel after the experience with the clinician."}, {"time": 8837, "text": "And like, you know, it's like with depression, it's like a headache that starts coming on."}, {"time": 8844, "text": "But you're like, this headache might last for years."}, {"time": 8847, "text": "It might last for six months."}, {"time": 8848, "text": "It might get worse and worse and worse."}, {"time": 8850, "text": "And so I went back to the hotel room and it was just gone."}, {"time": 8857, "text": "Like I just felt normal."}, {"time": 8858, "text": "It felt great."}, {"time": 8859, "text": "It was like the most remarkable thing ever."}, {"time": 8862, "text": "So, you know, look at the research on ketamine right now."}, {"time": 8865, "text": "It's like, it's not like bullshit."}, {"time": 8869, "text": "It's not like woo science."}, {"time": 8870, "text": "There's really, really good data out there showing that something like, I think it's 60%."}, {"time": 8875, "text": "I don't know what the percentage is, but 60% of people with an endogenous depression when they get ketamine therapy will experience remission, regardless of whether you trip out or not."}, {"time": 8888, "text": "It just does something that I don't know if they know what it is yet."}, {"time": 8891, "text": "I don't care if they do."}, {"time": 8892, "text": "But that one thing worked."}, {"time": 8894, "text": "And basically you keep fighting until something works."}, {"time": 8898, "text": "It's a survival issue."}, {"time": 8899, "text": "And it's a survival issue."}, {"time": 8901, "text": "But it's just, I think because it's kind of so slow moving, you might even forget it's progressive."}, {"time": 8906, "text": "Or, you know, you could easily just think that you're just a kind of bummed out person."}, {"time": 8910, "text": "Or you start thinking that these aspects of your psychology are permanent when they don't have to be."}, {"time": 8917, "text": "What about other people in your life?"}, {"time": 8919, "text": "What advice would you give to people that have loved ones who suffer from depression?"}, {"time": 8924, "text": "What are they to do?"}, {"time": 8926, "text": "Okay, now this is really like, man, it's really dark."}, {"time": 8934, "text": "Here's number one."}, {"time": 8937, "text": "This is what somebody told me when I lost a friend to suicide, you know?"}, {"time": 8940, "text": "Because when you lose a friend to suicide, when you lose a loved one to suicide, you're gonna blame yourself."}, {"time": 8945, "text": "It's like in the periphery of suicide, there is a circumference of guilty people who all feel like, oh, if only I'd said this at the right time, if only I'd listened more, if only I'd seen that warning sign, if only this or that."}, {"time": 8965, "text": "It's interesting in that with other forms of like disease, you know, if your loved one dies from cancer, say, more than likely, you're not gonna be thinking like, oh, I should have cured their cancer."}, {"time": 8981, "text": "You know, like it's a tragedy, but at least you're not like, oh, if only I had."}, {"time": 8986, "text": "You still might think that's part of grief, but."}, {"time": 8989, "text": "It's not as sticky in many of the other situations."}, {"time": 8992, "text": "Here, the guilt couldn't really stay for a long time."}, {"time": 8995, "text": "Yep, so you, number one, we're talking about a progressive disease that can lead to death."}, {"time": 9005, "text": "And if somebody commits suicide, they wanted to commit suicide."}, {"time": 9009, "text": "And at least what I've been told is you can't stop it."}, {"time": 9012, "text": "It's gonna happen, it's gonna happen."}, {"time": 9015, "text": "There are no magic words."}, {"time": 9016, "text": "There's nothing you could do."}, {"time": 9018, "text": "So, you know, people who've lost people to suicide, you know what I'm talking about."}, {"time": 9023, "text": "Like, you know, you can watch it happen in real time and there's just nothing you could do."}, {"time": 9056, "text": "Now there, that's when you can be a good listener and, you know, open up to them and hear what they're saying and see like, oh, shit, are they asking me for it?"}, {"time": 9064, "text": "Is this them asking for help?"}, {"time": 9065, "text": "And even if you're like, I don't know what to do, you know, at least you can like start checking in on them, you know, start like help them understand that you're there for them and then hopefully get them into therapy, get them to a doctor, get them to a professional who can like see what's going on there."}, {"time": 9085, "text": "So that, and then there's hope."}, {"time": 9087, "text": "And even then there might not be hope actually, you know, doctors can't stop it."}, {"time": 9090, "text": "There's no, sometimes it just, that's the way it goes."}, {"time": 9094, "text": "But, you know, I know that like being sensitive, if somebody's like all of a sudden hitting you up or reaching out to you that normally isn't like that and just, what's going on?"}, {"time": 9106, "text": "How are you?"}, {"time": 9106, "text": "And just listen."}, {"time": 9108, "text": "Which in general, depression or not, is probably a good thing to do."}, {"time": 9113, "text": "To truly listen."}, {"time": 9116, "text": "It's like, are you okay?"}, {"time": 9119, "text": "Because people have, you know, this whole thing of like cries for help, man."}, {"time": 9123, "text": "Sometimes they just look like a weird text."}, {"time": 9126, "text": "You know, and you don't realize for the person to send that fucking text, they've been thinking about it all morning."}, {"time": 9132, "text": "They've been just trying to get their phone up from the floor."}, {"time": 9136, "text": "So, you know, I think that's it."}, {"time": 9140, "text": "I mean, what, I don't know."}, {"time": 9142, "text": "I've had friends like kill themselves."}, {"time": 9145, "text": "And many of them, it wasn't like, sadly it was like, I don't know."}, {"time": 9151, "text": "I don't know what could have been done, but."}, {"time": 9154, "text": "But there's still a guilt in the back of your head?"}, {"time": 9157, "text": "For the rest of my life, for sure."}, {"time": 9159, "text": "I always will be."}, {"time": 9163, "text": "But again, what are you gonna do?"}, {"time": 9164, "text": "But even that, it's a part of love."}, {"time": 9171, "text": "You could, yeah."}, {"time": 9172, "text": "You know, we feel guilt."}, {"time": 9174, "text": "Part of grief is guilt, you know?"}, {"time": 9175, "text": "Like we always could have been better people."}, {"time": 9178, "text": "We always could have been better people."}, {"time": 9180, "text": "You getting to Viktor Frankl much?"}, {"time": 9185, "text": "The invitation to live your life as though you'd been on your death bed and had been given the chance to go back and not make the same mistakes."}, {"time": 9198, "text": "I return to that idea all the time, meaning it's like, okay, whatever you did before this moment was too late."}, {"time": 9208, "text": "But now, you know, this is where you can start."}, {"time": 9211, "text": "This is where you can start."}, {"time": 9212, "text": "And yeah, so I think that for a neurotic like me, that's super important."}, {"time": 9219, "text": "Because otherwise, I'll just get like too lost in the weeds of shitty things I did in the past."}, {"time": 9224, "text": "So speaking of Viktor Frankl, you and Hitler have the same birthday."}, {"time": 9228, "text": "Oh my God, you've really done your research."}, {"time": 9232, "text": "Well, I often Google famous people that have a birthday same as Hitler."}, {"time": 9239, "text": "The person that shows up, you know, is your face just really big."}, {"time": 9244, "text": "You and Hitler together, just pals next to each other."}, {"time": 9250, "text": "No, but April 20th is an embarrassing birthday for all my 420 friends out there."}, {"time": 9255, "text": "You share a birthday with Hitler."}, {"time": 9257, "text": "Well, it's 420s also has a humor and a lightness to it, right?"}, {"time": 9264, "text": "Your life is embarrassing."}, {"time": 9267, "text": "But if you like weed and you're born on stoner day and you believe in reincarnation, do you realize like when you start connecting the dots there, if there is like a Bardo where you get to choose your next life."}, {"time": 9281, "text": "So you're like a shitty generic NPC."}, {"time": 9285, "text": "You're like, of course, you would be born on 420."}, {"time": 9288, "text": "Dude, let me be born on 420, man, yeah."}, {"time": 9293, "text": "But isn't it interesting that on that same day, Hitler is also born."}, {"time": 9300, "text": "There's a tension to that and that Hitler's an artist."}, {"time": 9306, "text": "So it's like that hippie mindset could go anywhere."}, {"time": 9312, "text": "Oh, yeah, right."}, {"time": 9312, "text": "Like, yeah, you know, and I was just having this conversation with a friend of mine who's a wonderful skeptic."}, {"time": 9318, "text": "And we were talking about this, which is the thing where you start attributing to the day you were born, these kinds of significance."}, {"time": 9331, "text": "And based on maybe people who were born on that day, maybe some other things."}, {"time": 9334, "text": "And, you know, it's like, think of how many people by now in the course of human history have been born on April 20th."}, {"time": 9342, "text": "I mean, how many?"}, {"time": 9344, "text": "Someone could probably do the math and come up with some number close to it."}, {"time": 9347, "text": "Now, this is how you know how rotten Hitler is."}, {"time": 9351, "text": "Like, he's the one that, like, fucks up the birthday for everybody else."}, {"time": 9357, "text": "I think where I heard that you're 420 is Wim Hof episode because he's also 420."}, {"time": 9364, "text": "He's a 420."}, {"time": 9365, "text": "Yeah, so Hitler beats even Wim Hof."}, {"time": 9370, "text": "In terms of owning the date."}, {"time": 9371, "text": "I think if anybody is like, well, obviously there's nothing you can do to like fix it."}, {"time": 9378, "text": "Hitler fucked up a lot of things."}, {"time": 9380, "text": "He fucked up that mustache."}, {"time": 9382, "text": "He fucked up the name Hitler."}, {"time": 9383, "text": "He fucked up 420."}, {"time": 9385, "text": "And obviously he caused a horrific Holocaust that, by the way, talk about these reverberations through time that we're still experiencing."}, {"time": 9393, "text": "I mean, there's still people walking around with fucking tattoos from that motherfucker."}, {"time": 9396, "text": "So, but, you know, Wim Hof, you know, people like Wim Hof."}, {"time": 9401, "text": "They're like whatever the opposite of Hitler is, you know?"}, {"time": 9405, "text": "He too is creating ripples in the lake that hopefully respond to that of Hitler."}, {"time": 9411, "text": "Yeah, very cold fucking lake."}, {"time": 9413, "text": "And he's in, and yeah, so very, very cold lake that he's happily swimming around in."}, {"time": 9419, "text": "But yeah, you know, I try not to think about like the Hitler thing on my birthday."}, {"time": 9428, "text": "Then my dad would just, every birthday he would remind me that Hitler was 420."}, {"time": 9434, "text": "Do you think, you're one of the sweetest people I know, just as a fan, do you think you're capable of evil?"}, {"time": 9441, "text": "Sure, yeah, I mean, sure, definitely."}, {"time": 9444, "text": "I think if you don't think that, you better watch out because come on, how do you think you're not capable of evil?"}, {"time": 9451, "text": "And PS, you are, if you're connected to the supply chain, friend, you're doing evil."}, {"time": 9458, "text": "You're paying taxes."}, {"time": 9459, "text": "You're like, you're supporting the worst things in the world."}, {"time": 9463, "text": "I mean, you know, like diffusion of responsibility, it's really curious or the circumference of responsibility where it's like bombs are going off somewhere that were paid for in some small part by you, some fractional, if an American, if a drone is flying over a village in Afghanistan and drops a bomb and you pay taxes, then you could say you have fractional ownership over that drone."}, {"time": 9498, "text": "You're a cog in the machine of evil in some sense."}, {"time": 9502, "text": "And I know what you're gonna say, well, yeah, but I have to fucking pay taxes."}, {"time": 9506, "text": "Like I have no choice."}, {"time": 9507, "text": "There's sales tax, there's this or that."}, {"time": 9509, "text": "Take that attitude."}, {"time": 9511, "text": "It's the same thing that people on the battlefield when they're sending missiles into other tanks, they're thinking the same thing."}, {"time": 9519, "text": "It's just, they're more directly responsible for what's going on."}, {"time": 9523, "text": "But in Buddhism, this idea of dependent co arising or yeah, dependent co arising."}, {"time": 9530, "text": "We're all connected."}, {"time": 9531, "text": "We're all part of this matrix."}, {"time": 9533, "text": "We're all connected, meaning we all share responsibility for the evil in the world."}, {"time": 9538, "text": "So even if you aren't directly committing evil acts, if you're seeing something in the world and you're thinking that's evil, you're probably not quite as separated from that as you'd like to believe in some tiny infinitesimally quantum way, you're connected."}, {"time": 9559, "text": "And there is a sense, I've gotten to experience this over and over that one individual can actually make a gigantic difference."}, {"time": 9568, "text": "And so not only is there a diffusion responsibility, there's a kind of a paralysis about, well, what can I do?"}, {"time": 9578, "text": "Sure, I understand, but what can I do?"}, {"time": 9580, "text": "And I think just looking at history and also hanging out and becoming friends, but also interviewing people that have had a tremendous impact, you realize you're just one dude."}, {"time": 9596, "text": "You're like a normal person."}, {"time": 9598, "text": "You're not that smart even."}, {"time": 9600, "text": "Like a lot of people aren't like in some kind of magical way where you have a big head that's figuring out everything."}, {"time": 9607, "text": "No, you just saw problems in the world and you're like, hey, I think I'm gonna try to do something about this."}, {"time": 9616, "text": "And you stay focused and dedicated to it for a prolonged period of time and refuse to quit, refuse to listen to people that tell you that this isn't like impossible, here's how others have failed."}, {"time": 9627, "text": "No, I'm gonna do it."}, {"time": 9631, "text": "And one person, and then you kind of, the thing is when there's one person that keeps pushing forward that way, there's, humans are sticky."}, {"time": 9638, "text": "They, other people follow them around and they're like, I'll help."}, {"time": 9642, "text": "You know, I'll help and then the other people help and then the cool people all gather together cause they kind of get excited about this way."}, {"time": 9649, "text": "Holy shit, we can actually make a difference."}, {"time": 9652, "text": "And they, they form groups and then all of a sudden there's companies and nations that actually make a gigantic difference."}, {"time": 9659, "text": "And it all starts with one person often."}, {"time": 9662, "text": "If I could push back slightly against that, it's never just one person."}, {"time": 9666, "text": "It's like, you know, nobody ever talks about, at least as far as I'm aware, you never hear about like Buddha's great grandmother."}, {"time": 9674, "text": "You never hear about that."}, {"time": 9676, "text": "But if not for that person, no Buddhism."}, {"time": 9680, "text": "You know, the people you're talking about, they are the tip of the iceberg that pops up out of the ocean of history."}, {"time": 9689, "text": "And you never see that all the little things that helped that happen."}, {"time": 9696, "text": "And so to me, this is where the real, like how do you help?"}, {"time": 9701, "text": "What's something you can do?"}, {"time": 9702, "text": "Well, you know, recognize that first, that you don't really, you don't, you might not even be aware of how much you're impacting people around you."}, {"time": 9711, "text": "You might think that you're not, or you might think surely not in a way that makes a big difference, but you have no idea these tipping points and they can lead to the emergence of an Einstein, a Gandhi, a Martin Luther King."}, {"time": 9728, "text": "We can go on and on, a Dostoevsky or whoever."}, {"time": 9731, "text": "And so I think that's where for me, it goes back to tend to the part of the garden you can touch and then, or even deeper than that intention."}, {"time": 9742, "text": "It was just like an, I'm an idiot."}, {"time": 9744, "text": "So I need an idiot's intention, which is don't, if you, I heard the Dalai Lama say it."}, {"time": 9753, "text": "If you can help, help."}, {"time": 9756, "text": "If you can't help, don't hurt."}, {"time": 9758, "text": "Simple, basic dummy rules so that you can, if possible, refrain from hurting, which might as well be a form of helping."}, {"time": 9770, "text": "And the help doesn't have to be this dramatic thing."}, {"time": 9773, "text": "These little acts of kindness."}, {"time": 9776, "text": "I don't know, they seem to have, maybe I believe in kind of karma, but they seem to have this, they can have this gigantic ripple effect."}, {"time": 9787, "text": "I just, I remember a lot of little acts of kindness that people have done to me and they, what do they do?"}, {"time": 9796, "text": "One, they fill me with joy and hope for the future."}, {"time": 9799, "text": "They give me faith in humanity."}, {"time": 9801, "text": "That somehow there's a partially dormant desire in our sort of collective intelligence to do good in the world."}, {"time": 9813, "text": "That most of us want to be good, that want to do good onto the world."}, {"time": 9818, "text": "I want, there's a kindness that's kind of like begging to get out, you know?"}, {"time": 9823, "text": "And those little acts of kindness do just that."}, {"time": 9826, "text": "And actually one of the reasons I love Austin and moved here is realizing, just noticing those little acts of kindness all around me, just for stupid reasons, just people being really nice."}, {"time": 9838, "text": "It's weird and that kindness combined with an optimism for the future, it's just, it's amazing what that can build."}, {"time": 9849, "text": "Yes, yes, it's incredible."}, {"time": 9852, "text": "And I know what you're saying."}, {"time": 9853, "text": "It's like, you know, we moved to this great neighborhood and at this point I think three, maybe four of our neighbors have like made food for us that just shows up with like handwritten lists of like things they like to do in the area and their phone number if we need help."}, {"time": 9874, "text": "And it's like, holy shit."}, {"time": 9876, "text": "That's like, it might seem like a little act, but it feels like some kind of atomic love bomb just went off on your porch when you're looking at that."}, {"time": 9886, "text": "I'm like, what the fuck?"}, {"time": 9888, "text": "You made me a pie?"}, {"time": 9891, "text": "Like, this is incredible, so."}, {"time": 9893, "text": "And also it's another act to accept that kindness."}, {"time": 9897, "text": "It's like a lot of times when I was like in Boston or San Francisco, certain big cities, you can think like, oh, okay, well they're trying to like somehow, that's not an act of kindness."}, {"time": 9910, "text": "That's some kind of a transactional thing to build up."}, {"time": 9912, "text": "It's like a career move for networking, all that kind of stuff."}, {"time": 9916, "text": "But no, if you just accept it for what it is, a pure act of kindness."}, {"time": 9920, "text": "Fucking Boston."}, {"time": 9921, "text": "It's the, yeah."}, {"time": 9922, "text": "Because for me, I go the opposite route."}, {"time": 9925, "text": "Because I'm not, even though there is a part of me that might be a little suspicious or something, where I go to push that shit back mentally is I'm like, I don't deserve this."}, {"time": 9934, "text": "If they knew what a piece of shit I am."}, {"time": 9937, "text": "You're gonna bring me, I don't wanna never bring cakes to my neighbors."}, {"time": 9940, "text": "I wouldn't know how to make a cake."}, {"time": 9941, "text": "I don't know how to make anything."}, {"time": 9942, "text": "I don't have time."}, {"time": 9943, "text": "I should be bringing shit to my neighbors."}, {"time": 9945, "text": "Why didn't I do that?"}, {"time": 9946, "text": "I should have brought, I never do that."}, {"time": 9948, "text": "If you're not careful, you can spiral into a vortex of self hate from the gift."}, {"time": 9954, "text": "So you have to, yeah, you have to learn how to, in that circuitry, you have to learn how to like accept."}, {"time": 9961, "text": "Oh yeah, I have that problem really big."}, {"time": 9963, "text": "Yeah, like I don't deserve this."}, {"time": 9966, "text": "Like I don't, I get so much love from people."}, {"time": 9970, "text": "I'm like, well, yeah, they love me because they don't know me."}, {"time": 9973, "text": "That's my brain, my little voice."}, {"time": 9975, "text": "Like you're not, you're not worthy."}, {"time": 9979, "text": "You're not worthy of any of this kindness and all this kind of stuff."}, {"time": 9984, "text": "And that could be very, yeah, it can shut you down."}, {"time": 9988, "text": "It can be debilitating."}, {"time": 9990, "text": "And also it shuts the person down."}, {"time": 9992, "text": "I mean, you're talking."}, {"time": 9992, "text": "And that's the dark side is it pushes them away too."}, {"time": 9996, "text": "Yeah, it cuts off this fucking mystical circuitry."}, {"time": 10000, "text": "So like the best thing if that happens to you is like accept it joyfully."}, {"time": 10006, "text": "And just even, just all that, whatever that thing inside of you, whatever that little thing is, you know, this is like in the meditation I do, it's an infuriatingly simple meditation, but when a thought emerges, when you are resting your attention on your breath and then inevitably you think, you get lost in your thoughts."}, {"time": 10027, "text": "And when you catch yourself doing that, you think thinking, and then return your attention to the breath."}, {"time": 10033, "text": "So I like that so that when that part of myself starts, you know, having its little neurotic semi seizure, I can just go thinking, whatever."}, {"time": 10042, "text": "It's just another thought."}, {"time": 10043, "text": "And then eat the, eat the, eat the banana bread or whatever they gave you."}, {"time": 10048, "text": "What's the most wild psychedelic experience you've ever had in a dream, in a vision?"}, {"time": 10054, "text": "It doesn't have to be drug related."}, {"time": 10056, "text": "What's one that jumps to mind that was like, holy shit, I'm happy to be alive."}, {"time": 10062, "text": "Is this life?"}, {"time": 10065, "text": "Yeah, the, oh yeah, okay."}, {"time": 10066, "text": "So the one that pops to mind, I've had a lot of psychedelic experiences, but in this moment, the one that pops to mind, only because it goes back to what you're talking about, about this Nietzsche's idea of infinite return."}, {"time": 10081, "text": "The, the, so I'm a Burning Man and."}, {"time": 10088, "text": "Are you going to Burning Man this time?"}, {"time": 10091, "text": "I mean, I have kids right now."}, {"time": 10092, "text": "I just want to be around them."}, {"time": 10093, "text": "My wife was being so cool about it and she knows I love Burning Man."}, {"time": 10096, "text": "She's like, go to Burning Man."}, {"time": 10097, "text": "And I was going to go."}, {"time": 10099, "text": "And then I just, I just want to be around my kids as much as I can right now, but."}, {"time": 10104, "text": "I've never been to Burning Man."}, {"time": 10105, "text": "So I don't know how secretive it is that, I mean, cause quite high profile folks go."}, {"time": 10111, "text": "Yeah, everyone knows Elon Musk goes there."}, {"time": 10114, "text": "Isn't it pretty open?"}, {"time": 10115, "text": "He's got a boat."}, {"time": 10117, "text": "You know that?"}, {"time": 10118, "text": "I'm touching none of this."}, {"time": 10119, "text": "You know, there's a, it's called art cars."}, {"time": 10121, "text": "They all make art cars."}, {"time": 10122, "text": "And like part of the, part of the burn, what's so beautiful about it is like, you can't buy anything there, man."}, {"time": 10129, "text": "Like you, I've heard, I don't know if this has changed."}, {"time": 10133, "text": "It's been a bit because of the pandemic, but the only thing you could buy was ice and coffee."}, {"time": 10139, "text": "And I think maybe that's changed."}, {"time": 10141, "text": "I heard some whisper that that's changed, but so that means that it's a gifting economy is what they call it."}, {"time": 10148, "text": "And so people will just give you stuff."}, {"time": 10151, "text": "Talk about having to struggle with deserving stuff, man."}, {"time": 10153, "text": "What are you going to fucking do when the camp next to you is like every morning making the best iced coffee that you've ever had in your life."}, {"time": 10162, "text": "And they just are giving it all away till it's all gone."}, {"time": 10167, "text": "It's, it's the best ever."}, {"time": 10170, "text": "And then you're giving things to people."}, {"time": 10171, "text": "And then you, you learn stuff like, you learn these really interesting lessons."}, {"time": 10176, "text": "Like one of the times I went there, got all these strawberries."}, {"time": 10184, "text": "Might not sound like a big deal, but when you're out there in the dust and you're not at one of like the, like hardcore like luxury camps, which do exist out there, you know, you've got these like items where in my mind, I'm like, yeah, these are going to be just for me and my girlfriend, my special stash fruit and this or that."}, {"time": 10204, "text": "And then like two days in you're walking around your camp with the strawberries that you were coveting and everyone's so happy to get like cold strawberries and you've realized, oh my God, this feels so much better than the way a strawberry tastes."}, {"time": 10221, "text": "So you learn something experientially there, which is an incredible thing."}, {"time": 10227, "text": "It's an incredible thing."}, {"time": 10229, "text": "Man, now I'm wishing I had decided to go to Burning Man."}, {"time": 10231, "text": "Have you been a few times?"}, {"time": 10232, "text": "Yeah, I just know like, at least people were saying it was Elon Musk's boat."}, {"time": 10239, "text": "Like, yeah, like this, I think it was like, it's like this massive, it's art cars."}, {"time": 10243, "text": "And it was this party on this thing."}, {"time": 10245, "text": "You could just, anyone can go on the boat."}, {"time": 10248, "text": "Like no one's like, there's no guest list."}, {"time": 10250, "text": "You just go on there."}, {"time": 10252, "text": "I never saw him there, but that, you know, everyone's whispering Elon Musk is here."}, {"time": 10256, "text": "There's a secrecy, there's all that kind of stuff because you'd probably have to respect that."}, {"time": 10259, "text": "But at the same time there, it seems like the kind of people that go there, I mean, the rules of the outside world are suspended in the sense that the crime, the aggression, the tensions, all of that seems to dissipate somehow."}, {"time": 10279, "text": "Not all the way, not all the way."}, {"time": 10282, "text": "That, you know, you could look it up, you know, cause like there is tension."}, {"time": 10287, "text": "There's a lot of tension there between, it's called plug and plays."}, {"time": 10292, "text": "Like, you know, Burning Man, like the history of Burning Man is fascinating."}, {"time": 10296, "text": "It has its roots in the cacophony society is what it was called, which is a sort of evolution of something that was, I think it was called the God, like the San Francisco."}, {"time": 10310, "text": "Basically there was like an art movement in San Francisco."}, {"time": 10314, "text": "And I can't remember the name of it."}, {"time": 10315, "text": "Maybe the Suicide Club or essentially like, they were really into urban exploration and meaning like breaking into like old abandoned buildings and stuff."}, {"time": 10327, "text": "But part of this, what this was, was you would prepare your life as though you were going to kill yourself."}, {"time": 10338, "text": "You would get all your affairs in order."}, {"time": 10339, "text": "You would get, so it's going back to what we were talking about with the cancer diagnosis."}, {"time": 10343, "text": "You're like sort of putting yourself into that world of like, I'm going to get all my affairs together as though this is it."}, {"time": 10350, "text": "And then there was some, I'm sorry for anyone listening if I'm butchering this, but I think there was some really cool initiation where they would blindfold you and they would take you into some of these abandoned buildings."}, {"time": 10360, "text": "And you didn't know where you were walking, but they would say like, if you take one step to the left, you're going to die."}, {"time": 10367, "text": "You're going to fall off."}, {"time": 10368, "text": "You're going to fall."}, {"time": 10368, "text": "So please be careful."}, {"time": 10370, "text": "So you're like in the moment and then blindfold comes off."}, {"time": 10373, "text": "It's a big, awesome party."}, {"time": 10375, "text": "This evolves into something called the Cacophony Society."}, {"time": 10378, "text": "There's a great book called Tales of the Cacophony Society for people listening."}, {"time": 10384, "text": "One of the members of the Cacophony Society was the author of Fight Club."}, {"time": 10389, "text": "And so if you've seen Fight Club, like you could see little ideas that were in the Cacophony Society."}, {"time": 10394, "text": "They were into Dadaism, which I don't know a lot about."}, {"time": 10399, "text": "I don't know, but it's a philosophical art movement."}, {"time": 10404, "text": "And then so basically what was happening is like, they kept burning increasingly large effigies in San Francisco and they weren't allowed to do it."}, {"time": 10414, "text": "And so they took it out in the desert and they were basing it on something called a zone trip, which is like, across this border, the rules of that old society are gone."}, {"time": 10426, "text": "And so that was the original Burning Man, which was these lunatics out in the desert, launching like burning pianos out of catapults through the air doing like drive by shooting ranges, like no rules, wild, magical, beautiful, insane madness."}, {"time": 10449, "text": "And then it grew and grew and grew and grew until you have Burning Man as it is today, which is still the most incredible thing."}, {"time": 10459, "text": "I mean, obviously anytime you have like a thing that's been around for a while, you're gonna get that."}, {"time": 10464, "text": "It's not like it used to be."}, {"time": 10466, "text": "It's not as free as it used to be, so this or that."}, {"time": 10468, "text": "But what's fascinating about Burning Man, someone pointed this out to me, look on the ground, no trash, no cigarettes."}, {"time": 10477, "text": "The ethic of like picking up your shit there is like so intense."}, {"time": 10482, "text": "So it's not like the other festivals you go to where there's just trash everywhere, shit scattered everywhere."}, {"time": 10488, "text": "It's clean."}, {"time": 10489, "text": "People are picking up their stuff."}, {"time": 10491, "text": "People are like really being conscious of like not fucking up the playa."}, {"time": 10496, "text": "So I'm sorry, don't get a burner yapping about Burning Man."}, {"time": 10501, "text": "We won't stop."}, {"time": 10502, "text": "It'll be morning."}, {"time": 10503, "text": "But there's a power, but there is a power to culture propagating itself through to the stories that we tell each other."}, {"time": 10510, "text": "And that holds up for Burning Man."}, {"time": 10514, "text": "It's clear that the culture has stayed strong throughout the years."}, {"time": 10518, "text": "So many people, so many really interesting people speak of Burning Man as like a sacred place they go to to remind themselves about what's important."}, {"time": 10532, "text": "And it is."}, {"time": 10534, "text": "I mean, it's like, you know, there are all these stories of like, I love guru stories."}, {"time": 10538, "text": "I have a guru."}, {"time": 10539, "text": "I'm Karoli Baba, never met him, he was Ram Dass's guru, at least not in the flesh."}, {"time": 10543, "text": "But the story of the guru is if you're lucky, you meet this being that, and we're not talking about, you know, whatever the run of the mill, like charlatans out there."}, {"time": 10590, "text": "It's like, it is the UFO."}, {"time": 10591, "text": "It's a person, but it's not."}, {"time": 10593, "text": "It's everybody and nobody."}, {"time": 10595, "text": "And somehow they like end up conveying to you ideas that you may have heard a million times before, but somehow within the language itself is a transmission that permanently alters you."}, {"time": 10612, "text": "And so these people exist."}, {"time": 10614, "text": "I think you could argue that Burning Man, the total thing is a guru, that a pilgrimage is involved to get there."}, {"time": 10624, "text": "You, like, it's not easy to get there."}, {"time": 10628, "text": "And when you get there, it's gonna teach you something."}, {"time": 10632, "text": "It's gonna show you something."}, {"time": 10634, "text": "It's going to, and maybe some of the stuff it shows you might not be great, but the community around you will like, will hold you as you're like, whatever the thing is that's coming out of you is coming out of you."}, {"time": 10650, "text": "And even the simplest activities, the simplest exchange of words have like, just like the gurus, a profound impact somehow."}, {"time": 10661, "text": "Something about that place."}, {"time": 10662, "text": "Yeah, not to mention the insane synchronicities, like insane synchronicities there."}, {"time": 10668, "text": "And I think like, you know, to get back to the notion of sentience as a byproduct of a harmonized yet hyper complex system."}, {"time": 10678, "text": "I think synchronicities, like those kinds of systems are like lightning rods for synchronicity."}, {"time": 10685, "text": "So crazy, not just because your high synchronicities happen that are impossible, where you just have to deal with it."}, {"time": 10694, "text": "And like, you'll need something."}, {"time": 10696, "text": "And within a few minutes, someone's like, oh, here you go."}, {"time": 10700, "text": "And you mentioned, but by the way, Burning Anchors of a psychedelic experience, is it the strawberries or was it something else?"}, {"time": 10709, "text": "What was the moment?"}, {"time": 10710, "text": "Yeah, that was magical."}, {"time": 10711, "text": "No, it was DMT."}, {"time": 10712, "text": "It definitely wasn't."}, {"time": 10713, "text": "It wasn't strawberries."}, {"time": 10718, "text": "No, no, I was."}, {"time": 10719, "text": "More potent."}, {"time": 10721, "text": "Yeah, I was like smoking DMT."}, {"time": 10723, "text": "And like, I saw, like, if you, in the midnight gospel, there are these bovine creatures that have like a long neck and a lantern head."}, {"time": 10738, "text": "So like, I saw one of those things."}, {"time": 10741, "text": "And, you know, I thought it was funny and like ridiculous because you hear like all the Terence McKenna stories of the self transforming machine elves or all the purple or the magenta goddess everyone sees."}, {"time": 10760, "text": "I'm like, so this is what I get?"}, {"time": 10762, "text": "Like a fucking cow with a lantern head?"}, {"time": 10766, "text": "Like that's where my brain is at and we're interacting with this molecule."}, {"time": 10770, "text": "So then like, I look away."}, {"time": 10778, "text": "And again, this is DMT."}, {"time": 10779, "text": "So when I say look away, do I mean with my eyes shut, I look away or eyes open, I look away, I think eyes shut."}, {"time": 10786, "text": "So it sounds weird to say look away, but however you want to put it, that's what I did."}, {"time": 10791, "text": "And I look back and it's still there."}, {"time": 10794, "text": "Only now it's, you know, cause usually in like, when you're having those kinds of visions, they go away pretty quickly."}, {"time": 10801, "text": "This thing's like moved, like shambled ahead and maybe a few steps, just like a cow, just like a cow."}, {"time": 10808, "text": "And then that was when the, you know, all the stories you hear about it, like going through some kind of tuber, some kind of light tunnel, like a water slide made of light that's increasingly familiar."}, {"time": 10821, "text": "That's the wildest part of it."}, {"time": 10823, "text": "It's like, oh, I know this place."}, {"time": 10825, "text": "Not like, oh, I've seen this in like, you know, on like bong stickers, but like, oh yeah, this is that place you go to."}, {"time": 10832, "text": "You just remember, oh, this place."}, {"time": 10834, "text": "And then it was like I was in some kind of, I don't know how to put it, a chamber, a technological chamber, some kind of supercomputer, some kind of nucleus that was technological."}, {"time": 10849, "text": "And it was inviting."}, {"time": 10850, "text": "There was an invitation of like, come in, like come deeper into, come deeper in."}, {"time": 10856, "text": "And you can talk to whatever it is over there."}, {"time": 10860, "text": "You don't talk, but there's a communication."}, {"time": 10862, "text": "And I communicated, but my friends, I don't, I love my friends."}, {"time": 10868, "text": "I guess I had some sense in that moment that it would mean complete obliteration or who knows what."}, {"time": 10875, "text": "And the response that it gave back was, you can always go back there."}, {"time": 10880, "text": "And that's when I opened my eyes, I'm back."}, {"time": 10882, "text": "Totally, you know, and ever since then, that's caused me to revise my thinking on reincarnation."}, {"time": 10890, "text": "The idea that you die and you start as a baby and then live your life again."}, {"time": 10894, "text": "It goes right into what we were talking about."}, {"time": 10896, "text": "You know, that maybe data, you know, that the shit I saw in Nitro Sox, I don't feel dumb that my epiphanies are all related to drugs, but not all of them are a lot of them."}, {"time": 10906, "text": "But this notion of like, oh, is it that we're imprinting into the medium of time, space, everything we do, and that that is a permanent imprint, a frame that upon death can be accessed in the same way we can pull up pictures on our phone or computers, and not only accessed, but experienced as though, in other words, you could just jump in."}, {"time": 10940, "text": "You're still gonna have your memories."}, {"time": 10942, "text": "It's gonna give you the illusion of having been a kid and gotten to that frame, but no, you just decided to go back there, nostalgia, whatever."}, {"time": 10953, "text": "And yeah, you can jump around freely in space and time."}, {"time": 10957, "text": "Yeah, yeah, you can go in and out of time space, but the problem is when you go into time space, it's time."}, {"time": 10963, "text": "So it's gonna feel sticky."}, {"time": 10965, "text": "It's gonna feel like you've been here forever because you've dropped back onto the track that Nietzsche's talking about."}, {"time": 10971, "text": "And I guess one of the qualities of dropping into that frame is that you forget your higher dimensional identity."}, {"time": 10981, "text": "What happened to the cow with the lantern, was that goodbye?"}, {"time": 10987, "text": "He writes me letters sometimes."}, {"time": 10991, "text": "Never saw it again."}, {"time": 10992, "text": "Never?"}, {"time": 10993, "text": "Never saw it again, but I put it in, we put it in the Midnight Gospel."}, {"time": 10998, "text": "Pendleton was such a genius, and he drew it for me, and then it just ended up as a part of the show."}, {"time": 11004, "text": "But by the way, I have to admit that as a big fan of yours, I haven't watched the Midnight Gospel because I've been waiting."}, {"time": 11013, "text": "You do these stupid things, but ever since you talked to, maybe two years ago with Joe about it, I've been waiting to watch it with a special person on mushrooms."}, {"time": 11024, "text": "That's been in my to do."}, {"time": 11026, "text": "I don't know, of course you don't have to be on mushrooms to enjoy it, but for some reason I put it into my head that this is something I wanna do with somebody else, like experience it and get wild."}, {"time": 11037, "text": "Because visually, I mean, I watched a bunch of it, just a little bit here and there, but it's just visually such an interesting experience."}, {"time": 11047, "text": "Combined with everything else, obviously, the ideas, the voices and so on, but just visually it's like a super psychedelic version of Rick and Morty or something like that, like farther out, wilder out there."}, {"time": 11063, "text": "Yeah, man, that's Pendleton."}, {"time": 11066, "text": "These people, I mean, I was part of that in the sense that Pendleton gave, one of the reasons he's such a genius and great at making stuff is he really does a good job of just dehierarchizing potential hierarchies that can appear."}, {"time": 11087, "text": "Someone has to be driving the bus, and that was Pendleton, but he's so inclusive."}, {"time": 11094, "text": "There's a real punk rock thing that he's doing, which is like, he'll take everything, and it kind of mixes its way into the show."}, {"time": 11101, "text": "But one of the things in animation, it can get really strict with drawing the characters and trying to create continuity in the way the character looks, and it can get really brute for the animator."}, {"time": 11121, "text": "Making it brutally precise, like it has to be precise."}, {"time": 11126, "text": "But he figured out that if you just sort of, it's not like, obviously, Clancy had to look like Clancy through the whole show, but if you allow the various people animating it to sort of have their own spin on it, then suddenly it creates a very psychedelic, the show looks more psychedelic because it looks more organic, and also the amount of time."}, {"time": 11148, "text": "I had no idea, the amount of time that goes into making digital art look like that is, it's insane."}, {"time": 11158, "text": "The amount of work in comping that stuff is just crazy."}, {"time": 11164, "text": "Generally, the amount of time it takes, even just like a painting, when you, I really enjoy watching artists do a time lapse, and you realize how much effort just into a single image goes into it."}, {"time": 11179, "text": "Hours and hours and hours, sometimes days, sometimes weeks and months, and then you just get to see them work, but they lose themselves in the craftsmanship of it, in the rhythm of it."}, {"time": 11190, "text": "And like, because they're focused on the, so we were talking about robotics earlier, like on the little details, like they're never look, well, most of the time isn't spent looking at the big picture of the final result, it's looking at the little details there and so on."}, {"time": 11204, "text": "And they're, but they're nevertheless able to somehow constantly channel the big picture, the final result."}, {"time": 11210, "text": "My God, yeah, the respect I have for animators, it's like, dear God, it's the craziest thing when you watch it, when you see what it looks like and how much time goes into it and how zen they have to be, because like, no matter what, you're gonna have to cut stuff, man."}, {"time": 11227, "text": "And when you're cutting like a few seconds of animation, that was someone's like month, maybe, you know?"}, {"time": 11233, "text": "And like, they understand, but still it's like, whoa, it's brutal."}, {"time": 11239, "text": "And so they have like this zen outlook on it, which is really cool."}, {"time": 11246, "text": "And they watch podcasts, that's the other cool thing, when you realize like, oh, they're listening to podcasts or like, that's really cool to see that aspect of it too."}, {"time": 11254, "text": "But yeah, man, I, you know."}, {"time": 11256, "text": "Yeah, your voice is in the ears of a lot of interesting people, isn't it?"}, {"time": 11260, "text": "Yours too."}, {"time": 11262, "text": "Hello, interesting person."}, {"time": 11263, "text": "Hello, CIA, animators."}, {"time": 11266, "text": "Eating delicious food in the cafeteria."}, {"time": 11269, "text": "I'm on your side."}, {"time": 11270, "text": "He's against you, I'm with you."}, {"time": 11273, "text": "Do you have, you have a beard, therefore you must be wise."}, {"time": 11276, "text": "Do you have advice for young people, high school, college, about how to carve their path through life?"}, {"time": 11285, "text": "I don't have a life, a career that's successful that they can be proud of or a life they can be proud of."}, {"time": 11292, "text": "Man, see, this is what kind of, this is what sucks about my life, is that it's been very random and very spontaneous."}, {"time": 11303, "text": "So unfortunately, I don't get that thing where I could be like, well, here's what I did."}, {"time": 11309, "text": "Cause it's like, I don't, like I inherited $12,000 from my grandmother, here's what you do kids, you inherit $12,000 when your grandmother dies."}, {"time": 11319, "text": "And then you need to be dumb enough to think that that $12,000 is gonna help you live in LA for a year."}, {"time": 11326, "text": "So then what you do is you move to LA with $12,000 and you find a shitty place that you live at."}, {"time": 11333, "text": "And then you use that money to buy acid and synthesizers."}, {"time": 11338, "text": "And then you run out of the money and then you, then you have to get a job."}, {"time": 11343, "text": "And so then, because you think it'll be fun to work at a comedy club, you get a job at the comedy store."}, {"time": 11349, "text": "And then, you know, that's how it happened for me."}, {"time": 11351, "text": "And none of, there wasn't, I never had the confidence to be like, I'm gonna be a standup comedian."}, {"time": 11359, "text": "I just thought it'd be cool to work in that building."}, {"time": 11362, "text": "I thought the building looked cool."}, {"time": 11363, "text": "And so, but then like, cause like you work at the comedy store, you get stage time."}, {"time": 11368, "text": "It's there, it's the reason like you work there is at least in those days, cause it's not like they're paying like a shit ton of money for you to answer phones at a comedy club."}, {"time": 11379, "text": "And so, you know, I started going on stage and then like, I just got lucky cause Rogan saw me have like a very rare, good set."}, {"time": 11390, "text": "I didn't know he was in the room or I would've bombed, you know, and then like, cause he thought I was funny and he liked talking to me."}, {"time": 11396, "text": "He started taking me on the road with him."}, {"time": 11397, "text": "And then, you know, so I don't know, man."}, {"time": 11401, "text": "Was there an element to, there's a beautiful weirdness to you as a human being."}, {"time": 11406, "text": "Was there like a pressure to conform ever to hide yourself from the world?"}, {"time": 11415, "text": "Or did the $12,000 in the acid give you the confidence you needed to be yourself?"}, {"time": 11421, "text": "Oh no, I don't, like I still, no."}, {"time": 11424, "text": "I think, sure, there's that pressure."}, {"time": 11426, "text": "And like, you know, whenever you're beginning to really differentiate from your parents, but then you go back to hang out with your parents, you can feel that it's not like they even want you to conform, but you'll just, you could slip into that, whatever that was."}, {"time": 11441, "text": "So I remember that when I would go back and like visit them and stuff."}, {"time": 11445, "text": "And surely conformity or the pressure to like, not be individual or whatever, it's everywhere, man."}, {"time": 11453, "text": "Do you think you made your parents proud?"}, {"time": 11458, "text": "E, no, no, no, no."}, {"time": 11463, "text": "Well, I think that when my mom died, I felt successful in the sense that I was able to support my, I was making money from doing standup and I didn't need help."}, {"time": 11480, "text": "I was like, I was supporting myself with art and doing good, what I thought was great then."}, {"time": 11484, "text": "So, and I think she, like, because she had witnessed me literally failing, I mean, which is, by the way, I think part of, if you want to be an artist or successful, you kind of have to fail."}, {"time": 11498, "text": "Like there, if, and if there was a guaranteed route from sucking to not sucking or from like the neophyte phase of whatever the art form is and, you know, some intermediary phase, then I think a lot more people would do it, but there really is no guarantees in it, especially the standup comedy."}, {"time": 11523, "text": "It's like, you'd have to be a maniac to want to, to think that that's going to work out for you."}, {"time": 11528, "text": "You have to, so you're going to, there are obviously exceptions, but for me, it was like a long slog, you know, and that's scary for a mom."}, {"time": 11540, "text": "So, but that being said, when she was dying, like she did recognize that I was like not slogging anymore."}, {"time": 11551, "text": "And she did say, she said, you did it."}, {"time": 11555, "text": "And that's cool, but in, you know, I would love for her to see me now, like now it'd be way cooler, but maybe she does."}, {"time": 11563, "text": "She's listening to your podcast elsewhere in the other, in the Bardo."}, {"time": 11568, "text": "Yeah, however long that lasts reconfiguring the whole process to start again."}, {"time": 11576, "text": "You as a father now, how did that change you?"}, {"time": 11579, "text": "Yeah, that's the big change, man."}, {"time": 11583, "text": "You made a few biological entities."}, {"time": 11586, "text": "Yeah, I made biological entities."}, {"time": 11588, "text": "I mean, I came in my wife, let's face it."}, {"time": 11590, "text": "Like I would love to say I made them, but the womb whipped them up, but it is the, yeah, it's the best."}, {"time": 11598, "text": "It's, I've never experienced anything like it before."}, {"time": 11602, "text": "It is the, as far as I'm concerned, the greatest thing that has ever happened to me."}, {"time": 11607, "text": "And that's why I was able to answer your Nietzsche question with like, hell yes, fuck yes."}, {"time": 11613, "text": "I get to be around my kids again."}, {"time": 11615, "text": "I'll always be around my kids."}, {"time": 11616, "text": "I'll always be around my children."}, {"time": 11619, "text": "That's the joy."}, {"time": 11660, "text": "I'm just saying that because it's one of my regrets."}, {"time": 11662, "text": "It's like a big regret."}, {"time": 11663, "text": "I have a lot of little regrets, but that's a big one."}, {"time": 11666, "text": "And so when you have kids, you look back at everything you did and you think like, fuck, if I'd gone left at that point instead of right, if I had eaten, who knows?"}, {"time": 11685, "text": "What if I'd eaten like a turkey sandwich when my balls were creating the cum that was gonna make my kids?"}, {"time": 11694, "text": "Would I have a different kid?"}, {"time": 11696, "text": "Would this being not exist in my life?"}, {"time": 11699, "text": "Like you start looking at everything and you realize like, thank God, thank God for every single thing that happened to me because it all led up to this."}, {"time": 11708, "text": "And oh, for me, that is the, that's, that it's like, it frees you in this."}, {"time": 11718, "text": "It liberates you because you realize like, oh wow, it's clumsy and selfish and at times rotten as I've been in my life."}, {"time": 11729, "text": "That did not impede the universe at all from allowing these two beautiful beings to exist in the world."}, {"time": 11738, "text": "So maybe all of it enabled, all of it like a concert perfectly led up to that little beautiful moment."}, {"time": 11747, "text": "Is there ways you would like to be a better father?"}, {"time": 11755, "text": "There's a actual, I read something in a book, it's called Good Enough."}, {"time": 11760, "text": "The mantra for a parent, good enough."}, {"time": 11763, "text": "Because when you are in the presence of something you love more than you've ever experienced love, you wanna be perfect."}, {"time": 11775, "text": "Like you wanna be, I can't, I gotta work, man."}, {"time": 11777, "text": "I gotta go on the road."}, {"time": 11778, "text": "I've gotta work."}, {"time": 11779, "text": "I gotta support the family."}, {"time": 11780, "text": "So that means I have to work."}, {"time": 11782, "text": "Like I work, you know what it's like having a podcast."}, {"time": 11785, "text": "You fucking work, man."}, {"time": 11786, "text": "And you know, it's a full time job because I've, you know, I do standup too and all the other stuff."}]}]