[{"title": "Andrew Bustamante: CIA Spy | Lex Fridman Podcast #310", "id": "T3FC7qIAGZk", "quotes": [{"time": 276, "text": "And so how much jockeying there is for attention?"}, {"time": 281, "text": "I imagine for all the different intelligence agencies and within the CIA there's probably different groups that are modular and they all care about different nations or different cases."}, {"time": 294, "text": "Do you understand how much competition there is for the attention, for the limited attention of the president?"}, {"time": 301, "text": "You're 100% correct in how the agency and how officers and managers at the agency handle the PDB."}, {"time": 309, "text": "There's a ton of competition."}, {"time": 310, "text": "Everybody wants to be the first on the radar."}, {"time": 312, "text": "Everybody wants to be on the first page."}, {"time": 314, "text": "The thing that we're not baking into the equation is the president's interests."}, {"time": 319, "text": "The president dictates what's on the first page of his PDB and he will tell them usually the day before, I wanna see this on the first page tomorrow."}, {"time": 325, "text": "Bring this to me in the beginning."}, {"time": 326, "text": "I don't wanna hear about what's happening in Mozambique."}, {"time": 328, "text": "I don't really care about what's happening in Saudi Arabia."}, {"time": 330, "text": "I wanna see one, two, three."}, {"time": 332, "text": "And regardless of whether or not those are the three biggest things in the world, the president's the executive, he's the one."}, {"time": 339, "text": "He's the ultimate customer."}, {"time": 340, "text": "So we do what the customer says."}, {"time": 342, "text": "That has backfired in the past."}, {"time": 344, "text": "If you haven't already started seeing how that could go wrong, that has backfired in the past, but that is essentially what happens when you serve in the executive branch."}, {"time": 353, "text": "You serve the executive."}, {"time": 355, "text": "So what's the role of the director of the CIA versus the president?"}, {"time": 359, "text": "What's that dance like?"}, {"time": 361, "text": "So the president really leads the focus of the CIA?"}, {"time": 366, "text": "The president is the commander in chief for the military, but the president is also the executive for the entirety of the intelligence community."}, {"time": 376, "text": "So he's the ultimate customer."}, {"time": 379, "text": "If you look at it like a business, the customer, the person spending the money is the president and the director is the CEO."}, {"time": 387, "text": "So if the director doesn't create what the president wants, there's gonna be a new director."}, {"time": 391, "text": "That's why the director of CIA is a presidential appointed position."}, {"time": 394, "text": "Sometimes they're extremely qualified intelligence professionals."}, {"time": 397, "text": "Sometimes they're just professional politicians or soldiers that get put into that seat because the president trusts them to do what he wants them to do."}, {"time": 406, "text": "Another gaping area that causes problems, but that's still the way it is."}, {"time": 414, "text": "So you think this is a problematic configuration of the whole system?"}, {"time": 418, "text": "Massive flaw in the system."}, {"time": 419, "text": "It is a massive flaw in the system because if you're essentially appointing a director to do what you want them to do, then you're assigning a crony."}, {"time": 428, "text": "And that's what we define corruption as within the United States."}, {"time": 431, "text": "And inside the United States, we say if you pick somebody outside of merit for any other reason other than merit, then it's cronyism or it's nepotism."}, {"time": 439, "text": "Here, that's exactly what our structure is built on."}, {"time": 441, "text": "All presidential appointees are appointed on something other than merit."}, {"time": 445, "text": "So for an intelligence agency to be effective, it has to discover the truth and communicate that truth."}, {"time": 451, "text": "And maybe if you're appointing the director of that agency, you're not, they're less likely to communicate the truth to you unless the truth aligns perfectly with your desired worldview."}, {"time": 461, "text": "Well, not necessarily perfectly because there are other steps, right?"}, {"time": 464, "text": "They have to be, they have to go in front of Congress and they have to have the support of multiple legislatures or legislators, but the challenge is that the shortlist of people who even get the opportunity aren't a meritorious list."}, {"time": 479, "text": "It's a shortlist based off of who the president is picking or who the would be president is picking."}, {"time": 483, "text": "Now, I think we've proven that an intelligence organization can be, an intelligence organization can be extremely effective even within the flawed system."}, {"time": 493, "text": "The challenge is how much more effective could we be if we improved?"}, {"time": 497, "text": "And that's, I think that's the challenge that faces a lot of the US government."}, {"time": 501, "text": "I think that's a challenge that has resulted in what we see today when it comes to the decline of American power and American influence, the rise of foreign influence, authoritarian powers, and a shrinking US economy, a growing Chinese economy."}, {"time": 519, "text": "And it's just, we have questions, hard questions we need to ask ourselves about how we're gonna handle the future."}, {"time": 525, "text": "What aspect of that communication between the president and the CIA could be fixed to help fix the problems that you're referring to in terms of the decline of American power?"}, {"time": 537, "text": "So when you talk about the president wanting to prioritize what the president cares about, that immediately shows a break between what actually matters to the longterm success of the United States versus what happened, what benefits the short term success of the current president."}, {"time": 556, "text": "Because any president is just a human being and has a very narrow focus."}, {"time": 561, "text": "And narrow focus is not a longterm calculation."}, {"time": 564, "text": "Exactly, what's the maximum amount of years the president can be president?"}, {"time": 568, "text": "Eight."}, {"time": 569, "text": "He has to be, he or she."}, {"time": 571, "text": "In the United States, according to our current constitution."}, {"time": 575, "text": "But they're very limited in terms of what they have to prioritize."}, {"time": 581, "text": "And then if you look at a four year cycle, two years of that is essentially preparing for the next election cycle."}, {"time": 587, "text": "So that's only two years of really quality attention you get from the president, who is the chief executive of all the intelligence community."}, {"time": 593, "text": "So the most important thing to them is not always the most important thing to the longterm survival of the United States."}, {"time": 599, "text": "What do you make of the hostile relationship that to me at least stands out of the presidents between Donald Trump and the CIA?"}, {"time": 607, "text": "Was that a very kind of personal bickering?"}, {"time": 611, "text": "I mean, is there something interesting to you about the dynamics between that particular president and that particular instantiation of the intelligence agency?"}, {"time": 619, "text": "Man, there were lots of things fascinating to me about that relationship."}, {"time": 623, "text": "What's the good and the bad, sorry to interrupt."}, {"time": 626, "text": "So let me start with the good first because there's a lot of people who don't think there was any good."}, {"time": 630, "text": "So the good thing is we saw that the president who's the chief customer, the executive to the CIA, when the president doesn't want to hear what CIA has to say, he's not gonna listen."}, {"time": 645, "text": "I think that's an important lesson for everyone to take home."}, {"time": 649, "text": "If the president doesn't care what you have to say, he's gonna take funding away or she will take funding away."}, {"time": 654, "text": "They're gonna take attention away."}, {"time": 656, "text": "They're going to shut down your operations, your missions."}, {"time": 662, "text": "They're gonna kill the careers of the people working there."}, {"time": 664, "text": "Think about that, for the four years that President Trump was the president, basically everybody at CIA, their career was put on pause."}, {"time": 672, "text": "Some people's careers were ended."}, {"time": 673, "text": "Some people voluntarily left their career there because they found themselves working for a single customer that didn't want what they had to produce."}, {"time": 681, "text": "So for people who don't know, Donald Trump did not display significant, deep interest in the output."}, {"time": 689, "text": "He did not trust it, yeah."}, {"time": 690, "text": "He was a disinterested customer."}, {"time": 693, "text": "Of the information."}, {"time": 694, "text": "And then what do disinterested customers do?"}, {"time": 697, "text": "They go find someone else to create their product."}, {"time": 699, "text": "And that's exactly what Donald Trump did."}, {"time": 701, "text": "And he did it through the private intelligence world, funding private intelligence companies to run their own operations that brought him the information he cared about when CIA wouldn't."}, {"time": 710, "text": "It also didn't help that CIA stepped outside of their confines, right?"}, {"time": 714, "text": "CIA is supposed to collect foreign intelligence and not comment on domestic matters."}, {"time": 718, "text": "They went way outside of that when they started challenging the president, when they started questioning the results, when they started publicly claiming Russian influence."}, {"time": 728, "text": "That's all something the FBI could have handled by itself."}, {"time": 730, "text": "The Justice Department could have handled by itself."}, {"time": 732, "text": "CIA had no place to contribute to that conversation."}, {"time": 736, "text": "And when they did, all they did was undermine the relationship they had with their primary customer."}, {"time": 741, "text": "Let me sort of focus in on this relationship between the president or the leader and the intelligence agency and look outside the United States."}, {"time": 754, "text": "It seems like authoritarian regimes or regimes throughout history, if you look at Stalin and Hitler, if you look at today with Vladimir Putin, the negative effects of power corrupting the mind of a leader manifest itself is that they start to get bad information from the intelligence agencies."}, {"time": 773, "text": "So this kind of thing that you're talking about, over time, they start hearing information they want to hear."}, {"time": 780, "text": "The agency starts producing only the kind of information they want to hear, and the leader's worldview starts becoming distorted to where the propaganda they generate is also the thing that the intelligence agencies provide to them, and so they start getting this, they start believing their own propaganda, and they start getting a distorted view of the world."}, {"time": 803, "text": "Sorry for the sort of walking through in a weird way, but I guess I want to ask, do you think, let's look at Vladimir Putin specifically."}, {"time": 812, "text": "Do you think he's getting accurate information about the world?"}, {"time": 818, "text": "Do you think he knows the truth of the world, whether that's the war in Ukraine, whether that's the behavior of the other nations, in NATO, the United States in general?"}, {"time": 829, "text": "It's rare that I'll talk about just thinking."}, {"time": 832, "text": "I prefer to share my assessment, why I assess things a certain way, rather than just what's my random opinion."}, {"time": 839, "text": "In my assessment, Vladimir Putin is winning."}, {"time": 842, "text": "Russia is winning."}, {"time": 844, "text": "They're winning in Ukraine, but they're also winning the battle of influence against the West."}, {"time": 848, "text": "They're winning in the face of economic sanctions."}, {"time": 851, "text": "They're winning."}, {"time": 852, "text": "Empirically, when you look at the math, they're winning."}, {"time": 855, "text": "So when you ask me whether or not Putin is getting good information from his intelligence services, when I look at my overall assessment of multiple data points, he must be getting good information."}, {"time": 866, "text": "Do I know how or why?"}, {"time": 869, "text": "I don't know how or why it works there."}, {"time": 871, "text": "I don't know how such deep cronyism, such deep corruption can possibly yield true real results."}, {"time": 880, "text": "And yet, somehow there are real results happening."}, {"time": 882, "text": "So it's either excessive waste and an accidental win, or there really is a system and a process there that's functioning."}, {"time": 889, "text": "So this winning idea is very interesting."}, {"time": 891, "text": "In what way, short term and long term, is Russia winning?"}, {"time": 895, "text": "Some people say there was a miscalculation of the way the invasion happened."}, {"time": 899, "text": "There was an assumption that you would be able to successfully take Kiev."}, {"time": 905, "text": "You'd be able to successfully capture the East, the South, and the North of Ukraine."}, {"time": 910, "text": "And with what now appears to be significantly insufficient troops spread way too thin across way too large of a front."}, {"time": 920, "text": "So that seems to be like an intelligence failure."}, {"time": 925, "text": "And that doesn't seem to be like winning."}, {"time": 928, "text": "In another way, it doesn't seem like winning if we put aside the human cost of war."}, {"time": 933, "text": "It doesn't seem like winning because the hearts and minds of the West were completely on the side of Ukraine."}, {"time": 943, "text": "This particular leader, Volodymyr Zelensky, captured the attention of the world and the hearts and minds of Europe, the West, and many other nations throughout the world, both financially, in terms of military equipment, and in terms of sort of social and cultural and emotional support for the independence fight of this nation."}, {"time": 965, "text": "That seems to be like a miscalculation."}, {"time": 968, "text": "So against that pushback, why do you think there's still kernels of winning in this on the Russian side?"}, {"time": 979, "text": "What you're laying out isn't incorrect."}, {"time": 981, "text": "And the miscalculations are not unexpected."}, {"time": 986, "text": "Anybody who's been to a military college, including the Army War College in Pennsylvania, where so many of our military leaders are brought up, when you look at the conflict in Ukraine, it fits the exact mold of what an effective longterm military conflict, protracted military conflict, would and should look like for military dominance."}, {"time": 1009, "text": "Now, did Zelensky and did the Ukrainians shock the world?"}, {"time": 1014, "text": "But in that, they also shocked American intelligence, which, like you said, miscalculated."}, {"time": 1020, "text": "The whole world miscalculated how the Ukrainians would respond."}, {"time": 1023, "text": "Putin did not move in there accidentally."}, {"time": 1025, "text": "He had an assessment."}, {"time": 1026, "text": "He had high likelihood of a certain outcome, and that outcome did not happen."}, {"time": 1031, "text": "Why did he have that calculation?"}, {"time": 1033, "text": "Because in 2014, it worked."}, {"time": 1035, "text": "He invaded, he took Crimea in 14 days."}, {"time": 1039, "text": "He basically created an infiltration campaign that turned key leaders over in the first few days of the conflict."}, {"time": 1049, "text": "So essentially, there was no conflict."}, {"time": 1050, "text": "It worked in 2008 when he took Georgia."}, {"time": 1053, "text": "Nobody talks about that."}, {"time": 1055, "text": "He invaded Georgia the exact same way, and it worked."}, {"time": 1058, "text": "So in 2008, it worked."}, {"time": 1059, "text": "In 2014, it worked."}, {"time": 1060, "text": "There was no reason to believe it wasn't going to work again."}, {"time": 1063, "text": "So he just carried out the same campaign."}, {"time": 1065, "text": "But this time, something was different."}, {"time": 1067, "text": "That was a miscalculation for sure on the part of Putin."}, {"time": 1071, "text": "And the reason that there was no support from the West, because let's not forget, there is no support."}, {"time": 1075, "text": "There is nothing other than the Lend Lease Act, which is putting Ukraine in massive debt right now to the West."}, {"time": 1083, "text": "That's the only form of support they're getting from NATO or the United States."}, {"time": 1088, "text": "So if somebody believed Ukraine would win, if somebody believed Ukraine had a chance, they would have gotten more material support than just debt."}, {"time": 1095, "text": "And we can jump into that anytime you want to."}, {"time": 1097, "text": "But the whole world miscalculated."}, {"time": 1099, "text": "Everybody thought Russia was going to win in 14 days."}, {"time": 1101, "text": "I said that they would win in 14 days because that was the predominant calculation."}, {"time": 1106, "text": "Once the first invasion didn't work, then the military does what professional militaries do, man."}, {"time": 1112, "text": "They reevaluate, they reorganize leaders, and then they take a new approach."}, {"time": 1120, "text": "You saw three approaches."}, {"time": 1121, "text": "The first two did not work."}, {"time": 1123, "text": "The first two campaigns against Ukraine did not work the way they were supposed to work."}, {"time": 1127, "text": "The third has worked exactly like it's supposed to work."}, {"time": 1131, "text": "You don't need Kiev to win Ukraine."}, {"time": 1133, "text": "You don't need hearts and minds to win Ukraine."}, {"time": 1136, "text": "What you need is control of natural resources, which they're taking in the East, and you need access to the heartbeat, the blood flow of food and money into the country, which they're taking in the South."}, {"time": 1150, "text": "The fact that Ukraine had to go to the negotiation table with Russia and Turkey in order to get exports out of the Black Sea approved again demonstrates just how much Ukraine is losing."}, {"time": 1165, "text": "The aggressor had a seat at the negotiation table to allow Ukraine the ability to even export one of its top exports."}, {"time": 1173, "text": "If Russia would have said no, then they would not have had that."}, {"time": 1177, "text": "Russia has, that's like someone holding your throat."}, {"time": 1179, "text": "It's like somebody holding your jugular vein and saying, if you don't do what I tell you to do, then I'm not gonna let you breathe."}, {"time": 1188, "text": "I'm not gonna let blood flow to your brain."}, {"time": 1190, "text": "So do you think it's possible that Russia takes the South of Ukraine?"}, {"time": 1196, "text": "It takes, so starting from Mariupol, the Kherson region."}, {"time": 1203, "text": "All the way to Odessa."}, {"time": 1205, "text": "And into Moldova."}, {"time": 1209, "text": "I believe all of that will happen before the fall."}, {"time": 1212, "text": "Fall of this year?"}, {"time": 1213, "text": "Fall of this year."}, {"time": 1214, "text": "Before winter hits Europe, NATO wants Germany needs to be able to have sanctions lifted so they can tap into Russian power."}, {"time": 1223, "text": "There's no way they can have those sanctions lifted unless Russia wins."}, {"time": 1228, "text": "And Russia also knows that all of Europe, all of NATO is the true, the true people feeling the pain of the war outside of Ukraine are the NATO countries because they're so heavily reliant on Russia."}, {"time": 1242, "text": "And as they have supported American sanctions against Russia, their people feel the pain."}, {"time": 1247, "text": "Economically, their people feel the pain."}, {"time": 1250, "text": "What are they gonna do in the winter?"}, {"time": 1251, "text": "Because without Russian gas, their people are gonna freeze to death."}, {"time": 1256, "text": "Ukrainian people."}, {"time": 1258, "text": "People all over NATO."}, {"time": 1260, "text": "Ukraine, everybody knows Ukraine's at risk."}, {"time": 1263, "text": "Everybody knows Ukrainians are dying."}, {"time": 1265, "text": "The game of war isn't played just, it isn't even played majoritively by the people who are fighting."}, {"time": 1271, "text": "The game of war is played by everyone else."}, {"time": 1273, "text": "It's an economic game."}, {"time": 1274, "text": "It's not a military game."}, {"time": 1276, "text": "The flow of resources and energy."}, {"time": 1278, "text": "Attention."}, {"time": 1278, "text": "And food."}, {"time": 1281, "text": "I was on the front in the Kherson region, the very area that you're referring to, and I spoke to a lot of people, and the morale is incredibly high."}, {"time": 1293, "text": "And I don't think the people in that region, soldiers, volunteer soldiers, civilians, are going to give up that land without dying."}, {"time": 1308, "text": "I mean, in order to take Odessa, would require huge amount of artillery and slaughter of civilians, essentially."}, {"time": 1320, "text": "They're not gonna use artillery in Odessa because Odessa's too important to Russian culture."}, {"time": 1326, "text": "It's gonna be even uglier than that."}, {"time": 1327, "text": "It's going to be clearing of streets, clearing of buildings, person by person, troop by troop."}, {"time": 1333, "text": "It'll be a lot like what it was in Margol."}, {"time": 1336, "text": "Just shooting at civilians."}, {"time": 1338, "text": "Because they can't afford to just do bombing raids because they're gonna destroy cultural, significant architecture that's just too important to the Russian culture, and that's gonna demoralize their own Russian people."}, {"time": 1349, "text": "I have to do a lot of thinking to try to understand what I even feel."}, {"time": 1352, "text": "I don't know, but in terms of information, the thing that the soldiers are saying, the Russian soldiers are saying, the thing the Russian soldiers really believe is that they're freeing, they're liberating the Ukrainian people from Nazis."}, {"time": 1374, "text": "And they believe this."}, {"time": 1376, "text": "Because I visited Ukraine, I spoke to over 100, probably a couple hundred Ukrainian people from different walks of life."}, {"time": 1384, "text": "It feels like the Russian soldiers, at least, are under a cloud of propaganda."}, {"time": 1391, "text": "They're not operating on a clear view of the whole world."}, {"time": 1395, "text": "And given all that, I just don't see Russia taking the South without committing war crimes."}, {"time": 1412, "text": "And if Vladimir Putin is aware of what's happening in terms of the treatment of civilians, I don't see him pushing forward all the way to take the South, because that's not going to be effective strategy for him to win the hearts and minds of these people."}, {"time": 1434, "text": "Autocracies don't need to win hearts and minds."}, {"time": 1436, "text": "That's a staunchly democratic point of view."}, {"time": 1440, "text": "Hearts and minds mean very little to people who understand core basic needs and true power."}, {"time": 1451, "text": "You don't see Xi Jinping worrying about hearts and minds in China."}, {"time": 1454, "text": "You don't see it in North Korea."}, {"time": 1457, "text": "You don't see it in Congo."}, {"time": 1460, "text": "You don't see it in most of the world."}, {"time": 1462, "text": "Hearts and minds are a luxury."}, {"time": 1464, "text": "In reality, what people need is food, water, power."}, {"time": 1467, "text": "They need income to be able to secure a lifestyle."}, {"time": 1472, "text": "It is absolutely sad."}, {"time": 1474, "text": "I am not in any way, shape or form saying that my assessment on this is enriching or enlightening or hopeful."}, {"time": 1486, "text": "It's just fact."}, {"time": 1488, "text": "It's just calculatable empirical evidence."}, {"time": 1492, "text": "If Putin loses in Ukraine, the losses, the influential losses, the economic losses, the lives lost, the power lost is too great."}, {"time": 1503, "text": "So it is better for him to push and push and push through war crimes, through everything else."}, {"time": 1509, "text": "War crimes are something defined by the international court system."}, {"time": 1512, "text": "The international court system has Russia as part of its board."}, {"time": 1516, "text": "And the international court system is largely powerless when it comes to enforcing its own outcomes."}, {"time": 1523, "text": "So the real risk gain scenario here for Russia is significantly in favor of gain over risk."}, {"time": 1534, "text": "The other thing that I think is important to talk about is we, everybody is trapped in the middle of a gigantic information war."}, {"time": 1542, "text": "Yes, there's battlefield bullets and cannons and tanks, but there's also a massive informational war."}, {"time": 1548, "text": "The same narrative that you see these ground troops in Ukraine, these Russian ground troops in Ukraine, believing they're clearing the land of Nazis."}, {"time": 1559, "text": "That information is being fed to them from their own home country."}, {"time": 1565, "text": "I don't know why people seem to think that the information that they're reading in English is any more or less true."}, {"time": 1570, "text": "Every piece of news coming out of the West, every piece of information coming out in the English language is also a giant narrative being shared intentionally to try to undermine the morale and the faithfulness of English speaking Russians, which somebody somewhere knows exactly how many of those there are."}, {"time": 1589, "text": "So we have to recognize that we're not getting true information from other side because there's a strategic value in making sure that there is just the right amount of mis or disinformation out there."}, {"time": 1600, "text": "Not because someone's trying to lie to Americans, but because someone is trying to influence the way English speaking Russians think."}, {"time": 1607, "text": "And in that world, that's exactly why you see so many news articles cited to anonymous sources, government officials who do not wanna be named."}, {"time": 1616, "text": "There's nothing that links back responsibility there."}, {"time": 1619, "text": "There's nothing that can go to court there, but the information still gets released."}, {"time": 1624, "text": "And that's enough to make Ukrainians believe that the United States is gonna help them or that the West is gonna help them."}, {"time": 1631, "text": "It's enough to make Russians think that they're going to lose."}, {"time": 1635, "text": "And maybe they should just give up now and leave from the battlefield now."}, {"time": 1639, "text": "We have to understand."}, {"time": 1640, "text": "We are in the middle of a giant information war."}, {"time": 1644, "text": "Maybe you can correct me, but it feels like in the English speaking world, it's harder to control."}, {"time": 1649, "text": "It's harder to fight the information war because of, some people say there's not really a freedom of speech in this country, but I think if you compare, there's a lot more freedom of speech."}, {"time": 1661, "text": "And it's just harder to control narratives when there's a bunch of guerrilla journalists that are able to just publish anything they want on Twitter or anything."}, {"time": 1671, "text": "It's just harder to control narratives."}, {"time": 1673, "text": "So people don't understand what freedom of speech is."}, {"time": 1676, "text": "That's the first major problem."}, {"time": 1677, "text": "And it's shameful how many people in the United States do not understand what freedom of speech actually protects."}, {"time": 1683, "text": "So that aside, you're absolutely right."}, {"time": 1686, "text": "Fighting the information war in the West is extremely difficult because anyone with a blog, anyone with a Twitter account, anyone, I mean, anyone can call themselves a journalist, essentially."}, {"time": 1699, "text": "We live in a world, we live in a country where people read the headline and they completely bypass the author line and they go straight into the content."}, {"time": 1708, "text": "And then they decide whether the content's real or not based on how they feel instead of based on empirical, measurable evidence."}, {"time": 1715, "text": "So you mentioned the Lend Lease Act and the support of the United States, support of Ukraine by the United States."}, {"time": 1722, "text": "Are you skeptical to the level of support that the United States is providing and is going to provide over time?"}, {"time": 1729, "text": "The strategy that the United States has taken to support Ukraine is similar to the strategy we took to support Great Britain during World War II."}, {"time": 1737, "text": "The enactment of the Lend Lease Act is a perfect example of that."}, {"time": 1739, "text": "The Lend Lease Act means that we are lending or leasing equipment to the Ukrainian government in exchange for future payment."}, {"time": 1747, "text": "So every time a rocket is launched, every time a drone crashes into a tank, that's a bill that Ukraine is just racking up."}, {"time": 1757, "text": "It's like when you go to a restaurant and you start drinking shots."}, {"time": 1760, "text": "Sometime the bill will come due."}, {"time": 1762, "text": "This is exactly what we did when Europe and when Great Britain was in the face of a Nazi invasion."}, {"time": 1769, "text": "We signed the same thing into motion."}, {"time": 1771, "text": "Do you know that the UK did not pay off the debt from World War II until 2020?"}, {"time": 1777, "text": "They've been paying that debt since the end of World War II."}, {"time": 1781, "text": "So what we're doing is we're indebting Ukraine against the promise that perhaps they will secure their freedom, which nobody seems to wanna talk about what freedom is actually gonna look like for Ukrainians."}, {"time": 1813, "text": "It's all coming due."}, {"time": 1816, "text": "We're a democracy, but we're also a capitalist country."}, {"time": 1819, "text": "We can't afford to just give things away for free, but we can give things away at a discount."}, {"time": 1824, "text": "We can give things away, lay away, but the bill will come due."}, {"time": 1828, "text": "And unfortunately that is not part of the conversation that's being had with the American people."}, {"time": 1832, "text": "So debt is a way to establish some level of control."}, {"time": 1836, "text": "Power is power."}, {"time": 1839, "text": "That said, having a very close relationship between Ukraine and the United States does not seem to be a negative possibility when the Ukrainians think about their future in terms of freedom."}, {"time": 1854, "text": "And the other, there's some aspect of this war that I've just noticed that one of the people I talked to said that all great nations have a independence war, have to have a war for their independence."}, {"time": 1870, "text": "In order, there's something, it's dark, but there's something about war just being a catalyst for finding your own identity as a nation."}, {"time": 1878, "text": "So you can have leaders, you can have sort of signed documents, you can have all this kind of stuff, but there's something about war that really brings the country together and actually try to figure out what is at the core of the spirit of the people that defines this country."}, {"time": 1892, "text": "And they see this war as that, as the independence war to define the heart of what the country is."}, {"time": 1899, "text": "So there's been before the war, before this invasion, there was a lot of factions in the country."}, {"time": 1906, "text": "There was a lot of influence from oligarchs and corruption and so on."}, {"time": 1911, "text": "A lot of that was the factions were brought together under one umbrella effectively to become one nation because of this invasion."}, {"time": 1921, "text": "So they see that as a positive direction for the defining of what a free democratic country looks like after the war, in their perspective after the war is won."}, {"time": 1934, "text": "It's a difficult situation because I'm trying to make sure that you and all, everybody listening understands that what's happening in Ukraine, among Ukrainians, is noble and brave and courageous and beyond the expectations of anyone."}, {"time": 1955, "text": "The fact is there is no material support coming from the outside."}, {"time": 1960, "text": "The American Revolution was won because of French involvement."}, {"time": 1964, "text": "French ships, French troops, French generals, French military might."}, {"time": 1969, "text": "The independence of communist China was won through Russian support, Russian generals, Russian troops on the ground fighting with the communists."}, {"time": 1981, "text": "That's how revolutions are won."}, {"time": 1983, "text": "That's how independent countries are born."}, {"time": 1986, "text": "Ukraine doesn't get any of that."}, {"time": 1988, "text": "No one is stepping into that because we live in a world right now where there simply is no economic benefits to the parties in power to support Ukraine to that level."}, {"time": 2001, "text": "And war is a game of economics."}, {"time": 2004, "text": "The economic benefit of Ukraine is crystal clear in favor of Russia, which is why Putin cannot lose."}, {"time": 2011, "text": "He will not let himself lose."}, {"time": 2013, "text": "Short of something completely unexpected, right?"}, {"time": 2016, "text": "I'm talking 60%, 70% probability, Ukraine loses."}, {"time": 2020, "text": "But there's still 20%, 30% probability of the unimaginable happening."}, {"time": 2024, "text": "Who knows what that might be?"}, {"time": 2025, "text": "An oligarch assassinates Putin or a nuclear bomb goes off somewhere or who knows what, right?"}, {"time": 2032, "text": "There's still a chance that something unexpected will happen and change the tide of the war."}, {"time": 2037, "text": "But when it comes down to the core calculus here, Ukraine is the agricultural bed to support a future Russia."}, {"time": 2046, "text": "Russia knows, they know they have to have Ukraine."}, {"time": 2049, "text": "They know that they have to have it to protect themselves against military pressure from the West."}, {"time": 2053, "text": "They have to have it for agricultural reasons."}, {"time": 2055, "text": "They have major oil and natural gas pipelines that flow through Eastern Ukraine."}, {"time": 2062, "text": "They cannot let Ukraine fall outside of their sphere of influence."}, {"time": 2067, "text": "They cannot."}, {"time": 2068, "text": "The United States doesn't really have any economic vested interest in Ukraine."}, {"time": 2073, "text": "Ideological points of view and promises aside, there's no economic benefit."}, {"time": 2079, "text": "And the same thing goes for NATO."}, {"time": 2081, "text": "NATO has no economic investment in Ukraine."}, {"time": 2084, "text": "Ukrainian output, Ukrainian food goes to the Middle East and Africa."}, {"time": 2091, "text": "It doesn't go to Europe."}, {"time": 2093, "text": "So the whole, the West siding with Ukraine is exclusively ideological and it's putting them in a place where they fight a war with Russia so the whole world can see Russia's capabilities."}, {"time": 2106, "text": "Ukraine is a, as sad as it is to say, man, Ukraine is a pawn on a table for superpowers to calculate each other's capacities."}, {"time": 2117, "text": "Right now we've only talked about Russia and the United States."}, {"time": 2119, "text": "We haven't even talked about Iran."}, {"time": 2121, "text": "We haven't even talked about China, right?"}, {"time": 2123, "text": "It is a pawn on a table."}, {"time": 2124, "text": "This is a chicken fight so that people get to watch and see what the other trainers are doing."}, {"time": 2129, "text": "Well, a lot of people might've said the same thing about the United States back in the independence fight."}, {"time": 2134, "text": "So there is possibilities, as you've said."}, {"time": 2138, "text": "We're not saying a 0% chance and it could be a reasonably high percent chance that this becomes one of the great democratic nations that the 21st century is remembered by."}, {"time": 2150, "text": "And so you said American support."}, {"time": 2155, "text": "So ideologically, first of all, you don't assign much longterm power to that."}, {"time": 2163, "text": "That US could support Ukraine purely on ideological grounds."}, {"time": 2169, "text": "Just look in the last four years, the last three years."}, {"time": 2172, "text": "Do you remember what happened in Hong Kong right before COVID?"}, {"time": 2176, "text": "China swooped into Hong Kong violently, beating protesters, killing them in the street, imprisoning people without just cause."}, {"time": 2186, "text": "And Hong Kong was a democracy and the whole world stood by and let it happen."}, {"time": 2192, "text": "And then what happened in Afghanistan just a year ago and the whole world stood by and let the Taliban take power again after 20 years of loss."}, {"time": 2201, "text": "This, we are showing a repeatable point of view."}, {"time": 2206, "text": "We will talk."}, {"time": 2207, "text": "American politicians, American administrations, we will say a lot of things."}, {"time": 2212, "text": "We will promise a lot of ideological pro democracy, rah rah statements."}, {"time": 2218, "text": "We will say it."}, {"time": 2219, "text": "But when it comes down to putting our own people, our own economy, our own GDP at risk, we step away from that fight."}, {"time": 2229, "text": "America is currently supplying military equipment to Ukraine."}, {"time": 2233, "text": "And a lot of that military equipment has actually been the thing that turned the tides of war a couple of times already."}, {"time": 2240, "text": "Currently that's the high mar systems."}, {"time": 2243, "text": "So you mentioned sort of Putin can't afford to lose, but winning can look in different ways."}, {"time": 2249, "text": "So you've kind of defined so on."}, {"time": 2252, "text": "At this moment, the prediction is that winning looks like capturing not just the east, but the south of Ukraine."}, {"time": 2261, "text": "But you can have narratives of winning that return back to what was at the beginning of this year before the invasion."}, {"time": 2270, "text": "That Crimea is still with Russia."}, {"time": 2273, "text": "There's some kind of negotiated thing about Donbass where it still stays with Ukraine, but there's some."}, {"time": 2279, "text": "Puppet government."}, {"time": 2281, "text": "Just like that's what they have in Georgia right now."}, {"time": 2283, "text": "And that could still be defined through mechanisms."}, {"time": 2287, "text": "As Russia winning."}, {"time": 2288, "text": "As Russia winning for Russia and then for Ukraine as Ukraine winning and for the west as democracy winning and you kind of negotiate."}, {"time": 2299, "text": "I mean, that seems to be how geopolitics works is everybody can walk away with a win win story and then the world progresses with the lessons learned."}, {"time": 2308, "text": "That's the high likely."}, {"time": 2309, "text": "That's the most probable outcome."}, {"time": 2311, "text": "The most probable outcome is that Ukraine remains in air quotes, a sovereign nation."}, {"time": 2318, "text": "It's not going to be truly sovereign because it will become, it will have to have new government put in place."}, {"time": 2327, "text": "Zelinsky will, it's extremely unlikely he will be president because he has gone too far to demonstrate his power over the people and his ability to separate the Ukrainian people from the autocratic power of Russia."}, {"time": 2342, "text": "So he would have to be unseated whether he goes into exile or whether he is peacefully left alone is all gonna be part of negotiations."}, {"time": 2351, "text": "But the thing to keep in mind also is that a negotiated peace really just means a negotiated ceasefire."}, {"time": 2357, "text": "We've seen this happen all over the world."}, {"time": 2359, "text": "North Korea and South Korea are technically still just in negotiated cease power."}, {"time": 2363, "text": "What you end up having is Russia will allow Ukraine to call itself Ukraine, to operate independently, to have their own debt to the United States."}, {"time": 2372, "text": "Russia doesn't wanna take on that debt."}, {"time": 2374, "text": "And then in exchange for that, they will have firmer guidelines as to how NATO can engage with Ukraine."}, {"time": 2381, "text": "And then that becomes an example for all the other former Soviet satellite states, which are all required economically by Russia, not required economically by the West."}, {"time": 2391, "text": "And then you end up seeing how it just, you can see how the whole thing plays out once you realize that the keystone is Ukraine."}, {"time": 2431, "text": "They're a good partner."}, {"time": 2432, "text": "And so it's valuable, if you sort of have a cynical, pragmatic view, sort of like Henry Kissinger type of view, it's valuable to have them as a partner, so valuable that it makes sense to support them in achieving a negotiated ceasefire that's on the side of Ukraine."}, {"time": 2451, "text": "But because of this particular leader, this particular culture, this particular dynamics of how the war unrolled and things like Twitter and the way digital communication currently works, it just seems like this is a powerful symbol of freedom that's useful for the United States if we're sort of to take the pragmatic view."}, {"time": 2472, "text": "Don't you think it's possible that United States supports Ukraine financially, militarily enough for it to get an advantage in this war?"}, {"time": 2485, "text": "I think they've already gotten advantage in the war."}, {"time": 2487, "text": "The fact that the war is still going on demonstrates the asymmetrical advantage."}, {"time": 2490, "text": "The fact that Russia has stepped up to the negotiating table with them several times without just turning to Chechen, I mean, you remember what happened in Chechnya, without turning to Chechnya level, just mass blind destruction, which was another Putin war."}, {"time": 2511, "text": "To see that those things have happened demonstrates the asymmetric advantage that the West has given."}, {"time": 2516, "text": "I think the true way to look at the benefit of Ukraine as a shining example of freedom in Europe for the West isn't to understand whether or not they could."}, {"time": 2528, "text": "They absolutely could."}, {"time": 2530, "text": "It's the question of how valuable is that in Europe?"}, {"time": 2534, "text": "How valuable is Ukraine?"}, {"time": 2536, "text": "Which before February, nobody even thought about Ukraine."}, {"time": 2542, "text": "And the people who did know about Ukraine knew that it was an extremely corrupt former Soviet state with 20% of its national population self identifying as Russian."}, {"time": 2553, "text": "There's a reason Putin went into Ukraine."}, {"time": 2555, "text": "There's a reason he's been promising he would go into Ukraine for the better part of a decade."}, {"time": 2560, "text": "Because the circumstances were aligned, it was a corrupt country that self identified as Russian in many ways."}, {"time": 2567, "text": "It was supposed to be an easier of multiple marks in terms of the former Soviet satellite states to go after."}, {"time": 2575, "text": "That's all part of the miscalculation that the rest of the world saw too when we thought it would fall quickly."}, {"time": 2582, "text": "So to think that it could be a shining example of freedom is accurate."}, {"time": 2586, "text": "But is it as shining a star as Germany?"}, {"time": 2590, "text": "Is it as shining a star as the UK?"}, {"time": 2591, "text": "Is it as shining a star as Romania?"}, {"time": 2593, "text": "Is it as shiny a star as France?"}, {"time": 2597, "text": "It's got a lot of democratic freedom based countries in Europe to compete against to be the shining stellar example."}, {"time": 2606, "text": "And in exchange, on counterpoint to that, it has an extreme amount of strategic value to Russia which has no interest in making it a shining star of the example of democracy and freedom."}, {"time": 2618, "text": "Outside of research in terms of the shininess of the star, I would argue yes."}, {"time": 2623, "text": "If you look at how much it captivated the attention of the world."}, {"time": 2626, "text": "The attention of the world has made no material difference, man."}, {"time": 2630, "text": "That's your estimation, but are you sure we can, we can't, if you can convert that into political influence into money, don't you think attention is money?"}, {"time": 2643, "text": "Attention is money in democracies and capitalist countries."}, {"time": 2648, "text": "Which serves as a counterweight to sort of authoritarian regimes."}, {"time": 2651, "text": "So for Putin, resources matter."}, {"time": 2654, "text": "For the United States, also resources matter, but the attention and the belief of the people also matter because that's how you attain and maintain political power."}, {"time": 2664, "text": "So going to that exact example, then I would highlight that our current administration has the lowest approval ratings of any president in history."}, {"time": 2673, "text": "So if people were very fond of the war going on in Ukraine, wouldn't that counterbalance some of our upset, some of the dissent coming from the economy and some of the dissent coming from the great recession or the second great, or the great resignation and whatever's happening with the draw with the down stock market?"}, {"time": 2691, "text": "You would think that people would feel like they're sacrificing for something if they really believed that Ukraine mattered, that they would stand next to the president who is so staunchly driving and leading the West against this conflict."}, {"time": 2706, "text": "Well, I think the opposition to this particular president, I personally believe has less to do with the policies and more to do with a lot of the other human factors."}, {"time": 2719, "text": "But again, empirically, this is, I look at things through a very empirical lens, a very cold fact based lens."}, {"time": 2726, "text": "And there are multiple data points that suggest that the American people ideologically sympathize with Ukraine, but they really just want their gas prices to go down."}, {"time": 2736, "text": "They really just want to be able to pay less money at the grocery store for their food."}, {"time": 2739, "text": "And they most definitely don't want their sons and daughters to die in exchange for Ukrainian freedom."}, {"time": 2746, "text": "It does hurt me to see the politicization of this war as well."}, {"time": 2750, "text": "I think that maybe has to do with the kind of calculation you're referring to, but it seems like it doesn't."}, {"time": 2758, "text": "It seems like there's a cynical, whatever takes attention of the media for the moment, the red team chooses one side and the blue team chooses another."}, {"time": 2768, "text": "And then I think, correct me if I'm wrong, but I believe the Democrats went into full support of Ukraine on the ideological side."}, {"time": 2780, "text": "And then I guess Republicans are saying, why are we wasting money?"}, {"time": 2783, "text": "The gas prices are going up."}, {"time": 2818, "text": "You're right in the sense of the fact that it's, I wouldn't say that the red team and the blue team picked opposite sides on this."}, {"time": 2825, "text": "What I would say is that media discovered that talking about Ukraine wasn't as profitable as talking about something else."}, {"time": 2833, "text": "People simply, the American people who read media or who watch media, they simply became bored reading about news that didn't seem to be changing much."}, {"time": 2843, "text": "And we turned back into wanting to read about our own economy, and we wanted to hear more about cryptocurrency, and we wanted to hear more about the Kardashians, and that's what we care about, so that's what media writes about."}, {"time": 2853, "text": "That's how a capitalist market driven world works, and that's how the United States works."}, {"time": 2858, "text": "That's why in both red papers and blue papers, red sources and blue sources, you don't see Ukraine being mentioned very much."}, {"time": 2864, "text": "If anything, I would say that your Republicans are probably more in support of what's happening in Ukraine right now, because we're creating new weapon systems, our military is getting stronger, we're sending these, we get to test military systems in combat in Ukraine, that's priceless."}, {"time": 2882, "text": "In the world of the military industrial complex, being able to field test, combat test a weapon without having to sacrifice your own people is incredibly valuable."}, {"time": 2893, "text": "You get all the data, you get all the performance metrics, but you don't have to put yourself at risk."}, {"time": 2897, "text": "That is one of the major benefits of what we're seeing from supporting Ukraine with weapons and with troops."}, {"time": 2903, "text": "The longterm benefit to what will come of this for the United States, practically speaking, in the lens of national security, through military readiness, through future economic benefits, those are super strong."}, {"time": 2918, "text": "The geopolitical fight is essentially moot, because Ukraine is not a geopolitical player."}, {"time": 2925, "text": "It was not for 70 years, and after this conflict is over, it will not again."}, {"time": 2931, "text": "Just think about what you were just saying with the American people's attention span to Twitter and whatever's currently going on."}, {"time": 2937, "text": "If the Ukraine conflict resolved itself today in any direction, how many weeks do you think before no one talked about Ukraine anymore?"}, {"time": 2946, "text": "Do you think we would make it two weeks?"}, {"time": 2947, "text": "Or do you think we'd make it maybe seven days?"}, {"time": 2949, "text": "It would be headline news for one or two days, and then we'd be onto something else."}, {"time": 2955, "text": "It's just an unfortunate reality of how the world works in a capitalist democracy."}, {"time": 2961, "text": "Yeah, it just breaks my heart how much, you know, I know that there's Yemen and Syria and that nobody talks about anymore."}, {"time": 2973, "text": "Still raging conflicts going on."}, {"time": 2977, "text": "It breaks my heart how much generational hatred is born."}, {"time": 2982, "text": "I happen to be from, my family is from Ukraine and from Russia, and so for me, just personally, it's a part of the world I care about."}, {"time": 2991, "text": "In terms of its history, because I speak the language, I can appreciate the beauty of the literature, the music, the art, the cultural history of the 20th century through all the dark times, through all the hell of the dark sides of authoritarian regimes, the destruction of war."}, {"time": 3012, "text": "There's still just the beauty that I'm able to appreciate that I can't appreciate about China, Brazil, other countries because I don't speak their language."}, {"time": 3019, "text": "This one I can appreciate."}, {"time": 3020, "text": "And so in that way, this is personally really painful to me to see so much of that history, the beauty in that history suffocated by the hatred that is born through this kind of geopolitical game fought mostly by the politicians, the leaders."}, {"time": 3039, "text": "People are beautiful, and that's what you're talking about."}, {"time": 3042, "text": "People are just, people are beautiful creatures."}, {"time": 3047, "text": "Culture and art and science, these are beautiful, beautiful things that come about because of human beings."}, {"time": 3055, "text": "And the thing that gives me hope is that no matter what conflict the world has seen, and we've seen some devastating, horrible crimes against humanity already."}, {"time": 3067, "text": "We saw nuclear bombs go off in Japan."}, {"time": 3070, "text": "We saw genocide happen in Rwanda."}, {"time": 3073, "text": "We've seen horrible things happen."}, {"time": 3076, "text": "But people persevere."}, {"time": 3078, "text": "Language, culture, arts, science, they all persevere."}, {"time": 3081, "text": "They all shine through."}, {"time": 3083, "text": "Some of the most, people don't even realize how gorgeous the architecture and the culture is inside Iran."}, {"time": 3089, "text": "People have no idea."}, {"time": 3091, "text": "Chinese people in the rural parts of China are some of the kindest, most amazing people you'll ever meet."}, {"time": 3099, "text": "And Korean art and Korean dance, Korean drumming, I know nobody has ever even heard of Korean drumming."}, {"time": 3107, "text": "Korean drumming is this magical, beautiful thing."}, {"time": 3110, "text": "And the North, in North Korea, does it better than anybody in the world."}, {"time": 3114, "text": "Taekwondo in North Korea is just exceptional to watch."}, {"time": 3117, "text": "In North Korea?"}, {"time": 3118, "text": "In North Korea."}, {"time": 3119, "text": "Nobody knows these things."}, {"time": 3120, "text": "How do you know about Taekwondo in North Korea?"}, {"time": 3122, "text": "I have questions."}, {"time": 3125, "text": "That's, people don't think about that, but the culture, the beauty of the people still flourishes even in the toughest of places."}, {"time": 3131, "text": "Absolutely, and we always will."}, {"time": 3133, "text": "We always will because that is what people do."}, {"time": 3136, "text": "And that is just the truth of it."}, {"time": 3138, "text": "And it breaks my heart to see travesties that people commit against people."}, {"time": 3143, "text": "But whether you're looking at a micro level, like what happens with shootings here in the United States, or whether you look at a macro level, like geopolitical power exchanges and intra and interstate conflicts, like what you see in Syria and what you see in Ukraine, those are disgusting, terrible things."}, {"time": 3162, "text": "War is a terrible thing."}, {"time": 3163, "text": "That is a famous quote."}, {"time": 3167, "text": "But people will persevere."}, {"time": 3169, "text": "People will come through."}, {"time": 3175, "text": "And I hope we don't do something that I'll probably also ask you about later on is things that destroy the possibility of perseverance, which is things like nuclear war, things that can do such tremendous damage that we will never recover."}, {"time": 3197, "text": "But yeah, amidst your pragmatic pessimism, I think both you and I have a kind of maybe small flame of optimism in there about the perseverance of the human species in general."}, {"time": 3210, "text": "Let me ask you about intelligence agencies outside of the CIA."}, {"time": 3215, "text": "Can you illuminate what is the most powerful intelligence agency in the world?"}, {"time": 3223, "text": "The CIA, the FSB, formerly the KGB, the MI6, Mossad."}, {"time": 3229, "text": "I've gotten a chance to interact with a lot of Israelis while in Ukraine."}, {"time": 3234, "text": "Just incredible people."}, {"time": 3236, "text": "Yeah, in terms of both training and skill, just every front."}, {"time": 3240, "text": "American soldiers too, just American military is incredible."}, {"time": 3244, "text": "I just, the competence and skill of the military, the United States, Israeli I got to interact, and Ukrainian as well."}, {"time": 3252, "text": "It's striking."}, {"time": 3253, "text": "It's striking, it's beautiful."}, {"time": 3254, "text": "I just love people, I love carpenters, or people that are just extremely good at their job and then take pride in their craftsmanship."}, {"time": 3261, "text": "It's beautiful to see."}, {"time": 3262, "text": "And I imagine the same kind of thing happens inside of intelligence agencies as well that we don't get to appreciate because of the secrecy."}, {"time": 3269, "text": "Same thing with like Lockheed Martin."}, {"time": 3271, "text": "I interviewed the CTO of Lockheed Martin."}, {"time": 3274, "text": "It breaks my heart, as a person who loves engineering, because of the cover of secrecy, we'll never get to know some of the incredible engineering that happens inside of Lockheed Martin, Boeing, and Raytheon."}, {"time": 3286, "text": "Yeah, you know, there's kind of this idea that these are, you know, people have conspiracy theories and kind of assign evil to these companies in some part, but I think there's beautiful people inside those companies, brilliant people, and some incredible science and engineering is happening there."}, {"time": 3304, "text": "Anyway, that said, the CIA, the FSB, the MI6, Mossad, China, I know very little about the... MSS, the Ministry of State Security."}, {"time": 3314, "text": "I don't know how much you know."}, {"time": 3317, "text": "Or just other intelligence agencies."}, {"time": 3319, "text": "In India, Pakistan, I've also heard... Yeah, RAW is powerful, and so is ISSI."}, {"time": 3324, "text": "Yes, or ISSI."}, {"time": 3326, "text": "And then, of course, European nations in Germany and France."}, {"time": 3330, "text": "Yeah, so what can you say about the power, the influence of the different intelligence agencies within their nation and outside?"}, {"time": 3337, "text": "Yeah, so to answer your question, your original question, which is the most powerful, I'm gonna have to give you a few different answers."}, {"time": 3379, "text": "So they're the strongest."}, {"time": 3381, "text": "They're the most powerful intelligence service in terms of reach."}, {"time": 3384, "text": "Most assets, most informants, most intelligence."}, {"time": 3387, "text": "So it's deeply integrated with the citizenry."}, {"time": 3389, "text": "Correct, with their culture."}, {"time": 3390, "text": "You know what a Chinese person who lives in Syria thinks of themself as?"}, {"time": 3394, "text": "A Chinese person."}, {"time": 3395, "text": "Do you know what a Chinese person, a Chinese national living in the United States thinks of themself as?"}, {"time": 3400, "text": "A Chinese person, right?"}, {"time": 3401, "text": "Americans living abroad often think of ourselves as expats, expatriates, living on the local economy, embracing the local culture."}, {"time": 3409, "text": "That is not how Chinese people view traveling around the world."}, {"time": 3412, "text": "And by the way, if I may mention, I believe the way Mossad operates is a similar kind of thing, because people from Israel living abroad still think of themselves as Jewish and Israeli."}, {"time": 3427, "text": "First."}, {"time": 3428, "text": "First, so that allows you to integrate the."}, {"time": 3431, "text": "Culture, and yep, the faith based aspects."}, {"time": 3434, "text": "But the number of people in Israel is much, much smaller."}, {"time": 3438, "text": "The number of people in China."}, {"time": 3438, "text": "When it comes to reach, China wins that game."}, {"time": 3441, "text": "When it comes to professional capability, it's the CIA by far, because budget wise, capability wise, weapons system wise, modern technology wise, CIA is the leader around the world, which is why every other intelligence organization out there wants to partner with CIA."}, {"time": 3458, "text": "They want to learn from CIA."}, {"time": 3460, "text": "They want to train with CIA."}, {"time": 3462, "text": "They want to partner on counter narcotics, and counter drug, and counter terrorism, and counter Uyghur, you name it, people want to partner with CIA."}, {"time": 3470, "text": "So CIA is the most powerful in terms of capability and wealth."}, {"time": 3474, "text": "And then you've got the idea, you've got tech."}, {"time": 3479, "text": "So tech alone, meaning corporate espionage, economic espionage, nothing beats DGSE in France."}, {"time": 3489, "text": "They're the top."}, {"time": 3490, "text": "They've got a massive budget that almost goes exclusively to stealing foreign secrets."}, {"time": 3494, "text": "They're the biggest threat to the United States, even above Russia and above China."}, {"time": 3499, "text": "DGSE in France is a massively powerful intelligence organization, but they're so exclusively focused on a handful of types of intelligence collection that nobody even really thinks that they exist."}, {"time": 3511, "text": "And then in terms of just terrifying violence, you have Mossad."}, {"time": 3516, "text": "Mossad will do anything."}, {"time": 3518, "text": "Mossad has no qualms doing what it takes to ensure the survival of every Israeli citizen around the world."}, {"time": 3526, "text": "Most other countries will stop at some point, but Mossad doesn't do that."}, {"time": 3531, "text": "So it's the lines you're willing to cross."}, {"time": 3534, "text": "And the reasons that you're willing to cross them."}, {"time": 3537, "text": "The CIA will let an American stay in jail in Russia, unlawfully, and seek a diplomatic solution."}, {"time": 3546, "text": "I mean, the United States has let people, there are two gentlemen from the 1950s who were imprisoned in China for 20 years waiting for diplomatic solutions to their release."}, {"time": 3556, "text": "So we do not kill to save a citizen, but Mossad will."}, {"time": 3566, "text": "And then they'll not just kill, they'll do large scale infiltration."}, {"time": 3571, "text": "They'll do amazing things."}, {"time": 3572, "text": "There is no, they spare no expense because it's a demonstration to their own people."}, {"time": 3578, "text": "Again, going back to the whole idea of influence."}, {"time": 3580, "text": "Every intelligence operation that sees the light of day has two purposes."}, {"time": 3587, "text": "The first purpose is the intelligence operation."}, {"time": 3591, "text": "But if it was just the intelligence operation, it would stay secret forever."}, {"time": 3594, "text": "The second purpose of every successful intelligence operation, when they become public, is to send a signal to the world."}, {"time": 3602, "text": "If you work against us, we will do this to you."}, {"time": 3605, "text": "If you work for us, we will take care of you in this way."}, {"time": 3609, "text": "It's a massive information campaign."}, {"time": 3611, "text": "Do you think in that way, CIA is not doing a good job?"}, {"time": 3615, "text": "Because there is the FSB, perhaps much less so GRU, but the KGB did this well, which is to send a signal, like basically communicate that this is a terrifying organization with a lot of power."}, {"time": 3633, "text": "So Mossad is doing a good job of that."}, {"time": 3636, "text": "The psychological information warfare."}, {"time": 3639, "text": "And it seems like the CIA also has a lot of kind of myths about it, conspiracy theories about it, but much less so than the other agencies."}, {"time": 3652, "text": "CIA does a good job of playing to the mythos."}, {"time": 3654, "text": "So when General Petraeus used to be the director of CIA."}, {"time": 3658, "text": "Yeah, and your workout partner."}, {"time": 3660, "text": "And my workout partner."}, {"time": 3661, "text": "I read about this."}, {"time": 3662, "text": "So I loved and hated those workouts with Petraeus because he is a physical beast."}, {"time": 3667, "text": "He's a strong fit, at the time, 60 something year old man."}, {"time": 3671, "text": "Let me take a tangent on that because he's coming on this podcast."}, {"time": 3674, "text": "Oh, excellent man."}, {"time": 3675, "text": "So can you say what you learned from the man in terms of, or like what you think is interesting and powerful and inspiring about the way he sees the world, or maybe what you learned in terms of how to get strong in the gym or anything about life."}, {"time": 3694, "text": "Two things right away."}, {"time": 3694, "text": "And one of them I was gonna share with you anyway."}, {"time": 3696, "text": "So I'm glad that you asked the question."}, {"time": 3697, "text": "So the first is that on our runs and man, he runs fast and we would go for six mile runs through Bangkok."}, {"time": 3705, "text": "And he talked openly about, I asked him, how do you keep this mystery, this epic mythology about your fitness and your strength?"}, {"time": 3720, "text": "How do you keep all of this alive with the troops?"}, {"time": 3724, "text": "And he had this amazing answer."}, {"time": 3726, "text": "And he was like, I don't talk about it."}, {"time": 3728, "text": "Myths are born not from somebody orchestrating the myth, but from the source of the myth, simply being secretive."}, {"time": 3737, "text": "So he's like, I don't talk about it."}, {"time": 3739, "text": "I've never exacerbated it."}, {"time": 3741, "text": "I just do what I do."}, {"time": 3742, "text": "And I let the troops talk."}, {"time": 3743, "text": "And he's like, when it's in favor, when it goes in favor of discipline and loyalty and commitment, I let it run."}, {"time": 3750, "text": "If it starts getting destructive or damaging, then I have my leadership team step in to fix it."}, {"time": 3757, "text": "But when it comes to the mythos, the myth of him being superpowered soldier, that's what he wants every soldier to be."}, {"time": 3764, "text": "So he lets it run."}, {"time": 3765, "text": "And it was so enlightening when he told me, when there's a myth that benefits you, you just let it go."}, {"time": 3771, "text": "You let it happen because it gets you further without you doing any work."}, {"time": 3775, "text": "It costs no investment for you."}, {"time": 3776, "text": "So the catalyst of the virality of the myth is just being mysterious."}, {"time": 3780, "text": "And that's what CIA does well, to go back to your first question."}, {"time": 3783, "text": "What does CIA do?"}, {"time": 3784, "text": "They don't answer any questions."}, {"time": 3786, "text": "They don't say anything."}, {"time": 3788, "text": "And wherever the myth goes, the myth goes, whether it's that they sold drugs or use child prostitutes or whatever else, wherever the myth goes, they let it go."}, {"time": 3797, "text": "Because at the end of the day, everybody sits back and says, wow, I really just don't know."}, {"time": 3802, "text": "Now, the second thing that I learned from Petraeus, and I really am a big fan of Petraeus."}, {"time": 3807, "text": "I know he made personal mistakes."}, {"time": 3809, "text": "You don't get to be that powerful without making personal mistakes."}, {"time": 3812, "text": "But when I worked out with him, the one thing that my commanding officer told me not to ask about, he was like, never ask the general about his family."}, {"time": 3824, "text": "I'm a family guy."}, {"time": 3825, "text": "So as soon as I met General Petraeus, one of the first things I asked him was, hey, what was it like raising a family and being the commander of forces in the Middle East?"}, {"time": 3835, "text": "Like you weren't with your family very much."}, {"time": 3837, "text": "And the thing I love about the guy, he didn't bite off my head."}, {"time": 3840, "text": "He didn't snap at me."}, {"time": 3841, "text": "He didn't do anything."}, {"time": 3842, "text": "He openly admitted that he regretted some of the decisions that he made because he had to sacrifice his family to get there."}, {"time": 3851, "text": "Relationships with his children, absentee father, missing birthdays, missing, we all say, we all say how sad it is to miss birthdays and miss anniversaries, yada, yada, yada."}, {"time": 3861, "text": "Everybody knows what that feels like."}, {"time": 3862, "text": "Even business people know what that feels like."}, {"time": 3863, "text": "The actual pain that we're talking about is when you're not there to handle your 13 year old's questions when a boy breaks up with her or when you're not there to handle the bloody lip that your nine year old comes back with from their first encounter with a bully."}, {"time": 3877, "text": "Those are the truly heartbreaking moments that a parent lives and dies by."}, {"time": 3882, "text": "He missed almost all of those because he was fighting a war that we forgot and we gave up on 20 years later, right?"}, {"time": 3891, "text": "He's so honest about that."}, {"time": 3894, "text": "And it was really inspiring to me to be told not to ask that question."}, {"time": 3899, "text": "And when I broke that guidance, he didn't reprimand me."}, {"time": 3902, "text": "He just, he was authentic."}, {"time": 3905, "text": "And it was absolutely one of the big decisions that helped me leave CIA on my own in 2014."}, {"time": 3910, "text": "And he was honest on the sacrifice you make."}, {"time": 3915, "text": "The same man, the same man who just taught me a lesson about letting a myth live, that same guy was willing to be so authentic about this personal mistake."}, {"time": 3927, "text": "I like complicated people like that."}, {"time": 3930, "text": "So what did you, what do you make of that calculation, of family versus job?"}, {"time": 3936, "text": "You've given a lot of your life and passion to the CIA, to that work."}, {"time": 3944, "text": "You've spoken positively about that world, the good it does."}, {"time": 3951, "text": "And yet you're also a family man and you value that."}, {"time": 3953, "text": "What's that calculation like?"}, {"time": 3955, "text": "What's that trade off like?"}, {"time": 3956, "text": "I mean, for me, the calculation is very clear."}, {"time": 3957, "text": "It's family."}, {"time": 3958, "text": "I left CIA because I chose my family."}, {"time": 3963, "text": "And when my son was born, my wife and I found out that we were pregnant while we were still on mission."}, {"time": 3968, "text": "We were a tandem couple."}, {"time": 3969, "text": "My wife is also a former CIA officer, undercover like me."}, {"time": 3972, "text": "We were operating together overseas."}, {"time": 3974, "text": "We got the positive pregnancy test, like so many people do."}, {"time": 3978, "text": "And she cried."}, {"time": 3981, "text": "My wife was a bad ass."}, {"time": 3983, "text": "I was just, I was like the accidental spy, but my wife was really good at what she does."}, {"time": 3988, "text": "And she cried and she was like, what do we do now?"}, {"time": 3992, "text": "It's what we've always wanted, a child, but we're in this thing right now."}, {"time": 3998, "text": "There's no space for a child."}, {"time": 4001, "text": "So long story short, we had our baby."}, {"time": 4005, "text": "CIA brought us back to have the baby."}, {"time": 4008, "text": "And when we started having conversations about, hey, what do we do next?"}, {"time": 4012, "text": "Cause we're not the type of people to wanna just sit around and be domestic."}, {"time": 4017, "text": "What do we do next?"}, {"time": 4018, "text": "But keep in mind, we have a child now."}, {"time": 4020, "text": "So here's some of our suggestions."}, {"time": 4022, "text": "We could do this and we can do that."}, {"time": 4024, "text": "Let us get our child to a place where we can put him into an international school, or we can get him into some sort of program where we can both operate together again during the day."}, {"time": 4037, "text": "But CIA just had no, they had no patience for that conversation."}, {"time": 4039, "text": "There was no, family is not their priority."}, {"time": 4043, "text": "So the fact that we were a tandem couple, two officers, two operators trying to have a baby was irrelevant to them."}, {"time": 4050, "text": "So when they didn't play with us, when they did nothing to help us prioritize parenthood as part of our overall experience, that's when we knew that they never would."}, {"time": 4063, "text": "And what good is it to commit yourself to a career if the career is always going to challenge the thing that you value most?"}, {"time": 4070, "text": "And that was the calculation that we made to leave CIA."}, {"time": 4073, "text": "Not everybody makes that calculation."}, {"time": 4075, "text": "And a big part of why I am so vocal about my time in CIA is because I am immensely appreciative of the men and women who to this day have failed marriages and poor relationships with their children because they chose national security."}, {"time": 4094, "text": "They chose protecting America over their own family."}, {"time": 4097, "text": "And they've done it even though it's made them abuse alcohol and abuse substances and they've gotten themselves, they've got permanent diseases and issues from living and working abroad."}, {"time": 4111, "text": "It's just insane the sacrifice that officers make to keep America free."}, {"time": 4117, "text": "And I'm just not one of those people."}, {"time": 4119, "text": "I chose family."}, {"time": 4121, "text": "You said that your wife misses it."}, {"time": 4124, "text": "Do you miss it?"}, {"time": 4125, "text": "We both miss it."}, {"time": 4126, "text": "We miss it for different reasons."}, {"time": 4127, "text": "We miss it for similar reasons, I guess, but we miss it in different ways."}, {"time": 4130, "text": "The people, the people at CIA are just amazing."}, {"time": 4135, "text": "They're everyday people like the guy and the gal next door, but so smart and so dedicated and so courageous about what they do and how they do it."}, {"time": 4146, "text": "I mean, the sacrifices they make are massive, more massive than the sacrifices I made."}, {"time": 4150, "text": "So I was always inspired and impressed by the people around me."}, {"time": 4153, "text": "So both my wife and I absolutely miss the people."}, {"time": 4156, "text": "My wife misses the work because you know everything."}, {"time": 4160, "text": "When you're inside, it's all, I mean, we had top secret."}, {"time": 4165, "text": "We had TS SCI clearances at the time."}, {"time": 4167, "text": "I had a cat six, cat 12, which makes me nuclear cleared."}, {"time": 4170, "text": "My wife had other privy clearances that allowed her to look into areas that were specialized, but there wasn't a headline that went out that we couldn't fact check with a click of a few buttons."}, {"time": 4184, "text": "And she misses that because she loved that kind of knowledge."}, {"time": 4186, "text": "And now you're just one of us living in the cloud of mystery."}, {"time": 4192, "text": "Not really knowing anything about what's going on."}, {"time": 4194, "text": "Exactly, but for me, I've always been the person that likes operating."}, {"time": 4199, "text": "And you know what you still get to do when you leave CIA?"}, {"time": 4201, "text": "You still get to operate."}, {"time": 4202, "text": "Operating is just working with people."}, {"time": 4204, "text": "It's understanding how people think, predicting their actions, driving their direction of their thoughts, persuading them, winning negotiations."}, {"time": 4213, "text": "You still get to do that."}, {"time": 4214, "text": "You do that every day."}, {"time": 4215, "text": "And you can apply that in all kinds of domains."}, {"time": 4218, "text": "Well, let me ask you on that."}, {"time": 4221, "text": "You're a covert CIA intelligence officer for several years."}, {"time": 4225, "text": "Maybe can you tell me the story of how it all began?"}, {"time": 4228, "text": "How were you recruited?"}, {"time": 4230, "text": "And what did the job entail to the degree you can speak about it?"}, {"time": 4234, "text": "Feel free to direct me if I'm getting too boring or if the camera."}, {"time": 4237, "text": "Every aspect of this is super exciting."}, {"time": 4240, "text": "So I was leaving the United States Air Force in 2007."}, {"time": 4246, "text": "I was a lieutenant getting ready to pin on captain."}, {"time": 4251, "text": "My five years was up."}, {"time": 4253, "text": "And I was a very bad fit for the US Air Force."}, {"time": 4256, "text": "I was an Air Force Academy graduate, not by choice, but by lack of opportunity, lack of options otherwise."}, {"time": 4261, "text": "So I forced myself through the Academy, barely graduated with a 2.4 GPA."}, {"time": 4267, "text": "And then went on the Air Force taught me how to fly."}, {"time": 4269, "text": "And then the Air Force taught me about nuclear weapons."}, {"time": 4271, "text": "And I ended up as a nuclear missile commander in Montana."}, {"time": 4278, "text": "And I chose to leave the Air Force because I didn't like shaving my face."}, {"time": 4283, "text": "I didn't like having short hair."}, {"time": 4284, "text": "And I most definitely didn't like shining my shoes."}, {"time": 4286, "text": "And I did not wanna be one of the people in charge of nuclear weapons."}, {"time": 4289, "text": "So when I found myself as a person in charge of 200 nuclear weapons, I knew that I was going down the wrong road."}, {"time": 4294, "text": "I have questions about this."}, {"time": 4296, "text": "And more importantly, I have questions about your hair."}, {"time": 4298, "text": "So you had short hair at the time?"}, {"time": 4300, "text": "I had, yeah, you have to."}, {"time": 4301, "text": "Military regulations, you can't have hair longer than one inch."}, {"time": 4304, "text": "And this, the beautiful hair you have now, that came to be in the CIA or after?"}, {"time": 4312, "text": "This, so I discovered I had messy hair in CIA because I used to go muge, we called it muge."}, {"time": 4318, "text": "I used to go Mujahideen style, big burly beard and crazy wacky hair."}, {"time": 4323, "text": "Because an ambiguously brown guy with a big beard and long hair can go anywhere in the world without anyone even noticing him."}, {"time": 4332, "text": "They either think that he's a janitor or they think that he's like some forgotten part of history but nobody ever thinks that that guy is a spy."}, {"time": 4341, "text": "So it was the perfect, for me, it was one of my favorite disguises."}, {"time": 4347, "text": "It's what's known as a level two disguise."}, {"time": 4349, "text": "One of my favorite disguises to Don was just dilapidated brown guy."}, {"time": 4355, "text": "Can you actually, we'll just take a million tangents."}, {"time": 4357, "text": "What's a level two disguise?"}, {"time": 4360, "text": "What are the different levels of disguise?"}, {"time": 4362, "text": "What are the disguises?"}, {"time": 4364, "text": "Yeah, there's three levels of disguise by and large."}, {"time": 4366, "text": "Level one is what we also know, what we also call light disguise."}, {"time": 4369, "text": "So that's essentially, you put on sunglasses and a ball cap and that's a disguise."}, {"time": 4375, "text": "You look different than you normally look."}, {"time": 4377, "text": "So it's just different enough that someone who's never seen you before, someone who literally has to see you just from a picture on the internet, they may not recognize you."}, {"time": 4386, "text": "It's why you see celebrities walk around with ball caps and oversized jackets and baseball hats because they just need to not look like they look in the tabloid or not look like they look in TV."}, {"time": 4396, "text": "That's level one."}, {"time": 4397, "text": "Let me jump from level one to level three."}, {"time": 4399, "text": "Level three is all of your prosthetics, all the stuff you see in Mission Impossible, your fake ears, your fake faces, your fat suits, your stilts inside your feet, all that's level three."}, {"time": 4412, "text": "Whenever they make any kind of prosthetic disguise, that's a level three disguise because prosthetics are very damning if you are caught with a prosthetic."}, {"time": 4423, "text": "If you're caught wearing a sudden, wearing a baseball hat and sunglasses, nobody's gonna say you're a spy."}, {"time": 4429, "text": "But when you're caught with a custom made nose prosthetic that changes the way your face looks or when someone pops out a fake jaw and they see that your top teeth don't look like they did in this prosthetic, then all of a sudden you've got some very difficult questions to ask or to answer."}, {"time": 4446, "text": "So level three is extremely dangerous."}, {"time": 4448, "text": "Level one is not dangerous."}, {"time": 4449, "text": "Level two is longterm disguise."}, {"time": 4452, "text": "Level two is all the things that you can do to permanently change the way you look for a long period of time so that whether you're aggressed in the street or whether someone breaks into your hotel room or whatever, it's real."}, {"time": 4464, "text": "So maybe that's, maybe you get a tattoo."}, {"time": 4467, "text": "Maybe you cut your hair short."}, {"time": 4468, "text": "Maybe you grow your hair long."}, {"time": 4469, "text": "Maybe you go bald."}, {"time": 4471, "text": "Maybe you start wearing glasses."}, {"time": 4472, "text": "Well, glasses are technically a prosthetic, but you can, if you have teeth pulled, if you gain 20 pounds, really gain 20 pounds or lose 15 pounds, whatever you might do, all of that's considered level two."}, {"time": 4485, "text": "It's designed for a longterm mission so that people believe you are who you say you are in that disguise."}, {"time": 4493, "text": "A lot of that is physical characteristics."}, {"time": 4495, "text": "What about what actors do, which is the..."}, {"time": 4501, "text": "Method acting."}, {"time": 4502, "text": "Yeah, the method acting, sort of developing a backstory in your own mind, and then you start pretending that you host a podcast and teach at a university and then do research and so on just so that people can believe that you're not actually an agent."}, {"time": 4522, "text": "Is that part of the disguise levels or no?"}, {"time": 4524, "text": "So yes, disguise has to do with physical character traits."}, {"time": 4528, "text": "That's what a disguise is."}, {"time": 4529, "text": "What you're talking about is known as a cover legend."}, {"time": 4532, "text": "When you go undercover, what you claim to be, who you claim to be, that's called your legend, your cover legend."}, {"time": 4538, "text": "Every disguise would theoretically have its own cover legend."}, {"time": 4542, "text": "Even if it's just to describe why you're wearing what you're wearing, it's all a cover."}, {"time": 4547, "text": "So the method acting, this is a fantastic point that I don't get to make very often, so I'm glad you asked."}, {"time": 4552, "text": "The difference between CIA officers in the field and method actors is that method actors try to become the character."}, {"time": 4559, "text": "They try to shed all vestiges of who they really are and become the character, and that's part of what makes them so amazing, but it's also part of what makes them mentally unstable over long periods of time."}, {"time": 4573, "text": "It's part of what feeds their depression, their anxiety, their personal issues, because they lose sight of who they really are."}, {"time": 4578, "text": "Field officers don't get that luxury."}, {"time": 4580, "text": "We have to always, always remember we are a covert CIA intelligence officer collecting secrets in the field."}, {"time": 4588, "text": "We have to remember that."}, {"time": 4589, "text": "So we're taught a very specific skill to compartmentalize our true self separately, but make that true self the true identity."}, {"time": 4602, "text": "So then we can still live and act and effectively carry out our cover legend without ever losing sight, without ever losing that compass true north of who we actually are."}, {"time": 4613, "text": "And then we can compartmentalize and secure all the information that we need, retain it, remember it, but then return to our true self when we get back to a position of safety."}, {"time": 4623, "text": "Is it possible to do that?"}, {"time": 4624, "text": "So I just have kind of anecdotal evidence for myself."}, {"time": 4629, "text": "I really try to be the exact same person in all conditions, which makes it very easy."}, {"time": 4635, "text": "Like if you're not lying, it makes it very easy to, first of all, to exist, but also to communicate a kind of authenticity and a genuineness, which I think is really important."}, {"time": 4646, "text": "Like trust and integrity around trust is extremely important to me."}, {"time": 4650, "text": "It's the thing that opens doors and maintains relationships."}, {"time": 4654, "text": "And I tend to think, like when I was in Ukraine, so many doors just opened to the very high security areas and everywhere else too."}, {"time": 4666, "text": "Like I've just interacted with some incredible people without any kind of concerns."}, {"time": 4671, "text": "You know, who is this guy?"}, {"time": 4672, "text": "Is he gonna spread it?"}, {"time": 4674, "text": "You know, all that kind of stuff."}, {"time": 4675, "text": "And I tend to believe that you're able to communicate a trustworthiness somehow if you just are who you are."}, {"time": 4685, "text": "And I think, I suppose method actors are trying to achieve that by becoming something and they can, I just feel like there is very subtle cues that are extremely difficult to fake."}, {"time": 4697, "text": "Like you really have to become that person, be that person."}, {"time": 4702, "text": "But you're saying as a CIA agent, you have to remember that you are there to collect information."}, {"time": 4709, "text": "Do you think that gives you away?"}, {"time": 4711, "text": "So one of the flaws in your argument is that you keep referring to how you feel."}, {"time": 4718, "text": "I feel this, I feel that, I feel like this, I feel like that."}, {"time": 4721, "text": "That feeling is a predictable character trait of all human beings."}, {"time": 4726, "text": "It's a pink matter, we call it pink matter."}, {"time": 4729, "text": "It's a cognitive trait."}, {"time": 4732, "text": "You are not alone in trusting your feelings."}, {"time": 4735, "text": "All people trust their feelings."}, {"time": 4736, "text": "But because what CIA teaches us is how to systematically create artificial relationships where we're the one in control of the source that is giving us intelligence."}, {"time": 4748, "text": "And the core element to being able to control a relationship is understanding the pink matter truth of feelings."}, {"time": 4756, "text": "What all people feel becomes their point of view on what reality is."}, {"time": 4761, "text": "So when you understand and you learn how to manipulate what people feel, then you can essentially direct them to feel any way you want them to feel."}, {"time": 4768, "text": "So if you want them to feel like they can trust you, you can make them feel that way."}, {"time": 4772, "text": "If you want them to feel like you're a good guy or a bad guy, if you want them to feel like they should give you secrets even though their government tells them not to, you can do that."}, {"time": 4780, "text": "There are men who make women feel like they love them and just so that the woman will sleep with them."}, {"time": 4785, "text": "There are women who make men feel like they love them just so the men will give them their money."}, {"time": 4789, "text": "Manipulation is a core behavioral trait of all the human species because we all understand to some level how powerful feelings are, but feelings are not the same thing as logical, rational thought."}, {"time": 4801, "text": "They're two different sides of the brain."}, {"time": 4803, "text": "What CIA teaches us how to do is systematically tap into the right side, emotional side of the brain so that we can quickly get past all of the stuff you were just saying, all of the, well, don't you have to be convincing and don't you have to really know your story and don't you have to be able to defend it?"}, {"time": 4820, "text": "Don't you have to have authenticity and don't you have to have genuine feelings?"}, {"time": 4825, "text": "Yes, all of those things are true if you're having a genuine relationship, but in an artificial relationship, there's ways to bypass all of that and get right to the heart of making someone feel comfortable and safe."}, {"time": 4835, "text": "I guess the question I'm asking and the thing I was implying is that creating an artificial relationship is an extremely difficult skill to accomplish the level, like how good I am at being me and creating a feeling in another person that I create."}, {"time": 4856, "text": "For you to do that artificially, that's gotta be, you gotta be, my sense is you gotta be really damn good at that kind of thing."}, {"time": 4863, "text": "I would venture to say, I mean, I don't know how to measure how difficult the thing is, but especially when you're communicating with people whose job depends on forming trusting relationships, they're gonna smell bullshit."}, {"time": 4881, "text": "And to get past that bullshit detector is tough."}, {"time": 4887, "text": "It's a tough skill."}, {"time": 4889, "text": "So I would say that."}, {"time": 4890, "text": "Or maybe I'm wrong actually on that."}, {"time": 4892, "text": "I would say that once you understand the system, it's not that hard."}, {"time": 4897, "text": "But I would also say that to your exact point, you are right that people smell bullshit."}, {"time": 4902, "text": "People smell bullshit."}, {"time": 4905, "text": "If you come in smelling like goat shit, you still smell like shit, but you don't smell like bullshit."}, {"time": 4911, "text": "So they don't count you out right away."}, {"time": 4913, "text": "And if you come in smelling like rotten tomatoes or if you come in smelling like lavender or if you come in smelling like vanilla or if you come in without any smell at all, all that matters is that you don't smell like bullshit."}, {"time": 4925, "text": "Here's the thing that's one of the secret sauces of CIA."}, {"time": 4930, "text": "When you look and act like a spy, people think you're a spy."}, {"time": 4934, "text": "If you look and act in any other way, you know what they never ever think you are?"}, {"time": 4939, "text": "A spy."}, {"time": 4941, "text": "They might think you're an idiot."}, {"time": 4942, "text": "They might think you're trailer trash."}, {"time": 4944, "text": "They might think that you're a migrant worker, but they never think you're a spy."}, {"time": 4950, "text": "And that lesson in everyday life is immensely powerful."}, {"time": 4955, "text": "If you're trying to take your boss's job, as long as you don't ever look like the employee who's trying to take the boss's job, the boss is focused on all the employees who are trying to take his job."}, {"time": 4966, "text": "Everybody's prioritizing whether they know it or not."}, {"time": 4968, "text": "The goal is to just not be the one that they're targeting."}, {"time": 4971, "text": "Target them without them knowing you're targeting them."}, {"time": 4974, "text": "So people just, when they meet you, they put you in a bin."}, {"time": 4978, "text": "And if you want to avoid being put in a particular bin, just don't act like the person that would be, just show some kind of characteristics that bin you in some other way."}, {"time": 4988, "text": "You have to be in a bin."}, {"time": 4989, "text": "Just choose the bin."}, {"time": 4992, "text": "So you, knowing these methods, when you talk to people, especially in civilian life, how do you know who's lying to you and not?"}, {"time": 5002, "text": "That gets to be more into the trained skill side of things."}, {"time": 5006, "text": "There's body cues, there's micro expressions."}, {"time": 5009, "text": "I'm not a big fan of, I don't believe that micro expressions alone do anything."}, {"time": 5013, "text": "I also don't believe that micro expressions without an effective baseline do anything."}, {"time": 5017, "text": "So don't for a second think that I'm, all the people out there pitching that you can tell if someone's lying to you just by looking at their face, it's all baloney."}, {"time": 5026, "text": "In my world, that's baloney."}, {"time": 5027, "text": "Like the way you move your eyes or something like that."}, {"time": 5029, "text": "Without knowing a baseline, without knowing."}, {"time": 5033, "text": "Then you actually don't know."}, {"time": 5034, "text": "And an individual's baseline is based on education, culture, life experience, you name it, right?"}, {"time": 5038, "text": "So this is huge."}, {"time": 5040, "text": "But when you combine facial expressions with body movements, body language, nonverbal cues, and you add on top of that effective elicitation techniques that you are in control of, now you have a more robust platform to tell if someone's lying to you."}, {"time": 5056, "text": "So there's like a set of like interrogation trajectories you can go down that can help you figure out a person."}, {"time": 5066, "text": "Technically they're interview, interview concepts."}, {"time": 5071, "text": "Because an interrogation, an interrogation is something very different than an interview."}, {"time": 5074, "text": "And in the world of professionals, an interrogation is very different."}, {"time": 5078, "text": "The nature of how relaxed the thing is or what?"}, {"time": 5080, "text": "So in an interrogation, there's a clear pattern of dominance."}, {"time": 5084, "text": "There's no equality."}, {"time": 5085, "text": "Also, there's no escape."}, {"time": 5087, "text": "You are there until the interrogator is done with you."}, {"time": 5089, "text": "Anybody who's ever been reprimanded by mom and dad knows what an interrogation feels like."}, {"time": 5093, "text": "Anybody who's ever been called into the principal's office or the boss's office, that's what interrogation feels like."}, {"time": 5097, "text": "You don't leave until the boss says you can leave."}, {"time": 5099, "text": "And you're there to say, it's to answer questions the boss asks questions."}, {"time": 5102, "text": "An interview is an equal exchange of ideas."}, {"time": 5105, "text": "You are in control of this interview, for sure."}, {"time": 5109, "text": "But if we were having coffee, I could take control if I wanted to take control."}, {"time": 5113, "text": "If I wanted to ask you personal questions, I would."}, {"time": 5115, "text": "If I wanted to talk to you about your background, I could."}, {"time": 5117, "text": "Why am I in control of this interview exactly?"}, {"time": 5119, "text": "Because the person in control is the person asking questions."}, {"time": 5122, "text": "I'm sitting here, as you've spoken about, my power here is I'm the quiet one listening."}, {"time": 5131, "text": "Guess where this conversation goes?"}, {"time": 5133, "text": "Anywhere you choose to take it, because you're the one asking questions."}, {"time": 5136, "text": "Every time I answer a question, I am creating a pattern of obedience to you, which subliminally, subconsciously, makes me that much more apt to answer your questions."}, {"time": 5145, "text": "Of course, you can always turn and start asking me questions."}, {"time": 5148, "text": "But you're saying that through conversation, you can call it interviewing, you can start to see cracks in the story of the person and the degree to which they exaggerate or lie or to see how much they can be trusted, that kind of stuff."}, {"time": 5173, "text": "What I'm saying is that through a conversation, you develop a baseline."}, {"time": 5176, "text": "Even just in the first part of our conversation, I've been able to create some baseline elements about you."}, {"time": 5183, "text": "You've been able to create baseline elements about me."}, {"time": 5185, "text": "Maybe they're just not a friend of mine."}, {"time": 5187, "text": "From those baselines, now we can push through more intentional questions to test whether or not the person is being truthful because they're operating within their baseline, or if you are triggering sensitivities outside of their baseline, and then you can start to see their tells."}, {"time": 5206, "text": "Yeah, baseline, even the tells, right?"}, {"time": 5209, "text": "The eye contact."}, {"time": 5210, "text": "You've probably already formed a baseline that I have trouble making eye contact."}, {"time": 5214, "text": "And so if you ask me difficult questions and I'm not making eye contact, maybe that's not a good signal of me lying or whatever."}, {"time": 5221, "text": "Because I always have trouble making eye contact, stuff like that."}, {"time": 5226, "text": "The majority of your eye movement is to the right?"}, {"time": 5228, "text": "Your right, my left, right?"}, {"time": 5230, "text": "Which is usually someone who's, if you ask micro expressionists, that's someone who's referencing fact."}, {"time": 5236, "text": "That's not necessarily what's happening for you because you're pulling concepts out of the air."}, {"time": 5239, "text": "So it's also a place where you reference something other than fact."}, {"time": 5242, "text": "It's a place for you to find creativity."}, {"time": 5244, "text": "So if I just thought that you were lying because you look up and to the right, I would be wrong."}, {"time": 5249, "text": "And a lot of that has to do with like habits that are formed and all those kinds of things, or maybe some right hand, left hand type of situation."}, {"time": 5255, "text": "Right eye dominance."}, {"time": 5256, "text": "Yeah, right eye dominance."}, {"time": 5257, "text": "It's gonna make you look to the right."}, {"time": 5259, "text": "Is this a science or an art?"}, {"time": 5260, "text": "It's a bit of both."}, {"time": 5261, "text": "I would say that like all good art, art is taught from a foundation of skills."}, {"time": 5267, "text": "And those skills are played, are taught in a very structured manner."}, {"time": 5273, "text": "And then the way that you use the skills after that, that's more of the artistic grace."}, {"time": 5279, "text": "So I've always called espionage an art."}, {"time": 5281, "text": "Spying is an art."}, {"time": 5283, "text": "Being able to hack human beings is an art, but it's all based in a foundation of science."}, {"time": 5288, "text": "You still have to learn how to mix the color palette and use certain brushes."}, {"time": 5291, "text": "Do you think of that as a kind of the study of human psychology?"}, {"time": 5297, "text": "Is that what a psychologist does or a psychiatrist?"}, {"time": 5300, "text": "What from this process have you learned about human nature?"}, {"time": 5306, "text": "I mean, I suppose the answer to that could be a book, but it probably will be a book."}, {"time": 5312, "text": "I'll save you that, yeah."}, {"time": 5313, "text": "But is there things that are surprising about human nature, surprising to us civilians that you could speak to?"}, {"time": 5323, "text": "Yes, one thing is extremely surprising about human nature, which is funny, because that's not the answer I would have said."}, {"time": 5330, "text": "So I'm glad that you clarified this specific question."}, {"time": 5333, "text": "The thing that's surprising about human nature is that human beings long, like in their soul, there's like a painful longing to be with other people."}, {"time": 5346, "text": "And that's really surprising, because we all wanna pretend like we're strong."}, {"time": 5351, "text": "We all wanna pretend like we're independent."}, {"time": 5354, "text": "We all wanna pretend like we are the masters of our destiny."}, {"time": 5358, "text": "But what's truly consistent in all people is this longing to commune with others like us."}, {"time": 5369, "text": "My more practical answer about what I've learned to be the truth is that human nature is predictable."}, {"time": 5376, "text": "And that predictability is what gives people an incredible advantage over other people."}, {"time": 5381, "text": "But that's not the surprising piece."}, {"time": 5383, "text": "I mean, even when CIA taught me that human nature is predictable, it just made sense."}, {"time": 5387, "text": "I was like, oh yeah, that makes sense."}, {"time": 5389, "text": "But what I never ever anticipated was no matter where I've been in the world, no matter who I've talked to, no matter what socioeconomic bracket is that longing, man, it hurts."}, {"time": 5400, "text": "Loneliness sucks, and togetherness feels good, even if you're together with someone you know isn't the right person."}, {"time": 5407, "text": "It still feels better than being alone."}, {"time": 5409, "text": "I mean, that's such a deep truth you speak to, and I could talk about that for a long time."}, {"time": 5415, "text": "There is, I mean, through these conversations in general, whether it's being recorded or not, I hunger to discover in the other person that longing."}, {"time": 5427, "text": "You strip away the other things, and then you share in the longing for that connection."}, {"time": 5432, "text": "And I particularly also have detected that in people from all walks of life, including people that others might identify as evil or hard, as completely cold, it's there."}, {"time": 5453, "text": "They've hardened themselves in their search, and who knows what dark place their brain is in, their heart is in, but that longing is still there."}, {"time": 5463, "text": "Even if it's an ember, it's there."}, {"time": 5466, "text": "It's the reason why in World War I and World War II, you know, enemy combatants still shared cigarettes on the front lines during periods of holidays or bad weather or whatever else, because that human connection, man, it triumphs over all."}, {"time": 5482, "text": "See, that's in part of what I refer to when I say love, because I feel like if political leaders and people in conflict at the small scale and the large scale were able to tune into that longing, to seek in each other that basic longing for human connection, a lot of problems could be solved."}, {"time": 5509, "text": "But of course, it's difficult, because it's a game of chicken."}, {"time": 5516, "text": "It's if you open yourself up to reveal that longing for connection with others, people can hurt you."}, {"time": 5523, "text": "Well, I would go a step farther, and I would say that taking the connection away, punishing, penalizing people by removing the connection is a powerful tool, and that's what we see."}, {"time": 5538, "text": "That's why we send people to jail."}, {"time": 5540, "text": "That's why we put economic sanctions on countries."}, {"time": 5542, "text": "That's why we ground our children and send them to their rooms."}, {"time": 5545, "text": "We are penalizing them."}, {"time": 5547, "text": "Whether we know it or not, we're using punitive damage by taking away that basic human connection, that longing for community."}, {"time": 5556, "text": "What was your recruitment process and training process and things you could speak to in the CIA?"}, {"time": 5566, "text": "As I was leaving the Air Force, all that was on my mind, I don't know what you were like at 27, but I was a total tip shit at 27."}, {"time": 5574, "text": "I'm not much better now at 42, but."}, {"time": 5577, "text": "You and me, Bill."}, {"time": 5578, "text": "Yeah, but I was like, I just wanted to be anything other than a military officer, so I was actually in the process of applying to the Peace Corps through this thing called the internet, which was still fairly rudimentary in 2007."}, {"time": 5596, "text": "I had a computer lab that we went to, and it had 10 computers in it, and you had to log in and log out, and slow internet and everything else, but anyways, I was filling out an online application to go work in the US Peace Corps."}, {"time": 5608, "text": "I wanted to grow my hair out."}, {"time": 5609, "text": "I wanted to stop wearing shoes that were shiny."}, {"time": 5613, "text": "I wanted to meet a hippie chick and have hippie babies in the wild teaching Nigerian children how to read, so that was the path I was going down, and as I filled in all of my details, there came this page that popped up, and it was this blinking red page, and it said, stop here."}, {"time": 5630, "text": "You may qualify for other government positions."}, {"time": 5633, "text": "If you're willing to put your application on hold for 72 hours, that gives us a chance to reach out to you, so again, 27 year old dipshit."}, {"time": 5642, "text": "I was like, sure, I'll put myself on hold if I might qualify for other government opportunities, and then about a day later, I got a phone call from an almost unlisted number."}, {"time": 5651, "text": "It just said 703, which was very strange to see on my flip phone at the time, just one 703 area code, and I picked it up, and it was a person from Northern Virginia asking me if I would be telling me that I was qualified for a position in national security, and if I would be interested, they'll pay for my ticket and fly me up to Langley, Virginia."}, {"time": 5675, "text": "They didn't say CIA."}, {"time": 5676, "text": "They said Langley."}, {"time": 5677, "text": "I put one on one together, and I was like, maybe this is CIA, like, how cool is this?"}, {"time": 5683, "text": "Or maybe this is all make believe, and this is totally fake, so either way, it doesn't hurt me at all to say yes."}, {"time": 5687, "text": "They already have my phone number, so yes, yes, yes, and then I remember thinking, there's no way that happened, and this isn't real, and then a day later, I got FedEx or an overnight delivery of an airplane ticket and a hotel reservation and a rental car reservation, and then I just kept doing the next thing, which I found out later on is a form of control."}, {"time": 5707, "text": "You just do the next thing that they tell you to do, and then before I knew it, I was interviewing in a nondescript building with a person who only told me their first name for a position with the National Clandestine Service."}, {"time": 5719, "text": "So you never really got a chance to think about it because there's small steps along the way, and it kind of just leads you, and maybe your personality is such that."}, {"time": 5729, "text": "That's an adventure."}, {"time": 5730, "text": "It's an adventure, and because it's one step at a time, you don't necessarily see the negative consequences of the adventure."}, {"time": 5737, "text": "You don't think about any of that."}, {"time": 5738, "text": "You're just stepping into the adventure."}, {"time": 5741, "text": "And it's easy."}, {"time": 5742, "text": "There's no work involved."}, {"time": 5743, "text": "Somebody else is doing all the work, telling me where to be and when."}, {"time": 5746, "text": "It's a lot like basic training in the military."}, {"time": 5748, "text": "Anybody who's ever been through basic training will tell you they hated the first few days, and then by the end, it was really comforting because you just did what you were told."}, {"time": 5756, "text": "They told you when to eat."}, {"time": 5757, "text": "They made the decision of what to eat, and then you just, you marched when they told you to march, shined your shoes when they told you to shine your shoes."}, {"time": 5763, "text": "Human beings love being told what to do."}, {"time": 5766, "text": "What about the training process for becoming a covert CIA agent?"}, {"time": 5774, "text": "Yeah, so the interview process is."}, {"time": 5779, "text": "Yeah, the interview process, too."}, {"time": 5781, "text": "How rigorous was that?"}, {"time": 5782, "text": "It was very rigorous."}, {"time": 5783, "text": "That was where it became difficult."}, {"time": 5786, "text": "Everything up to the first interview was easy, but there's three interviews, and some people are lucky enough to have four or five interviews if something goes wrong or something goes awry with the first few interviews."}, {"time": 5797, "text": "And again, this might be dated from what I went through, but during the interview process is when they start, they do your psychological evaluations."}, {"time": 5805, "text": "They do your, they do personality assessments."}, {"time": 5811, "text": "They do skills assessments."}, {"time": 5813, "text": "They'll start sending you back to wherever you're living with assignments, not intel assignments, but actual homework assignments."}, {"time": 5822, "text": "Write an essay about three parts of the world that you think will be most impacted in the next three to five years, or prioritize the top three strategic priorities for the United States and put it into 250 words or 2,500 words and whatever else, double spaced in this font, yada, yada, yada, like super specific stuff."}, {"time": 5842, "text": "It's kind of stressful, but it's just like going back to college again."}, {"time": 5846, "text": "So you go through all of those acts, and then you submit this stuff to some PO box that doesn't have anybody that's ever gonna respond to you, and then you hope."}, {"time": 5854, "text": "You just send it into the ether, and you hope that you sent it right."}, {"time": 5858, "text": "You hope that you wrote well enough."}, {"time": 5860, "text": "You hope that your assessment was right, whatever else it might be, and then eventually get another phone call that says, hey, we received your package."}, {"time": 5866, "text": "You've been moved to the next level of interview, and now we need you to go to this other nondescript building in this other nondescript city, and then you start meeting."}, {"time": 5875, "text": "You start sitting in waiting rooms with other groups of people who are at the same phase of interview with you, which were some of the coolest experiences that I remember still."}, {"time": 5885, "text": "One of my best friends to this day, who I don't get to talk to because he's still undercover, is a guy I met during those interview processes, and I was like, oh, we met."}, {"time": 5894, "text": "I saw what he was wearing."}, {"time": 5894, "text": "He saw what I was wearing."}, {"time": 5896, "text": "I was brown."}, {"time": 5897, "text": "So you immediately connected, and you liked the people there."}, {"time": 5900, "text": "More like we immediately judge each other, because we're all untrained."}, {"time": 5904, "text": "So he looked at me, and he was like, brown dude with crazy hair, and I was wearing, dude, I was dressed like a total ass."}, {"time": 5909, "text": "I was dressed in a clubbing shirt."}, {"time": 5912, "text": "I don't know why I thought it would be a good idea to go to a CIA interview in a clubbing shirt with my buttons unbuttoned down to here."}, {"time": 5919, "text": "And he was like, yeah, you were really, after we got in, he was like, yeah, dude, you were always really cool to talk to, but I was like, there's no way that idiot's getting in."}, {"time": 5926, "text": "And I remember looking at him and being like, dude, you were just another white guy in a black suit."}, {"time": 5930, "text": "They're not looking for you, but here you are."}, {"time": 5932, "text": "So it was just, those kinds of things were so interesting, because we were totally wrong about what CIA was looking for."}, {"time": 5936, "text": "Until you're in, you have no idea what they're looking for."}, {"time": 5939, "text": "And you're just shooting in the dark."}, {"time": 5942, "text": "Did they have you do like a lie detector test?"}, {"time": 5945, "text": "Yes, it's called a polygraph."}, {"time": 5947, "text": "Polygraph."}, {"time": 5948, "text": "How effective, just interesting, or our previous discussion, how effective are those?"}, {"time": 5952, "text": "Polygraphs are really interesting."}, {"time": 5954, "text": "So one of the things that people don't understand about polygraphs is that polygraphs aren't meant to detect a lie."}, {"time": 5959, "text": "Like they're called a lie detector, but they're not actually meant to detect a lie."}, {"time": 5963, "text": "They're built to detect variants from your physiological baseline."}, {"time": 5969, "text": "So they're essentially meant to identify sensitivities to certain types of questions."}, {"time": 5975, "text": "And then as they identify a sensitivity to a question, it gives the interviewer an additional piece of information to direct the next round of questions."}, {"time": 5983, "text": "So then from there, they can kind of see how sensitive you are to a certain level of questions."}, {"time": 5986, "text": "And your sensitivity could be a sign of dishonesty, but it could also be a sign of vulnerability."}, {"time": 5994, "text": "So the interrogator themselves, the interviewer themselves, they're the one that have to make the judgment call as to which one it is, which is why you might see multiple interviewers over the course of multiple polygraphs."}, {"time": 6005, "text": "But that's really what they're all about."}, {"time": 6007, "text": "So, I mean, outside of, they're extremely uncomfortable, like they're mentally uncomfortable, but then there's also, you sit on a pad because the pad is supposed to be able to tell like your body movements, but also like your sphincter contractions or whatever."}, {"time": 6022, "text": "So you're sitting on this pad, you're plugged in, you're strapped in, you're tied up, and it takes so much time to get in there."}, {"time": 6028, "text": "And then they start asking you questions, baseline questions at first, and then other questions from there."}, {"time": 6033, "text": "And you're just answering the best you can."}, {"time": 6035, "text": "And you never know what they're seeing and you don't know what they're doing."}, {"time": 6037, "text": "And it's really hard not to get anxious of that anyways."}, {"time": 6039, "text": "And then... Are they the whole time monitoring the readings?"}, {"time": 6042, "text": "Yeah, from like a big, they've got multiple screens and they've got just, it's all information superiority."}, {"time": 6047, "text": "They have information superiority."}, {"time": 6049, "text": "You're the idiot looking away from them or looking sideways of them and trying not to move because you're afraid that if you like have gas or if you move a little bit, it's gonna bury you from your baseline."}, {"time": 6059, "text": "And the whole time you're worried, your heart's racing and your blood pressure's increasing, which is a variance from baseline."}, {"time": 6064, "text": "So yeah, that means it's an interesting art."}, {"time": 6066, "text": "Or your baseline."}, {"time": 6068, "text": "Maybe there's some people that are just chilling the whole time and that's their baseline."}, {"time": 6072, "text": "But that's what they're doing."}, {"time": 6074, "text": "They're establishing a baseline."}, {"time": 6074, "text": "I mean, I guess that means the polygraph is a skill that you develop to do it well."}, {"time": 6082, "text": "So when people talk about beating a lie detector, it's not that they're telling an effective lie."}, {"time": 6086, "text": "That's not hard."}, {"time": 6087, "text": "It's not hard to tell a lie to an interviewer."}, {"time": 6091, "text": "And the interviewer doesn't care if you're being honest or not honest about a topic."}, {"time": 6094, "text": "What they're looking for is sensitivity."}, {"time": 6096, "text": "If they see no sensitivity, that's a big sign for them."}, {"time": 6100, "text": "That's a big sign that you're probably a pathological liar."}, {"time": 6103, "text": "If you show sensitivity to many things, then that's a sign that you're probably an anxious person and they can still reset their baseline because they can tell how your anxiety is increasing in 15 minute increments."}, {"time": 6116, "text": "It's a unique skill."}, {"time": 6118, "text": "I mean, a really good polygrapher is immensely valuable."}, {"time": 6122, "text": "But yeah, it's the misnomers, the misconceptions about polygraphs are vast."}, {"time": 6127, "text": "You also mentioned personality tests."}, {"time": 6130, "text": "So how effective are personality tests?"}, {"time": 6134, "text": "One for the hiring process, but also for understanding a human being."}, {"time": 6137, "text": "So personality is extremely important for understanding human being."}, {"time": 6140, "text": "And I would say that there's a thousand different ways of looking at personality."}, {"time": 6143, "text": "The only one that I count with any significance is the MBTI."}, {"time": 6148, "text": "And the MBTI is what all the leading spy agencies around the world use as well."}, {"time": 6152, "text": "Well, that's kind of interesting to hear."}, {"time": 6154, "text": "So there's been criticisms of that kind of test."}, {"time": 6156, "text": "There have been criticisms for a long time."}, {"time": 6158, "text": "Yeah, and you think there's value."}, {"time": 6161, "text": "And there's a few reasons why, right?"}, {"time": 6163, "text": "So first, MBTI makes the claim that your core personality doesn't change over time."}, {"time": 6169, "text": "And that's how it's calibrated."}, {"time": 6171, "text": "And one of the big arguments is that people say that your personality can change over time."}, {"time": 6175, "text": "Now, in my experience, the MBTI is exactly correct."}, {"time": 6179, "text": "Your core personality does not change because your core personality is defined as your personality when all resources are removed."}, {"time": 6188, "text": "So essentially, your emergency mode, your dire conditions, that is your core personality."}, {"time": 6195, "text": "We can all act a little more extroverted."}, {"time": 6198, "text": "We can all be a little more empathetic when we have tons of time and money and patience."}, {"time": 6205, "text": "When you strip away all that time, money, and patience, how empathetic are you?"}, {"time": 6208, "text": "How much do you like being around other people?"}, {"time": 6211, "text": "How much do you like being alone?"}, {"time": 6213, "text": "Do you make judgments or do you analyze information?"}, {"time": 6217, "text": "That's what's so powerful about MBTI is it's talking about what people are like when you strip away resources."}, {"time": 6222, "text": "And then because it's so consistent, it's also only four codes."}, {"time": 6226, "text": "It's super easy to be able to assess a human being through a dialogue, through a series of conversations, to be able to hone in with high accuracy what is there for letter code."}, {"time": 6240, "text": "There's only 16 options and it becomes extremely valuable."}, {"time": 6244, "text": "Is it perfectly precise and does everybody do it the same?"}, {"time": 6248, "text": "I mean, those things are, the answers to those are no, but is it operationally useful in a short period of time?"}, {"time": 6255, "text": "That is a resoundingly powerful yes."}, {"time": 6258, "text": "Yeah, I just, I only know, I think the first letter, it's introverted and extroverted, right?"}, {"time": 6263, "text": "I've taken the test before, just like a crude version of the test and that's the same problem you have with IQ tests."}, {"time": 6270, "text": "There's the right thorough way of doing it and there's like fun internet way."}, {"time": 6274, "text": "And do you mind sharing what your personality?"}, {"time": 6282, "text": "My type index?"}, {"time": 6284, "text": "I'm an ENTP, that's an extrovert, intuitive, perceiver, thinker, ENT, thinker, P, perceiver."}, {"time": 6294, "text": "My wife is an ISFJ, which is the polar opposite of me."}, {"time": 6299, "text": "E, I'm extroverted, she's introverted, I'm an intuitor, she's a sensor, I'm a thinker, she's a feeler, I'm a perceiver, she's a judger."}, {"time": 6307, "text": "Is there good science on like longterm successful relationships in terms of the dynamics of that, the 16, I wonder if there's good data on this."}, {"time": 6374, "text": "So in terms of compressed representation of another human being, you can't do much better than those four letters."}, {"time": 6381, "text": "I don't believe you can do much better."}, {"time": 6383, "text": "In my experience, I have not seen anything better."}, {"time": 6386, "text": "Yeah, it is kind of, it's difficult to realize that there is a core personality or to the degree that's true, it seems to be true."}, {"time": 6395, "text": "It's even more difficult to realize that there is a stable, at least the science says so, a stable, consistent intelligence, unfortunately, you know, the G factor that they call, that if you do a barrage of IQ tests, that's going to consistently represent that G factor."}, {"time": 6417, "text": "And we're all born with that, we can't fix it."}, {"time": 6419, "text": "And that defines so much of who we are."}, {"time": 6423, "text": "I don't see it as sad, because it's, for me, the faster you learn it, the faster you learn what your own sort of natural strengths and weaknesses are, the faster you get to stop wasting time on things that you're never gonna be good at, and you get to double down on the things that you're already naturally skilled or interested in."}, {"time": 6443, "text": "So there's always a silver lining to a cloud."}, {"time": 6446, "text": "But I know now that I will never be a ballerina or a ballerino, I know that I'll never be an artist, I'll never be a musician, I'll never be any of those things."}, {"time": 6455, "text": "And when I was 18, that might've made me sad, but now at 42, I'm like, well, shit, awesome."}, {"time": 6460, "text": "I can go be something else good instead of always being bad."}, {"time": 6464, "text": "You're not gonna be a ballerina, ballerino."}, {"time": 6466, "text": "Because I'm not graceful."}, {"time": 6468, "text": "And you've learned this through years of experience."}, {"time": 6472, "text": "Well, I don't know if there's an MBTI equivalent for grace of movement."}, {"time": 6476, "text": "I think it's called S sensor."}, {"time": 6479, "text": "Yeah, because a sensor is someone who's able to interact with the world around them through their five senses very effectively."}, {"time": 6486, "text": "Like if you talk to dancers, dancers can actually feel the grace in all of their muscles."}, {"time": 6490, "text": "They know what position their finger is in."}, {"time": 6493, "text": "I don't have any idea."}, {"time": 6494, "text": "I don't know what position my feet are in right now."}, {"time": 6495, "text": "I had to look to make sure I actually feel the floor right."}, {"time": 6498, "text": "Yeah, I definitely have."}, {"time": 6500, "text": "Oh, that's good to know."}, {"time": 6501, "text": "So I don't, I'm not a dancer, but I do have that."}, {"time": 6505, "text": "You're a musician, man."}, {"time": 6507, "text": "Well, the music, I don't know if that's for sure."}, {"time": 6509, "text": "Yeah, that's true that there is that physical component, but I think deeper, cause there's a technical aspect to that."}, {"time": 6515, "text": "That's just like, it's less about feel, but I do know jujitsu and grappling I've done all my life."}, {"time": 6523, "text": "I don't, you know, there's some people who are clumsy and they drop stuff all the time."}, {"time": 6527, "text": "They run into stuff."}, {"time": 6529, "text": "I don't, I don't, first of all, I don't know how that happens, but to me, I just have an awareness of stuff."}, {"time": 6534, "text": "Like if there's a little orientation."}, {"time": 6536, "text": "Yeah, like, like I know that there's a small object I have to step over and I have a good sense of that."}, {"time": 6543, "text": "It's so, it's so interesting."}, {"time": 6544, "text": "Yeah, you're just like born with that or something."}, {"time": 6546, "text": "My wife is brilliant and she still walks into doors."}, {"time": 6550, "text": "I mean, she'll walk in a doorway."}, {"time": 6551, "text": "She'll bang her knee on the same wall that's been there for the last 50 years."}, {"time": 6555, "text": "It's for some reason, really hilarious."}, {"time": 6557, "text": "That's good for me."}, {"time": 6560, "text": "You've been asked, I think on Reddit, are there big secrets that you know that could lend you and our country in terrible trouble if you came out to the public and you answered, yes, I wish I could forget them."}, {"time": 6572, "text": "So let me ask you just about secrecy in general."}, {"time": 6576, "text": "Are these secrets or just other secrets, ones that the public will never know or will it come out in 10, 20, 50 years?"}, {"time": 6587, "text": "I guess the deeper question is, what is the value of secrecy and transparency?"}, {"time": 6593, "text": "The standard classification for all human intelligence operations is something called two five X two, 25 by two."}, {"time": 6603, "text": "So 50 years, 25 years times two years or times two rounds."}, {"time": 6607, "text": "So in essence, anything that I've seen has the first chance of becoming public domain, declassified after 50 years, unless there's some congressional requirement for it to be reviewed and assessed earlier."}, {"time": 6622, "text": "So by then, I'll be 80 something years old or potentially dead, which is either way."}, {"time": 6628, "text": "That's when it can come out according to its typical classification."}, {"time": 6634, "text": "The value of secrets I have seen is that secrets create space."}, {"time": 6644, "text": "Secrets give opportunity for security."}, {"time": 6648, "text": "They give opportunity for thinking."}, {"time": 6650, "text": "They give space and space is an incredibly advantageous thing to have."}, {"time": 6655, "text": "If you know something somebody else doesn't know, even if it's just 15 or 20 minutes different, you can direct, you can change the course of fate."}, {"time": 6662, "text": "So I find secrets to be extremely valuable, extremely useful."}, {"time": 6667, "text": "Even at the place where secrets are being kept from a large mass, part of what all Americans need to understand is that one of the trade offs to building a system of government that allows us to be first world and wealthy and secure and successful, one of the trade offs is that we have given up a great deal of personal freedom."}, {"time": 6692, "text": "And one of the personal freedoms that we give up is the freedom of knowing what we wanna know."}, {"time": 6699, "text": "You get to know what the government tells you, you get to know what you need to know or what you've learned yourself, but you don't get to know secrets."}, {"time": 6707, "text": "People who do get to know secrets know them for a reason."}, {"time": 6709, "text": "That's why it's called a need to know."}, {"time": 6711, "text": "How difficult is it to maintain secrecy?"}, {"time": 6714, "text": "It's surprisingly difficult as technology changes."}, {"time": 6718, "text": "It's also surprisingly difficult as our culture becomes one where people want notoriety."}, {"time": 6726, "text": "People wanna be the person who breaks the secret."}, {"time": 6730, "text": "25 years ago, 40 years ago, that wasn't the case."}, {"time": 6733, "text": "There was a time in the United States where if someone gave you a secret, it was a point of personal honor not to share the secret."}, {"time": 6740, "text": "Now we're in a place where someone tells you a secret, like that could turn into a Twitter post that gets you a bunch of thumbs up and a bunch of likes or whatever else."}, {"time": 6747, "text": "An opportunity."}, {"time": 6748, "text": "So the value of secrets has changed."}, {"time": 6751, "text": "And now there's almost a greater value on exposing secrets than there is on keeping secrets."}, {"time": 6756, "text": "That makes it difficult to keep secrets, especially when technology is going in the same direction."}, {"time": 6760, "text": "Yeah, where is the line?"}, {"time": 6763, "text": "And by the way, I'm one of those old school people with the secrets."}, {"time": 6766, "text": "I think it's a karma thing."}, {"time": 6771, "text": "Again, back to the trust."}, {"time": 6772, "text": "I think in the short term you can benefit by sharing a secret."}, {"time": 6777, "text": "But in the long term, if people know they can trust you, like the juicy of the secret, it's a test of sorts."}, {"time": 6785, "text": "If they know you can keep that secret, that means you're somebody that could be trusted."}, {"time": 6790, "text": "And I believe that not just effectiveness in this life, but happiness in this life is informing a circle of people you can trust."}, {"time": 6798, "text": "Right, we're taught that secrets and lies are similar in that they have a limited shelf life."}, {"time": 6804, "text": "If you treat them like food, secrets and lies have a very limited shelf life."}, {"time": 6809, "text": "So if you cash in on them while they're still fresh, you beat them before they spoil."}, {"time": 6815, "text": "You get to take advantage of them before they spoil."}, {"time": 6818, "text": "However, trust has no limit to its shelf life."}, {"time": 6823, "text": "So it's almost like you're trading a short term victory and losing a long term victory."}, {"time": 6828, "text": "It's always better to keep the secret."}, {"time": 6830, "text": "It's always better to let the lie live because it will eventually come to light from somebody else, not from you, because it already has a limited shelf life."}, {"time": 6839, "text": "But what you win in exchange for not being the one that cashed in on the secret is immense trust."}, {"time": 6847, "text": "Let me ask you about lying and trust and so on."}, {"time": 6852, "text": "So I don't believe I've been contacted by or interacted with the CIA, the MI6, the FSB, Mossad or any other intelligence agency."}, {"time": 6862, "text": "I'm kind of offended, but would I know if I was?"}, {"time": 6869, "text": "So from your perspective."}, {"time": 6871, "text": "No, you would not know if you were."}, {"time": 6873, "text": "For sure you've been on their radar."}, {"time": 6875, "text": "Absolutely, you've got a file."}, {"time": 6876, "text": "You've got a dossier somewhere."}, {"time": 6878, "text": "Why would I be on their radar?"}, {"time": 6879, "text": "Because you're a."}, {"time": 6880, "text": "Who's interesting?"}, {"time": 6881, "text": "It's not necessarily that you are interesting to someone as a foreign asset or an intelligence collection source, but your network is extremely interesting."}, {"time": 6894, "text": "The networks are important too."}, {"time": 6895, "text": "Correct, if someone had access to, if someone was able to clone your phone, every time you cross a border, you go through some sort of security."}, {"time": 6904, "text": "If you've ever been pulled into secondary and separated from your bag, that's exactly when and how people clone computers."}, {"time": 6910, "text": "They clone phones, they make whatever, photocopies of your old school planner, whatever it might be."}, {"time": 6918, "text": "But for sure you are an intelligence target."}, {"time": 6923, "text": "It just may be that you're not suitable to be a person who reports foreign intelligence."}, {"time": 6928, "text": "We've got to understand that all people are potential sources of valuable information to the national security infrastructure of our host country and any country that we visit."}, {"time": 6938, "text": "Someone like you with your public footprint, with your notoriety, with your educational background, with your national identifications becomes a viable and valuable target of information."}, {"time": 6950, "text": "Yeah, so to speak to that, I take security pretty seriously, but not to the degree that it runs my life, which I'm very careful about."}, {"time": 6965, "text": "That's good, I'm glad to hear that."}, {"time": 6967, "text": "So the moment you start to think about germs, right?"}, {"time": 6971, "text": "Like you start to freak out and you become sort of paralyzed by the stress of it."}, {"time": 6981, "text": "If you think about all the things that could hurt you in this world and all the risk you could take, it can overwhelm your life."}, {"time": 6989, "text": "That said, the cyber world is a weird world because it doesn't have the same."}, {"time": 6996, "text": "I know not to cross the street without looking each way because there's a physical intuition about it."}, {"time": 7001, "text": "I'm not sure, I'm a computer science guy, so I have some intuition, but the cyber world, it's really hard to build up an intuition of what is safe and not."}, {"time": 7013, "text": "I've seen a lot of people just logging out of your devices all the time, like regularly."}, {"time": 7019, "text": "Just like that physical access step is a lot of people don't take."}, {"time": 7023, "text": "I can just like walk in into the offices of a lot of CEOs and it's like everything's wide open for physical access of those systems, which is kind of incredible for somebody, that sounds really shady, but it's not."}, {"time": 7038, "text": "I've written key loggers, like things that record everything you type in the mouse you move."}, {"time": 7043, "text": "And like I did that for, during my PhD, I was recording everything you do on your device and everything you do on your computer."}, {"time": 7053, "text": "People sign up to the study, they willingly do this to understand behavior."}, {"time": 7057, "text": "I was trying to use machine learning to identify who you are based on different biometric and behavioral things, which allows me to study human behavior and to see which is uniquely identifiable."}, {"time": 7069, "text": "And the goal there was to remove the need for a password."}, {"time": 7073, "text": "But how easy it is to write a thing that logs everything you type."}, {"time": 7078, "text": "I was like, wait a minute, like I can probably get a lot of people in the world to run this for me."}, {"time": 7084, "text": "I can then get all of their passwords."}, {"time": 7086, "text": "I mean, you could do so much, like I can run the entirety of the CIA from just myself."}, {"time": 7095, "text": "If I was, and I imagine there's a lot of really good hackers like that out there, much better than me."}, {"time": 7102, "text": "So I tried to prevent myself from being all the different low hanging fruit attack vectors in my life."}, {"time": 7109, "text": "I try to make it difficult to be that."}, {"time": 7113, "text": "But then I'm also aware that there's probably people that are like five steps ahead."}, {"time": 7120, "text": "What I always advocate is the low hanging fruit is what keeps you from being a target of opportunity."}, {"time": 7126, "text": "Because you're half assed hackers, you're lazy hackers, you're unskilled hackers."}, {"time": 7133, "text": "They're looking for low hanging fruit."}, {"time": 7134, "text": "They're looking for the person who gets the Nigeria email about how you could be getting $5 million if you just give me your bank account."}, {"time": 7141, "text": "That's what they're looking for."}, {"time": 7143, "text": "The thing that's scary is that if you're not a target of opportunity, if you become a intentional target, then there's almost nothing you can do."}, {"time": 7151, "text": "Because once you become an intentional target, then your security apparatus, they will create a dedicated customized way vector of attacking your specific security apparatus."}, {"time": 7167, "text": "And because security is always after, right?"}, {"time": 7170, "text": "There's always, there's the leading advantage and the trailing advantage."}, {"time": 7174, "text": "When it comes to attacks, the leader always has the advantage because they have to create the attack before anybody else can create a way to protect against the attack."}, {"time": 7184, "text": "So the attack always comes first and that means they always have the advantage."}, {"time": 7187, "text": "You are always stuck just leaning on, this is the best security that I know of."}, {"time": 7192, "text": "Meanwhile, there's always somebody who can create a way of attacking the best security out there."}, {"time": 7197, "text": "And once they win, they have a monopoly."}, {"time": 7199, "text": "They have all that time until a new defensive countermeasure is deployed."}, {"time": 7204, "text": "Yeah, I tend to think exactly as you said, that the long hanging fruit protects against like, yeah, crimes of opportunity."}, {"time": 7211, "text": "And then I assume that people can just hack in if they really want."}, {"time": 7216, "text": "Think about how much anxiety we would be able to solve if everybody just accepted that."}, {"time": 7221, "text": "Well, there's several things you do."}, {"time": 7222, "text": "First of all, to be honest, it just makes me, it keeps me honest."}, {"time": 7228, "text": "Not to be a douchebag or like, not, yeah, to assume everything could be public."}, {"time": 7239, "text": "And so don't trade information that could hurt people if it was made public."}, {"time": 7246, "text": "So I try to do that."}, {"time": 7247, "text": "And the thing I try to make sure is I, like Home Alone style, try to."}, {"time": 7254, "text": "Booby trap."}, {"time": 7255, "text": "I really would like to know if I was hacked."}, {"time": 7259, "text": "And so I try to assume that I will be hacked and detect it."}, {"time": 7266, "text": "Have a tripwire or something."}, {"time": 7267, "text": "Yeah, a tripwire through everything."}, {"time": 7270, "text": "And not paranoid tripwise, just like open door."}, {"time": 7273, "text": "But I think that's probably the future of life on this earth is you're going, like everybody of interest is going to be hacked."}, {"time": 7281, "text": "That hopefully inspires, now this is outside of company."}, {"time": 7285, "text": "These are individuals."}, {"time": 7285, "text": "I mean, there is, of course, if you're actually operating, like I'm just a, who am I?"}, {"time": 7291, "text": "I'm just a scientist person, podcasting person."}, {"time": 7296, "text": "So if I was actually running a company or was an integral part of some kind of military operation, then you probably have to have an entire team that's now doing that battle of trying to be ahead of the best hackers in the world that are attacking."}, {"time": 7317, "text": "But that requires a team that full time is their focus."}, {"time": 7321, "text": "And then you still get in trouble."}, {"time": 7324, "text": "So what I've seen as the norm, well, what I've seen is the cutting edge standard for corporations and the ultra wealthy and even intelligence organizations is that we have tripwires."}, {"time": 7339, "text": "It's better if you can't prevent from being hacked."}, {"time": 7342, "text": "The next best thing is to know as soon as you get hacked because then you can essentially terminate all the information."}, {"time": 7350, "text": "If you know it fast enough, you can just destroy the information."}, {"time": 7352, "text": "This is what the ultra wealthy do."}, {"time": 7354, "text": "They have multiple phones."}, {"time": 7355, "text": "So as soon as one phone gets hacked, the tripwire goes off."}, {"time": 7358, "text": "The operating system is totally deleted along with all data on the phone."}, {"time": 7361, "text": "And a second phone is turned on with a whole new separate set of metadata."}, {"time": 7367, "text": "And now for them, there's no break in service."}, {"time": 7369, "text": "It's just, oh, this phone went black."}, {"time": 7371, "text": "It's got a warning on it that says it was hacked."}, {"time": 7374, "text": "So trash it because they don't care about the price of the phone."}, {"time": 7376, "text": "Pick up the next phone, and we move on."}, {"time": 7378, "text": "That's the best thing that you can do essentially outside of trying to out hack the hackers."}, {"time": 7384, "text": "And then even in your intelligence and military worlds where cyber warfare is active, the people who are aggressing are not trying to create aggression that beats security."}, {"time": 7396, "text": "They're trying to find aggressive techniques, offensive techniques that have no security built around them yet."}, {"time": 7403, "text": "Because it's too cost and time intensive to protect against what you know is coming, it's so much more efficient and cost effective to go after new vectors."}, {"time": 7412, "text": "So it just becomes like, it becomes almost a silly game of your neighbor gets a guard dog."}, {"time": 7421, "text": "So you get a bigger guard dog."}, {"time": 7423, "text": "And then your neighbor gets a fence."}, {"time": 7425, "text": "So you're just constantly outdoing each other."}, {"time": 7426, "text": "It's called the security paradigm."}, {"time": 7428, "text": "People just, they just one up each other because it's never worth it to just get to the same level."}, {"time": 7433, "text": "You're always trying to outdo each other."}, {"time": 7434, "text": "Yeah, then maybe like banks have to fight that fight, but not everybody can."}, {"time": 7441, "text": "So you're saying I operated at the state of the art with the trip wires."}, {"time": 7444, "text": "This is good to know."}, {"time": 7444, "text": "Absolutely, man."}, {"time": 7446, "text": "And also just not using anybody else's services, doing everything myself."}, {"time": 7452, "text": "So that's harder to figure out what the heck this person is doing."}, {"time": 7455, "text": "Because if I'm using somebody else's service, like I did with QNAP, I have a QNAP NAS I use for cold storage of unimportant things, but a large videos."}, {"time": 7467, "text": "And I don't know if you know, but QNAP is a company that does NAS storage devices, and they got hacked."}, {"time": 7474, "text": "And everybody that didn't update as of a week ago from the point of the zero day hack, everybody got hacked."}, {"time": 7482, "text": "It's several thousand machines, and they asked, you can get your data back if you pay, I forget what it was, but it was, it was about a couple thousand dollars."}, {"time": 7495, "text": "And QNAP can get all the data back for their customers if they pay, I think, two million dollars."}, {"time": 7501, "text": "But that came from me relying on the systems of others for security."}, {"time": 7505, "text": "I assumed this company would have their security handled, but then that was a very valuable lesson to me."}, {"time": 7513, "text": "I now have layers of security and also an understanding which data is really important, which is somewhat important, which is not that important, and layering that all together."}, {"time": 7526, "text": "So just so you know, the US government, the military, woke up to that exact same thing about two years ago."}, {"time": 7531, "text": "It's still very new."}, {"time": 7533, "text": "I mean, they were sourcing, take night vision goggles, for example."}, {"time": 7537, "text": "They were sourcing components and engineering and blueprints for night vision goggles from three, four, five different subcontractors all over the country, but they never asked themselves what the security status was of those subcontractors."}, {"time": 7550, "text": "So fast forward a few years, and all of a sudden, they start getting faulty components."}, {"time": 7557, "text": "They start having night vision goggles that don't work."}, {"time": 7559, "text": "They start having supply chain issues where they have to change their provider, and the army doesn't know that the provider is changing."}, {"time": 7567, "text": "I mean, this is a strategy."}, {"time": 7569, "text": "The idea of going through third party systems is identifying the vulnerability in the supply chain."}, {"time": 7575, "text": "That's a savvy offensive practice for more than just cyber hackers."}, {"time": 7584, "text": "Let me ask you about physical hacking."}, {"time": 7586, "text": "So I'm now, like I'm an introvert, so I'm paranoid about all social interaction, but how much truth is there?"}, {"time": 7595, "text": "It's kind of a funny question."}, {"time": 7597, "text": "How suspicious should I be when I'm traveling in Ukraine or different parts of the world when an attractive female walks up to me and shows any kind of attention?"}, {"time": 7606, "text": "Is that like this kind of James Bond spy movie stuff, or is that kind of stuff used by intelligence agencies?"}, {"time": 7614, "text": "I don't think it's used."}, {"time": 7615, "text": "It's absolutely used."}, {"time": 7616, "text": "It's called sexpionage."}, {"time": 7618, "text": "That's the term that we jokingly call it, is sexpionage."}, {"time": 7622, "text": "But yeah, the art of attraction, appeal, the manifestation of feelings through sexual manipulation, all of that is a super powerful tool."}, {"time": 7634, "text": "The Chinese use it extremely well."}, {"time": 7635, "text": "The Russians use it extremely well."}, {"time": 7638, "text": "In the United States, we actively train our officers not to use it because in the end it leads to complications in how you professionally run a case."}, {"time": 7648, "text": "So we train our officers not to use it."}, {"time": 7650, "text": "However, you can't control what other people think."}, {"time": 7653, "text": "So if you're an attractive male or an attractive female officer, and you're trying to talk to an older general who just happens to be gay or happens to be straight and is attracted to you, of course they're gonna be that much more willing to talk to an American who is also attractive."}, {"time": 7668, "text": "So it's hard to walk that back."}, {"time": 7670, "text": "In all definitions."}, {"time": 7671, "text": "So it could be all elements of charisma."}, {"time": 7676, "text": "So attractiveness in a dynamic sense of the word."}, {"time": 7680, "text": "So it's visual attractiveness, but the smile, the humor, the wit, the flirting, all that kind of stuff that could be used to the art of conversation."}, {"time": 7690, "text": "There's also elements of sexuality that people underestimate, right?"}, {"time": 7694, "text": "So physical sexuality, physical attraction is the most obvious one."}, {"time": 7698, "text": "It's the one that everybody talks about and thinks about."}, {"time": 7700, "text": "But then there's also sapiosexuality, which is being sexually attracted to thoughts, to intelligence."}, {"time": 7708, "text": "And then you've got all the various varieties of personal preferences."}, {"time": 7714, "text": "Some people like people of a certain color skin, or they like big noses, they like small noses, they like big butts, they like small butts, they like tall guys, they like bald guys, whatever it might be."}, {"time": 7723, "text": "You can't ever predict what someone's preferences, sexual arousal preferences are going to be."}, {"time": 7730, "text": "So then you end up walking into a situation where then you discover, and just imagine, imagine being an unattractive, overweight, married guy, and you're walking into an asset or a target meeting with like a middle aged female who is also not very attractive and also married."}, {"time": 7749, "text": "But then it turns out that that person is a sapiosexual and gets extremely turned on by intelligent conversation."}, {"time": 7754, "text": "That's exactly what you're there to do."}, {"time": 7756, "text": "Your mission is to have intelligent conversation with this person to find out if they have access to secrets."}, {"time": 7762, "text": "And by virtue of you carrying out your mission, they become extremely aroused and attracted to you."}, {"time": 7766, "text": "That is a very complicated situation."}, {"time": 7769, "text": "It's hard to know who to trust."}, {"time": 7770, "text": "Like, how do you know your wife, or how does your wife know that you're not a double agent from Russia?"}, {"time": 7777, "text": "There's a large element of experience and time that goes into that."}, {"time": 7783, "text": "She's also trained."}, {"time": 7785, "text": "And I think my wife and I also."}, {"time": 7787, "text": "Actually you think."}, {"time": 7788, "text": "My wife and I also have the benefit of being recruited young and together where."}, {"time": 7796, "text": "So over time you can start to figure out things that are very difficult to."}, {"time": 7802, "text": "So you form the baseline, you start to understand the person's very, it becomes very difficult to lie."}, {"time": 7806, "text": "The most difficult thing in the world is consistency."}, {"time": 7808, "text": "It's the most difficult thing in the world."}, {"time": 7810, "text": "Some people say that discipline or self discipline, what they're really talking about is consistency."}, {"time": 7814, "text": "When you have someone who performs consistently over long periods of time, under various levels of stress, you have high, high confidence that that is the person that you can trust."}, {"time": 7823, "text": "You can trust, again, you can trust them to behave within a certain pattern."}, {"time": 7830, "text": "You can trust an asshole to be an asshole without trusting the asshole to take care of your kids, right?"}, {"time": 7836, "text": "So I don't ever wanna mix up the idea of personal trust versus trusting the outcome."}, {"time": 7842, "text": "You can always trust a person to operate within their pattern of behavior."}, {"time": 7845, "text": "It just takes time for you to get a consistent, to get consistent feedback as to what that baseline is for them."}, {"time": 7852, "text": "To form a good model, predictive model of what their behavior is going to be like."}, {"time": 7857, "text": "Right, and you know, it's fascinating is I think the challenge is building that model quickly."}, {"time": 7863, "text": "So technology is one of those tools that will be able in the future to very quickly create a model of behavior because technology can pull in multiple data points in a very short period of time that the human brain simply can't pull in at the same space, at the same speed."}, {"time": 7880, "text": "That's actually what I did my PhD on."}, {"time": 7882, "text": "That's what I did at Google is forming a good representation, unique representation in the entire world based on the behavior of the person."}, {"time": 7891, "text": "The specific task there is so that you don't have to type in the password."}, {"time": 7895, "text": "The idea was to replace the password."}, {"time": 7898, "text": "But it also allows you to actually study human behavior and to think, all right, what is the unique representation of a person?"}, {"time": 7904, "text": "How, because we have very specific patterns and a lot of humans are very similar in those patterns, what are the unique identifiers within those patterns of behavior?"}, {"time": 7915, "text": "And I think that's, from a psychology perspective, a super fascinating question."}, {"time": 7919, "text": "And from a machine learning perspective, it's something that you can, as the systems get better and better and better, and as we get more and more digital data about each individual, you start to get, you start to be able to do that kind of thing effectively."}, {"time": 7931, "text": "And it's, I mean, when I think of the fact that you could create a dossier on somebody in a matter of 24 or 48 hours, if you could wire them for two days, right?"}, {"time": 7941, "text": "Internet of Things style, you put it in their underwear or whatever, right?"}, {"time": 7943, "text": "Some chip that just reads everything."}, {"time": 7946, "text": "How heavy are they walking?"}, {"time": 7947, "text": "How much time do they sleep?"}, {"time": 7948, "text": "How many times do they open the refrigerator?"}, {"time": 7950, "text": "When they log into their computer, how do they do it?"}, {"time": 7952, "text": "Like, which hand do they use when they log in?"}, {"time": 7954, "text": "What's their most common swipe?"}, {"time": 7956, "text": "What's their most visited website?"}, {"time": 7958, "text": "You could collect an enormous amount of normative data in a short period of time where otherwise we're stuck."}, {"time": 7965, "text": "The way that we do it now, once or twice a week, we go out for a coffee for two hours."}, {"time": 7971, "text": "And two hours at a time over the course of six, eight weeks, 12 weeks, you're coming up with a 50% assessment on how you think this person is going to behave."}, {"time": 7980, "text": "Just that time savings is immense."}, {"time": 7983, "text": "Something you've also spoken about is private intelligence and the power and the reach and the scale and the importance of private intelligence versus government intelligence."}, {"time": 7993, "text": "Can you elaborate on the role of what is private intelligence and what's the role of private intelligence in the scope of all the intelligence that is gathered and used in the United States?"}, {"time": 8007, "text": "It's something that so few people know about."}, {"time": 8010, "text": "And it became a more mainstream topic with the Trump administration."}, {"time": 8015, "text": "Because Trump made it no secret that he was going to hire private intelligence organizations to run his intelligence operations."}, {"time": 8022, "text": "And fund them."}, {"time": 8023, "text": "So that really brought it to the mainstream."}, {"time": 8024, "text": "But going all the way back to 9 11, going all the way back to 2001, when the 9 11 attacks happened, there was a commission that was formed to determine the reasons that 9 11 happened."}, {"time": 8040, "text": "And among the lists that they determined, of course they found out that the intelligence community wasn't coordinating well with each other."}, {"time": 8046, "text": "There were fiefdoms and there was infighting and there wasn't good intel sharing."}, {"time": 8050, "text": "But more than that, they identified that we were operating at Cold War levels, even though we were living in a time when terrorism was the new biggest threat to national security."}, {"time": 8062, "text": "So the big recommendation coming out of the 9 11 commission was that the intelligence organizations, the intelligence community significantly increased the presence of intelligence operators overseas and in terms of analytical capacity here in the United States."}, {"time": 8078, "text": "When they made that decision, it completely destroyed, it totally was incongruent with the existing hiring process because the existing hiring process for CIA or NSA is a six to nine month process."}, {"time": 8091, "text": "The only way they could plus up their sizes fast enough was to bypass their own hiring and instead go direct to private organizations."}, {"time": 8100, "text": "So naturally the government contracted with the companies that they already had secure contracts with, Boeing, Raytheon, Northrop Grumman, Khaki, you name it."}, {"time": 8112, "text": "And then over time from 2001 to now, or I guess that started really in 2004 when they started significantly increasing the presence of private intelligence officers."}, {"time": 8122, "text": "From then until now, it's become a budgetary thing."}, {"time": 8126, "text": "It's become a continuity of operations thing."}, {"time": 8130, "text": "And now the reason Northern Virginia has become one of the wealthiest zip codes in America is because of the incredible concentration of private intelligence that is supporting CIA, NSA, DIA, FBI, and all the slew of IC partners."}, {"time": 8146, "text": "By the way, does Palantir play a role in this?"}, {"time": 8149, "text": "Palantir is one of those organizations that was trying to pitch their product to an intelligence community because they have, it's a fantastic product on paper."}, {"time": 8161, "text": "But the challenge was the proprietary services, the proprietary systems that we current that we used in CIA prior to Palantir continued to outperform Palantir."}, {"time": 8173, "text": "So just like any other business decision, if you've got homegrown systems that outperform external systems, then it's not worth it to share the internal information."}, {"time": 8184, "text": "So what the close connection between Peter Thiel and Donald Trump, did that have a role to play in Donald Trump's leveraging of private intelligence or is that completely disjoint?"}, {"time": 8200, "text": "I think that they're related but only circumstantially."}, {"time": 8205, "text": "Because remember, Donald Trump wasn't really investing in CIA."}, {"time": 8208, "text": "So the last thing he wanted to do was spend his network, WASTA, WASTA is a term that we call influence, it's an Arabic term for influence."}, {"time": 8218, "text": "Trump didn't wanna use his WASTA putting Thiel into CIA only to lose Thiel's contract as soon as Trump left office."}, {"time": 8224, "text": "So instead, it was more valuable to put Peter Thiel's tool to use in private intelligence."}, {"time": 8229, "text": "And then of course, I think he nominated Peter Thiel to be his Secretary of Defense, Secretary of State."}, {"time": 8235, "text": "At some point in time, he tried to present, like presidentially appoint Peter Thiel into a position of government authority."}, {"time": 8243, "text": "What do you think of figures like Peter Thiel?"}, {"time": 8247, "text": "Do they wield, and I'm sure there's figures of similar scale and reach and power in private intelligence."}, {"time": 8257, "text": "What do you think about their role and power in this whole, like without public accountability that you would think directors of CIA perhaps have?"}, {"time": 8267, "text": "So this is where private intelligence has both a strength and a weakness."}, {"time": 8273, "text": "The ultimate law overriding, that's overseeing private intelligence is not government legislation."}, {"time": 8283, "text": "It's the law of economics."}, {"time": 8285, "text": "If they produce a superior product, then they will have a buyer."}, {"time": 8289, "text": "If they do not produce a superior product, they will not have a buyer."}, {"time": 8293, "text": "And that's a very simple business principle."}, {"time": 8296, "text": "Whereas in the current national security infrastructure, you can create a crap product, but the taxpayer dollars are always going to be spent."}, {"time": 8305, "text": "So it's really thrown things for a loop."}, {"time": 8308, "text": "Especially during the Trump administration."}, {"time": 8309, "text": "And this is one of the things that I will always say I liked about the Trump administration."}, {"time": 8314, "text": "It shown, it put a big blazing bright light on all of the flaws within our system."}, {"time": 8321, "text": "One of those flaws being this executive power over the intelligence organizations and the lack of accountability for intelligence organizations to produce a superior product."}, {"time": 8333, "text": "When that light got shown down, that's when you also saw Trump start to go after, if you remember, there was a period where he was taking security clearances away from retiring officers."}, {"time": 8346, "text": "That became a big hot issue."}, {"time": 8348, "text": "That became something that people were very opposed to when they didn't realize that that process of taking security clearances away, that incentivized seasoned senior officers to stay in service."}, {"time": 8361, "text": "Because with private intelligence paying a premium during the Trump administration, because Trump was paying a premium to the private intelligence world, when senior officers found that it was more profitable to retire early, keep their clearance, and go work for Raytheon, Trump saw that as bypassing service to the American people."}, {"time": 8381, "text": "You've made a career in CIA, you've made a career in NSA, you should stay there."}, {"time": 8384, "text": "If you leave, you lose your clearance because you no longer have a need to know."}, {"time": 8389, "text": "He upset the apple cart with that."}, {"time": 8391, "text": "And unfortunately, the narrative that came out in many ways was a negative narrative against Trump, when in fact, he was actually doing quite a service to the American people, trying to take away the incentive of senior officials leaving their service in order to just profiteer in the private intelligence."}, {"time": 8410, "text": "So in that way, he was kind of supporting the CIA in making sure that competent people and experienced people stay in CIA, are incentivized to stay there."}, {"time": 8424, "text": "Correct, I think that there was definitely, he understood incentives."}, {"time": 8429, "text": "I mean, Donald Trump understands incentives."}, {"time": 8432, "text": "So he was trying to incentivize them to stay, but I think he was also playing a safety card because he didn't want former CIA officials who were not listening to him to then move into private intel organizations that he may be hiring, only to then have them undermine him from both sides of the coin."}, {"time": 8449, "text": "So there was a little bit of offensive calculation in there as well."}, {"time": 8454, "text": "But do the dynamics and the incentives of economics that you referred to that the private intelligence operates under, is that more or less ethical than the forces that maybe government agencies operate under?"}, {"time": 8468, "text": "Is capitalism lead, so you mentioned it leads to maximizations of efficiency and performance, but is that correlated with ethical behavior when we're talking about such hairy activities like collection of intelligence?"}, {"time": 8486, "text": "The question of ethics is a great question."}, {"time": 8487, "text": "So let me start this whole thing out by saying, CIA hires people on a spectrum of our ability to be morally flexible, ethically flexible."}, {"time": 8501, "text": "All people at their heart are ethically flexible."}, {"time": 8505, "text": "I would never punch somebody in the face, right?"}, {"time": 8508, "text": "Some people out there would say, I would never hurt another human being."}, {"time": 8511, "text": "But as soon as a human being posed a direct threat to their daughter or their son or their mother, now all of a sudden they're gonna change their ethical stance in self defense, right?"}, {"time": 8521, "text": "But at the end of the day, it's still hurting another person."}, {"time": 8525, "text": "So what CIA looks for is people who are able to swing across that spectrum for lesser offenses, right?"}, {"time": 8532, "text": "More flexibility."}, {"time": 8535, "text": "I do not believe that private intelligence and the laws of economics lend themselves to increased ethics or increased ethical behavior in the short term."}, {"time": 8547, "text": "But what ends up happening is that in the long term, in order to scale economic benefits, you are forced to act within norms of your customer base."}, {"time": 8559, "text": "So as the norms of that customer base dictate certain requirements, the company has to adapt to those requirements in order to continue to scale."}, {"time": 8569, "text": "So if a company tries to ostracize LGBTQ or if they try to ostracize men or ostracize women, they're limiting their ability to grow economically."}, {"time": 8581, "text": "They have to adapt to whatever is the prevailing ethical requirement of their customer base."}, {"time": 8589, "text": "That's such an interesting question because you look at big pharma and pharmaceutical companies, and they have quite a poor reputation in the public eye."}, {"time": 8600, "text": "And some of it, maybe much of it is deserved, at least historically speaking."}, {"time": 8606, "text": "And so you start to wonder, well, can intelligence agencies use some of the same methods or can these use some of the same technique to manipulate the public, like what they believe about those agencies in order to maximize profit as well?"}, {"time": 8625, "text": "Sort of finding shortcuts or unethical paths that allow you to not be ultimately responsible to the customer."}, {"time": 8636, "text": "And I would go a step further to say that the covert nature of intelligence operations is really attractive when it comes to the private sector, because now they have all the same money with none of the oversight, and all they have to do is deliver."}, {"time": 8653, "text": "So without the oversight, what's holding you back?"}, {"time": 8657, "text": "And for anybody who's ever run a business, anybody who's ever started a startup or tried to make something succeed, we all know that there come those times where you have to skirt the boundaries of propriety or morality or commitments or promises to other people, because at the end of the day, if your business fails, it's on you."}, {"time": 8679, "text": "So if you promise to deliver something to a client, you've got to deliver it to the client, even if that means you stay up late or if you lie on your taxes, whatever it might be, there's a certain level of do or die."}, {"time": 8692, "text": "Yeah, I personally have a sort of optimistic view that ultimately the best way is to stay within the ethical bounds, kind of like what you suggested."}, {"time": 8702, "text": "If you want to be a company that's extremely successful, is win with competence, not with cheating, because cheating won't, I believe, win in the long term."}, {"time": 8715, "text": "But in terms of being publicly responsible to your decisions, I mean, I've already been supposed to talk to Peter Thiel twice on this podcast, and it's just been complicated."}, {"time": 8728, "text": "If I were to put myself into his shoes, why do podcasts?"}, {"time": 8735, "text": "The risk is too high to be a public person at all."}, {"time": 8740, "text": "And so I totally understand that."}, {"time": 8742, "text": "At the same time, I think if you're doing things by the book and you're the best in the world at your job, then you have nothing to worry about."}, {"time": 8756, "text": "And you can advertise that and you recruit, you help recruit, I mean, that's the work of capitalism is you want to advertise that this is the place where the best people in the world at this thing work."}, {"time": 8770, "text": "True, I think that your point of view is accurate."}, {"time": 8774, "text": "I would also say that the complexities of what makes somebody make a decision can only really be properly calculated with a baseline."}, {"time": 8786, "text": "So because there is no baseline that you or I have on Peter Thiel, it's difficult to really ascertain why he does or doesn't accept invites or why he does or doesn't appear."}, {"time": 8795, "text": "Well, let me ask your opinion on the NSA, and then maybe you could mention about bulk collection in general in the CIA, but let's look at some history with the NSA and Snowden."}, {"time": 8811, "text": "What's your opinion on the mass surveillance that is reported to have been conducted by the NSA?"}, {"time": 8822, "text": "We've talked about ethics."}, {"time": 8824, "text": "Are you troubled by the, from a public perception, the unethical nature of mass surveillance of especially American citizens?"}, {"time": 8838, "text": "This is a topic that I never get tired of talking about, but it's very rare that anyone ever really agrees with me, just so you know."}, {"time": 8846, "text": "I see where you're, well, I think there's a nuance thing here and maybe we'll find some agreement."}, {"time": 8852, "text": "The truth is that the American experience after 9 11 is nothing like the American experience now."}, {"time": 8860, "text": "So all the terminology, all the talk about privacy and privacy laws and mass surveillance and all this other stuff, it was a completely different time then."}, {"time": 8870, "text": "And that's not to say it was an excuse, because to this day, I will still say mass collection, bulk collection of data that allows for an expedient identification of a threat to national security benefits all of us, but people don't understand what they want."}, {"time": 8889, "text": "Like people don't understand what the value of their own privacy is."}, {"time": 8893, "text": "First of all, the fact that people think they have personal privacy is laughable."}, {"time": 8897, "text": "You have no privacy."}, {"time": 8899, "text": "The cell phone that you carry in your pocket, you're giving permission to those apps constantly."}, {"time": 8902, "text": "You're giving commercial organizations, what you and I have already said, are less tied to ethical responsibility."}, {"time": 8908, "text": "You're giving them permission to collect enormous amounts of private data from you all the time."}, {"time": 8914, "text": "And do you know what happens if AT&T or Verizon sees some nefarious activity on your account?"}, {"time": 8920, "text": "They do nothing."}, {"time": 8922, "text": "They might send a note to FBI because they have to, according to some checklist."}, {"time": 8927, "text": "But when NSA was collecting intelligence on metadata from around the United States, they were very specifically looking for terrorist threats that would harm American lives."}, {"time": 8938, "text": "Man, NSA can clone my phone."}, {"time": 8940, "text": "I will give them my children's phone."}, {"time": 8941, "text": "I will give them the passwords to every one of my accounts if it means that there's a likelihood that my family will be safer from a nefarious actor who's intent on hurting us."}, {"time": 8953, "text": "NSA doesn't care about your affair."}, {"time": 8955, "text": "NSA doesn't care if you're cheating on your taxes."}, {"time": 8957, "text": "NSA doesn't care if you talk shit about your boss or if you hate the US president."}, {"time": 8964, "text": "Your intelligence community is there to find threats to national security."}, {"time": 8969, "text": "That's what they're there to do."}, {"time": 8971, "text": "What Snowden did when he outed that whole program, the fact that the court, the justice system, the civilian justice system went back and essentially overruled the ruling of the intelligence courts before them just goes to show how the general mass community really shouldn't have a say in what happens in the intelligence community."}, {"time": 8995, "text": "They really shouldn't."}, {"time": 8996, "text": "You have politicians and you have the opportunity to elect people to a position and then you trust them."}, {"time": 9003, "text": "That's what a representative republic is."}, {"time": 9005, "text": "You vote the people in, you trust them to work on your behalf."}, {"time": 9009, "text": "They make decisions without running them by you."}, {"time": 9011, "text": "They make decisions that they believe are in the best interest of their constituency and that's how our form of democracy works."}, {"time": 9021, "text": "It worked, we were safer."}, {"time": 9023, "text": "Now that we don't have that information and now that there's this giant looming question of whether or not NSA is there to serve people or is collecting mass surveillance against all American people, that's not really a true accurate representation of what they were ever doing."}, {"time": 9036, "text": "They were looking for the needle in a haystack of the series of transactions in metadata that was going to lead to American deaths."}, {"time": 9045, "text": "We are now less secure because they can't do that and that bothers me."}, {"time": 9050, "text": "So you said a few really interesting things there."}, {"time": 9053, "text": "So because you are kind of an insider, or were for a time an insider, meaning you were able to build up an intuition about the good, the bad, and the ugly of these institutions, specifically the good."}, {"time": 9067, "text": "A lot of people don't have a good sense of the good."}, {"time": 9069, "text": "They know the bad and the ugly or can infer the bad and the ugly."}, {"time": 9074, "text": "You mentioned that the one little key little thing there at the end saying the NSA doesn't care about whether you hate the president or not."}, {"time": 9084, "text": "Now that's what people really worry about is they're not sure they can trust the government to not go into full dictatorial mode and basing your political preference, your oppositions, your, basically one of the essential powers, the freedom of speech in the United States is the ability to criticize your government."}, {"time": 9110, "text": "And that, they worry, well, can't the government get a hold of the NSA and start to ask the basic question, well, can you give me a list of people that are criticizing the government?"}, {"time": 9123, "text": "Think about, so let's just walk through that exact example, right, because this is, it's a preponderance, it's a preponderance fear, it's a ridiculous fear because you would have to tap on multiple elements of government for anything to happen."}, {"time": 9136, "text": "So for example, let's just say that somebody goes to the NSA and says, hey, can you give us a readout on all the people who are tweeting terrible things about the president?"}, {"time": 9146, "text": "Okay, cool, here's your hundred million people, whatever it is, right?"}, {"time": 9150, "text": "Here's all the people saying negative things about the government."}, {"time": 9152, "text": "So now they have a list, what do they do next?"}, {"time": 9155, "text": "Well, let's just make it simple."}, {"time": 9157, "text": "They stay with NSA and they say, surveil them even more, tap their phones, tap their computers, I wanna know even more."}, {"time": 9163, "text": "So then they get this preponderance of evidence."}, {"time": 9166, "text": "What do you do with evidence?"}, {"time": 9167, "text": "You take it to a court."}, {"time": 9169, "text": "Well, guess what no court is going to support?"}, {"time": 9172, "text": "Anything that goes against the freedom of speech."}, {"time": 9176, "text": "So the court is not going to support what the executive is asking them to do."}, {"time": 9181, "text": "Even before you take somebody to court, you have to involve law enforcement."}, {"time": 9185, "text": "Essentially, you have to send some sort of police force to go apprehend the individual who's in question."}, {"time": 9191, "text": "Well, guess what doesn't meet criteria for any police force anywhere in the United States?"}, {"time": 9196, "text": "Arresting people who say negative things about the president."}, {"time": 9201, "text": "Now, if somebody poses a threat to the life of a public figure or the threat to life of a politician, that's a completely different case, which means the standards of evidence are much higher for them to arrest that person."}, {"time": 9212, "text": "So unless you create a secret police force, then your actual public police force is never gonna take action."}, {"time": 9219, "text": "So all these people who are afraid of this exact situation that you're outlying, they need the creation of a secret police force, the creation of a secret court that operates outside the judicial system, the creation of a secret intelligence service that operates outside of foreign intelligence collection, all so that a handful of people who don't like the president get what?"}, {"time": 9240, "text": "Whisked away, assassinated, put in prison, who knows what?"}, {"time": 9244, "text": "Think about the resources that would be, the amount of money and time and how hard would it be to keep that secret, to have all of those things in motion."}, {"time": 9253, "text": "The reason it worked in Russia and Soviet Germany or Russia and communist Germany was because everybody knew there was a secret police."}, {"time": 9261, "text": "Everybody knew that there was a threat to work to speaking out against the government."}, {"time": 9265, "text": "It's completely different here."}, {"time": 9266, "text": "Well, so there's a lot to say."}, {"time": 9268, "text": "So one is yes, if I was a dictator and I wanted to, and just looking at history, let me take myself out of it, but I think one of the more effective ways is you don't need the surveillance."}, {"time": 9283, "text": "You can pick out a random person and in a public display, semi public display, basically put them in jail for opposing the government, whether they oppose it or not, and the fear, that sends a message to a lot of people."}, {"time": 9299, "text": "That's exactly what you see happening in China."}, {"time": 9302, "text": "That's what you just light out."}, {"time": 9303, "text": "It's genius, and that is the standard."}, {"time": 9306, "text": "You don't need the surveillance for that."}, {"time": 9309, "text": "But that said, if you did do the surveillance, so that's the support, the sort of, the incentives aren't aligned."}, {"time": 9317, "text": "It seems like a lot of work to do for the thing you could do without the surveillance."}, {"time": 9321, "text": "But yes, the courts wouldn't, if you were to be able to get a list of people, which I think that part you could do."}, {"time": 9332, "text": "That oppose the government."}, {"time": 9334, "text": "You could do that just like you said on Twitter publicly."}, {"time": 9336, "text": "You could make a list."}, {"time": 9338, "text": "And with that, you can start to, especially if you have a lot of data on those people, find ways in which they did violate the law."}, {"time": 9346, "text": "Not because they oppose the government, but because in some other way."}, {"time": 9350, "text": "They'll park your tickets or didn't pay the taxes."}, {"time": 9353, "text": "That's probably a common one, or like screwed up something about the taxes."}, {"time": 9357, "text": "I just happen to know Russia and Ukraine, they're very good at this kind of stuff."}, {"time": 9363, "text": "Knowing how the citizens screwed everything up, because especially in those countries, everybody's breaking the law."}, {"time": 9370, "text": "Because in a corrupt nation, you have to bend the law to operate the war."}, {"time": 9376, "text": "The number of people that pay taxes fully in those nations is just very low, not zero."}, {"time": 9382, "text": "And so they then use that breaking of the law to come up with an excuse to actually put you in jail based on that."}, {"time": 9391, "text": "So it's possible to imagine."}, {"time": 9393, "text": "But yes, I think, I think that's the ugly part of surveillance."}, {"time": 9399, "text": "But I do think, just like you said, the incentives aren't correct."}, {"time": 9403, "text": "Like you really don't need to get all of the secret police and all of these kinds of organizations working."}, {"time": 9409, "text": "If you do have a charismatic, powerful leader that built up a network that's able to control a lot of organizations to a level of authoritarianism in a government, they're just able to do the usual thing."}, {"time": 9423, "text": "One, have propaganda machine to tell narratives."}, {"time": 9426, "text": "Two, pick out people that they can put in jail for opposing the state."}, {"time": 9432, "text": "And maybe loud members of the press start silencing the press."}, {"time": 9436, "text": "There's a playbook to this thing."}, {"time": 9439, "text": "It doesn't require the surveillance."}, {"time": 9441, "text": "The surveillance, you know what is useful for the surveillance is the thing you mentioned in China, which is encourage everybody in the citizenry to watch each other, to say there's enemies of the state everywhere."}, {"time": 9458, "text": "And then you start having children reporting on their appearance and that kind of stuff."}, {"time": 9462, "text": "Again, don't need a surveillance state for that."}, {"time": 9466, "text": "Now the good of a surveillance system, if it's operating within ethical bounds, is that yes, it could protect the populace."}, {"time": 9475, "text": "So you're saying like the good given on your understanding of these institutions, the good outweighs the bad."}, {"time": 9483, "text": "Absolutely, so let me give you just a practical example."}, {"time": 9486, "text": "So people don't realize this, but there's multiple surveillance states that are out there."}, {"time": 9490, "text": "There are surveillance states that are close allies with the United States."}, {"time": 9493, "text": "One of those surveillance states is the United Arab Emirates, the UAE."}, {"time": 9498, "text": "Now I lived in the UAE from 2019 to 2020, came back on a repatriation flight after COVID broke out."}, {"time": 9506, "text": "And, but we were there for a full year."}, {"time": 9508, "text": "We were residents, we had IDs, we had everything."}, {"time": 9511, "text": "Now, when you get your national ID in the Emirates, you get a chip and that chip connects you to everything."}, {"time": 9519, "text": "It connects you to cameras, it connects you to your license plate on your car, to your passport, to your credit card, everything."}, {"time": 9526, "text": "Everything is intertwined, everything is interlinked."}, {"time": 9529, "text": "When you drive, there are no police."}, {"time": 9531, "text": "There are no police on the roads."}, {"time": 9532, "text": "Every 50 to 100 meters, you cross a camera that reads your license plate, measures your speed."}, {"time": 9539, "text": "And if you're breaking the speed limit, it just immediately charges your credit card because it's tied, it's all tied together."}, {"time": 9544, "text": "Totally surveillance."}, {"time": 9545, "text": "That technology was invented by the Israelis who use it in Israel."}, {"time": 9553, "text": "When I was in Abu Dhabi and I was rear ended at high speed by what turned out to be an Emirati official, a senior ranking official of one of the Emirates."}, {"time": 9563, "text": "It was caught on camera."}, {"time": 9565, "text": "His ID was registered, my ID was registered."}, {"time": 9567, "text": "Everything was tied back to our IDs."}, {"time": 9568, "text": "The proof and the evidence was crystal clear."}, {"time": 9571, "text": "Even still, he was Emirati, I was not."}, {"time": 9574, "text": "So when I went to the police station to file the complaints, it was something that nobody was comfortable with because generally speaking, Emiratis don't accept legal claims against their own from foreigners."}, {"time": 9586, "text": "But the difference was that I was an American and I was there on a contract supporting the Emirati government."}, {"time": 9591, "text": "So I had these different variances, right?"}, {"time": 9594, "text": "Long story short, in the end, the surveillance state is what made sure that justice was played because the proof was incontrovertible."}, {"time": 9607, "text": "There was so much evidence collected because of the surveillance nature of their state."}, {"time": 9611, "text": "Now, why do they have a surveillance state?"}, {"time": 9612, "text": "It's not for people like me."}, {"time": 9614, "text": "It's because they're constantly afraid of extremist terrorist activity happening inside Abu Dhabi or inside the UAE because they're under constant threat from Islam and they're from extremists and they're under constant threat from Iran."}, {"time": 9628, "text": "So that's what drives the people to want a police state, to want a surveillance state."}, {"time": 9633, "text": "For them, their survival is paramount and they need the surveillance to have that survival."}, {"time": 9638, "text": "For us, we haven't tasted that level of desperation and fear yet or hopefully never, but that's what makes us feel like there's something wrong with surveillance."}, {"time": 9648, "text": "Surveillance is all about the purpose."}, {"time": 9650, "text": "It's all about the intent."}, {"time": 9652, "text": "Well, and like you said, companies do a significant amount of surveillance to provide us with services that we take for granted."}, {"time": 9660, "text": "For example, just one of the things to give props to the digital efforts of the Zelensky administration in Ukraine."}, {"time": 9668, "text": "I don't know if you're aware, but they have this digital transformation efforts where you could put, there's an, it's laughable to say in the United States, but they actually did a really good job by having a government app that has your passport on it."}, {"time": 9685, "text": "It's all the digital information."}, {"time": 9687, "text": "You can get a doctor."}, {"time": 9688, "text": "It's like everything that you would think America would be doing, like license, like all that kind of stuff, it's in an app."}, {"time": 9696, "text": "You could pay, there's payment to each other."}, {"time": 9699, "text": "And that's all coming, I mean, there's probably contractors somehow connected to the whole thing, but that's like under the flag of government."}, {"time": 9706, "text": "And so that's an incredible technology."}, {"time": 9709, "text": "And I didn't, I guess, hear anybody talk about surveillance in that context, even though it is, but they all love it."}, {"time": 9716, "text": "And it's super easy."}, {"time": 9717, "text": "And they, frankly already, it's so easy and convenient."}, {"time": 9720, "text": "They've already taken for granted that, of course, this is what you do."}, {"time": 9724, "text": "Of course, your passport is on your phone."}, {"time": 9726, "text": "For everybody to have housed in a server that you have no idea where it's at, that could be hacked at any time by a third party."}, {"time": 9733, "text": "They don't ask these kinds of questions because it's so convenient, as we do for Google, Facebook, Twitter, Apple, Microsoft products we use."}, {"time": 9747, "text": "Security and convenience are on two opposite sides of another spectrum."}, {"time": 9750, "text": "The more convenient something is, the less secure."}, {"time": 9753, "text": "And the more secure something is, the less convenient."}, {"time": 9756, "text": "And that's a battle that we're always working with as individuals, and then we're trying to outsource that battle to our politicians."}, {"time": 9763, "text": "And our politicians are, frankly, just more interested in being politicians."}, {"time": 9766, "text": "Yeah, that said, I mean, people are really worried about giving any one institution a large amount of power, especially when it's a federal government institution, given some history."}, {"time": 9782, "text": "First of all, just history of the corruption, of power corrupting individuals and institutions."}, {"time": 9788, "text": "And second of all, myth or reality of certain institutions like the CIA misbehaving."}, {"time": 9797, "text": "Well, let me actually ask you about the Edward Snowden."}, {"time": 9800, "text": "So you, outside of the utility that you're arguing for of the NSA surveillance program, do you think Edward Snowden is a criminal or a hero?"}, {"time": 9814, "text": "In terms, in the eyes of the law, he's a criminal."}, {"time": 9818, "text": "He broke the law, he broke the confidence, he made us, he was under security obligation."}, {"time": 9823, "text": "And then when he ran away, he ran away to all of the worst villains in the world from the US perspective to basically seek protection."}, {"time": 9833, "text": "That's how you act in the face of accusation is in essence part of the case that you build for yourself."}, {"time": 9843, "text": "So running away to China, Russia, Cuba, there was a Latin Ecuador, I think, that just paints a very negative picture that does not suggest that you were doing anything that was ethical and upright and in favor of the American people if you're gonna run to American enemies to support yourself."}, {"time": 9859, "text": "So for sure, in the eyes of law, he's a criminal."}, {"time": 9862, "text": "In the eyes of a group of people who are largely ignorant to what they lost, to them, he's a hero."}, {"time": 9872, "text": "To me, he's just kind of a sad case."}, {"time": 9875, "text": "I personally look at Snowden as a sad, unfortunate case."}, {"time": 9881, "text": "His life is ruined, his family name is tarnished."}, {"time": 9886, "text": "He's forever going to be a desperate pawn."}, {"time": 9891, "text": "And that's all because of the decisions that he made and the order that he made them."}, {"time": 9895, "text": "I'm not sure his name is tarnished."}, {"time": 9897, "text": "I think the case you're making is a difficult case to make."}, {"time": 9901, "text": "And so I think his name represents fighting one man, it's like Tiananmen Square standing before the tank, is like one man fighting the government."}, {"time": 9915, "text": "And I think that there is some aspect which, taking that case aside, that is the American spirit, which is hold the powerful accountable."}, {"time": 9928, "text": "So whenever there's somebody in power, one individual can change."}, {"time": 9938, "text": "One man can make a difference."}, {"time": 9939, "text": "Can make a difference, yeah."}, {"time": 9940, "text": "Very Knight Rider of you."}, {"time": 9942, "text": "I mean, that's the American individualism."}, {"time": 9945, "text": "And so he represents that."}, {"time": 9946, "text": "And I think there's a huge skepticism against large federal institutions."}, {"time": 9952, "text": "And I think if you look at the long arc of history, that actually is a forcing function for the institutions to behave their best."}, {"time": 9961, "text": "So basically hold them accountable."}, {"time": 9968, "text": "What's nice about this is that we can agree to disagree and history will be the one that decides."}, {"time": 9973, "text": "But there's a reason that Edward Snowden needs to do something new every 16 or 18 months to remain relevant, right?"}, {"time": 9985, "text": "Because if he didn't, he would just be forgotten."}, {"time": 9988, "text": "Because he was not a maverick who changed history for the better."}, {"time": 9992, "text": "He was a man who broke a law and now he's on the run."}, {"time": 9997, "text": "And to some people, he is a hero."}, {"time": 10001, "text": "To other people, he is a criminal."}, {"time": 10002, "text": "But to the vast majority, he's just a blip on a radar of their everyday life that really makes no difference to them at all."}, {"time": 10010, "text": "So actually let's linger on that."}, {"time": 10011, "text": "So just to clarify, do you think, are you making the difficult case that the NSA mass surveillance program was one, ethical and two, made a better world for Americans?"}, {"time": 10024, "text": "I am making the case that at the time, it was exactly what we needed to feel safe in our own homes."}, {"time": 10033, "text": "But what about to be safe, actually be safe?"}, {"time": 10036, "text": "So this is what's difficult because any proof that was that they collected that actually prevented an attack from happening is proof we'll never know about."}, {"time": 10044, "text": "This is the really unfortunate side of intelligence operations."}, {"time": 10048, "text": "And I've been at the front end of this."}, {"time": 10050, "text": "You work your ass off."}, {"time": 10052, "text": "You take personal risk."}, {"time": 10053, "text": "You make personal sacrifice to make sure that something terrible doesn't happen."}, {"time": 10058, "text": "Nobody knows that that ever happens."}, {"time": 10059, "text": "Does that have to be that way?"}, {"time": 10061, "text": "Does it have to remain secret every time the NSA or the CIA saves the lives of Americans?"}, {"time": 10070, "text": "It does for two reasons."}, {"time": 10072, "text": "It has to be secret."}, {"time": 10072, "text": "First, the mythos."}, {"time": 10075, "text": "The same thing we were talking about with General Petraeus."}, {"time": 10078, "text": "You can't brag about your victories if you want to let the myth shape itself."}, {"time": 10086, "text": "The second thing is once a victory is claimed, the danger comes from letting your enemy know that you claimed the victory because they can reverse engineer and they can start to change how they did things."}, {"time": 10102, "text": "If a terrorist act, if a terrorist cell tries to execute an operation and the operation fails, from their point of view, they don't know why it failed."}, {"time": 10109, "text": "They just know that it failed."}, {"time": 10110, "text": "But then if the US or if the American government comes in and says, we took apart this amazing attack, now they have more information, right?"}, {"time": 10119, "text": "The whole power of secrets, like we talked about before, the power of secrets is in knowing that not everybody has them."}, {"time": 10124, "text": "There's only a shelf life."}, {"time": 10126, "text": "So take advantage of the shelf life."}, {"time": 10128, "text": "You get space."}, {"time": 10129, "text": "So you gotta keep it a secret."}, {"time": 10131, "text": "There is no tactical advantage from sharing a secret unless you are specifically trying to achieve a certain tactical advantage from sharing that secret, which is what we've seen so much of with US intel sharing with Ukraine."}, {"time": 10145, "text": "There's a tactical advantage from sharing a secret about Russian military movements or weaknesses in tanks or supply chain challenges, whatever it might be."}, {"time": 10154, "text": "Well, let me argue that there might be an advantage to share information with the American public when a terrorist attack or is averted or the lives of Americans are saved, because what that does."}, {"time": 10170, "text": "Is make every American think that they're not that safe."}, {"time": 10174, "text": "There is no tactical advantage there."}, {"time": 10178, "text": "What about?"}, {"time": 10178, "text": "If the Austin PD started telling you every day about these crazy crimes that they prevented, would that make you feel more safe?"}, {"time": 10189, "text": "It would make you feel like they're doing their job."}, {"time": 10191, "text": "Is that obvious to you, make us feel less safe?"}, {"time": 10193, "text": "Because if we see competence, that there is extremely competent defenders of this territory of these people, wouldn't that make us feel more safe or no?"}, {"time": 10205, "text": "The human nature is not to assign competence."}, {"time": 10208, "text": "So empirically, humans overvalue losses and undervalue gains."}, {"time": 10217, "text": "That's something that we've seen from finance to betting and beyond."}, {"time": 10221, "text": "If the Austin Police Department starts telling you about all these heinous crimes that were avoided because of their hard work, the way that your brain is actually going to process that information is you are going to say, if this is all the stuff that they've stopped, how bad must this place be?"}, {"time": 10239, "text": "How much more haven't they stopped?"}, {"time": 10241, "text": "I take your point, it's a powerful psychological point, but looking at the other picture of it, looking at the police force, looking at the CIA, the NSA, those people, now with the police, they're seeing, there's such a negative feeling amongst Americans towards these institutions."}, {"time": 10263, "text": "Who the hell wants to work for the CIA now and the police force?"}, {"time": 10267, "text": "Like, you're gonna be criticized, like that's a, I mean, that's really bad for the CIA."}, {"time": 10278, "text": "Like, as opposed to being seen as a hero, like for example, currently soldiers are for the most part seen as heroes that are protecting this nation."}, {"time": 10290, "text": "That's not the case for the CIA."}, {"time": 10292, "text": "Soldiers weren't seen as heroes in the Vietnam War, right?"}, {"time": 10296, "text": "You've got to remember that when you, so first of all, public service is a sacrifice."}, {"time": 10303, "text": "We oftentimes forget that."}, {"time": 10305, "text": "We start to think, oh, government jobs are cushy and they're easy, and it must be so easy to be the president, because then you're basically a celebrity overnight."}, {"time": 10312, "text": "Public service is a sacrifice, it's a grind."}, {"time": 10317, "text": "For all of the soldiers, the submariners, the missileers, the police officers, intelligence specialists, they all know what it's like to give things up, to serve a public that can turn its opinion at any given time."}, {"time": 10334, "text": "And history is what defines it."}, {"time": 10336, "text": "The more important thing is to understand that if you want a true open and fair democracy, you cannot control a narrative."}, {"time": 10345, "text": "And starting to share all of your victories or starting to share your biggest victories with the intent of shaping public opinion to be supportive of the police force or supportive of CIA or supportive of you name it, is shaping a narrative that is intentional operational use of influence to drive public opinion."}, {"time": 10365, "text": "That is something nobody wants to get into."}, {"time": 10367, "text": "It is much more professional to be a silent sentinel, a silent servant, humbly carrying the burden of public service in the United States where we are a fair and open democracy."}, {"time": 10379, "text": "Why, why not celebrate the killing of Bin Laden?"}, {"time": 10385, "text": "The search, discovery, and the capture and the killing of Bin Laden."}, {"time": 10388, "text": "Wasn't that, actually the details of that, how much of the details of that, how he was discovered were made public?"}, {"time": 10395, "text": "I think some of it was made public enough."}, {"time": 10397, "text": "Why not do that?"}, {"time": 10399, "text": "Doesn't that make heroes out of the people that are servants?"}, {"time": 10403, "text": "Or do people who serve to do service for this nation, do they always have to operate in a thankless manner in the shadows?"}, {"time": 10414, "text": "I think that's a very good question."}, {"time": 10416, "text": "The folks who I left behind when I left CIA, who continue to serve as faceless, nameless heroes every day, I am grateful to them."}, {"time": 10431, "text": "The truth is that if they were motivated by something else, they wouldn't be as good as they are at doing what they do."}, {"time": 10439, "text": "And I see your point about, shouldn't we be celebrating our victories?"}, {"time": 10447, "text": "But when celebrating our victories runs the risk of informing our enemies how we operate, giving away our informational advantage, giving away our tactical battlefield advantage, and running the risk of shaping a narrative intentionally among our own American people, now all of a sudden we're turning into exactly the thing that the American people trust us not to become."}, {"time": 10471, "text": "Yeah, but then you operate in the secrecy, and then there's corrupt and douchebag people everywhere."}, {"time": 10479, "text": "So when they, even inside the CIA and criminals, inside the CIA there's criminals in all organizations, in all walks of life, human nature as such, that this is always the case, then it breeds conspiracy theories."}, {"time": 10494, "text": "And sometimes those conspiracy theories turn out to be true."}, {"time": 10497, "text": "But most times they don't."}, {"time": 10499, "text": "That's just part of the risk of being a myth."}, {"time": 10504, "text": "Can you speak to some of the myths?"}, {"time": 10505, "text": "So MKUltra, so."}, {"time": 10508, "text": "Not a myth."}, {"time": 10510, "text": "So this is a fascinating human experimentation program undertaken by the CIA to develop procedures for using drugs like LSD to interrogate people through, let's say, psychological manipulation and maybe even torture."}, {"time": 10525, "text": "The scale of the program is perhaps not known."}, {"time": 10529, "text": "How do you make sense that this program existed?"}, {"time": 10532, "text": "Again, you've gotta look through the lens of time."}, {"time": 10533, "text": "You've gotta look at where we were historically at that time."}, {"time": 10536, "text": "There was the peak of the Cold War."}, {"time": 10538, "text": "Our enemies were doing the same kind of experimentation."}, {"time": 10541, "text": "It was essentially another space race."}, {"time": 10544, "text": "What if they broke through a new weapon technology faster than we did?"}, {"time": 10550, "text": "What would that mean for the safety and security of the American people?"}, {"time": 10554, "text": "So right decision or wrong decision, it was guided by and informed by national security priorities."}, {"time": 10562, "text": "So from this program that was designed to use drugs to drive interrogation and torture people was born something very productive, Operation Stargate, which was a chance to use remote viewing and metaphysics to try to collect intelligence."}, {"time": 10579, "text": "Now, even though in the end, the outcome of MKUltra and the outcome of Stargate were mixed, nobody really knows if they did or didn't do what they were supposed to do, we still know that to this day, there's still a demand in the US government and in CIA for people who have sensitivities to ethereal energies."}, {"time": 10599, "text": "By the way, is there any proof that that kind of stuff works?"}, {"time": 10601, "text": "Or it just shows that there's interest."}, {"time": 10606, "text": "It shows that there's openness to consider those kinds of things."}, {"time": 10609, "text": "But is there any evidence that that kind of stuff works?"}, {"time": 10611, "text": "If there's evidence, I haven't seen it."}, {"time": 10614, "text": "Speaking from a science based point of view only, if energy and matter can always be exchanged, then a person who can understand and become sensitive to energy is a person who could become sensitive to what does become matter."}, {"time": 10633, "text": "Yeah, I mean, the basics of the physics might be there, but a lot of people probably are skeptical."}, {"time": 10640, "text": "I'm skeptical too, but I'm just trying to look at it."}, {"time": 10641, "text": "You should be open minded, right?"}, {"time": 10643, "text": "I mean, that's actually, you know, that's what science is about, is remain open minded, even for the things that are long shots, because those are the things that actually define scientific revolutions."}, {"time": 10654, "text": "What about Operation Northwoods?"}, {"time": 10657, "text": "It was a proposed 1962 false flag operation by the DOD and the CIA to be carried out by the CIA to commit acts of terrorism on Americans and blame them on Cuba."}, {"time": 10672, "text": "So JFK, the president, rejected the proposal."}, {"time": 10675, "text": "What do you make that this was on the table, Operation Northwoods?"}, {"time": 10680, "text": "First, I'm glad that JFK rejected it."}, {"time": 10682, "text": "That's a good sign."}, {"time": 10685, "text": "So we have to understand that good ideas are oftentimes born from bad ideas."}, {"time": 10692, "text": "I had a really good friend of mine who actually went on to become a pastor, and he used to say all the time that he wanted all the bad ideas on the table."}, {"time": 10700, "text": "Like, give me all your bad ideas every time we had any kind of conversation."}, {"time": 10703, "text": "And I was always one of those people who was like, isn't a bad idea just a waste of time?"}, {"time": 10708, "text": "And he was like, no, because the best ideas oftentimes come from bad ideas."}, {"time": 10711, "text": "So again, Cuban missile crisis, mass hysteria in the United States about nuclear war from Cuba, missiles blowing up American cities faster than we could even see them coming."}, {"time": 10723, "text": "It makes sense to me that a president would go to, especially the part of CIA, which is the Special Activities Division, it makes perfect sense to me that the president would go to a division called Special Activities, whose job it is to create crazy ideas that have presidential approval, but nobody knows they exist."}, {"time": 10744, "text": "So it makes sense that he would challenge a group like that to come up with any wacky idea, right?"}, {"time": 10749, "text": "Come up with anything."}, {"time": 10750, "text": "Just let's start with something, because we can't bring nothing to the table."}, {"time": 10753, "text": "We have to do something about this Cuban issue."}, {"time": 10755, "text": "And then that's how an operation like that could reasonably be born."}, {"time": 10759, "text": "Not because anybody wants to do it, but because they were tasked by the president to come up with five ideas."}, {"time": 10764, "text": "And it was one of the ideas."}, {"time": 10767, "text": "That still happens to this day."}, {"time": 10769, "text": "The president will still come in, but it'll basically send out a notice to his covert action arm."}, {"time": 10774, "text": "And he will say, I need this."}, {"time": 10778, "text": "And I need it on Wednesday."}, {"time": 10779, "text": "And people have to come back with options for the thing he asked for, a finding."}, {"time": 10784, "text": "He will issue a presidential finding."}, {"time": 10786, "text": "And then his covert action arms have to come back and say, here's how we would do this and hide the hands of the Americans."}, {"time": 10793, "text": "How gangster was it of JFK to reject it though?"}, {"time": 10795, "text": "His baller, right?"}, {"time": 10797, "text": "That's like, that is a mic drop right there."}, {"time": 10800, "text": "Nope, not doing that."}, {"time": 10801, "text": "Yep, doing that."}, {"time": 10803, "text": "A thing that crosses an ethical line, even in a time where the human, the entirety of human civilization hangs in a balance, still forfeit that power."}, {"time": 10816, "text": "That's a beautiful thing about the American experiment."}, {"time": 10820, "text": "That's a few times throughout the history that this has happened, including with our first president, George Washington."}, {"time": 10828, "text": "Well, let me ask about JFK."}, {"time": 10830, "text": "25 times two, and they still keep that stuff classified."}, {"time": 10835, "text": "So do you think the CIA had a hand in the assassination of JFK?"}, {"time": 10843, "text": "I cannot imagine in any reasonable point of view that the organization of CIA had anything to do with the assassination of JFK."}, {"time": 10853, "text": "So it's not possible to infiltrate the CIA, a small part of the CIA in order to attain political or criminal gains, or financial."}, {"time": 10867, "text": "Yeah, absolutely it's possible to infiltrate CIA."}, {"time": 10870, "text": "There's a long history of foreign intelligence services infiltrating CIA, from Aldrich Ames to Jerry Lee recently with China."}, {"time": 10880, "text": "So we know CIA can be infiltrated, even if they are infiltrated, and even if that's interlocutor execution that interlocutor executes on their own agenda or the agenda as directed by their foreign adversary, their foreign handler, that's different than organizational support for an event."}, {"time": 10905, "text": "So I do think it's possible they could have been infiltrated at the time, especially it was a major priority for the Cubans and the Russians to infiltrate some aspect of US intelligence, multiple moles were caught in the years following."}, {"time": 10923, "text": "So it's not surprising that there would be a priority for that."}, {"time": 10927, "text": "But to say that the organization of CIA was somehow in cahoots with, to independently assassinate their own executive, that's a significant stretch."}, {"time": 10936, "text": "I've seen no evidence to support that."}, {"time": 10938, "text": "And it goes contrary to everything I learned from my time at CIA."}, {"time": 10944, "text": "Well, let me ask you, do you think CIA played a part in enabling drug cartels and drug trafficking, which is another big kind of shadow that hangs over the CIA?"}, {"time": 10957, "text": "At the beginning of the drug war, I would imagine the answer is yes."}, {"time": 10962, "text": "CIA has its own counter narcotics division, a division that's dedicated to fighting and preventing narcotics from coming into the United States."}, {"time": 10971, "text": "So when you paint a picture for me, like do you think the CIA was complicit in helping drug trafficking or drug use?"}, {"time": 10979, "text": "When I say yes, my exception is I don't think they did that for Americans inside the United States."}, {"time": 10985, "text": "If the CIA can basically set it up so that two different drug cartels shoot each other by assisting in the transaction of a sale to a third country and then leaking that that sale happened to a competing cartel, that's just letting cartels do what they do."}, {"time": 11003, "text": "That's them doing the dirty work for us."}, {"time": 11005, "text": "So especially at the beginning of the drug war, I think there was tons of space, lots of room for CIA to get involved in the economics of drugs and then let the inevitable happen."}, {"time": 11015, "text": "And that was way more efficient, way more productive than us trying to send our own troops in to kill a bunch of cartel warlords."}, {"time": 11023, "text": "So that makes a ton of sense to me."}, {"time": 11025, "text": "It just seems efficient."}, {"time": 11026, "text": "It seems very practical."}, {"time": 11027, "text": "I do not believe that CIA would like, I don't think all the accusations out there about how they would buy drugs and sell drugs and somehow make money on the side from it."}, {"time": 11036, "text": "So do you think there's, on that point, a connection between Barry Seal, the great governor and then President Bill Clinton, Oliver North and Vice President and former CIA Director George H.W."}, {"time": 11048, "text": "Bush and the little town with a little airport called Mena, Arkansas?"}, {"time": 11054, "text": "So I am out of my element now."}, {"time": 11057, "text": "This is one I haven't heard many details about."}, {"time": 11059, "text": "Okay, so your sense is any of the drug trafficking has to do with criminal operations outside of the United States and the CIA just leveraging that to achieve its ends but nothing to do with American citizens and American politicians."}, {"time": 11079, "text": "With American citizens, again, speaking organizationally."}, {"time": 11083, "text": "So that would be my sense, yes."}, {"time": 11085, "text": "Let me ask you about, so back to Operation Northwoods because it's such a powerful tool, sadly powerful tool used by dictators throughout history, the false flag operation."}, {"time": 11104, "text": "So I think there's, and you said the terrorist attacks in 9 11 were, it changed a lot for us, for the United States, for Americans."}, {"time": 11118, "text": "It changed the way we see the world."}, {"time": 11119, "text": "It woke us up to the harshness of the world."}, {"time": 11122, "text": "I think there's, to my eyes at least, there's nothing that shows evidence that 9 11 was a quote inside job."}, {"time": 11130, "text": "But is the CIA or the intelligence agencies or the US government capable of something like that?"}, {"time": 11141, "text": "But that's the question."}, {"time": 11142, "text": "So there's a bunch of shadiness about how it was reported on."}, {"time": 11147, "text": "I just can't, that's the thing I struggle with."}, {"time": 11153, "text": "While there's no evidence that there was an inside job, it raises the question to me, well, could something like this be an inside job?"}, {"time": 11162, "text": "Because it sure as heck, now looking back 20 years, the amount of money that was spent on these wars, the military industrial complex, the amount of interest in terms of power and money involved, organizationally, can something like that happen?"}, {"time": 11182, "text": "You know Occam's razor."}, {"time": 11184, "text": "So the harem's razor is that you can never prescribe to conspiracy what could be explained through incompetence."}, {"time": 11194, "text": "That is one of, those are two fundamental guidelines that we follow all the time."}, {"time": 11198, "text": "The simplest answer is oftentimes the best and never prescribe to conspiracy what can be explained through incompetence."}, {"time": 11204, "text": "Can you elaborate what you mean by we?"}, {"time": 11207, "text": "We as intelligence professionals."}, {"time": 11210, "text": "So you think there's a deep truth to that second razor?"}, {"time": 11215, "text": "There is more than a deep truth."}, {"time": 11217, "text": "There's ages of experience for me and for others."}, {"time": 11221, "text": "So in general, people are incompetent."}, {"time": 11224, "text": "If left to their own means they're more incompetent than they are malevolent at a large organizational scale."}, {"time": 11233, "text": "People are more incompetent of executing a conspiracy than they are of competently, yeah, than they are of competently executing a conspiracy."}, {"time": 11245, "text": "That's really what it means is that it's so difficult to carry out a complex lie that most people don't have the competency to do it."}, {"time": 11253, "text": "So it doesn't make any sense to lead thinking of conspiracy."}, {"time": 11256, "text": "It makes more sense to lead assuming incompetence."}, {"time": 11260, "text": "When you look at all of the outcomes, all the findings from 9 11, it speaks to incompetence."}, {"time": 11265, "text": "It speaks brashly and openly to incompetence and nobody likes talking about it."}, {"time": 11270, "text": "FBI and CIA to this day hate hearing about it."}, {"time": 11273, "text": "The 9 11 commission is gonna go down in history as this painful example of the incompetence of the American intelligence community."}, {"time": 11281, "text": "And it's going to come back again and again."}, {"time": 11282, "text": "Every time there's an intel flap, it's gonna come back again and again."}, {"time": 11286, "text": "What are you seeing?"}, {"time": 11287, "text": "Even right now, we miss the US intelligence infrastructure, misjudged Afghanistan, misjudged Hong Kong, misjudged Ukraine's and Russia's invasion of Ukraine."}, {"time": 11300, "text": "Those were three massive misjudgments in a few years."}, {"time": 11304, "text": "That speaks, it's just embarrassing."}, {"time": 11308, "text": "So all the sort of cover up looking things around 9 11 is just people being embarrassed by their failures."}, {"time": 11316, "text": "If they're taking steps to cover anything up, it's just their own, it's a painful reminder of their lack of competency at the time."}, {"time": 11326, "text": "Now, I understand that conspiracy theorists want to take inklings of information and put them together in a way that is the most damning, but that goes back to our point about overvaluing losses and undervaluing gains."}, {"time": 11340, "text": "It's just predictable human behavior."}, {"time": 11343, "text": "Let me ask you about this because it comes up often."}, {"time": 11347, "text": "So I'm from MIT and there's a guy by the name of Jeffrey Epstein that still troubles me to this day that some of the people I respect were interacted with this individual and fell into his influence."}, {"time": 11363, "text": "The charm, charisma, whatever the hell he used to delude these people, he did so successfully."}, {"time": 11376, "text": "I'm very open minded about this thing."}, {"time": 11378, "text": "I just, I would love to learn more, but a lot of people tell me, a lot of people I respect, that there's intelligence agencies behind this individual."}, {"time": 11387, "text": "So they were using Jeffrey Epstein for getting access to powerful people and then to control and manipulate those powerful people."}, {"time": 11397, "text": "The CIA, I believe, is not brought up as often as Mossad."}, {"time": 11401, "text": "And so this goes back to the original aspect of our conversation is how much each individual intelligence agency is willing to go to control, to manipulate, to achieve its means."}, {"time": 11413, "text": "Do you think there is, can you educate me?"}, {"time": 11416, "text": "If, obviously you don't know, but you can bet, what are the chances the intelligence agencies are involved with the character of Jeffrey Epstein?"}, {"time": 11426, "text": "In some way, shape, or form with the character of Epstein, it's 100% guaranteed that some intelligence organization was involved, but let's talk about why."}, {"time": 11436, "text": "Let's talk about why, okay?"}, {"time": 11438, "text": "There's multiple types of intelligence assets, just like we were talking earlier."}, {"time": 11443, "text": "There's foreign intelligence reporting assets, there's access agents, and then there's agents of influence."}, {"time": 11451, "text": "Three different categories of intelligence, right?"}, {"time": 11454, "text": "One is when you talk about foreign intelligence reporters, these are people who have access to secrets and their job is to give you their secrets in exchange for gold or money or alcohol or prostitution or whatever else, right?"}, {"time": 11465, "text": "Their job is to give you secrets and then you pay them for the secrets."}, {"time": 11469, "text": "Access agents, their job is to give you physical access or digital access to something of interest to you."}, {"time": 11477, "text": "So maybe they're the ones that open a door that should have been locked and let you come in and stick your thumb drive in the computer."}, {"time": 11483, "text": "Or maybe they're the ones that share a phone number with somebody and then they're just like, just don't tell them you got the phone number from me."}, {"time": 11489, "text": "Their job is to give you access."}, {"time": 11491, "text": "Then you have these agents of influence."}, {"time": 11493, "text": "An agent of influence's job is to be part of your effort to influence the outcomes in some way that benefits your intelligence requirements, right?"}, {"time": 11505, "text": "Of these three types of people, the least scrupulous and the most shady is your agent of influence."}, {"time": 11514, "text": "Because your agent of influence understands exactly what they're doing."}, {"time": 11517, "text": "They know they're working with one guy and they know they're using the influence to manipulate some other guy."}, {"time": 11524, "text": "When it comes to powerful people, especially wealthy, powerful people, the only thing that interests them is power."}, {"time": 11533, "text": "Money is not a challenge anymore."}, {"time": 11536, "text": "Prestige, notoriety, none of those things are a challenge."}, {"time": 11539, "text": "The rest of us, we're busy trying to make money."}, {"time": 11541, "text": "We're busy trying to build a reputation."}, {"time": 11542, "text": "We're busy trying to build a career, keep a family afloat."}, {"time": 11545, "text": "At the highest levels, they're bored."}, {"time": 11547, "text": "They don't need any of that."}, {"time": 11548, "text": "The only thing that they care about is being able to wield power."}, {"time": 11551, "text": "So a character like Jeffrey Epstein is exactly the kind of character that the Chinese would want, the Russians would want, Mossad would want, the French would want."}, {"time": 11563, "text": "It's too easy because the man had access to a wide range of American influential people."}, {"time": 11572, "text": "For corporate espionage uses, for economic espionage uses, for national security espionage uses, it doesn't make any sense that a person like that wouldn't be targeted."}, {"time": 11587, "text": "Who, and whether, I think the really important distinction here is was this person, was Jeffrey Epstein created, or once he's achieved and built his network, was he then infiltrated?"}, {"time": 11603, "text": "And that's a really sort of important difference."}, {"time": 11606, "text": "Like at which stage do you connect a person like that?"}, {"time": 11609, "text": "You start to notice maybe they're effective at building a network, and then you start making, building a relationship to where at some point it's a job, they're working for you."}, {"time": 11621, "text": "Or do you literally create a person like that?"}, {"time": 11623, "text": "Yeah, so intelligence organizations have different strategies here."}, {"time": 11627, "text": "In the United States, we never create."}, {"time": 11629, "text": "We don't have a budget cycle that allows us to create."}, {"time": 11633, "text": "I mean, the maximum budget cycle in the United States is five years."}, {"time": 11637, "text": "So even if we were to try to invest in some seed operation or create some character of influence, essentially every year you have to justify why you're spending budget."}, {"time": 11647, "text": "And that becomes very difficult in a democracy like ours."}, {"time": 11650, "text": "However, Russia and China are extremely adept at seed operations, longterm operations."}, {"time": 11657, "text": "They are willing to invest and develop and create an agent that serves their purposes."}, {"time": 11665, "text": "Now, to create someone from scratch like Jeffrey Epstein, the probabilities are extremely low."}, {"time": 11673, "text": "They would have had to start with like a thousand different targets and try to grow a thousand different, if you will, influencers, and then hope that one of them hits, kind of like a venture capital firm, right?"}, {"time": 11684, "text": "Invest in many, hope that a few hits."}, {"time": 11686, "text": "More likely, they observed him at some point in his own natural rise."}, {"time": 11692, "text": "They identified his personal vulnerability, very classic espionage technique."}, {"time": 11697, "text": "And then they stepped in, introduced themselves mid career and said, hey, we know you have this thing that you like that isn't really frowned upon by your own people, but we don't frown upon it."}, {"time": 11707, "text": "And we can help you both succeed and have an endless supply of ladies along the way."}, {"time": 11714, "text": "I recently talked to Ryan Graves, who's a lieutenant."}, {"time": 11717, "text": "Ryan Graves, who's a fighter jet pilot, about many things."}, {"time": 11722, "text": "He also does work on autonomous weapon systems, drones, and that kind of thing, including quantum computing."}, {"time": 11729, "text": "But he also happens to be one of the very few pilots that were willing to go on record and talk about UFO sightings."}, {"time": 11739, "text": "Does the CIA and the federal government have interest in UFOs?"}, {"time": 11744, "text": "In my experience at CIA, that is, an area that remains very compartmented."}, {"time": 11751, "text": "And that could be one of two reasons."}, {"time": 11754, "text": "It could be because there is significant interest and that's why it's so heavily compartmented."}, {"time": 11758, "text": "Or it could be because it's an area that's non, that's just not important."}, {"time": 11763, "text": "It's a distraction."}, {"time": 11764, "text": "So they compartment it so it doesn't distract from other operations."}, {"time": 11770, "text": "One of the areas that I've been quite interested in and where I've done a lot of research and I've done some work in the private intelligence and private investigation side is with UFOs."}, {"time": 11782, "text": "The place where UFOs really connect with the federal government is when it comes to aviation safety and predominance of power."}, {"time": 11790, "text": "So FAA and the U.S. Air Force and the U.S. military are very invested in knowing what's happening in the skies above the United States."}, {"time": 11798, "text": "And that's of primary interest to them."}, {"time": 11801, "text": "When they can rule out the direct threat to national security of UFOs, then they become less interested."}, {"time": 11807, "text": "That said, when you have unexplained aerial phenomenon that are unexplained, that can't directly be tied to anything that is known of the terrestrial world, then they're left without an answer to their question."}, {"time": 11825, "text": "They don't know if it's a threat or not a threat."}, {"time": 11828, "text": "But I think that's a very important question."}, {"time": 11830, "text": "But I think the scarier concern for the U.S. national government or for the U.S. federal government, the scarier concern that nobody talks about is what if the UFO isn't alien?"}, {"time": 11840, "text": "What if it is actually a cutting edge war machine that we are eons behind ever being able to replicate?"}, {"time": 11849, "text": "Or the other concern is that it's a system, it's a machine from a foreign power that's doing intelligence collection."}, {"time": 11859, "text": "Not just military purposes, it's actually collecting data."}, {"time": 11863, "text": "Well, they fall, a lot of times the federal government will see the two as the same."}, {"time": 11867, "text": "It's a hostile tool from a foreign government."}, {"time": 11870, "text": "So collection of information is a hostile act."}, {"time": 11873, "text": "Absolutely, that's why the Espionage Act exists."}, {"time": 11876, "text": "That's why it's a criminal offense if you're committing espionage in the United States as a U.S. citizen or a foreign citizen."}, {"time": 11883, "text": "So I guess they keep digging until they can confirm it's not a threat."}, {"time": 11887, "text": "But it just, and you're saying that there's not, from your understanding, much evidence that they're doing."}, {"time": 11892, "text": "So it could be because they're compartmentalized."}, {"time": 11897, "text": "But you're saying private intelligence institutions are trying to make progress on this."}, {"time": 11905, "text": "Yeah, it's really difficult to know the scale."}, {"time": 11909, "text": "Yeah, there's an economic interest in the private intelligence world."}, {"time": 11913, "text": "Because, for example, if you understand why certain aerial phenomenon are happening over a location, then you can use that to inform investors, whether to invest in that location or avoid investment in that location."}, {"time": 11927, "text": "But that's not a national security concern."}, {"time": 11928, "text": "So it doesn't matter to the federal government."}, {"time": 11932, "text": "Could these UFOs be aliens?"}, {"time": 11934, "text": "Now I'm going into a territory of you as a human being wondering about all the alien civilizations that are out there."}, {"time": 11941, "text": "The humbling question."}, {"time": 11943, "text": "We are not alone."}, {"time": 11945, "text": "You think we're not alone."}, {"time": 11947, "text": "It's an improbability that we are alone."}, {"time": 11950, "text": "If by virtue of the fact that sentient human life exists, intelligent human life exists, all the probabilities that would have to be destroyed for that to be true simply speak over the galaxies that exist that there's no possible way we're alone."}, {"time": 11966, "text": "It's a mathematical equation."}, {"time": 11967, "text": "It's a one or a zero, right?"}, {"time": 11970, "text": "And for me, it has to exist."}, {"time": 11972, "text": "It's impossible otherwise rationally for me to think that we are truly the only intelligent life form in all of the universe."}, {"time": 11980, "text": "But to think that an alien life form is anything like us at all is equally as inconceivable."}, {"time": 11989, "text": "To think that they're carbon based bipedal humanoid alien species that just happened to fly around in metal machines and visit alien planets in a way that they become observed is, it's just silly, it's the world of sci fi."}, {"time": 12007, "text": "Well, let me push."}, {"time": 12008, "text": "Every good scientist, because we always assume that they're superior to us in intelligence."}, {"time": 12013, "text": "When any scientist carries out an experiment, the whole objective of the experiment is to observe without being disclosed or being discovered."}, {"time": 12023, "text": "So why on earth would we think that the superior species makes the mistake of being discovered over and over again?"}, {"time": 12031, "text": "So to push back on that idea, if we were to think about us humans trying to communicate with ants, first we observe for a while."}, {"time": 12039, "text": "There'll be a bunch of PhDs written, a bunch of people just sort of collecting data, taking notes, trying to understand about this thing that you detected that seems to be a living thing, which is a very difficult thing to define from an alien perspective or from our perspective if we find life on Mars or something like that."}, {"time": 12057, "text": "Okay, so you observe for a while."}, {"time": 12059, "text": "But then if you want to actually interact with it, how would you interact with the ants?"}, {"time": 12064, "text": "If I were to interact with the ants, I would try to infiltrate."}, {"time": 12070, "text": "I would try to figure out what is the language they use to communicate with each other."}, {"time": 12077, "text": "I would try to operate at their physical scale, like in terms of the physics of their interaction, in terms of the information, methods, mediums of information exchange with pheromones or whatever, however the heck, ants."}, {"time": 12093, "text": "So I would try to mimic them in some way."}, {"time": 12096, "text": "So in that sense, it makes sense that the objects we would see, you mentioned bipedal."}, {"time": 12104, "text": "Yes, of course it's ridiculous that aliens would actually be very similar to us, but maybe they create forms in order to be like, here, the humans will understand it."}, {"time": 12118, "text": "And this needs to be sufficiently different from humans to know that there's something weird."}, {"time": 12122, "text": "I don't know, I think it's actually an incredibly difficult problem of figuring out how to communicate with a thing way dumber than you."}, {"time": 12131, "text": "People assume if you're smart, it's easier to talk to the dumb thing."}, {"time": 12136, "text": "But I think it's actually extremely difficult when the gap in intelligence is just orders of magnitude."}, {"time": 12143, "text": "And so of course you can observe, but once you notice the thing is sufficiently interesting, how do you communicate with that thing?"}, {"time": 12152, "text": "So this is where, one of the things I always try to highlight is how conspiracies are born."}, {"time": 12158, "text": "Because many people don't understand how easy it is to fall into the conspiratorial cycle."}, {"time": 12164, "text": "So the first step to a conspiracy being born is to have a piece of evidence that is true."}, {"time": 12172, "text": "And then immediately following the true evidence is a gap in information."}, {"time": 12177, "text": "And then to fill in the gap of information, people create an idea and then the next logical outcome is based on the idea that they just created, which is an idea that's based on something that was imagined in the first place."}, {"time": 12192, "text": "So the idea, the factual thing is now two steps away and then three steps away, four steps away as the things go on."}, {"time": 12198, "text": "And then all of a sudden you have this kernel of truth that turned into this wild conspiracy."}, {"time": 12203, "text": "So in our example, you talked about humans trying to communicate with ants."}, {"time": 12207, "text": "Ants are not intelligent."}, {"time": 12208, "text": "There's no, ants are not intelligent species."}, {"time": 12210, "text": "They're a drone species that's somehow commanded through whatever technology, whatever."}, {"time": 12216, "text": "Spoken like a typical human, but yes."}, {"time": 12217, "text": "Whatever biological thing is in the queen, right?"}, {"time": 12220, "text": "But they're not, it's not a fair equivalent."}, {"time": 12222, "text": "But let's look at gorillas or let's look at something in the monkey family, right?"}, {"time": 12225, "text": "Where largely we agree that there is some sort of intelligence there or dolphins, some sort of intelligence, right?"}, {"time": 12232, "text": "It is a human thing, a human thing to want to observe and then communicate and integrate."}, {"time": 12242, "text": "That's a human thing, not an intelligent life thing."}, {"time": 12246, "text": "So for us to even think that a foreign and intelligent alien species would want to engage and communicate at all is an extremely human assumption."}, {"time": 12256, "text": "And then from that assumption, then we started going into all the other things you said."}, {"time": 12260, "text": "If they wanted to communicate, wouldn't they want to mimic?"}, {"time": 12263, "text": "If they wanted to mimic, wouldn't they create devices like ours?"}, {"time": 12266, "text": "So now we're three steps removed from the true fact of there's something unexplainable in the skies."}, {"time": 12274, "text": "Yeah, so the fact is there's something unexplainable in the skies and then we're filling in the gaps with all our basic human biases and assumptions."}, {"time": 12285, "text": "Now we're getting right back to Project Northwood."}, {"time": 12287, "text": "We need some plan."}, {"time": 12288, "text": "I don't care how crazy the idea is, guys."}, {"time": 12290, "text": "Give me some plan."}, {"time": 12291, "text": "So that's where we come up with."}, {"time": 12293, "text": "Maybe it's an alien species trying to communicate or maybe it's an alien, a hostile threat that's trying to take over the world or who knows what."}, {"time": 12300, "text": "Maybe it's."}, {"time": 12301, "text": "But you have to somehow construct hypotheses and theories for anomalies."}, {"time": 12310, "text": "And then from that, amidst giant pile of the ridiculous, emerges perhaps a deeper truth over a period of decades."}, {"time": 12321, "text": "And at first, that truth is ridiculed and then it's accepted, that whole process."}, {"time": 12329, "text": "The Earth revolving around the sun?"}, {"time": 12330, "text": "Yeah, the Earth revolving around the sun."}, {"time": 12332, "text": "But to me, it's interesting because it asks us looking out there with SETI, just looking for alien life, is forcing us to really ask questions about ourselves, about what is life, how special."}, {"time": 12348, "text": "First of all, what is intelligence?"}, {"time": 12349, "text": "How special is intelligence in the cosmos?"}, {"time": 12352, "text": "And I think it's inspiring and challenging to us as human beings, both on a scientific and engineering level, but also on a philosophical level."}, {"time": 12361, "text": "I mean, all of those questions that are laid before us when you start to think about alien life."}, {"time": 12366, "text": "So you interviewed Joe Rogan recently."}, {"time": 12369, "text": "And he said something that I thought was really, really brilliant during the podcast interview."}, {"time": 12374, "text": "He said that you."}, {"time": 12375, "text": "He's gonna love hearing that."}, {"time": 12376, "text": "But go ahead, sorry."}, {"time": 12378, "text": "But he said that he realized at some point that the turn in his opinion about UFOs happened when he realized how desperately he wanted it to be true."}, {"time": 12390, "text": "This is the human condition."}, {"time": 12393, "text": "We are pink matter works the same way as everybody's pink matter."}, {"time": 12396, "text": "And one of the ways that our pink matter works is with this thing, with what's known as a cognitive bias."}, {"time": 12401, "text": "It's a mental shortcut."}, {"time": 12402, "text": "Essentially, your brain doesn't want to process through facts over and over again."}, {"time": 12406, "text": "Instead, it wants to assume certain facts are in place and just jump right to the conclusion."}, {"time": 12410, "text": "It saves energy, it saves megabytes."}, {"time": 12412, "text": "So what Joe or Joe Rogan, I feel weird calling him Joe, I don't know him, but what Joe identified on his own."}, {"time": 12419, "text": "Mr. Rogan."}, {"time": 12420, "text": "What Mr. Rogan identified on his own."}, {"time": 12424, "text": "Was his own cognitive loop."}, {"time": 12426, "text": "And then he immediately grew suspicious of that loop."}, {"time": 12430, "text": "That is a super powerful tool."}, {"time": 12431, "text": "That is something that most people never become self actualized enough to realize that they have a cognitive loop, let alone questioning their own cognitive loop."}, {"time": 12440, "text": "So that was, when it came to this topic specifically, that was just something that I thought was really powerful because you learn to not trust your own mind."}, {"time": 12450, "text": "Just for the record, after he drinks one whiskey, all that goes out."}, {"time": 12456, "text": "I think that was just in that moment in time, like, you know."}, {"time": 12460, "text": "A moment of brilliance."}, {"time": 12461, "text": "A moment of brilliance is, I think he still is, you know, he's definitely, one of the things that inspires me about Joe is how open minded he is, how curious he is."}, {"time": 12473, "text": "He refuses to let sort of the conformity and the conventions of any one community, including the scientific community, be a kind of thing that limits his curiosity, of asking what if, like the whole, it's entirely possible."}, {"time": 12488, "text": "I think that's a beautiful thing."}, {"time": 12490, "text": "And it actually represents what the best of science is, that childlike curiosity."}, {"time": 12495, "text": "But, so it's good to sort of balance those two things, but then you have to wake up to it, like, is this, is there a chance this is true, or do I just really want it to be true?"}, {"time": 12507, "text": "Like that hot girl that talks to you overseas?"}, {"time": 12512, "text": "For a brief moment."}, {"time": 12515, "text": "There's actually a deeper explanation for it that I'll tell you off the mic that perhaps a lot of people can kind of figure out."}, {"time": 12523, "text": "Just to take it one step further, cause I love this stuff."}, {"time": 12525, "text": "Personally, I love pink matter stuff."}, {"time": 12528, "text": "In your interview with Jack Barsky, Jack's a good friend of mine, a good dude."}, {"time": 12532, "text": "An incredible person."}, {"time": 12533, "text": "In your conversation with Jack Barsky, you guys, he started talking to you about how his recruiters were feeding back to him his own beliefs, his own opinions about himself, how smart he was, how good he was, how uniquely qualified he was."}, {"time": 12548, "text": "That's all pink matter manipulation."}, {"time": 12550, "text": "Feeding right back to the person what they already think of themselves is a way to get them to invest and trust you faster because obviously you value them for all the right reasons because that's how they see themselves."}, {"time": 12562, "text": "So that loop that the KGB was using with Jack, Jack did not wake up to that loop at the time."}, {"time": 12571, "text": "He woke up to it later."}, {"time": 12572, "text": "So it happens to all of us."}, {"time": 12575, "text": "We're all in a loop."}, {"time": 12577, "text": "It's just whether it's about oat milk or whether it's about aliens or whether it's about the Democrats trying to take your guns, whatever it is, everybody's in a loop and we've got to wake up to ask ourselves, just like you said, is it true or do we just really want it to be true?"}, {"time": 12593, "text": "And until you ask yourself that question, you're just one of the masses trapped in the loop."}, {"time": 12598, "text": "Yeah, that's the really, the Nietzsche gaze into the abyss."}, {"time": 12603, "text": "It's a dangerous thing."}, {"time": 12605, "text": "That's the path to insanity is to ask that question."}, {"time": 12608, "text": "You want to be doing it carefully, but it's also the place where you can truly discover something fundamental about this world that people don't understand and then that and lay the groundwork for progress, scientific, cultural, all that kind of stuff."}, {"time": 12627, "text": "What is one spy trick?"}, {"time": 12628, "text": "This is from a Reddit that I really enjoy."}, {"time": 12631, "text": "What's one spy trick and you're full of a million spy tricks."}, {"time": 12636, "text": "People should follow you."}, {"time": 12637, "text": "You did an amazing podcast."}, {"time": 12639, "text": "You're just an amazing person."}, {"time": 12642, "text": "What is the one spy trick you would teach everyone that they can use to improve their life instantly?"}, {"time": 12647, "text": "Now you already mentioned quite a few, but what else could jump to mind?"}, {"time": 12654, "text": "My go to answer for this has not really changed much over the last few years."}, {"time": 12657, "text": "So the first, the most important spy trick to change everything immediately is something called perception versus perspective."}, {"time": 12666, "text": "We all look at the world through our own perception."}, {"time": 12670, "text": "My dad used to tell me, my stepdad used to tell me that perception is reality."}, {"time": 12673, "text": "And I was arguing this with him when I was 14 years old."}, {"time": 12677, "text": "I told you so dad, you're still wrong."}, {"time": 12680, "text": "But perception is your interpretation of the world around you, but it's unique only to you."}, {"time": 12686, "text": "There's no advantage in your perception."}, {"time": 12688, "text": "That's why so many people find themselves arguing all the time, trying to convince other people of their own perception."}, {"time": 12695, "text": "The way that you win any argument, the way that you get ahead in your career, the way that you outsell or out race anybody is when you move off of perception and move into perspective."}, {"time": 12709, "text": "Perspective is the act or the art of observing the world from outside of yourself, whether that's outside of yourself as like an entity, just observing in a third from a different point of view, or even more powerful, you sit in the shoes, you sit in the seat of the person opposite you."}, {"time": 12727, "text": "And you think to yourself, what is their life like?"}, {"time": 12730, "text": "What do they feel right now?"}, {"time": 12733, "text": "Are they comfortable?"}, {"time": 12733, "text": "Are they uncomfortable?"}, {"time": 12734, "text": "Are they afraid?"}, {"time": 12735, "text": "Are they scared?"}, {"time": 12736, "text": "What's the stressor that they woke up to this morning?"}, {"time": 12738, "text": "What's the stressor that they're gonna go to sleep with tonight?"}, {"time": 12741, "text": "When you shift places and get out of your own perception and into someone else's perspective, now you're thinking like them, which is giving you an informational advantage."}, {"time": 12751, "text": "But you know what they're all doing?"}, {"time": 12753, "text": "Everyone else out there is trapped in their own perception, not thinking about a different perspective."}, {"time": 12759, "text": "So immediately you have superior information, superior positioning, you have an advantage that they don't have."}, {"time": 12766, "text": "And if you do that to your boss, it's gonna change your career."}, {"time": 12770, "text": "If you do that to your spouse, it's gonna change your marriage."}, {"time": 12772, "text": "If you do that to your kids, it's gonna change your family legacy because nobody else out there is doing it."}, {"time": 12778, "text": "It's so interesting how difficult empathy is for people and how powerful it is, especially for, like you said, with spouse, like intimacy."}, {"time": 12788, "text": "Like stepping outside of yourself and really putting yourself in the shoes of the other person considering how they see the world."}, {"time": 12794, "text": "And that's, I really enjoy that because how does that exactly lead to connection?"}, {"time": 12801, "text": "I think when you start to understand the way the other person sees the world, you start to enjoy the world through their eyes and you start to be able to share, in terms of intimacy, share the beauty that they see together because you understand their perspective."}, {"time": 12821, "text": "And somehow you converge as well."}, {"time": 12823, "text": "Of course, that allows you to gather information better and all that kind of stuff."}, {"time": 12827, "text": "And that allows you to work together better, to share in all different kinds of ways."}, {"time": 12833, "text": "But for intimacy, that's a really powerful thing."}, {"time": 12835, "text": "And also for, actually, like people you really disagree with or people on the internet you disagree with and so on, I find empathy is such a powerful way to resolve any tensions there."}, {"time": 12849, "text": "Even like people like trolls or all that kind of stuff, I don't deride them."}, {"time": 12854, "text": "I just kind of put myself in their shoes and it becomes like an enjoyable comradery with that person."}, {"time": 12861, "text": "So I wanna draw a pretty hard line between perspective and empathy."}, {"time": 12866, "text": "Because empathy is, frankly, an overused term by people who don't really know what they're saying sometimes."}, {"time": 12874, "text": "I think you know what you're saying, but the vast majority of people listening."}, {"time": 12877, "text": "I would argue that, but that's fine."}, {"time": 12879, "text": "As soon as you say empathy, they're gonna just be like, oh, yeah, I've heard this a thousand times."}, {"time": 12884, "text": "Empathy is about feeling what other people feel."}, {"time": 12889, "text": "Or understanding."}, {"time": 12890, "text": "It's more about feeling, would you say?"}, {"time": 12891, "text": "Yeah, it's about feelings."}, {"time": 12893, "text": "It's about understanding someone else's feelings."}, {"time": 12894, "text": "Feeling, it's not the same as sympathy where you feel their feelings."}, {"time": 12899, "text": "Empathy is about recognizing that they have feelings and recognizing that their feelings are valid."}, {"time": 12904, "text": "Perspective is more than just feelings."}, {"time": 12907, "text": "It's about the brain."}, {"time": 12909, "text": "It's about the pink matter on the left side and the right side of the brain."}, {"time": 12914, "text": "Yes, I care about feelings, and this goes directly to your point about connection."}, {"time": 12918, "text": "Yes, I care about feelings, but I also care about objectives."}, {"time": 12922, "text": "What is your life, what is your aspirational goal?"}, {"time": 12925, "text": "What was it like to grow up as you?"}, {"time": 12927, "text": "What was it like to experience this and how did this shape your opinion on that?"}, {"time": 12930, "text": "And what is it that you're going to do next?"}, {"time": 12935, "text": "More than just feelings, actual tactical actions."}, {"time": 12938, "text": "And that becomes extremely valuable in the operational world because if you can get into someone's head, left brain and right brain, feelings and logic, you can start anticipating what actions they're gonna take next."}, {"time": 12950, "text": "You can direct the actions that they're going to take next because you're basically telling them the story that's in their own head."}, {"time": 12955, "text": "When it comes to relationships and personal connection, we talked about it earlier, the thing that people want the most is community."}, {"time": 12965, "text": "They want someone else who understands them."}, {"time": 12968, "text": "They want to be with people."}, {"time": 12969, "text": "They don't want to be alone."}, {"time": 12971, "text": "The more you practice perspective, empathy or no empathy, the more you just validate that a person is there."}, {"time": 12979, "text": "I am in this time and space with you in this moment."}, {"time": 12982, "text": "Feelings aside, that is powerful."}, {"time": 12987, "text": "That is intimate."}, {"time": 12989, "text": "And whether you're talking about lovers or whether you're talking about a business exchange or whether you're talking about collaborators in a crime, I'm here with you ride or die, let's do it."}, {"time": 13001, "text": "How much of what you've learned in your role at the CIA transfer over to relationships, the business relationship to other aspects of life?"}, {"time": 13011, "text": "This is something you work closely with powerful people to help them out."}, {"time": 13015, "text": "What have you learned about the commonalities, about the problems that people face?"}, {"time": 13019, "text": "Man, I would say about a solid 95% of what I learned at CIA carries over to the civilian world."}, {"time": 13027, "text": "That 5% that doesn't is, it would carry over in a disaster, right?"}, {"time": 13033, "text": "There's knowing how to shoot on target with my non dominant hand really only has one purpose."}, {"time": 13040, "text": "It's not gonna happen day to day, right?"}, {"time": 13043, "text": "Knowing how to do a dead drop that isn't discoverable by the local police force isn't gonna be useful right now, but it could be useful in disaster."}, {"time": 13050, "text": "But the 95% of stuff that's useful, it's all tied to the human condition."}, {"time": 13054, "text": "It's all tied to being able to understand what someone's thinking, understand what someone's feeling, direct their thoughts, direct their emotions, direct their thought process, win their attention, win their loyalty, win influence with them, grow your network, grow your own circle of influence."}, {"time": 13074, "text": "I mean, all of that is immensely, immensely valuable."}, {"time": 13079, "text": "As an example, the disguise, the disguise thing that we talked about earlier, disguise in and of itself has mixed utility."}, {"time": 13086, "text": "If you're Brad Pitt and you don't want anybody to know you're Brad Pitt, you put on a level one disguise and that's great."}, {"time": 13090, "text": "Or maybe you call me and I walk you through a level two disguise so that you can go to Aruba and nobody's gonna know you're in Aruba, right?"}, {"time": 13096, "text": "Whatever it is."}, {"time": 13098, "text": "But even there with the 5% that doesn't apply to everyday life, there's still elements that do."}, {"time": 13104, "text": "For example, when a person looks at a human being's face, the first place they look is the same part of the face as if they were reading a piece of paper."}, {"time": 13114, "text": "So in English, we start from the top left and we read left to right, top to bottom."}, {"time": 13118, "text": "So when an English speaking person interacts with another person, the first thing they look at isn't their eyes."}, {"time": 13125, "text": "It's the upper left from their point of view, corner of their face, right?"}, {"time": 13132, "text": "They look there and the information they get is hair color, hair pattern, skin color, right?"}, {"time": 13139, "text": "Before they know anything else about the face."}, {"time": 13141, "text": "This is one of the reasons why somebody can look at you and then you ask them, what color are my eyes?"}, {"time": 13145, "text": "I don't really remember."}, {"time": 13146, "text": "Because the way they read the face, they read it from left to right, top to bottom."}, {"time": 13150, "text": "So they're paying a lot of attention to the first few things they see and then they're paying less attention as they go down the face."}, {"time": 13154, "text": "The same scrolling behavior that you see on the internet, right?"}, {"time": 13158, "text": "So when you understand that through the lens of disguise, it allows you to make a very powerful disguise."}, {"time": 13163, "text": "The most important part of your disguise is here if you're English speaking, right?"}, {"time": 13167, "text": "Here if you're speaking some foreign languages that read right to left, right?"}, {"time": 13171, "text": "If you're, if it's Chinese, you know that they're gonna look from here down because they read left down."}, {"time": 13177, "text": "So yeah, knowing that really helps you sort of configure the things in terms of physical appearance."}, {"time": 13183, "text": "So when it comes to how to make a disguise, not so useful to the ultra wealthy usually."}, {"time": 13187, "text": "But when it comes to how to read a face or more importantly, how people are going to read your face, that's extremely important because now you know where to find the first signs of deception in a baseline or anything else."}, {"time": 13199, "text": "You mentioned that the idea of having privacy is one that we kind of, we think we can, but we really don't."}, {"time": 13212, "text": "Is it possible for maybe somebody like me or a regular person to disappear from the grid?"}, {"time": 13218, "text": "Yeah, and it's not as hard as you might think."}, {"time": 13220, "text": "It's not convenient."}, {"time": 13221, "text": "Again, convenience and security."}, {"time": 13224, "text": "You can disappear tomorrow, right?"}, {"time": 13226, "text": "I can walk you through three steps right now that are gonna help you disappear tomorrow, but none of them are convenient."}, {"time": 13231, "text": "They're all extremely secure, right?"}, {"time": 13233, "text": "The first thing you do is every piece of digital technology you have that is connected to you in any way is now dead."}, {"time": 13241, "text": "You just let the battery run out."}, {"time": 13244, "text": "You never touch it again, starting at this moment."}, {"time": 13246, "text": "What you have to do is go out and acquire a new one."}, {"time": 13250, "text": "Realistically, you will not be able to acquire a new one in the United States by buying it because to do so, you would tie it to your credit card."}, {"time": 13258, "text": "You would tie it to a location, a time, a place, a registered name, whatever else."}, {"time": 13262, "text": "So you would have to acquire it essentially by theft or through the black market."}, {"time": 13267, "text": "So you would want something because you're gonna need the advantage of technology without it being in your name."}, {"time": 13273, "text": "So you go out and you steal a phone or you steal a laptop."}, {"time": 13276, "text": "You do whatever you have to do to make sure that you can get on with the password and whatever else that might be."}, {"time": 13280, "text": "As dirty or as clean as you want that to be, we're all morally flexible here, but now you have a technological device that you can work with."}, {"time": 13289, "text": "And then from there on, you're just doing whatever you have to do, whether you're stealing every step of the way or whether you run a massive con."}, {"time": 13298, "text": "Keep in mind that we often talk about con men and cons."}, {"time": 13302, "text": "Do you know what the root, the word that con is a root word for?"}, {"time": 13308, "text": "That's what a con man is."}, {"time": 13309, "text": "A con man is a confidence man."}, {"time": 13311, "text": "Just somebody who is so brazenly confident that the people around them living in their own perception, not perspective, and their perception, they're like, well, this guy really knows what he's talking about, so I'm gonna do what he says."}, {"time": 13324, "text": "So you can run a massive con and that can take care of your finances, that can take care of your lodging, whatever else it is."}, {"time": 13330, "text": "You are whoever you present yourself to be."}, {"time": 13333, "text": "So if you wanna go be Bill for the afternoon, just go tell people your name is Bill."}, {"time": 13339, "text": "They're not gonna question you."}, {"time": 13341, "text": "So the intelligence, the natural web of intelligence gathering systems we have in the United States and in the world, are they going to believe for long that you're Bill?"}, {"time": 13357, "text": "Until you do something that makes them think otherwise."}, {"time": 13359, "text": "If you are consistent, we talked about consistency being the superpower."}, {"time": 13363, "text": "If you are consistent, they will think you're Bill forever."}, {"time": 13366, "text": "How difficult is that to do?"}, {"time": 13370, "text": "It's quite difficult."}, {"time": 13371, "text": "Does that require training?"}, {"time": 13373, "text": "It does require training."}, {"time": 13375, "text": "Because why do criminals always get caught?"}, {"time": 13377, "text": "Because they stop being consistent."}, {"time": 13379, "text": "Criminals, I've..."}, {"time": 13384, "text": "I never hesitate to admit this, but people tell me I should hesitate to admit it."}, {"time": 13389, "text": "So now I hesitate because of the guidance I've gotten to hesitate, right?"}, {"time": 13393, "text": "I like criminals."}, {"time": 13394, "text": "I'm friends with a number of criminals because the only people who get me, like right away who get me, are criminals."}, {"time": 13400, "text": "Because we know what it's like to basically abandon all the rules, do our own thing our own way, and watch the world just keep turning."}, {"time": 13409, "text": "Most people are so stuck in the trap of normal thought and behavior that when I tell them, they just don't... Just go tell people your name is Bill."}, {"time": 13419, "text": "Most people are going to say, psh, that's not going to work."}, {"time": 13422, "text": "But a criminal will be like, oh yeah, I did that once."}, {"time": 13424, "text": "I just told everybody my name is Nancy, you know, dude, and they still believe me."}, {"time": 13428, "text": "Criminals just get it, right?"}, {"time": 13430, "text": "So what happens with criminals is they go to the school of hard knocks."}, {"time": 13436, "text": "They go to..."}, {"time": 13437, "text": "They learn criminal behavior on the job."}, {"time": 13440, "text": "Spies go to school."}, {"time": 13442, "text": "We go to the best spy school in the world."}, {"time": 13445, "text": "We go to Langley's, the farm, right?"}, {"time": 13447, "text": "What's known as Field Tradecraft Course, FTC, in a covert location for a covert period of time and covert, covert, covert."}, {"time": 13453, "text": "So if anybody from CIA is watching, I'm not breaking any rules."}, {"time": 13456, "text": "It's all on Wikipedia, but it's not coming from me."}, {"time": 13459, "text": "But we do... That's how we do it."}, {"time": 13460, "text": "They train us from a hundred years of experience and the best ways to carry out covert operations, which are all just criminal activities overseas."}, {"time": 13470, "text": "We learn how to do it the right way so that we don't get caught."}, {"time": 13473, "text": "We learn how to be consistent."}, {"time": 13474, "text": "More importantly, we learn how to create an operation that has a limited lifespan because the longer it lives, the more at risk you are."}, {"time": 13483, "text": "So you want operations to be short, concise, on the X, off the X."}, {"time": 13488, "text": "Limit your room for mistakes."}, {"time": 13489, "text": "Criminals want the default to wanting these longterm operations because they don't want to have to recreate a new way to make money every 15 days."}, {"time": 13500, "text": "You mentioned, if anybody from the CIA is watching, so I've seen you talk about the fact that sort of people that are currently working at the CIA would kind of look down on the people who've left the CIA and they divide them, especially if you go public, especially if there's a book and all that kind of stuff."}, {"time": 13519, "text": "Do you feel the pressure of that to be quiet, to not do something like this conversation that we're doing today?"}, {"time": 13531, "text": "I feel the silent judgment."}, {"time": 13534, "text": "That's very real."}, {"time": 13535, "text": "I feel it for myself and I feel it for my wife who doesn't appear on camera very often, but who's also former CIA."}, {"time": 13540, "text": "We both feel the judgment."}, {"time": 13542, "text": "We know that right now, three days after this is released, somebody's gonna send an email on a closed network system inside CIA headquarters and there's a bunch of people who are gonna laugh at it, a bunch of people who are gonna say that who knows what."}, {"time": 13556, "text": "It's not gonna be good stuff."}, {"time": 13556, "text": "A bunch of people you respect probably."}, {"time": 13558, "text": "A bunch of people who I'm trying to bring honor to."}, {"time": 13561, "text": "Whether I know them or respect them is irrelevant."}, {"time": 13564, "text": "These are people who are out there doing the deed every day and I wanna bring them honor and I wanna do that in a way that I get to share what they can't share and what they won't share when they leave because they will also feel the silent pressure, the pressure to the shame, the judgment, right?"}, {"time": 13582, "text": "But the truth is that I've done this now long enough."}, {"time": 13585, "text": "The first few times that I spoke out publicly, the response to being a positive voice for what the sacrifice is that people are making, it's so refreshing to be an honest voice that people don't normally hear that it's too important."}, {"time": 13603, "text": "One day I'm gonna be gone and my kids are gonna look back on all this and they're gonna see their dad trying to do the right thing for the right reasons and even if my son or daughter ends up at CIA and even if they get ridiculed for being, oh, you're the Bustamante kid, right?"}, {"time": 13617, "text": "Your dad's a total sellout, whatever it might be."}, {"time": 13621, "text": "Like I want them to know dad was doing what he could to bring honor to the organization even when he couldn't stay in the organization anymore."}, {"time": 13629, "text": "So you said when you were 27, I think you didn't know what the hell you're doing."}, {"time": 13635, "text": "So now that you're a few years older and wiser, let me ask you to put on your wise sage hat and give advice to other 27 year olds or even younger 17, 18 year olds that are just out of high school, maybe going to college, trying to figure out this life, this career thing that they're on."}, {"time": 13657, "text": "What advice would you give them about how to have a career or how to have a life they can be proud of?"}, {"time": 13665, "text": "What's a powerful question, man?"}, {"time": 13669, "text": "Have you figured it out yet yourself?"}, {"time": 13671, "text": "No, I think I'm a grand total of seven days smarter than I was at 27."}, {"time": 13677, "text": "It's not a good average."}, {"time": 13677, "text": "Progress."}, {"time": 13680, "text": "There's still time."}, {"time": 13682, "text": "So for all the young people out there deciding what to do, I would just say the same thing that I do say and I will say to my own kids."}, {"time": 13692, "text": "You only have one life."}, {"time": 13694, "text": "You only have one chance."}, {"time": 13696, "text": "If you spend it doing what other people expect you to do, you will wake up to your regret at some point."}, {"time": 13705, "text": "I woke up when I was 38 years old."}, {"time": 13709, "text": "My wife in many ways is still waking up to it as she watches her grandparents pass and an older generation pass away."}]}]