[{"title": "Michael Levin: Biology, Life, Aliens, Evolution, Embryogenesis & Xenobots | Lex Fridman Podcast #325", "id": "p3lsYlod5OU", "quotes": [{"time": 236, "text": "So the physics is deeply integrated with the information."}, {"time": 236, "text": "So the DNA doesn't exist on its own."}, {"time": 243, "text": "The DNA is integrated as, in some sense, in response to the laws of physics at every scale."}, {"time": 250, "text": "The laws of the environment it exists in."}, {"time": 254, "text": "Yeah, the environment and also the laws of the universe."}, {"time": 282, "text": "So just as a really stupid example, if you're trying to evolve a particular triangle, you can evolve the first angle and you evolve the second angle, but you don't need to evolve the third."}, {"time": 290, "text": "You know what it is already."}, {"time": 290, "text": "Now, why do you know?"}, {"time": 290, "text": "That's a gift for free from geometry in a particular space."}, {"time": 294, "text": "You know what that angle has to be."}, {"time": 294, "text": "And if you evolve an ion channel, which is, ion channels are basically transistors, right?"}, {"time": 298, "text": "They're voltage gated current conductances."}, {"time": 301, "text": "If you evolve that ion channel, you immediately get to use things like truth tables."}, {"time": 306, "text": "You get logic functions."}, {"time": 306, "text": "You don't have to evolve the logic function."}, {"time": 310, "text": "You don't have to evolve a truth table."}, {"time": 310, "text": "It doesn't have to be in the DNA."}, {"time": 310, "text": "You get it for free, right?"}, {"time": 314, "text": "And the fact that if you have NAND gates, you can build anything you want, you get that for free."}, {"time": 317, "text": "All you have to evolve is that first step, that first little machine that enables you to couple to those laws."}, {"time": 322, "text": "And there's laws of adhesion and many other things."}, {"time": 322, "text": "And this is all that interplay between the hardware that's set up by the genetics and the software that's made, right?"}, {"time": 333, "text": "The physiological software that basically does all the computation and the cognition and everything else is a real interplay between the information and the DNA and the laws of physics of computation and so on."}, {"time": 343, "text": "So is it fair to say, just like this idea that the laws of mathematics are discovered, they're latent within the fabric of the universe in that same way the laws of biology are kind of discovered?"}, {"time": 355, "text": "Yeah, I think that's absolutely, and it's probably not a popular view, but I think that's right on the money."}, {"time": 359, "text": "Well, I think that's a really deep idea."}, {"time": 359, "text": "Then embryogenesis is the process of revealing, of embodying, of manifesting these laws."}, {"time": 365, "text": "You're not building the laws."}, {"time": 376, "text": "You're just creating the capacity to reveal."}, {"time": 376, "text": "I think, again, not the standard view of molecular biology by any means, but I think that's right on the money."}, {"time": 383, "text": "I'll give you a simple example."}, {"time": 387, "text": "Some of our latest work with these xenobots, right?"}, {"time": 387, "text": "So what we've done is to take some skin cells off of an early frog embryo and basically ask about their plasticity."}, {"time": 391, "text": "If we give you a chance to sort of reboot your multicellularity in a different context, what would you do?"}, {"time": 400, "text": "Because what you might assume by..."}, {"time": 400, "text": "The thing about embryogenesis is that it's super reliable, right?"}, {"time": 405, "text": "It's very robust."}, {"time": 405, "text": "And that really obscures some of its most interesting features."}, {"time": 405, "text": "We get used to it."}, {"time": 410, "text": "We get used to the fact that acorns make oak trees and frog eggs make frogs."}, {"time": 410, "text": "And we say, well, what else is it going to make?"}, {"time": 414, "text": "That's what it makes."}, {"time": 414, "text": "That's a standard story."}, {"time": 417, "text": "But the reality is... And so you look at these skin cells and you say, well, what do they know how to do?"}, {"time": 423, "text": "Well, they know how to be a passive boring two dimensional outer layer, keeping the bacteria from getting into the embryo."}, {"time": 427, "text": "That's what they know how to do."}, {"time": 427, "text": "Well, it turns out that if you take these skin cells and you remove the rest of the embryo, so you remove all of the rest of the cells and you say, well, you're by yourself now, what do you want to do?"}, {"time": 437, "text": "So what they do is they form this multi little creature that runs around the dish."}, {"time": 440, "text": "They have all kinds of incredible and incredible capacities."}, {"time": 446, "text": "They navigate through mazes."}, {"time": 446, "text": "They have various behaviors that they do both independently and together."}, {"time": 450, "text": "Basically, they implement von Neumann's dream of self replication, because if you sprinkle a bunch of loose cells into the dish, what they do is they run around, they collect those cells into little piles."}, {"time": 462, "text": "They sort of mush them together until those little piles become the next generation of xenobots."}, {"time": 466, "text": "So you've got this machine that builds copies of itself from loose material in its environment."}, {"time": 470, "text": "None of this are things that you would have expected from the frog genome."}, {"time": 476, "text": "In fact, the genome is wild type."}, {"time": 476, "text": "There's nothing wrong with their genetics."}, {"time": 481, "text": "Nothing has been added, no nanomaterials, no genomic editing, nothing."}, {"time": 481, "text": "And so what we have done there is engineered by subtraction."}, {"time": 486, "text": "What you've done is you've removed the other cells that normally basically bully these cells into being skin cells."}, {"time": 491, "text": "And you find out that what they really want to do is to be this, their default behaviors to be a xenobot."}, {"time": 495, "text": "But in vivo, in the embryo, they get told to be skinned by these other cell types."}, {"time": 501, "text": "And so now here comes this really interesting question that you just posed."}, {"time": 508, "text": "When you ask where does the form of the tadpole and the frog come from, the standard answer is, well, it's selection."}, {"time": 513, "text": "So over millions of years, it's been shaped to produce the specific body that's fit for froggy environments."}, {"time": 524, "text": "Where does the shape of the xenobot come from?"}, {"time": 524, "text": "There's never been any xenobots."}, {"time": 524, "text": "There's never been selection to be a good xenobot."}, {"time": 528, "text": "These cells find themselves in the new environment."}, {"time": 531, "text": "In 48 hours, they figure out how to be an entirely different protoorganism with new capacities like kinematic self replication."}, {"time": 537, "text": "That's not how frogs or tadpoles replicate."}, {"time": 537, "text": "We've made it impossible for them to replicate their normal way."}, {"time": 542, "text": "Within a couple of days, these guys find a new way of doing it that's not done anywhere else in the biosphere."}, {"time": 545, "text": "Well, actually, let's step back and define, what are xenobots?"}, {"time": 549, "text": "So a xenobot is a self assembling little protoorganism."}, {"time": 549, "text": "It's also a biological robot."}, {"time": 556, "text": "Those things are not distinct."}, {"time": 556, "text": "It's a member of both classes."}, {"time": 556, "text": "How much is it biology?"}, {"time": 562, "text": "How much is that robot?"}, {"time": 562, "text": "At this point, most of it is biology because what we're doing is we're discovering natural behaviors of the cells and also of the cell collectives."}, {"time": 568, "text": "Now, one of the really important parts of this was that we're working together with Josh Bongaert's group at University of Vermont."}, {"time": 579, "text": "They're computer scientists, they do AI, and they've basically been able to use a simulated evolution approach to ask, how can we manipulate these cells, give them signals, not rewire their DNA, so not hardware, but experience signals?"}, {"time": 591, "text": "So can we remove some cells?"}, {"time": 596, "text": "Can we add some cells?"}, {"time": 596, "text": "Can we poke them in different ways to get them to do other things?"}, {"time": 599, "text": "So in the future, there's going to be, we're now, and this is future unpublished work, but we're doing all sorts of interesting ways to reprogram them to new behaviors."}, {"time": 604, "text": "But before you can start to reprogram these things, you have to understand what their innate capacities are."}, {"time": 613, "text": "Okay, so that means engineering, programming, you're engineering them in the future."}, {"time": 613, "text": "And in some sense, the definition of a robot is something you in part engineer versus evolve."}, {"time": 619, "text": "I mean, it's such a fuzzy definition anyway, in some sense, many of the organisms within our body are kinds of robots."}, {"time": 633, "text": "And I think robots is a weird line because it's, we tend to see robots as the other."}, {"time": 640, "text": "I think there will be a time in the future when there's going to be something akin to the civil rights movements for robots, but we'll talk about that later perhaps."}, {"time": 645, "text": "Anyway, so how do you, can we just linger on it?"}, {"time": 652, "text": "How do you build a Xenobot?"}, {"time": 652, "text": "From when does it start and how does it become the glorious Xenobot?"}, {"time": 666, "text": "Yeah, so just to take one step back, one of the things that a lot of people get stuck on is they say, well, you know, engineering requires new DNA circuits or it requires new nanomaterials, you know, what the thing is, we are now moving from old school engineering, which use passive materials, right?"}, {"time": 684, "text": "That things, you know, wood, metal, things like this, that basically the only thing you could depend on is that they were going to keep their shape."}, {"time": 688, "text": "They don't do anything else."}, {"time": 691, "text": "It's on you as an engineer to make them do everything they're going to do."}, {"time": 695, "text": "And then there were active materials and now computation materials."}, {"time": 695, "text": "This is a whole new era."}, {"time": 699, "text": "These are agential materials."}, {"time": 699, "text": "This is you're now collaborating with your substrate because your material has an agenda."}, {"time": 703, "text": "These cells have, you know, billions of years of evolution."}, {"time": 703, "text": "They have goals."}, {"time": 711, "text": "They have preferences."}, {"time": 711, "text": "They're not just going to sit where you put them."}, {"time": 711, "text": "That's hilarious that you have to talk your material into keeping its shape."}, {"time": 714, "text": "That is exactly right."}, {"time": 718, "text": "Stay there."}, {"time": 718, "text": "It's like getting a bunch of cats or something and trying to organize the shape out of them."}, {"time": 724, "text": "We're on the same page here because in a paper, this is, this is currently just been accepted in nature by engineering."}, {"time": 728, "text": "One of the figures I have is building a tower out of Legos versus dogs, right?"}, {"time": 732, "text": "So think about the difference, right?"}, {"time": 732, "text": "If you build out of Legos, you have full control over where it's going to go."}, {"time": 737, "text": "But if somebody knocks it over, it's game over."}, {"time": 742, "text": "With the dogs, you cannot just come and stack them."}, {"time": 742, "text": "They're not going to stay that way."}, {"time": 742, "text": "But the good news is that if you train them, then somebody knocks it over, they'll get right back up."}, {"time": 749, "text": "So it's all right."}, {"time": 749, "text": "So as an engineer, what you really want to know is what can they depend on this thing to do, right?"}, {"time": 753, "text": "That's really, you know, a lot of people have definitions of robots as far as what they're made of or how they got here, you know, design versus evolve, whatever."}, {"time": 761, "text": "I don't think any of that is useful."}, {"time": 761, "text": "I think, I think as an engineer, what you want to know is how much can I depend on this thing to do when I'm not around to micromanage it?"}, {"time": 765, "text": "What level of, what level of dependency can I, can I give this thing?"}, {"time": 770, "text": "How much agency does it have?"}, {"time": 774, "text": "Which then tells you what techniques do you use?"}, {"time": 774, "text": "So do you use micromanagement, like you put everything where it goes?"}, {"time": 777, "text": "Do you train it?"}, {"time": 777, "text": "Do you give it signals?"}, {"time": 777, "text": "Do you try to convince it to do things, right?"}, {"time": 781, "text": "How much, you know, how intelligent is your substrate?"}, {"time": 784, "text": "And so now we're moving into this, into this area where you're, you're, you're working with agential materials."}, {"time": 788, "text": "That's a collaboration."}, {"time": 788, "text": "That's not, that's not old, old style."}, {"time": 792, "text": "What's the word you're using?"}, {"time": 792, "text": "Agential?"}, {"time": 794, "text": "Agential."}, {"time": 795, "text": "Agency."}, {"time": 795, "text": "It comes from the word agency."}, {"time": 795, "text": "So, so basically the material has agency, meaning that it has some, some level of obviously not human level, but some level of preferences, goals, memories, ability to remember things, to compute into the future, meaning anticipate, you know, when you're working with cells, they have all of that to some, to various degrees."}, {"time": 814, "text": "Is that empowering or limiting having material as a mind of its own, literally?"}, {"time": 819, "text": "I think it's both, right?"}, {"time": 819, "text": "So it raises difficulties because it means that it, if you, if you're using the old mindset, which is a linear kind of extrapolation of what's going to happen, you're going to be surprised and shocked all the time because biology does not do what we linearly expect materials to do."}, {"time": 834, "text": "On the other hand, it's massively liberating."}, {"time": 834, "text": "And so in the following way, I've argued that advances in regenerative medicine require us to take advantage of this because what it means is that you can get the material to do things that you don't know how to micromanage."}, {"time": 849, "text": "So just as a simple example, right?"}, {"time": 849, "text": "If you, if you, you had a rat and you wanted this rat to do a circus trick, put a ball in the little hoop, you can do it the micromanagement way, which is try to control every neuron and try to play the thing like a puppet, right?"}, {"time": 862, "text": "And maybe someday that'll be possible, maybe, or you can train the rat."}, {"time": 862, "text": "And this is why humanity for thousands of years before we knew any neuroscience, we had no idea what's behind, what's between the ears of any animal."}, {"time": 871, "text": "We were able to train these animals because once you recognize the level of agency of a certain system, you can use appropriate techniques."}, {"time": 875, "text": "If you know the currency of motivation, reward and punishment, you know how smart it is, you know what kinds of things it likes to do."}, {"time": 884, "text": "You are searching a much more, much smoother, much nicer problem space than if you try to micromanage the thing."}, {"time": 890, "text": "And in regenerative medicine, when you're trying to get, let's say an arm to grow back or an eye to repair a cell birth defect or something, do you really want to be controlling tens of thousands of genes at each point to try to micromanage it?"}, {"time": 902, "text": "Or do you want to find the high level modular controls that say, build an arm here."}, {"time": 907, "text": "You already know how to build an arm."}, {"time": 907, "text": "You did it before, do it again."}, {"time": 911, "text": "So that's, I think it's both, it's both difficult and it challenges us to develop new ways of engineering and it's hugely empowering."}, {"time": 915, "text": "So how do you do, I mean, maybe sticking with the metaphor of dogs and cats, I presume you have to figure out the, find the dogs and dispose of the cats."}, {"time": 931, "text": "Because, you know, it's like the old herding cats is an issue."}, {"time": 931, "text": "So you may be able to train dogs."}, {"time": 938, "text": "I suspect you will not be able to train cats."}, {"time": 938, "text": "Or if you do, you're never going to be able to trust them."}, {"time": 944, "text": "So is there a way to figure out which material is amenable to herding?"}, {"time": 944, "text": "Is it in the lab work or is it in simulation?"}, {"time": 953, "text": "Right now it's largely in the lab because we, our simulations do not capture yet the most interesting and powerful things about biology."}, {"time": 959, "text": "So the simulation does, what we're pretty good at simulating are feed forward emergent types of things, right?"}, {"time": 970, "text": "So cellular automata, if you have simple rules and you sort of roll those forward for every, every agent or every cell in the simulation, then complex things happen, you know, ant colony or algorithms, things like that."}, {"time": 979, "text": "We're good at that."}, {"time": 979, "text": "And that's, and that's fine."}, {"time": 979, "text": "The difficulty with all of that is that it's incredibly hard to reverse."}, {"time": 983, "text": "So this is a really hard inverse problem, right?"}, {"time": 988, "text": "If you look at a bunch of termites and they make a, you know, a thing with a single chimney and you say, well, I like it, but I'd like two chimneys."}, {"time": 991, "text": "How do you change the rules of behavior free termites?"}, {"time": 996, "text": "So they make two chimneys, right?"}, {"time": 996, "text": "Or, or if you say, here are a bunch of cells that are creating this kind of organism."}, {"time": 1000, "text": "I don't think that's optimal."}, {"time": 1000, "text": "I'd like to repair that birth defect."}, {"time": 1004, "text": "How do you control all the, all the individual low level rules, right?"}, {"time": 1004, "text": "All the protein interactions and everything else, rolling it back from the anatomy that you want to the low level hardware rules is in general intractable."}, {"time": 1013, "text": "It's a, it's an inverse problem that's generally not solvable."}, {"time": 1017, "text": "So right now it's mostly in the lab because what we need to do is we need to understand how biology uses top down controls."}, {"time": 1022, "text": "So the idea is not, not bottom up emergence, but the idea of things like a goal directed test operate exit kinds of loops where, where it's basically an error minimization function over a new space and not a space of gene expression, but for example, a space of anatomy."}, {"time": 1039, "text": "So just as a simple example, if you have, you have a salamander and it's got an arm, you can, you can amputate that arm anywhere along the length."}, {"time": 1043, "text": "It will grow exactly what's needed and then it stops."}, {"time": 1049, "text": "That's the most amazing thing about regeneration is that it stops it knows when to stop."}, {"time": 1052, "text": "When does it stop?"}, {"time": 1052, "text": "It stops when a correct salamander arm has been completed."}, {"time": 1057, "text": "So that tells you that's right."}, {"time": 1057, "text": "That's a, that's a, a means ends kind of analysis where it has to know what the correct limb is supposed to look like, right?"}, {"time": 1062, "text": "So it has a way to ascertain the current shape."}, {"time": 1067, "text": "It has a way to measure that Delta from, from what shape it's supposed to be."}, {"time": 1067, "text": "And it will keep taking actions, meaning remodeling and growing and everything else until that's complete."}, {"time": 1075, "text": "So once you know that, and we've taken advantage of this in the lab to do some, some really wild things with, with both planaria and frog embryos and so on, once you know that, you can start playing with that, with that homeostatic cycle."}, {"time": 1084, "text": "You can ask, for example, well, how does it remember what the correct shape is?"}, {"time": 1088, "text": "And can we mess with that memory?"}, {"time": 1088, "text": "Can we give it a false memory of what the shape should be and let the cells build something else?"}, {"time": 1092, "text": "Or can we mess with the measurement apparatus, right?"}, {"time": 1096, "text": "So it gives you, it gives you those kinds of, so, so, so the idea is to basically appropriate a lot of the approaches and concepts from cognitive neuroscience and behavioral science into things that previously were taken to be dumb materials."}, {"time": 1108, "text": "And, you know, you get yelled at in class if you, if you, for being anthropomorphic, if you said, well, my cells want to do this and my cells want to do that."}, {"time": 1117, "text": "And I think, I think that's a, that's a major mistake that leaves a ton of capabilities on the table."}, {"time": 1121, "text": "So thinking about biologic systems as things that have memory, have almost something like cognitive ability, but I mean, how incredible is it, you know, that the salamander arm is being rebuilt, not with a dictator."}, {"time": 1136, "text": "It's kind of like the cellular automata system."}, {"time": 1143, "text": "All the individual workers are doing their own thing."}, {"time": 1143, "text": "So where's that top down signal that does the control coming from?"}, {"time": 1150, "text": "Like, how can you find it?"}, {"time": 1150, "text": "Like, why does it stop growing?"}, {"time": 1156, "text": "How does it know the shape?"}, {"time": 1156, "text": "How does it have memory of the shape?"}, {"time": 1156, "text": "And how does it tell everybody to be like, whoa, whoa, whoa, slow down, we're done."}, {"time": 1161, "text": "So the first thing to think about, I think, is that there are no examples anywhere of a central dictator, because in this kind of science, because everything is made of parts."}, {"time": 1173, "text": "And so we, even though we feel as a unified central sort of intelligence and kind of point of cognition, we are a bag of neurons, right?"}, {"time": 1185, "text": "All intelligence is collective intelligence."}, {"time": 1185, "text": "There's this, this is important to kind of think about, because a lot of people think, okay, there's real intelligence, like me, and then there's collective intelligence, which is ants and flocks of birds and termites and things like that."}, {"time": 1199, "text": "And maybe it's appropriate to think of them as an individual, and maybe it's not, and a lot of people are skeptical about that and so on."}, {"time": 1205, "text": "But you've got to realize that we are not, there's no such thing as this like indivisible diamond of intelligence that's like this one central thing that's not made of parts."}, {"time": 1213, "text": "We are all made of parts."}, {"time": 1213, "text": "And so if you believe, which I think is hard to get around, that we in fact have a centralized set of goals and preferences and we plan and we do things and so on, you are already committed to the fact that a collection of cells is able to do this, because we are a collection of cells."}, {"time": 1230, "text": "There's no getting around that."}, {"time": 1234, "text": "In our case, what we do is we navigate the three dimensional world and we have behavior."}, {"time": 1237, "text": "This is blowing my mind right now, because we are just a collection of cells."}, {"time": 1241, "text": "So when I'm moving this arm, I feel like I'm the central dictator of that action, but there's a lot of stuff going on."}, {"time": 1250, "text": "All the cells here are collaborating in some interesting way."}, {"time": 1257, "text": "They're getting signal from the central nervous system."}, {"time": 1260, "text": "Well, even the central nervous system is misleadingly named because it isn't really central."}, {"time": 1265, "text": "Again, it's just a bunch of cells."}, {"time": 1265, "text": "I mean, all of them, right?"}, {"time": 1265, "text": "There are no, there are no singular indivisible intelligences anywhere."}, {"time": 1270, "text": "We are all, every example that we've ever seen is a collective of something."}, {"time": 1276, "text": "It's just that we're used to it."}, {"time": 1276, "text": "We're used to that."}, {"time": 1276, "text": "We're used to, okay, this thing is kind of a single thing, but it's really not."}, {"time": 1281, "text": "You zoom in, you know what you see."}, {"time": 1284, "text": "You see a bunch of cells running around."}, {"time": 1284, "text": "Is there some unifying, I mean, we're jumping around, but that something that you look at as the bioelectrical signal versus the biochemical, the chemistry, the electricity, maybe the life is in that versus the cells."}, {"time": 1307, "text": "It's the, there's an orchestra playing and the resulting music is the dictator."}, {"time": 1317, "text": "That's Dennis Noble's kind of view of things."}, {"time": 1317, "text": "He has two really good books where he talks about this musical analogy, right?"}, {"time": 1322, "text": "So I think that's, I like it."}, {"time": 1327, "text": "Is it wrong though?"}, {"time": 1328, "text": "I don't think it's, no, I don't think it's wrong."}, {"time": 1328, "text": "I think the important thing about it is that we have to come to grips with the fact that a true proper cognitive intelligence can still be made of parts."}, {"time": 1343, "text": "Those things are, and in fact it has to be, and I think it's a real shame, but I see this all the time."}, {"time": 1347, "text": "When you have a collective like this, whether it be a group of robots or a collection of cells or neurons or whatever, as soon as we gain some insight into how it works, meaning that, oh, I see, in order to take this action, here's the information that got processed via this chemical mechanism or whatever."}, {"time": 1365, "text": "Immediately people say, oh, well then that's not real cognition."}, {"time": 1370, "text": "That's just physics."}, {"time": 1370, "text": "I think this is fundamentally flawed because if you zoom into anything, what are you going to see?"}, {"time": 1374, "text": "Of course you're just going to see physics."}, {"time": 1378, "text": "What else could be underneath, right?"}, {"time": 1378, "text": "It's not going to be fairy dust."}, {"time": 1378, "text": "It's going to be physics and chemistry, but that doesn't take away from the magic of the fact that there are certain ways to arrange that physics and chemistry and in particular the bioelectricity, which I like a lot, to give you an emergent collective with goals and preferences and memories and anticipations that do not belong to any of the subunits."}, {"time": 1398, "text": "So I think what we're getting into here, and we can talk about how this happens during embryogenesis and so on, what we're getting into is the origin of a self with a capital S. So we ourselves, there are many other kinds of selves, and we can tell some really interesting stories about where selves come from and how they become unified."}, {"time": 1417, "text": "Yeah, is this the first, or at least humans tend to think that this is the level of which the self with a capital S is first born, and we really don't want to see human civilization or Earth itself as one living organism."}, {"time": 1429, "text": "Yeah, that's very uncomfortable to us."}, {"time": 1434, "text": "But is, yeah, where's the self born?"}, {"time": 1434, "text": "We have to grow up past that."}, {"time": 1434, "text": "So what I like to do is, I'll tell you two quick stories about that."}, {"time": 1441, "text": "I like to roll backwards."}, {"time": 1441, "text": "So as opposed to, so if you start and you say, okay, here's a paramecium, and you see it, you know, it's a single cell organism, you see it doing various things, and people will say, okay, I'm sure there's some chemical story to be told about how it's doing it, so that's not a paramecium."}, {"time": 1458, "text": "So that's not true cognition, right?"}, {"time": 1458, "text": "And people will argue about that."}, {"time": 1458, "text": "I like to work it backwards."}, {"time": 1463, "text": "I say, let's agree that you and I, as we sit here, are examples of true cognition, if anything, as if there's anything that's true cognition, we are examples of it."}, {"time": 1468, "text": "Now let's just roll back slowly, right?"}, {"time": 1472, "text": "So you roll back to the time when you were a small child and used to doing whatever, and then just sort of day by day, you roll back, and eventually you become more or less that paramecium, and then you sort of even below that, right, as an unfertilized OSI."}, {"time": 1481, "text": "So it's, no one has, to my knowledge, no one has come up with any convincing discrete step at which my cognitive powers disappear, right?"}, {"time": 1493, "text": "It just doesn't, the biology doesn't offer any specific step."}, {"time": 1499, "text": "It's incredibly smooth and slow and continuous."}, {"time": 1499, "text": "And so I think this idea that it just sort of magically shows up at one point, and then, you know, humans have true selves that don't exist elsewhere, I think it runs against everything we know about evolution, everything we know about developmental biology, these are all slow continua."}, {"time": 1513, "text": "And the other really important story I want to tell is where embryos come from."}, {"time": 1518, "text": "So think about this for a second."}, {"time": 1518, "text": "Amniote embryos, so this is humans, birds, and so on, mammals and birds and so on."}, {"time": 1523, "text": "Imagine a flat disk of cells, so there's maybe 50,000 cells."}, {"time": 1529, "text": "And in that, so when you get an egg from a fertilized, let's say you buy a fertilized egg from a farm, right?"}, {"time": 1535, "text": "That egg will have about 50,000 cells in a flat disk, it looks like a little tiny little frisbee."}, {"time": 1542, "text": "And in that flat disk, what'll happen is there'll be one set of cells will become special, and it will tell all the other cells, I'm going to be the head, you guys don't be the head."}, {"time": 1556, "text": "And so it'll amplify symmetry breaking amplification, you get one embryo, there's some neural tissue and some other stuff forms."}, {"time": 1560, "text": "Now, you say, okay, I had one egg and one embryo, and there you go, what else could it be?"}, {"time": 1566, "text": "Well, the reality is, and I used to, I did all of this as a grad student, if you take a little needle, and you make a scratch in that blastoderm in that disk, such that the cells can't talk to each other for a while, it heals up, but for a while, they can't talk to each other."}, {"time": 1580, "text": "What will happen is that both regions will decide that they can be the embryo, and there will be two of them."}, {"time": 1586, "text": "And then when they heal up, they become conjoint twins, and you can make two, you can make three, you can make lots."}, {"time": 1589, "text": "So the question of how many cells are in there cannot be answered until it's actually played all the way through."}, {"time": 1593, "text": "It isn't necessarily that there's just one, there can be many."}, {"time": 1600, "text": "So what you have is you have this medium, this, this undifferentiated, I'm sure there's a there's a psychological version of this somewhere that I don't know the proper terminology."}, {"time": 1609, "text": "But you have this, you have this list, like the ocean of potentiality, you have these 1000s of cells, and some number of individuals are going to be formed out of it, usually one, sometimes zero, sometimes several."}, {"time": 1618, "text": "And they form out of these cells, because a region of these cells organizes into a collective that will have goals, goals that individual cells don't have, for example, make a limb, make an eye, how many eyes?"}, {"time": 1630, "text": "Well, exactly two."}, {"time": 1635, "text": "So individual cells don't know what an eye is, they don't know how many eyes you're supposed to have, but the collective does."}, {"time": 1639, "text": "The collective has goals and memories and anticipations that the individual cells don't."}, {"time": 1643, "text": "And that that the establishment of that boundary with its own ability to maintain to to pursue certain goals."}, {"time": 1647, "text": "That's the origin of selfhood."}, {"time": 1653, "text": "But I, is that goal in there somewhere?"}, {"time": 1653, "text": "Were they always destined?"}, {"time": 1653, "text": "Like, are they discovering that goal?"}, {"time": 1662, "text": "Like, where the hell did evolution discover this when you went from the prokaryotes to eukaryotic cells?"}, {"time": 1669, "text": "And then they started making groups."}, {"time": 1669, "text": "And when you make a certain group, you make a, you make it sound, and it's such a tricky thing to try to understand, you make it sound like this cells didn't get together and came up with a goal."}, {"time": 1683, "text": "But the very act of them getting together revealed the goal that was always there."}, {"time": 1689, "text": "There was always that potential for that goal."}, {"time": 1696, "text": "So the first thing to say is that there are way more questions here than certainties."}, {"time": 1700, "text": "Okay, so everything I'm telling you is cutting edge developing, you know, stuff."}, {"time": 1700, "text": "So it's not as if any of us know the answer to this."}, {"time": 1705, "text": "But, but here's, here's, here's my opinion on this."}, {"time": 1709, "text": "I think what evolution, I don't think that evolution produces solutions to specific problems, in other words, specific environments, like here's a frog that can live well in a froggy environment."}, {"time": 1719, "text": "I think what evolution produces is problem solving machines that that will that will solve problems in different spaces."}, {"time": 1726, "text": "So not just three dimensional spaces, but in a way, three dimensional space."}, {"time": 1730, "text": "This goes back to what we were talking about before we the brain is a evolutionarily a late development."}, {"time": 1763, "text": "And before that, cells were navigating transcriptional space, which is a space of all possible gene expressions."}, {"time": 1767, "text": "And before that metabolic space."}, {"time": 1767, "text": "So what evolution has done, I think, is is is is produced hardware that is very good at navigating different spaces using a bag of tricks, right, which which I'm sure many of them we can steal for autonomous vehicles and robotics and various things."}, {"time": 1782, "text": "And what happens is that they navigate these spaces without a whole lot of commitment to what the space is."}, {"time": 1787, "text": "In fact, they don't know what the space is, right?"}, {"time": 1787, "text": "We are all brains in a vat, so to speak."}, {"time": 1791, "text": "Every cell does not know, right?"}, {"time": 1791, "text": "Every cell is some other name, some other cells external environment, right?"}, {"time": 1797, "text": "So where does that with that border between you, you and the outside world, you don't really know where that is, right?"}, {"time": 1802, "text": "Every every collection of cell has to figure that out from scratch."}, {"time": 1805, "text": "And the fact that evolution requires all of these things to figure out what they are, what effectors they have, what sensors they have, where does it make sense to draw a boundary between me and the outside world?"}, {"time": 1815, "text": "The fact that you have to build all that from scratch, this autopoiesis is what defines the border of a self."}, {"time": 1818, "text": "Now, biology uses like a multi a multi scale competency architecture, meaning that every level has goals."}, {"time": 1826, "text": "So so molecular networks have goals, cells have goals, tissues, organs, colonies."}, {"time": 1831, "text": "And and it's the interplay of all of those that that enable biology to solve problems in new ways, for example, in xenobots and various other things."}, {"time": 1843, "text": "This is, you know, it's exactly as you said, in many ways, the cells are discovering new ways of being."}, {"time": 1850, "text": "But at the same time, evolution certainly shapes all this."}, {"time": 1856, "text": "So so evolution is very good at this agential bioengineering, right?"}, {"time": 1856, "text": "When evolution is discovering a new way of being an animal, you know, an animal or a plant or something, sometimes it's by changing the hardware, you know, protein, changing proteins, protein structure, and so on."}, {"time": 1870, "text": "But much of the time, it's not by changing the hardware, it's by changing the signals that the cells give to each other."}, {"time": 1874, "text": "It's doing what we as engineers do, which is try to convince the cells to do various things by using signals, experiences, stimuli."}, {"time": 1877, "text": "That's what biology does."}, {"time": 1882, "text": "It has to, because it's not dealing with a blank slate."}, {"time": 1882, "text": "Every time as you know, if you're evolution, and you're trying to make make a make an organism, you're not dealing with a passive material that is fresh, and you have to specify it already wants to do certain things."}, {"time": 1892, "text": "So the easiest way to do that search to find whatever is going to be adaptive, is to find the signals that are going to convince cells to do various things, right?"}, {"time": 1902, "text": "Your sense is that evolution operates both in the software and the hardware."}, {"time": 1908, "text": "And it's just easier, more efficient to operate in the software."}, {"time": 1914, "text": "And I should also say, I don't think the distinction is sharp."}, {"time": 1914, "text": "In other words, I think it's a continuum."}, {"time": 1918, "text": "But I think we can but I think it's a meaningful distinction where you can make changes to a particular protein, and now the enzymatic function is different, and it metabolizes differently, and whatever, and that will have implications for fitness."}, {"time": 1928, "text": "Or you can change the huge amount of information in the genome that isn't structural at all."}, {"time": 1934, "text": "It's, it's, it's signaling, it's when and how do cells say certain things to each other."}, {"time": 1940, "text": "And that can have massive changes, as far as how it's going to solve problems."}, {"time": 1945, "text": "I mean, this idea of multi hierarchical competence architecture, which is incredible to think about."}, {"time": 1949, "text": "So this hierarchy that evolution builds, I don't know who's responsible for this."}, {"time": 1955, "text": "I also see the incompetence of bureaucracies of humans when they get together."}, {"time": 1963, "text": "So how the hell does evolution build this, where at every level, only the best get to stick around, they somehow figure out how to do their job without knowing the bigger picture."}, {"time": 1977, "text": "And then there's like the bosses that do the bigger thing somehow, or that you can now abstract away the small group of cells as a as an organ or something."}, {"time": 1984, "text": "And then that organ does something bigger in the context of the full body or something like this."}, {"time": 1997, "text": "How is that built?"}, {"time": 1997, "text": "Is there some intuition you can kind of provide of how that's constructed, that that hierarchical competence architecture?"}, {"time": 2003, "text": "I love that competence, just the word competence is pretty cool in this context, because everybody's good at their job."}, {"time": 2014, "text": "Yeah, no, it's really key."}, {"time": 2014, "text": "And the other nice thing about competency is that so my central belief in all of this is that engineering is the right perspective on all of this stuff, because it gets you away from subjective terms."}, {"time": 2023, "text": "You know, people talk about sentience and this and that those things very hard to define, or people argue about them philosophically."}, {"time": 2034, "text": "I think that engineering terms like competency, like, you know, pursuit of goals, right?"}, {"time": 2062, "text": "If that helps me to control and predict and build such systems, then that's all there is to say, there's no more philosophy to argue about."}, {"time": 2068, "text": "So I like competency in that way, because you can quantify, you could, you have to, in fact, you have to, you have to make a claim competent at what?"}, {"time": 2075, "text": "And then, or if I say, if I tell you, it has a goal, the question is, what's the goal?"}, {"time": 2078, "text": "And how do you know?"}, {"time": 2078, "text": "And I say, well, because every time I deviated from this particular state, that's what it spends energy to get back to, that's the goal."}, {"time": 2086, "text": "And we can quantify it, and we can be objective about it."}, {"time": 2086, "text": "So so so the the, we're not used to thinking about this, I give a talk sometimes called Why don't robots get cancer, right?"}, {"time": 2096, "text": "And the reason robots don't get cancer is because generally speaking, with a few exceptions, our architectures have been, you've got a bunch of dumb parts."}, {"time": 2100, "text": "And you hope that if you put them together, the the the overlying machine will have some intelligence and do something rather, right, but the individual parts don't don't care, they don't have an agenda."}, {"time": 2109, "text": "Biology isn't like that every level has an agenda."}, {"time": 2113, "text": "And the final outcome is the result of cooperation and competition, both within and across levels."}, {"time": 2120, "text": "So for example, during embryogenesis, your tissues and organs are competing with each other."}, {"time": 2125, "text": "And it's actually a really important part of development, there's a reason they compete with each other, they're not all just, you know, sort of helping each other, they're also competing for information for metabolic for limited metabolic constraints."}, {"time": 2138, "text": "But to get back to your your other point, which is, you know, which is which is the seems like really efficient and good and so on compared to some of our human efforts."}, {"time": 2143, "text": "We also have to keep in mind that what happens here is that each level bends the option space for the level beneath so that your parts basically they don't see the the geometry."}, {"time": 2156, "text": "So I'm using them."}, {"time": 2156, "text": "And I think I take I take this the seriously terminology from from like, from like relativity, right, where the space is literally bent."}, {"time": 2170, "text": "So the option space is deformed by the higher level so that the lower levels, all they really have to do is go down their concentration gradient, they don't have to, in fact, they don't, they can't know what the big picture is."}, {"time": 2178, "text": "But if you bend the space just right, if they do what locally seems right, they end up doing your bidding, they end up doing things that are optimal in the in the higher space."}, {"time": 2186, "text": "Conversely, because the components are good at getting their job done, you as the higher level don't need to try to compute all the low level controls, all you're doing is bending the space, you don't know or care how they're going to do it."}, {"time": 2202, "text": "Give you a super simple example in the in the tappel, we found that okay, so so tappels need to become frogs and to become to go from a tappel head to a frog head, you have to rearrange the face."}, {"time": 2211, "text": "So the eyes have to move forward, the jaws have to come out the nostrils move like everything moves."}, {"time": 2215, "text": "It used to be thought that because all tappels look the same, and all frogs look the same."}, {"time": 2219, "text": "If you just remember, if every piece just moves in the right direction, the right amount, then you get your you get your fraud."}, {"time": 2223, "text": "So we decided to test we I have this hypothesis that I thought I thought actually, the system is probably more intelligent than that."}, {"time": 2228, "text": "So what did we do?"}, {"time": 2231, "text": "We made what we call Picasso tappels."}, {"time": 2231, "text": "So these are so everything is scrambled."}, {"time": 2231, "text": "So the eyes are on the back of the head, the jaws are off to the side, everything is scrambled."}, {"time": 2235, "text": "Well, guess what they make, they make pretty normal frogs, because all the different things move around in novel paths configurations until they get to the correct froggy sort of frog face configuration, then they stop."}, {"time": 2248, "text": "So, so the thing about that is now imagine evolution, right?"}, {"time": 2248, "text": "So, so you make some sort of mutation, and it does, like every mutation, it does many things."}, {"time": 2254, "text": "So something good comes of it, but also it moves your mouth off to the side, right?"}, {"time": 2260, "text": "Now, if if there wasn't this multi scale competency, you can see where this is going, if there wasn't this multi scale competency, the organism would be dead, your fitness is zero, because you can't eat."}, {"time": 2269, "text": "And you would never get to explore the other beneficial consequences of that mutation, you'd have to wait until you find some other way of doing it without moving the mouth, that's really hard."}, {"time": 2277, "text": "So, so the fitness landscape would be incredibly rugged evolution would take forever."}, {"time": 2281, "text": "The reason it works, one of the reasons it works so well, is because you do that, no worries, the mouth will find its way where where it belongs, right?"}, {"time": 2291, "text": "So now you get to explore."}, {"time": 2291, "text": "So what that means is that all of these mutations that otherwise would be deleterious are now neutral, because the competency of the parts make up for all kinds of things."}, {"time": 2301, "text": "So all the noise of development, all the variability in the environment, all these things, the competency of the parts makes up for it."}, {"time": 2306, "text": "So the so so that's all that's all fantastic, right?"}, {"time": 2312, "text": "That's all that's all great."}, {"time": 2312, "text": "The only other thing to remember when we compare this to human efforts is this."}, {"time": 2316, "text": "Every component has its own goals in various spaces, usually with very little regard for the welfare of the other levels."}, {"time": 2321, "text": "So so as a simple example, you know, you as a as a complex system, you will go out and you will do you know, jiu jitsu, or whatever, you'll have some go you have to go rock climbing, scrape a bunch of cells off your hands."}, {"time": 2335, "text": "And then you're happy as a system, right?"}, {"time": 2335, "text": "You come back, and you've accomplished some goals, and you're really happy."}, {"time": 2339, "text": "Those cells are dead."}, {"time": 2339, "text": "They're gone."}, {"time": 2339, "text": "Did you think about those cells?"}, {"time": 2343, "text": "Not really, right?"}, {"time": 2343, "text": "You had some you had some bruising out selfish SOB."}, {"time": 2343, "text": "And so and so that's the thing to remember is that, you know, and we know this from from history is that is that just being a collective isn't enough."}, {"time": 2353, "text": "Because what the goals of that collective will be relative to the welfare of the individual parts is a massively open and justify the means I'm telling you, Stalin was onto something."}, {"time": 2364, "text": "No, that's the danger."}, {"time": 2364, "text": "But we can exactly that's the danger of for us humans, we have to construct ethical systems under which we don't take seriously the full mechanism of biology and apply it to the way the world functions, which is which is an interesting line we've drawn."}, {"time": 2383, "text": "The world that built us is the one we reject in some sense, when we construct human societies, the idea that this country was founded on that all men are created equal."}, {"time": 2399, "text": "That's such a fascinating idea."}, {"time": 2399, "text": "That's like, you're fighting against nature and saying, well, there's something bigger here than a hierarchical competency architecture."}, {"time": 2414, "text": "But there's so many interesting things you said."}, {"time": 2414, "text": "So from an algorithmic perspective, the act of bending the option space."}, {"time": 2421, "text": "That's really, that's really profound."}, {"time": 2421, "text": "Because if you look at the way AI systems are built today, there's a big system, like I said, with robots, and as a goal, and he gets better and better at optimizing that goal at accomplishing that goal."}, {"time": 2442, "text": "But if biology built a hierarchical system where everything is doing computation, and everything is accomplishing the goal, not only that, it's kind of dumb, you know, with the limited with a bent option space is just doing the thing that's the easiest thing for in some sense."}, {"time": 2463, "text": "And somehow that allows you to have turtles on top of turtles, literally dumb systems on top of dumb systems that as a whole create something incredibly smart."}, {"time": 2478, "text": "Yeah, I mean, every system is has some degree of intelligence in its own problem domain."}, {"time": 2478, "text": "So, so cells will have problems they're trying to solve in physiological space and transcriptional space."}, {"time": 2490, "text": "And then I can give you some some cool examples of that."}, {"time": 2490, "text": "But the collective is trying to solve problems in anatomical space, right and forming a, you know, a creature and growing your blood vessels and so on."}, {"time": 2498, "text": "And then the collective the the the whole body is solving yet other problems, they may be in social space and linguistic space and three dimensional space."}, {"time": 2508, "text": "And who knows, you know, the group might be solving problems in, you know, I don't know, some sort of financial space or something."}, {"time": 2512, "text": "So one of the major differences with with most, with most AIs today is is a the kind of flatness of the architecture, but also of the fact that they're constructed from outside their their borders, and they're, you know, so a few."}, {"time": 2526, "text": "So, to a large extent, and of course, there are counter examples now, but but to a large extent, our technology has been such that you create a machine or a robot, it knows what its sensors are, it knows what its effectors are, it knows the boundary between it and the outside world, although this is given from the outside."}, {"time": 2547, "text": "Biology constructs this from scratch."}, {"time": 2547, "text": "Now the best example of this that that originally in robotics was actually Josh Bongard's work in 2006, where he made these, these robots that did not know their shape to start with."}, {"time": 2558, "text": "So like a baby, they sort of floundered around, they made some hypotheses, well, I did this, and I moved in this way."}, {"time": 2563, "text": "Well, maybe I'm a whatever, maybe I have wheels, or maybe I have six legs or whatever, right?"}, {"time": 2567, "text": "And they would make a model and eventually will crawl around."}, {"time": 2570, "text": "So that's, I mean, that's really good."}, {"time": 2574, "text": "That's part of the autopoiesis, but we can go a step further."}, {"time": 2574, "text": "And some people are doing this."}, {"time": 2574, "text": "And then we're sort of working on some of this too, is this idea that let's even go back further, you don't even know what sensors you have, you don't know where you end in the outside world begins."}, {"time": 2586, "text": "All you have is is certain things like active inference, meaning you're trying to minimize surprise, right?"}, {"time": 2591, "text": "You have some metabolic constraints, you don't have all the energy you need, you don't have all the time in the world to think about everything you want to think about."}, {"time": 2594, "text": "So that means that you can't afford to be a micro reductionist, you know, all this data coming in, you have to course grain it and say, I'm gonna take all this stuff, and I'm gonna call that a cat."}, {"time": 2606, "text": "I'm gonna take all this, I'm gonna call that the edge of the table I don't want to fall off of."}, {"time": 2610, "text": "And I don't want to know anything about the micro states, what I want to know is what is the optimal way to cut up my world."}, {"time": 2614, "text": "And by the way, this thing over here, that's me."}, {"time": 2614, "text": "And the reason that's me is because I have more control over this than I have over any of this other stuff."}, {"time": 2618, "text": "And so now you can begin to write."}, {"time": 2622, "text": "So that's self construction at that, that figuring out making models of the outside world, and then turning that inwards, and starting to make a model of yourself, right, which immediately starts to get into issues of agency and control."}, {"time": 2665, "text": "And so right at the base of simple, very simple organisms starting to make models of agents doing things, that is the origin of models of free will, basically, right, because you see the world around you as having agency."}, {"time": 2679, "text": "And then you turn that on yourself."}, {"time": 2679, "text": "And you say, wait, I have agency too, I can I do things, right."}, {"time": 2682, "text": "And and then you make decisions about what you're going to do."}, {"time": 2687, "text": "So all of this one one model is to view all of those kinds of things as being driven by that early need to determine what you are and to do so and to then take actions in the most energetically efficient space possible."}, {"time": 2699, "text": "So free will emerges when you try to simplify, tell a nice narrative about your environment."}, {"time": 2704, "text": "I think that's very plausible."}, {"time": 2710, "text": "You think free was an illusion."}, {"time": 2710, "text": "So you're kind of implying that it's a useful hack."}, {"time": 2719, "text": "Well, I'll say two things."}, {"time": 2719, "text": "The first thing is, I think I think it's very plausible to say that any organism that self or any agent that self whether it's biological or not, any agent that self constructs under energy constraints, is going to believe in free will, we'll get to whether it has free will momentarily."}, {"time": 2736, "text": "But but I think but I think what what it definitely drives is a view of yourself and the outside world as an agential view, I think that's inescapable."}, {"time": 2741, "text": "So that's true for even primitive organisms?"}, {"time": 2745, "text": "I think that's now now they don't have now obviously, you have to scale down, right."}, {"time": 2750, "text": "So so so so they don't have the kinds of complex metacognition that we have."}, {"time": 2755, "text": "So they can do long term planning and thinking about free will and so on and so on."}, {"time": 2759, "text": "But but the sense of agency is really useful to accomplish tasks simple or complicated."}, {"time": 2765, "text": "In all kinds of spaces, not just in obvious three dimensional space."}, {"time": 2765, "text": "I mean, we're very good that the thing is, humans are very good at detecting agency of like medium sized objects moving at medium speeds in the three dimensional world, right?"}, {"time": 2776, "text": "We see a bowling ball and we see a mouse and we immediately know what the difference is, right?"}, {"time": 2780, "text": "And how we're going to mostly things you can eat or get eaten by."}, {"time": 2783, "text": "That's our that's our training set, right?"}, {"time": 2783, "text": "From the time you're little, your training set is visual data on on this this like little chunk of your experience."}, {"time": 2793, "text": "But imagine if imagine if from the time that we were born, we had innate senses of your blood chemistry, if you could feel your blood chemistry, the way you can see, right, you had a high bandwidth connection, and you could feel your blood chemistry, and you could see, you could sense all the things that your organs were doing."}, {"time": 2806, "text": "So your pancreas, your liver, all the things."}, {"time": 2806, "text": "If we had that you we would be very good at detecting intelligence and physiological space, we would know the level of intelligence that our various organs were deploying to deal with things that were coming to anticipate the stimuli to, you know, but but we're just terrible at that."}, {"time": 2820, "text": "We don't, in fact, in fact, people don't even, you know, you talk about intelligence that these are the paper spaces."}, {"time": 2827, "text": "And a lot of people think that's just crazy, because, because all we're all we know is motion."}, {"time": 2832, "text": "We do have access to that information."}, {"time": 2832, "text": "So it's actually possible that so evolution could if we wanted to construct an organism that's able to perceive the flow of blood through your body, the way you see an old friend and say, yo, what's up?"}, {"time": 2844, "text": "How's the wife and the kids?"}, {"time": 2844, "text": "In that same way, you would see that you would feel like a connection to the liver."}, {"time": 2852, "text": "Yeah, yeah, I think, you know, maybe other people's liver and not just your own, because you don't have access to other people's."}, {"time": 2861, "text": "But you could imagine some really interesting connection, right?"}, {"time": 2861, "text": "But like sexual selection, like, oh, that girl's got a nice liver."}, {"time": 2866, "text": "Well, that's like, the way her blood flows, the dynamics of the blood is very interesting."}, {"time": 2872, "text": "It's novel."}, {"time": 2872, "text": "I've never seen one of those."}, {"time": 2878, "text": "But you know, that's exactly what we're trying to half ass when we, when we judge judgment of beauty by facial symmetry and so on."}, {"time": 2883, "text": "That's a half assed assessment of exactly that."}, {"time": 2883, "text": "Because if your cells could not cooperate enough to keep your organism symmetrical, you know, you can make some inferences about what else is wrong, right?"}, {"time": 2893, "text": "Like that's a very, you know, that's a very basic."}, {"time": 2897, "text": "So that in some deep sense, actually, that is what we're doing."}, {"time": 2903, "text": "We're trying to infer how health, we use the word healthy, but basically, how functional is this biological system I'm looking at so I can hook up with that one and make offspring?"}, {"time": 2921, "text": "Well, what kind of hardware might their genomics give me that that might be useful in the future?"}, {"time": 2925, "text": "I wonder why evolution didn't give us a higher resolution signal."}, {"time": 2925, "text": "Like why the whole peacock thing with the feathers?"}, {"time": 2930, "text": "It doesn't seem, it's a very low bandwidth signal for sexual selection."}, {"time": 2938, "text": "I'm gonna, and I'm not an expert on this stuff, but on peacocks."}, {"time": 2938, "text": "Well, you know, but I'll take a stab at the reason."}, {"time": 2942, "text": "I think that it's because it's an arms race."}, {"time": 2942, "text": "You see, you don't want everybody to know everything about you."}, {"time": 2948, "text": "So I think that as much as, as much as, and in fact, there's another interesting part of this arms race, which is, if you think about this, the most adaptive, evolvable system is one that has the most level of top down control, right?"}, {"time": 2967, "text": "If it's really easy to say to a bunch of cells, make another finger versus, okay, here's 10,000 gene expression changes that you need to do to make it to change your finger, right?"}, {"time": 2973, "text": "The system with good top down control that has memory and when we need to get back to that, by the way, that's a question I neglected to answer about where the memory is and so on."}, {"time": 2982, "text": "A system that uses all of that is really highly evolvable and that's fantastic."}, {"time": 2988, "text": "It's also highly subject to hijacking by parasites, by cheaters of various kinds, by conspecifics."}, {"time": 2993, "text": "Like we found that, and then that goes back to the story of the pattern memory in these planaria, there's a bacterium that lives on these planaria."}, {"time": 3004, "text": "That bacterium has an input into how many heads the worm is going to have because it's hijacks that control system and it's able to make a chemical that basically interfaces with the system that calculates how many heads you're supposed to have and they can make them have two heads."}, {"time": 3018, "text": "And so you can imagine that if you are two, so you want to be understandable for your own parts to understand each other, but you don't want to be too understandable because you'll be too easily controllable."}, {"time": 3028, "text": "And so I think that my guess is that that opposing pressure keeps us from being a super high bandwidth kind of thing where we can just look at somebody and know everything about them."}, {"time": 3040, "text": "So it's a kind of biological game of Texas hold them."}, {"time": 3040, "text": "You're showing some cards and you're hiding other cards and there's part of it and there's bluffing and there's all that."}, {"time": 3045, "text": "And then there's probably whole species that would do way too much bluffing."}, {"time": 3050, "text": "That's probably where peacocks fall."}, {"time": 3056, "text": "There's a book that I don't remember if I read or if I read summaries of the book, but it's about evolution of beauty and birds."}, {"time": 3064, "text": "Where is that from?"}, {"time": 3064, "text": "Is that a book or does Richard Dawkins talk about it?"}, {"time": 3070, "text": "But basically there's some species start to like over select for beauty, not over select."}, {"time": 3075, "text": "They just some reason select for beauty."}, {"time": 3075, "text": "There is a case to be made."}, {"time": 3081, "text": "Actually now I'm starting to remember, I think Darwin himself made a case that you can select based on beauty alone."}, {"time": 3087, "text": "There's a point where beauty doesn't represent some underlying biological truth."}, {"time": 3095, "text": "You start to select for beauty itself."}, {"time": 3095, "text": "And I think the deep question is there some evolutionary value to beauty, but it's an interesting kind of thought that can we deviate completely from the deep biological truth to actually appreciate some kind of the summarization in itself."}, {"time": 3120, "text": "Let me get back to memory because this is a really interesting idea."}, {"time": 3120, "text": "How do a collection of cells remember anything?"}, {"time": 3127, "text": "How do biological systems remember anything?"}, {"time": 3127, "text": "How is that akin to the kind of memory we think of humans as having within our big cognitive engine?"}, {"time": 3137, "text": "One of the ways to start thinking about bioelectricity is to ask ourselves, where did neurons and all these cool tricks that the brain uses to run these amazing problem solving abilities on and basically an electrical network, right?"}, {"time": 3152, "text": "They didn't just evolve, you know, appear out of nowhere."}, {"time": 3156, "text": "It must have evolved from something."}, {"time": 3156, "text": "And what it evolved from was a much more ancient ability of cells to form networks to solve other kinds of problems."}, {"time": 3160, "text": "For example, to navigate more for space to control the body shape."}, {"time": 3166, "text": "And so all of the components of neurons, so ion channels, neurotransmitter machinery, electrical synapses, all this stuff is way older than brains, way older than neurons, in fact, older than multicellularity."}, {"time": 3178, "text": "And so it was already that even bacterial biofilms, there's some beautiful work from UCSD on brain like dynamics and bacterial biofilms."}, {"time": 3189, "text": "So evolution figured out very early on that electrical networks are amazing at having memories, at integrating information across distance, at different kinds of optimization tasks, you know, image recognition and so on, long before there were brains."}, {"time": 3204, "text": "Can you actually just step back?"}, {"time": 3204, "text": "We'll return to it."}, {"time": 3204, "text": "What is bioelectricity?"}, {"time": 3204, "text": "What is biochemistry?"}, {"time": 3210, "text": "What is, what are electrical networks?"}, {"time": 3210, "text": "I think a lot of the biology community focuses on the chemicals as the signaling mechanisms that make the whole thing work."}, {"time": 3216, "text": "You have, I think, to a large degree, uniquely, maybe you can correct me on that, have focused on the bioelectricity, which is using electricity for signaling."}, {"time": 3233, "text": "There's also probably mechanical."}, {"time": 3233, "text": "Like knocking on the door."}, {"time": 3240, "text": "And what's an electrical network?"}, {"time": 3240, "text": "Yeah, so I want to make sure and kind of give credit where credit is due."}, {"time": 3247, "text": "So as far back as 1903, and probably late 1800s already, people were thinking about the importance of electrical phenomena in life."}, {"time": 3254, "text": "So I'm for sure not the first person to stress the importance of electricity."}, {"time": 3286, "text": "And to really start looking at this as saying, no, this is a privileged computational layer that gives you access to the actual cognition of the tissue of basal cognition."}, {"time": 3297, "text": "So, so merging that that developmental biophysics with ideas and cognition of computation, and so on, I think I think that's what we've done that's new."}, {"time": 3305, "text": "But people have been talking about bioelectricity for a really long time."}, {"time": 3305, "text": "And so I'll, so I'll define that."}, {"time": 3309, "text": "So what happens is that if you have, if you have a single cell, cell has a membrane, in that membrane are proteins called ion channels, and those proteins allow charged molecules, potassium, sodium, chloride, to go in and out under certain circumstances."}, {"time": 3321, "text": "And when there's an imbalance of of those ions, there becomes a voltage gradient across that membrane."}, {"time": 3327, "text": "And so all cells, all living cells try to hold a particular kind of voltage difference across the membrane, and they spend a lot of energy to do so."}, {"time": 3338, "text": "When you now now, so that's it, that's it, that's a single cell."}, {"time": 3344, "text": "When you have multiple cells, the cells sitting next to each other, they can communicate their voltage state to each other via a number of different ways."}, {"time": 3348, "text": "But one of them is this thing called a gap junction, which is basically like a little submarine hatch that just kind of docks, right?"}, {"time": 3356, "text": "And the ions from one side can flow to the other side, and vice versa."}, {"time": 3362, "text": "Isn't it incredible that this evolved?"}, {"time": 3362, "text": "Isn't that wild?"}, {"time": 3362, "text": "Because that didn't exist."}, {"time": 3369, "text": "This had to be, this had to be evolved."}, {"time": 3371, "text": "It had to be invented."}, {"time": 3373, "text": "Somebody invented electricity in the ocean."}, {"time": 3373, "text": "When did this get invented?"}, {"time": 3377, "text": "So, I mean, it is incredible."}, {"time": 3377, "text": "The guy who discovered gap junctions, Werner Loewenstein, I visited him."}, {"time": 3385, "text": "A human being?"}, {"time": 3386, "text": "He discovered them."}, {"time": 3387, "text": "Because who really discovered them lived probably four billion years ago."}, {"time": 3392, "text": "So you give credit where credit is due, I'm just saying."}, {"time": 3395, "text": "He rediscovered gap junctions."}, {"time": 3395, "text": "But when I visited him in Woods Hole, maybe 20 years ago now, he told me that he was writing, and unfortunately, he passed away, and I think this book never got written."}, {"time": 3407, "text": "He was writing a book on gap junctions and consciousness."}, {"time": 3407, "text": "And I think it would have been an incredible book, because gap junctions are magic."}, {"time": 3412, "text": "I'll explain why in a minute."}, {"time": 3417, "text": "What happens is that, just imagine, the thing about both these ion channels and these gap junctions is that many of them are themselves voltage sensitive."}, {"time": 3422, "text": "So that's a voltage sensitive current conductance."}, {"time": 3428, "text": "That's a transistor."}, {"time": 3428, "text": "And as soon as you've invented one, immediately, you now get access to, from this platonic space of mathematical truths, you get access to all of the cool things that transistors do."}, {"time": 3440, "text": "So now, when you have a network of cells, not only do they talk to each other, but they can send messages to each other, and the differences of voltage can propagate."}, {"time": 3450, "text": "Now, to neuroscientists, this is old hat, because you see this in the brain, right?"}, {"time": 3450, "text": "This action potentials, the electricity."}, {"time": 3454, "text": "They have these awesome movies where you can take a zebra, like a transparent animal, like a zebrafish, and you can literally look down, and you can see all the firings as the fish is making decisions about what to eat and things like this."}, {"time": 3469, "text": "Well, your whole body is doing that all the time, just much slower."}, {"time": 3469, "text": "So there are very few things that neurons do that all the cells in your body don't do."}, {"time": 3474, "text": "They all do very similar things, just on a much slower timescale."}, {"time": 3479, "text": "And whereas your brain is thinking about how to solve problems in three dimensional space, the cells in an embryo are thinking about how to solve problems in anatomical space."}, {"time": 3488, "text": "They're trying to have memories like, hey, how many fingers are we supposed to have?"}, {"time": 3492, "text": "Well, how many do we have now?"}, {"time": 3492, "text": "What do we do to get from here to there?"}, {"time": 3492, "text": "That's the kind of problems they're thinking about."}, {"time": 3495, "text": "And the reason that gap junctions are magic is, imagine, right, from the earliest time."}, {"time": 3500, "text": "Here are two cells."}, {"time": 3500, "text": "This cell, how can they communicate?"}, {"time": 3500, "text": "Well, the simple version is this cell could send a chemical signal, it floats over, and it hits a receptor on this cell, right?"}, {"time": 3514, "text": "Because it comes from outside, this cell can very easily tell that that came from outside."}, {"time": 3519, "text": "Whatever information is coming, that's not my information."}, {"time": 3519, "text": "That information is coming from the outside."}, {"time": 3524, "text": "So I can trust it, I can ignore it, I can do various things with it, I can do various things with it, whatever, but I know it comes from the outside."}, {"time": 3528, "text": "Now imagine instead that you have two cells with a gap junction between them."}, {"time": 3532, "text": "Something happens, let's say this cell gets poked, there's a calcium spike, the calcium spike or whatever small molecule signal propagates through the gap junction to this cell."}, {"time": 3539, "text": "There's no ownership metadata on that signal."}, {"time": 3544, "text": "This cell does not know now that it came from outside because it looks exactly like its own memories would have looked like of whatever had happened, right?"}, {"time": 3550, "text": "So gap junctions to some extent wipe ownership information on data, which means that if I can't, if you and I are sharing memories and we can't quite tell who the memories belong to, that's the beginning of a mind melt."}, {"time": 3566, "text": "That's the beginning of a scale up of cognition from here's me and here's you to no, now there's just us."}, {"time": 3571, "text": "So they enforce a collective intelligence gap junctions."}, {"time": 3571, "text": "It helps."}, {"time": 3576, "text": "It's the beginning."}, {"time": 3576, "text": "It's not the whole story by any means, but it's the start."}, {"time": 3579, "text": "Where's state stored of the system?"}, {"time": 3579, "text": "Is it in part in the gap junctions themselves?"}, {"time": 3579, "text": "Is it in the cells?"}, {"time": 3588, "text": "There are many, many layers to this as always in biology."}, {"time": 3588, "text": "So there are chemical networks."}, {"time": 3595, "text": "So for example, gene regulatory networks, right?"}, {"time": 3595, "text": "Which, or basically any kind of chemical pathway where different chemicals activate and repress each other, they can store memories."}, {"time": 3600, "text": "So in a dynamical system sense, they can store memories."}, {"time": 3604, "text": "They can get into stable states that are hard to pull them out of."}, {"time": 3609, "text": "So that becomes, once they get in, that's a memory, a permanent memory or a semi permanent memory of something that's happened."}, {"time": 3613, "text": "There are cytoskeletal structures that are physically, they store memories in physical configuration."}, {"time": 3617, "text": "There are electrical memories like flip flops where there is no physical."}, {"time": 3624, "text": "So if you look, I showed my students this example as a flip flop."}, {"time": 3630, "text": "And the reason that it stores a zero one is not because some piece of the hardware moved."}, {"time": 3637, "text": "It's because there's a cycling of the current in one side of the thing."}, {"time": 3637, "text": "If I come over and I hold the other side to a high voltage for a brief period of time, it flips over and now it's here."}, {"time": 3650, "text": "But none of the hardware moved."}, {"time": 3650, "text": "The information is in a stable dynamical sense."}, {"time": 3650, "text": "And if you were to x ray the thing, you couldn't tell me if it was zero or one, because all you would see is where the hardware is."}, {"time": 3658, "text": "You wouldn't see the energetic state of the system."}, {"time": 3658, "text": "So there are bioelectrical states that are held in that exact way, like volatile ram basically, like in the electrical state."}, {"time": 3669, "text": "It's very akin to the different ways that memory is stored in a computer."}, {"time": 3675, "text": "So there's ram, there's hard drive."}, {"time": 3675, "text": "You can make that mapping, right?"}, {"time": 3675, "text": "So I think the interesting thing is that based on the biology, we can have a more sophisticated, you know, I think we can revise some of our computer engineering methods because there are some interesting things that biology we haven't done yet."}, {"time": 3692, "text": "But that mapping is not bad."}, {"time": 3692, "text": "I mean, I think it works in many ways."}, {"time": 3698, "text": "Yeah, I wonder because I mean, the way we build computers at the root of computer science is the idea of proof of correctness."}, {"time": 3703, "text": "We program things to be perfect, reliable."}, {"time": 3703, "text": "You know, this idea of resilience and robustness to unknown conditions is not as important."}, {"time": 3712, "text": "So that's what biology is really good at."}, {"time": 3718, "text": "So I don't know what kind of systems."}, {"time": 3718, "text": "I don't know how we go from a computer to a biological system in the future."}, {"time": 3724, "text": "Yeah, I think that, you know, the thing about biology is all about making really important decisions really quickly on very limited information."}, {"time": 3730, "text": "I mean, that's what biology is all about."}, {"time": 3735, "text": "You have to act, you have to act now."}, {"time": 3735, "text": "The stakes are very high, and you don't know most of what you need to know to be perfect."}, {"time": 3739, "text": "And so there's not even an attempt to be perfect or to get it right in any sense."}, {"time": 3744, "text": "There are just things like active inference, minimize surprise, optimize some efficiency and some things like this that guides the whole business."}, {"time": 3757, "text": "I mentioned too offline that somebody who's a fan of your work is Andre Kapathy."}, {"time": 3764, "text": "And he's, amongst many things, also writes occasionally a great blog."}, {"time": 3764, "text": "He came up with this idea, I don't know if he coined the term, but of software 2.0, where the programming is done in the space of configuring these artificial neural networks."}, {"time": 3780, "text": "Is there some sense in which that would be the future of programming for us humans, where we're less doing like Python like programming and more... How would that look like?"}, {"time": 3796, "text": "But basically doing the hyperparameters of something akin to a biological system and watching it go and adjusting it and creating some kind of feedback loop within the system so it corrects itself."}, {"time": 3813, "text": "And then we watch it over time accomplish the goals we want it to accomplish."}, {"time": 3820, "text": "Is that kind of the dream of the dogs that you described in the Nature paper?"}, {"time": 3826, "text": "I mean, that's what you just painted is a very good description of our efforts at regenerative medicine as a kind of somatic psychiatry."}, {"time": 3834, "text": "So the idea is that you're not trying to micromanage."}, {"time": 3841, "text": "I mean, think about the limitations of a lot of the medicines today."}, {"time": 3841, "text": "We try to interact down at the level of pathways."}, {"time": 3847, "text": "So we're trying to micromanage it."}, {"time": 3847, "text": "Well, one problem is that for almost every medicine other than antibiotics, once you stop it, the problem comes right back."}, {"time": 3860, "text": "You haven't fixed anything."}, {"time": 3860, "text": "You were addressing symptoms."}, {"time": 3860, "text": "You weren't actually curing anything, again, except for antibiotics."}, {"time": 3863, "text": "That's one problem."}, {"time": 3863, "text": "The other problem is you have massive amount of side effects because you were trying to interact at the lowest level."}, {"time": 3873, "text": "It's like, I'm going to try to program this computer by changing the melting point of copper."}, {"time": 3880, "text": "Maybe you can do things that way, but my God, it's hard to program at the hardware level."}, {"time": 3886, "text": "So what I think we're starting to understand is that, and by the way, this goes back to what you were saying before about that we could have access to our internal state."}, {"time": 3893, "text": "So people who practice that kind of stuff, so yoga and biofeedback and those, those are all the people that uniformly will say things like, well, the body has an intelligence and this and that."}, {"time": 3904, "text": "Those two sets overlap perfectly because that's exactly right."}, {"time": 3908, "text": "Because once you start thinking about it that way, you realize that the better locus of control is not always at the lowest level."}, {"time": 3913, "text": "This is why we don't all program with a soldering iron."}, {"time": 3918, "text": "We take advantage of the high level intelligences that are there, intelligences that are there, which means trying to figure out, okay, which of your tissues can learn?"}, {"time": 3928, "text": "What can they learn?"}, {"time": 3928, "text": "Why is it that certain drugs stop working after you take them for a while with this habituation, right?"}, {"time": 3935, "text": "And so can we understand habituation, sensitization, associative learning, these kinds of things in chemical pathways?"}, {"time": 3940, "text": "We're going to have a completely different way."}, {"time": 3944, "text": "I think we're going to have a completely different way of using drugs and of medicine in general when we start focusing on the goal states and on the intelligence of our subsystems as opposed to treating everything as if the only path was micromanagement from chemistry upwards."}, {"time": 3959, "text": "Well, can you speak to this idea of somatic psychiatry?"}, {"time": 3959, "text": "What are somatic cells?"}, {"time": 3965, "text": "How do they form networks that use bioelectricity to have memory and all those kinds of things?"}, {"time": 3971, "text": "What are somatic cells like basics here?"}, {"time": 3971, "text": "Somatic cells just means the cells of your body."}, {"time": 3976, "text": "Soma just means body, right?"}, {"time": 3976, "text": "So somatic cells are just the..."}, {"time": 3976, "text": "I'm not even specifically making a distinction between somatic cells and stem cells or anything like that."}, {"time": 3980, "text": "I mean, basically all the cells in your body, not just neurons, but all the cells in your body."}, {"time": 3983, "text": "They form electrical networks during embryogenesis, during regeneration."}, {"time": 3988, "text": "What those networks are doing in part is processing information about what our current shape is and what the goal shape is."}, {"time": 3999, "text": "Now, how do I know this?"}, {"time": 3999, "text": "Because I can give you a couple of examples."}, {"time": 3999, "text": "One example is when we started studying this, we said, okay, here's a planarian."}, {"time": 4005, "text": "A planarian is a flatworm."}, {"time": 4005, "text": "It has one head and one tail normally."}, {"time": 4010, "text": "And the amazing..."}, {"time": 4010, "text": "There's several amazing things about planaria, but basically they kind of..."}, {"time": 4015, "text": "I think planaria hold the answer to pretty much every deep question of life."}, {"time": 4020, "text": "For one thing, they're similar to our ancestors."}, {"time": 4020, "text": "So they have true symmetry."}, {"time": 4020, "text": "They have a true brain."}, {"time": 4024, "text": "They're not like earthworms."}, {"time": 4024, "text": "They're a much more advanced life form."}, {"time": 4024, "text": "They have lots of different internal organs, but they're these little..."}, {"time": 4028, "text": "They're about maybe two centimeters in the centimeter to two in size."}, {"time": 4032, "text": "They have a head and a tail."}, {"time": 4032, "text": "And the first thing is planaria are immortal."}, {"time": 4037, "text": "So they do not age."}, {"time": 4037, "text": "There's no such thing as an old planarian."}, {"time": 4037, "text": "So that right there tells you that these theories of thermodynamic limitations on lifespan are wrong."}, {"time": 4042, "text": "It's not that well over time everything degrades."}, {"time": 4047, "text": "No, planaria can keep it going for probably how long have they been around 400 million years."}, {"time": 4053, "text": "So the planaria in our lab are actually in physical continuity with planaria that were here 400 million years ago."}, {"time": 4058, "text": "So there's planaria that have lived that long essentially."}, {"time": 4063, "text": "What does it mean physical continuity?"}, {"time": 4063, "text": "Because what they do is they split in half."}, {"time": 4069, "text": "The way they reproduce is they split in half."}, {"time": 4069, "text": "So the planaria, the back end grabs the petri dish, the front end takes off and they rip themselves in half."}, {"time": 4074, "text": "But isn't it some sense where like you are a physical continuation?"}, {"time": 4079, "text": "Yes, except that we go through a bottleneck of one cell, which is the egg."}, {"time": 4087, "text": "I mean, they can."}, {"time": 4087, "text": "There's certain planaria."}, {"time": 4087, "text": "So we go through a very ruthless compression process and they don't."}, {"time": 4091, "text": "Like an auto encoder, you know, sort of squashed down to one cell and then back out."}, {"time": 4097, "text": "These guys just tear themselves in half."}, {"time": 4102, "text": "And so the other amazing thing about them is they regenerate."}, {"time": 4102, "text": "So you can cut them into pieces."}, {"time": 4106, "text": "The record is, I think, 276 or something like that by Thomas Hunt Morgan."}, {"time": 4106, "text": "And each piece regrows a perfect little worm."}, {"time": 4112, "text": "They know exactly, every piece knows exactly what's missing, what needs to happen."}, {"time": 4116, "text": "In fact, if you chop it in half, as it grows the other half, the original tissue shrinks so that when the new tiny head shows up, they're proportional."}, {"time": 4125, "text": "So it keeps perfect proportion."}, {"time": 4130, "text": "If you starve them, they shrink."}, {"time": 4130, "text": "If you feed them again, they expand."}, {"time": 4130, "text": "Their control, their anatomical control is just insane."}, {"time": 4134, "text": "Somebody cut them into over 200 pieces."}, {"time": 4138, "text": "Thomas Hunt Morgan did."}, {"time": 4138, "text": "Hashtag science."}, {"time": 4138, "text": "And maybe more."}, {"time": 4138, "text": "I mean, they didn't have antibiotics back then."}, {"time": 4143, "text": "I bet he lost some due to infection."}, {"time": 4143, "text": "I bet it's actually more than that."}, {"time": 4146, "text": "I bet you could do more than that."}, {"time": 4146, "text": "Humans can't do that."}, {"time": 4151, "text": "I mean, again, true, except that... Maybe you can at the embryonic level."}, {"time": 4156, "text": "Well, that's the thing, right?"}, {"time": 4156, "text": "So when I talk about this, I say, just remember that as amazing as it is to grow a whole planarian from a tiny fragment, half of the human population can grow a full body from one cell."}, {"time": 4164, "text": "So development is really, you can look at development as just an example of regeneration."}, {"time": 4174, "text": "To think, we'll talk about regenerative medicine, but there's some sense of what would be like that warm in like 500 years where I can just go regrow a hand."}, {"time": 4186, "text": "With given time, it takes time to grow large things."}, {"time": 4191, "text": "You can probably... Why not accelerate?"}, {"time": 4191, "text": "Oh, biology takes its time?"}, {"time": 4196, "text": "I'm not going to say anything is impossible, but I don't know of a way to accelerate these processes."}, {"time": 4200, "text": "I think we are going to be regenerative, but I don't know of a way to make it faster."}, {"time": 4204, "text": "I could just think people from a few centuries from now would be like, well, they used to have to wait a week for the hand to regrow."}, {"time": 4210, "text": "It's like when the microwave was invented."}, {"time": 4210, "text": "You can toast your... What's that called when you put a cheese on a toast?"}, {"time": 4217, "text": "It's delicious is all I know."}, {"time": 4227, "text": "Anywho."}, {"time": 4227, "text": "So planaria, why were we talking about the magical planaria that they have the mystery of life?"}, {"time": 4234, "text": "So the reason we're talking about planaria is not only are they immortal, not only do they regenerate every part of the body, they generally don't get cancer, which we can talk about why that's important."}, {"time": 4243, "text": "They're smart."}, {"time": 4243, "text": "They can learn things."}, {"time": 4243, "text": "You can train them."}, {"time": 4247, "text": "And it turns out that if you train a planaria and then cut their heads off, the tail will regenerate a brand new brain that still remembers the original information."}, {"time": 4256, "text": "Do they have a biological network going on or no?"}, {"time": 4259, "text": "So their somatic cells are forming a network."}, {"time": 4259, "text": "And that's what you mean by a true brain?"}, {"time": 4259, "text": "What's the requirement for a true brain?"}, {"time": 4267, "text": "Like everything else, it's a continuum, but a true brain has certain characteristics as far as the density, like a localized density of neurons that guides behavior."}, {"time": 4275, "text": "In the head."}, {"time": 4276, "text": "If you cut their head off, the tail doesn't do anything."}, {"time": 4276, "text": "It just sits there until a new brain regenerates."}, {"time": 4282, "text": "They have all the same neurotransmitters that you and I have."}, {"time": 4288, "text": "But here's why we're talking about them in this context."}, {"time": 4288, "text": "So here's your planaria."}, {"time": 4288, "text": "You cut off the head."}, {"time": 4292, "text": "You cut off the tail."}, {"time": 4292, "text": "You have a middle fragment."}, {"time": 4292, "text": "That middle fragment has to make one head and one tail."}, {"time": 4295, "text": "How does it know how many of each to make?"}, {"time": 4295, "text": "And where do they go?"}, {"time": 4295, "text": "How come it doesn't switch?"}, {"time": 4300, "text": "How come, right?"}, {"time": 4300, "text": "So we did a very simple thing."}, {"time": 4300, "text": "And we said, okay, let's make the hypothesis that there's a somatic electrical network that remembers the correct pattern, and that what it's doing is recalling that memory and building to that pattern."}, {"time": 4315, "text": "So what we did was we used a way to visualize electrical activity in these cells, right?"}, {"time": 4315, "text": "It's a variant of what people used to look for electricity in the brain."}, {"time": 4321, "text": "And we saw that that fragment has a very particular electrical pattern."}, {"time": 4328, "text": "You can literally see it once we developed the technique."}, {"time": 4332, "text": "It has a very particular electrical pattern that shows you where the head and the tail goes, right?"}, {"time": 4337, "text": "You can just see it."}, {"time": 4337, "text": "And then we said, okay, well now let's test the idea that that's a memory that actually controls where the head and the tail goes."}, {"time": 4342, "text": "Let's change that pattern."}, {"time": 4342, "text": "So basically, incept the false memory."}, {"time": 4345, "text": "And so what you can do is you can do that in many different ways."}, {"time": 4349, "text": "One way is with drugs that target ion channels to say, and so you pick these drugs and you say, okay, I'm going to do it so that instead of this one head, one tail electrical pattern, you have a two headed pattern, right?"}, {"time": 4359, "text": "You're just editing the electrical information in the network."}, {"time": 4363, "text": "When you do that, guess what the cells build?"}, {"time": 4363, "text": "They build a two headed worm."}, {"time": 4367, "text": "And the coolest thing about it, no genetic changes."}, {"time": 4367, "text": "So we haven't touched the genome."}, {"time": 4371, "text": "The genome is totally wild type."}, {"time": 4371, "text": "But the amazing thing about it is that when you take these two headed animals and you cut them into pieces again, some of those pieces will continue to make two headed animals."}, {"time": 4379, "text": "So that information, that memory, that electrical circuit, not only does it hold the information for how many heads, not only does it use that information to tell the cells what to do to regenerate, but it stores it."}, {"time": 4389, "text": "Once you've reset it, it keeps."}, {"time": 4389, "text": "And we can go back, we can take a two headed animal and put it back to one headed."}, {"time": 4394, "text": "So now imagine, so there's a couple of interesting things here that that have implications for understanding what genomes and things like that."}, {"time": 4402, "text": "Imagine I take this two headed animal."}, {"time": 4402, "text": "Oh, and by the way, when they reproduce, when they tear themselves in half, you still get two headed animals."}, {"time": 4407, "text": "So imagine I take them and I throw them in the Charles River over here."}, {"time": 4411, "text": "So 100 years later, some scientists come along and they scoop up some samples and they go, oh, there's a single headed form and a two headed form."}, {"time": 4418, "text": "Wow, a speciation event."}, {"time": 4418, "text": "Let's sequence the genome and see why, what happened."}, {"time": 4418, "text": "The genomes are identical."}, {"time": 4423, "text": "There's nothing wrong with the genome."}, {"time": 4423, "text": "So if you ask the question, how does, so, so this goes back to your very first question is where do body plans come from, right?"}, {"time": 4427, "text": "How does the planarian know how many heads it's supposed to have?"}, {"time": 4431, "text": "Now it's interesting because you could say DNA, but what happened, what, what, as it turns out, the DNA produces a piece of hardware that by default says one head the way that when you turn on a calculator, by default, it's a zero every single time, right?"}, {"time": 4447, "text": "When you turn it on, it just says zero, but it's a programmable calculator as it turns out."}, {"time": 4451, "text": "So once you've changed that next time, it won't say zero."}, {"time": 4451, "text": "It'll say something else and the same thing here."}, {"time": 4456, "text": "So you can make, you can make one headed, two headed, you can make no headed worms."}, {"time": 4459, "text": "We've done some other things along these lines, some other really weird constructs."}, {"time": 4464, "text": "So, so this, this, this, this question of, right."}, {"time": 4464, "text": "So again, it's really important."}, {"time": 4464, "text": "The, the hardware software distinction is really important because the hardware is essential because without proper hardware, you're never going to get to the right physiology of having that memory."}, {"time": 4473, "text": "But once you have it, it doesn't fully determine what the information is going to be."}, {"time": 4478, "text": "You can have other information in there and it's reprogrammable by us, by bacteria, by various parasites, probably things like that."}, {"time": 4487, "text": "The other amazing thing about these planarias, think about this, most animals, when we get a mutation in our bodies, our children don't inherit it, right?"}, {"time": 4492, "text": "So you can go on, you could run around for 50, 60 years getting mutations."}, {"time": 4496, "text": "Your children don't have those mutations because we go through the egg stage."}, {"time": 4500, "text": "Planaria tear themselves in half and that's how they reproduce."}, {"time": 4505, "text": "So for 400 million years, they keep every mutation that they've had that doesn't kill the cell that it's in."}, {"time": 4510, "text": "So when you look at these planaria, their bodies are what's called mixoploid, meaning that every cell might have a different number of chromosomes."}, {"time": 4514, "text": "They look like a tumor."}, {"time": 4514, "text": "If you look at the, the, the, the, the genome is an incredible mess because they accumulate all this stuff."}, {"time": 4522, "text": "And yet the, their body structure is, they are the best regenerators on the planet."}, {"time": 4522, "text": "Their anatomy is rock solid, even though their genome is always all kinds of crap."}, {"time": 4528, "text": "So this is a kind of a scandal, right?"}, {"time": 4532, "text": "That, you know, when we learn that, well, you know, what are genomes to what genomes determine your body?"}, {"time": 4537, "text": "Why is the animal with the worst genome have the best anatomical control, the most cancer resistant, the most regenerative, right?"}, {"time": 4541, "text": "Really, we're just beginning to start to understand this relationship between the, the genomically determined hardware and, and, and by the way, just as of, as of a couple of months ago, I think I now somewhat understand why this is, but it's really, it's really a major, you know, a major puzzle."}, {"time": 4557, "text": "I mean, that really throws a wrench into the whole nature versus nurture because you usually associate electricity with the, with the nurture and the hardware with the nature."}, {"time": 4573, "text": "And it's, there's just this weird integrated mess that propagates through generations."}, {"time": 4579, "text": "It's much more fluid."}, {"time": 4579, "text": "It's much more complex."}, {"time": 4579, "text": "You can, you can imagine what's, what's happening here is just, just imagine the evolution of a, of a, of an animal like this, that, that multi scale, this goes back to this multi scale competency, right?"}, {"time": 4589, "text": "Imagine that you have two, two, two, you have, you have an animal that that where its, its tissues have some degree of multi scale competency."}, {"time": 4598, "text": "So for example, if the like, like we saw in the tadpole, you know, if you put an eye on its tail, they can still see out of that eye, right?"}, {"time": 4602, "text": "That the, you know, there's all, there's incredible plasticity."}, {"time": 4606, "text": "So if you have an animal and it comes up for selection and the fitness is quite good, evolution doesn't know whether the fitness is good because the genome was awesome or because the genome was kind of junky, but, but the competency made up for it, right?"}, {"time": 4621, "text": "And things kind of ended up good."}, {"time": 4621, "text": "So what that means is that the more competency you have, the harder it is for selection to pick the best genomes, it hides information, right?"}, {"time": 4626, "text": "And so that means that, so, so what happens, you know, evolution basically starts all those start, all the hard work is being done to increase the competency because it's harder and harder to see the genomes."}, {"time": 4641, "text": "And so I think in planaria, what happened is that there's this runaway phenomenon where all the effort went into the algorithm such that we know you got a crappy genome."}, {"time": 4645, "text": "We can't keep, we can't clean up the genome."}, {"time": 4651, "text": "We can't keep track of it."}, {"time": 4651, "text": "So what's going to happen is what survives are the algorithms that can create a great worm no matter what the genome is."}, {"time": 4655, "text": "So everything went into the algorithm and which, which of course then reduces the pressure on keeping a, you know, keeping a clean genome."}, {"time": 4664, "text": "So this idea of, right, and different animals have this in different, to different levels, but this idea of putting energy into an algorithm that does not overtrain on priors, right?"}, {"time": 4674, "text": "It can't assume, I mean, I think biology is this way in general, evolution doesn't take the past too seriously because it makes these basically problem solving machines as opposed to like exactly what, you know, to, to, to deal with exactly what happened last time."}, {"time": 4688, "text": "Problem solving versus memory recall."}, {"time": 4688, "text": "So a little memory, but a lot of problem solving."}, {"time": 4694, "text": "In many cases, yeah."}, {"time": 4694, "text": "Problem solving."}, {"time": 4702, "text": "I mean, it's incredible that those kinds of systems are able to be constructed, um, especially how much they contrast with the way we build problem solving systems in the AI world."}, {"time": 4712, "text": "Um, back to Xenobots."}, {"time": 4712, "text": "I'm not sure if we ever described how Xenobots are built, but I mean, you have a paper titled biological robots perspectives on an emerging interdisciplinary field."}, {"time": 4725, "text": "And the beginning you, uh, you mentioned that the word Xenobots is like controversial."}, {"time": 4731, "text": "Do you guys get in trouble for using Xenobots or what?"}, {"time": 4731, "text": "Do people not like the word Xenobots?"}, {"time": 4737, "text": "Are you trying to be provocative with the word Xenobots versus biological robots?"}, {"time": 4742, "text": "Is there some drama that we should be aware of?"}, {"time": 4742, "text": "There's a little bit of drama."}, {"time": 4742, "text": "Uh, I think, I think the drama is basically related to people, um, having very fixed ideas about what terms mean."}, {"time": 4755, "text": "And I think in many cases, these ideas are completely out of date with, with where science is now."}, {"time": 4762, "text": "And for sure they're, they're out of date with what's going to be, I mean, these, these, these concepts, uh, are not going to survive the next couple of decades."}, {"time": 4768, "text": "So if you ask a person and including, um, you know, a lot of people in biology who kind of want to keep a sharp distinction between biologicals and robots, right?"}, {"time": 4778, "text": "See, what's a robot?"}, {"time": 4778, "text": "Well, a robot, it comes out of a factory."}, {"time": 4782, "text": "It's made by humans."}, {"time": 4782, "text": "It is boring."}, {"time": 4782, "text": "It is a meaning that you can predict everything it's going to do."}, {"time": 4786, "text": "It's made of metal and certain other inorganic materials."}, {"time": 4786, "text": "Living organisms are magical."}, {"time": 4790, "text": "They, they, they arise, right?"}, {"time": 4790, "text": "So these, these distinctions, I think these, these distinctions, I think were, were never good, but, uh, they're going to be completely useless going forward."}, {"time": 4800, "text": "And so part of, there's a couple of papers that that's one paper and there's another one that Josh Bongar and I wrote where we really attack the terminology."}, {"time": 4809, "text": "And we say these binary categories are based on very, um, nonessential kind of surface, uh, limitations of, of technology and imagination that were true before, but they've got to go."}, {"time": 4816, "text": "And so, and so we call them Zenobots."}, {"time": 4822, "text": "So, so Xeno for Xenopus Levus, where this is, it's the frog that, that these guys are made of, but we think it's an example of, of, of, uh, of a biobot technology, because ultimately if we, if we under, once we understand how to, uh, communicate and manipulate, um, the inputs to these cells, we will be able to get them to build whatever we want them to build."}, {"time": 4845, "text": "And that's robotics, right?"}, {"time": 4845, "text": "It's, it's the rational construction of machines that have useful purposes."}, {"time": 4849, "text": "I, I absolutely think that this is a robotics platform, whereas some biologists don't, but it's built in a way that, uh, all the different components are doing their own computation."}, {"time": 4862, "text": "So in a way that we've been talking about, so you're trying to do top down control in that biological system."}, {"time": 4866, "text": "And in the future, all of this will, will, will merge together because of course at some point we're going to throw in synthetic biology circuits, right?"}, {"time": 4869, "text": "New, new, um, you know, new transcriptional circuits to get them to do new things."}, {"time": 4873, "text": "Of course we'll throw some of that in, but we specifically stayed away from all of that because in the first few papers, and there's some more coming down the pike that are, I think going to be pretty, pretty dynamite, um, that, uh, we want to show what the native cells are made of."}, {"time": 4885, "text": "Because what happens is, you know, if you engineer the heck out of them, right, if we were to put in new, you know, new transcription factors and some new metabolic machinery and whatever, people will say, well, okay, you engineered this and you made it do whatever."}, {"time": 4898, "text": "And fine."}, {"time": 4898, "text": "I wanted to show, uh, and, and, and the whole team, uh, wanted to show the plasticity and the intelligence in the biology."}, {"time": 4910, "text": "What does it do that's surprising before you even start manipulating the hardware in that way?"}, {"time": 4915, "text": "Don't try to, uh, over control the thing."}, {"time": 4915, "text": "Let it flourish."}, {"time": 4915, "text": "The, the full beauty of the biological system."}, {"time": 4922, "text": "Why Xenopus Levus?"}, {"time": 4922, "text": "The frog."}, {"time": 4927, "text": "Xenopus Levus."}, {"time": 4927, "text": "It's a very popular."}, {"time": 4929, "text": "Why this frog?"}, {"time": 4930, "text": "It's been used since, uh, I think the fifties."}, {"time": 4930, "text": "Uh, it's just very convenient because you can, you know, we, we keep the adults in this, in this, uh, very fine frog habitat."}, {"time": 4935, "text": "They lay eggs."}, {"time": 4935, "text": "They lay tens of thousands of eggs at a time."}, {"time": 4939, "text": "Um, the eggs develop right in front of your eyes."}, {"time": 4939, "text": "It's the most mad magical thing you can, you can see because normally, you know, if you were to deal with mice or rabbits or whatever, you don't see the early stages, right?"}, {"time": 4949, "text": "Cause everything's inside the mother."}, {"time": 4952, "text": "Everything's in a Petri dish at room temperature."}, {"time": 4952, "text": "So you just, you, you have an egg, it's fertilized and you can just watch it divide and divide and divide."}, {"time": 4956, "text": "And on all the organs form, you can just see it."}, {"time": 4960, "text": "And at that point, um, the community has, has developed lots of different tools for understanding what's going on and also for, for manipulating, right?"}, {"time": 4964, "text": "So it's, it's people use it for, um, you know, for understanding birth defects and neurobiology and cancer immunology."}, {"time": 4974, "text": "So you get the whole, uh, embryogenesis in the Petri dish."}, {"time": 4980, "text": "That's so cool to watch."}, {"time": 4980, "text": "Is there videos of this?"}, {"time": 4980, "text": "There's, but yeah, there's, there's amazing videos on, on, online."}, {"time": 4983, "text": "I mean, mammalian embryos are super cool too."}, {"time": 4988, "text": "For example, monozygotic twins are what happens when you cut a mammalian embryo in half."}, {"time": 4992, "text": "You don't get two half bodies."}, {"time": 4992, "text": "You get two perfectly normal bodies because it's a regeneration event, right?"}, {"time": 4995, "text": "Development is just the, it's just the kind of regeneration really."}, {"time": 4999, "text": "And why this particular frog?"}, {"time": 4999, "text": "It's just, uh, cause they were doing in the fifties and."}, {"time": 5005, "text": "It breeds well in, um, you know, in, in, it's easy to raise in, in the laboratory and, uh, it's very prolific and all the tools basically for decades, people have been developing tools."}, {"time": 5016, "text": "There's other, some people use other frogs, but I have to say this is, this is, this is important."}, {"time": 5020, "text": "Xenobots are fundamentally not anything about frogs."}, {"time": 5020, "text": "So, um, I can't say too much about this cause it's not published and peer reviewed yet, but we've made Xenobots out of other things that have nothing to do with frogs."}, {"time": 5030, "text": "It's, this is not a frog phenomenon."}, {"time": 5030, "text": "This is, we, we started with frog because it's so convenient, but this, this, this plasticity is not a fraud."}, {"time": 5034, "text": "You know, it's not related to the fact that they're frogs."}, {"time": 5039, "text": "What happens when you kiss it?"}, {"time": 5039, "text": "Does it turn into a prince?"}, {"time": 5042, "text": "Or a princess?"}, {"time": 5042, "text": "Uh, prince."}, {"time": 5042, "text": "Prince should be a prince."}, {"time": 5047, "text": "Uh, that's an experiment that I don't believe we've done."}, {"time": 5047, "text": "And if we have, I don't want to collaborate, I can, I can take on the lead, uh, on that effort."}, {"time": 5050, "text": "Uh, how does the cells coordinate?"}, {"time": 5057, "text": "Let's focus in on just the embryogenesis."}, {"time": 5057, "text": "So there's one cell, so it divides, doesn't have to be very careful about what each cell starts doing once they divide."}, {"time": 5072, "text": "And like, when there's three of them, it's like the cofounders or whatever, like, well, like slow down, you're responsible for this."}, {"time": 5077, "text": "When do they become specialized and how do they coordinate that specialization?"}, {"time": 5084, "text": "So, so this is the basic science of developmental biology."}, {"time": 5089, "text": "There's a lot known about all of that, but, um, but I'll tell you what I think is kind of the most important part, which is, yes, it's very important who does what."}, {"time": 5095, "text": "However, because going back to this issue of why I made this claim that, um, biology doesn't take the past too seriously."}, {"time": 5107, "text": "And what I mean by that is it doesn't assume that everything is the way it's, it's expected to be."}, {"time": 5112, "text": "And here's an example of that."}, {"time": 5112, "text": "Um, this was, this was done, this was, this was an old experiment going back to the forties, but, um, basically imagine imagine it's a new salamander and it's got these little tube tubules that go to the kidneys, right?"}, {"time": 5121, "text": "It's a little tube."}, {"time": 5125, "text": "Take a cross section of that tube."}, {"time": 5125, "text": "You see eight to 10 cells that have cooperated to make this little tube in cross section, right?"}, {"time": 5130, "text": "So one amazing, one amazing thing you can do is, um, you can, you can mess with a very early cell division to make the cells gigantic, bigger."}, {"time": 5141, "text": "You can, you can make them different sizes."}, {"time": 5141, "text": "You can force them to be different sizes."}, {"time": 5144, "text": "So if you make the cells different sizes, the whole nude is still the same size."}, {"time": 5150, "text": "So if you take a cross section through the, through that tubule, instead of eight to 10 cells, you might have four or five or you might have, you know, three until you make the cells so enormous that one single cell wraps around itself and, and gives you that same large scale structure with a completely different molecular mechanism."}, {"time": 5166, "text": "So now instead of cell to cell communication to make a tubule, instead of that, it's one cell using the cytoskeleton to bend itself around."}, {"time": 5175, "text": "So think about what that means in the service of a large scale, talk about top down control, right?"}, {"time": 5180, "text": "In the service of a large scale anatomical feature, different molecular mechanisms get called up."}, {"time": 5184, "text": "So now think about this, you're, you're, you're a nude cell and trying to make an embryo."}, {"time": 5190, "text": "If you had a fixed idea of who was supposed to do what, you'd be screwed because now your cells are gigantic."}, {"time": 5194, "text": "Nothing would work."}, {"time": 5194, "text": "The, there's an incredible tolerance for changes in the size of the parts and the amount of DNA in those parts."}, {"time": 5200, "text": "Um, all sorts of stuff you can, you can, the life is highly interoperable."}, {"time": 5205, "text": "You can put electrodes in there and you can put weird nanomaterials."}, {"time": 5205, "text": "It still works."}, {"time": 5209, "text": "It's, it's, uh, this is that problem solving action, right?"}, {"time": 5209, "text": "It's able to do what it needs to do, even when circumstances change."}, {"time": 5214, "text": "That is, you know, the hallmark of intelligence, right?"}, {"time": 5220, "text": "William James defined intelligence as the ability to get to the same goal by different means."}, {"time": 5224, "text": "That's this, you get to the same goal by completely different means."}, {"time": 5224, "text": "And so, so, so why am I bringing this up is just to say that, yeah, it's important for the cells to do the right stuff, but they have incredible tolerances for things not being what you expect and to still get their job done."}, {"time": 5237, "text": "So if you're, you know, um, all of these things are not hardwired."}, {"time": 5243, "text": "There are organisms that might be hardwired."}, {"time": 5243, "text": "For example, the nematode C elegans in that organism, every cell is numbered, meaning that every C elegans has exactly the same number of cells as every other C elegans."}, {"time": 5252, "text": "They're all in the same place."}, {"time": 5252, "text": "They all divide."}, {"time": 5252, "text": "There's literally a map of how it works that in that, in that sort of system, it's, it's, it's much more cookie cutter, but, but most, most organisms are incredibly plastic in that way."}, {"time": 5260, "text": "Is there something particularly magical to you about the whole developmental biology process?"}, {"time": 5267, "text": "Um, is there something you could say, cause you just said it, they're very good at accomplishing the goal of the job they need to do the competency thing, but you get fricking organism from one cell."}, {"time": 5278, "text": "It's like, uh, I mean, it's very hard, hard to intuit that whole process to even think about reverse engineering that process."}, {"time": 5294, "text": "Very hard to the point where I often just imagine, I, I sometimes ask my students to do this thought experiment."}, {"time": 5299, "text": "Imagine you were, you were shrunk down to the, to the scale of a single cell and you were in the middle of an embryo and you were looking around at what's going on and the cells running around, some cells are dying at the, you know, every time you look, it's kind of a different number of cells for most organisms."}, {"time": 5310, "text": "And so I think that if you didn't know what embryonic development was, you would have no clue that what you're seeing is always going to make the same thing."}, {"time": 5320, "text": "Nevermind knowing what that, what that is."}, {"time": 5320, "text": "Nevermind being able to say, even with full genomic information, being able to say, what the hell are they building?"}, {"time": 5324, "text": "We have no way to do that."}, {"time": 5328, "text": "But, but just even to guess that, wow, the, the, the outcome of all this activity is it's always going to be, it's always going to build the same thing."}, {"time": 5334, "text": "The imperative to create the final you as you are now is there already."}, {"time": 5340, "text": "So you can, you would, so you start from the same embryo, you create a very similar organism."}, {"time": 5346, "text": "Except for cases like the Xenobots, when you give them a different environment, they come up with a different way to be adaptive in that environment."}, {"time": 5358, "text": "But overall, I mean, so, so I think, so I think to, you know, kind of summarize it, I think what evolution is really good at is creating hardware that has a very stable baseline mode, meaning that left to its own devices, it's very good at doing the same thing."}, {"time": 5371, "text": "But it has a bunch of problem solving capacity such that if any, if any assumptions don't hold, if your cells are a weird size, or you get the wrong number of cells, or there's a, you know, somebody stuck in electrode halfway through the body, whatever, it will still get most of what it needs to do done."}, {"time": 5392, "text": "You've talked about the magic and the power of biology here."}, {"time": 5392, "text": "If we look at the human brain, how special is the brain in this context?"}, {"time": 5397, "text": "You're kind of minimizing the importance of the brain or lessening its, we think of all the special computation happens in the brain, everything else is like the help."}, {"time": 5408, "text": "You're kind of saying that the whole thing is the whole thing is doing computation."}, {"time": 5414, "text": "But nevertheless, how special is the human brain in this full context of biology?"}, {"time": 5422, "text": "Yeah, I mean, look, there's no getting away from the fact that the human brain allows us to do things that we could not do without it."}, {"time": 5427, "text": "You can say the same thing about the liver."}, {"time": 5431, "text": "Yeah, no, this is this is true."}, {"time": 5431, "text": "And so and so, you know, I, my goal is not No, you're right."}, {"time": 5431, "text": "My goal is just being polite to the brain right now."}, {"time": 5437, "text": "Well, being a politician, like, listen, everybody has everybody has a role."}, {"time": 5442, "text": "Yeah, it's very important role."}, {"time": 5442, "text": "We have to acknowledge the importance of the brain, you know, there are more than enough people who are cheerleading the brain, right?"}, {"time": 5452, "text": "So so I don't feel like nothing I say is going to reduce people's excitement about the human brain."}, {"time": 5458, "text": "And so so I emphasize other things credit."}, {"time": 5458, "text": "I don't think it gets too much credit."}, {"time": 5464, "text": "I think other things don't get enough credit."}, {"time": 5464, "text": "I think the brain is the human brain is incredible and special and all that."}, {"time": 5468, "text": "I think other things need more credit."}, {"time": 5468, "text": "And and I also think that this and I'm sort of this way about everything."}, {"time": 5473, "text": "I don't like binary categories, but almost anything I like a continuum."}, {"time": 5479, "text": "And the thing about the human brain is that it by by by accepting that as some kind of an important category or essential, essential thing, we end up with all kinds of weird pseudo problems and conundrum."}, {"time": 5492, "text": "So for example, when we talk about it, you know, if you don't want to talk about ethics and other other things like that, and what you know, this this idea that surely if we look out into the universe, surely, we don't believe that this human brain is the only way to be sentient, right?"}, {"time": 5510, "text": "Surely we don't, you know, and to have high level cognition."}, {"time": 5514, "text": "I just can't even wrap my mind around this, this idea that that is the only way to do it."}, {"time": 5519, "text": "No doubt there are other architectures made bond made of completely different principles that achieve the same thing."}, {"time": 5524, "text": "And once we believe that, then that tells us something important."}, {"time": 5524, "text": "It tells us that things that are not quite human brains or chimeras of human brains and other tissue or human brains or other kinds of brains and novel configurations or things that are sort of brains, but not really, or plants or embryos or whatever, might also have important cognitive status."}, {"time": 5546, "text": "So that's the only thing I think we have to be really careful about treating the human brain as if it was some kind of like sharp binary category."}, {"time": 5552, "text": "You know, you are or you aren't."}, {"time": 5552, "text": "I don't believe that exists."}, {"time": 5557, "text": "So when we look out at all the beautiful variety of human brains, semi biological architectures out there in the universe, how many intelligent alien civilizations do you think are out there?"}, {"time": 5572, "text": "Boy, I have no expertise in that whatsoever."}, {"time": 5572, "text": "You haven't met any?"}, {"time": 5579, "text": "I have met the ones we've made."}, {"time": 5579, "text": "I think that I mean, exactly."}, {"time": 5579, "text": "In some sense with synthetic biology, are you not creating aliens?"}, {"time": 5586, "text": "I absolutely think so because look, all of life, all of all standard model systems are an end of one course of evolution on Earth, right?"}, {"time": 5592, "text": "And trying to make conclusions about biology from looking at life on Earth is like testing your theory on the same data that generated it."}, {"time": 5606, "text": "It's all it's all kind of like locked in."}, {"time": 5606, "text": "So we absolutely have to create novel examples that have no history on Earth that don't, you know, xenobots have no history of selection to be a good xenobot."}, {"time": 5620, "text": "The cells have selection for various things, but the xenobot itself never existed before."}, {"time": 5624, "text": "And so we can make chimeras, you know, we make frog a lottles that are sort of half frog, half axolotl."}, {"time": 5628, "text": "You can make all sorts of high brats, right constructions of living tissue with robots and whatever."}, {"time": 5633, "text": "We need to be making these things until we find actual aliens, because otherwise, we're just looking at an end of one set of examples, all kinds of frozen accidents of evolution and so on."}, {"time": 5643, "text": "We need to go beyond that to really understand biology."}, {"time": 5643, "text": "But we're still even when you do a synthetic biology, you're locked in to the basic components of the way biology is done on this Earth."}, {"time": 5657, "text": "And also, and the and also the basic constraints of the environment, even artificial environments to construct in the lab are tied up to the environment."}, {"time": 5667, "text": "I mean, what do you?"}, {"time": 5667, "text": "Okay, let's say there is I mean, what I think is there's a nearly infinite number of intelligent civilizations living or dead out there."}, {"time": 5681, "text": "If you pick one out of the box, what do you think it would look like?"}, {"time": 5681, "text": "So in when you think about synthetic biology, or creating synthetic organisms, how hard is it to create something that's very different?"}, {"time": 5698, "text": "Yeah, I think it's very hard to create something that's very different, right?"}, {"time": 5698, "text": "It's we are just locked in both both both experimentally and in terms of our imagination, right?"}, {"time": 5712, "text": "And you also emphasize several times that the idea of shape."}, {"time": 5712, "text": "Yeah, the individual cell get together with other cells and they kind of they're gonna build a shape."}, {"time": 5718, "text": "So it's shape and function, but shape is a critical thing."}, {"time": 5723, "text": "So here, I'll take a stab."}, {"time": 5723, "text": "I mean, I agree with you."}, {"time": 5723, "text": "I did to whatever extent that we can say anything, I do think that there's, you know, probably an infinite number of, of different different architectures with with that are with interesting cognitive properties out there."}, {"time": 5738, "text": "What can we say about them?"}, {"time": 5738, "text": "I think that the only things that are going I don't I don't think we can rely on any of the typical stuff, you know, carbon based, none of that."}, {"time": 5750, "text": "Like, I think all of that is just, you know, us being having having a lack of imagination."}, {"time": 5750, "text": "But I think the things that are going to be universal, if anything is, are things, for example, driven by resource limitation, the fact that you are fighting a hostile world, and you have to draw a boundary between yourself and the world somewhere, the fact that that boundary is not given to you by anybody, you have to you have to assume it, you know, estimated yourself."}, {"time": 5773, "text": "And the fact that you have to course grain your experience and the fact that you're going to try to minimize surprise and the fact that like these, these are the things that I think are fundamental about biology, none of the, you know, the facts about the genetic code, or even the fact that we have genes or the biochemistry of it, I don't think any of those things are fundamental."}, {"time": 5790, "text": "But it's going to be a lot more about the information and about the creation of the self, the fact that so in my in my framework, selves are demarcated by the scale of the goals that they can pursue."}, {"time": 5798, "text": "So from little tiny local goals to like massive, you know, planetary scale goals for certain humans, and everything and everything in between."}, {"time": 5809, "text": "So you can draw this like cognitive light cone about that determines the the scale of the goals you could possibly pursue."}, {"time": 5813, "text": "I think those kinds of frameworks, like that, like active inference, and so on are going to be universally applicable, but but none of the other things that are that are typically discussed."}, {"time": 5824, "text": "Quick pause, do you need a bathroom break?"}, {"time": 5828, "text": "We were just talking about, you know, aliens and all that."}, {"time": 5828, "text": "That's a funny thing, which is, I don't know if you've seen them, there's a kind of debate that goes on about cognition and plants, and what can you say about different kinds of computation and cognition and plants."}, {"time": 5844, "text": "And I always I always look at that something like if you're weirded out by cognition and plants, you're not ready for exobiology, right?"}, {"time": 5848, "text": "If you know something that's that similar here on Earth is already like freaking you out, then I think there's going to be all kinds of cognitive life out there that we're gonna have a really hard time recognizing."}, {"time": 5858, "text": "I think robots will help us, yeah, like expand our mind about cognition, either that or the word like xenobots."}, {"time": 5864, "text": "So, and they maybe becomes the same thing is, you know, really, when the human engineers, the thing, at least in part, and then is able to achieve some kind of cognition that's different than what you're used to, then you start to understand like, oh, you know, every living organism is capable of cognition."}, {"time": 5894, "text": "Oh, I need to kind of broaden my understanding what cognition is."}, {"time": 5899, "text": "But do you think plants, like when you when you eat them, are they screaming?"}, {"time": 5899, "text": "I don't know about screaming."}, {"time": 5905, "text": "I think you have to see what I think when I eat a salad."}, {"time": 5905, "text": "Yeah, I think you have to scale down the expectations in terms of right, so probably they're not screaming in the way that we would be screaming."}, {"time": 5914, "text": "However, there's plenty of data on plants being able to do anticipation and certain kinds of memory and so on."}, {"time": 5919, "text": "I think, you know, what you just said about robots, I hope you're right."}, {"time": 5926, "text": "And I hope that's but there's two, there's two ways that people can take that right."}, {"time": 5931, "text": "So one way is exactly what you just said to try to kind of expand their expand their their their notions for that category."}, {"time": 5934, "text": "The other way people often go is they just sort of define the term is if if if it's not a natural product, it's it's just faking, right?"}, {"time": 5948, "text": "It's not really intelligence if it was made by somebody else, because it's that same, it's the same thing."}, {"time": 5951, "text": "They can see how it's done."}, {"time": 5951, "text": "And once you see how it's like a magic trick, when you see how it's done, it's not as fun anymore."}, {"time": 5956, "text": "And and I think people have a real tendency for that."}, {"time": 5961, "text": "And they sort of which which I find really strange in the sense that if somebody said to me, we have this this this sort of blind, like, like, hill climbing search, and then and then we have a really smart team of engineers, which one do you think is going to produce a system that has good intelligence?"}, {"time": 5976, "text": "I think it's really weird to say that it only comes from the blind search, right?"}, {"time": 5981, "text": "It can't be done by people who, by the way, can also use evolutionary techniques if they want to, but also rational design."}, {"time": 5985, "text": "I think it's really weird to say that real intelligence only comes from natural evolution."}, {"time": 5989, "text": "So I hope you're right."}, {"time": 5989, "text": "I hope people take it the other the other way."}, {"time": 5995, "text": "But there's a nice shortcut."}, {"time": 5995, "text": "So I work with Lego robots a lot now from for my own personal pleasure."}, {"time": 6001, "text": "Not in that way internet."}, {"time": 6001, "text": "So four legs."}, {"time": 6001, "text": "And one of the things that changes my experience with the robots a lot is when I can't understand why I did a certain thing."}, {"time": 6021, "text": "And there's a lot of ways to engineer that."}, {"time": 6021, "text": "Me, the person that created the software that runs it."}, {"time": 6027, "text": "There's a lot of ways for me to build that software in such a way that I don't exactly know why it did a certain basic decision."}, {"time": 6033, "text": "Of course, as an engineer, you can go in and start to look at logs."}, {"time": 6040, "text": "You can log all kind of data, sensory data, the decisions you made, you know, all the outputs in your networks and so on."}, {"time": 6045, "text": "But I also try to really experience that surprise and that really experience as another person would that totally doesn't know how it's built."}, {"time": 6052, "text": "And I think the magic is there in not knowing how it works."}, {"time": 6057, "text": "That I think biology does that for you through the layers of abstraction."}, {"time": 6066, "text": "Yeah, it because nobody really knows what's going on inside the biological."}, {"time": 6066, "text": "Like each one component is clueless about the big picture."}, {"time": 6074, "text": "I think there's actually really cheap systems that can that can illustrate that kind of thing, which is even like, you know, fractals, right?"}, {"time": 6080, "text": "Like, you have a very small, short formula in Z, and you see it and there's no magic, you're just going to crank through, you know, Z squared plus C, whatever, you're just going to crank through it."}, {"time": 6092, "text": "But the result of it is this incredibly rich, beautiful image, right?"}, {"time": 6096, "text": "That that just like, wow, all of that was in this, like, 10 character long string, like amazing."}, {"time": 6103, "text": "So the fact that you can you can know everything there is to know about the details and the process and all the parts and every like, there's literally no magic of any kind there."}, {"time": 6114, "text": "And yet the outcome is something that you would never have expected."}, {"time": 6121, "text": "And it's just it just, you know, is incredibly rich and complex and beautiful."}, {"time": 6121, "text": "So there's a lot of that."}, {"time": 6127, "text": "You write that you work on developing conceptual frameworks for understanding unconventional cognition."}, {"time": 6133, "text": "So the kind of thing we've been talking about, I just like the term unconventional cognition."}, {"time": 6137, "text": "And you want to figure out how to detect, study and communicate with the thing."}, {"time": 6143, "text": "You've already mentioned a few examples, but what is unconventional cognition?"}, {"time": 6143, "text": "Is it as simply as everything else outside of what we define usually as cognition, cognitive science, the stuff going on between our ears?"}, {"time": 6154, "text": "Or is there some deeper way to get at the fundamentals of what is cognition?"}, {"time": 6161, "text": "Yeah, I think like, and I'm certainly not the only person who works in unconventional, unconventional cognition."}, {"time": 6167, "text": "So it's the term used?"}, {"time": 6167, "text": "Yeah, that's one that I so I've coined a number of weird terms, but that's not one of mine like that."}, {"time": 6173, "text": "That's an existing thing."}, {"time": 6173, "text": "So so for example, somebody like Andy Adam Askey, who I don't know if you've if you've had him on, if you haven't, you should he's a he's a he's a, you know, very interesting guy."}, {"time": 6180, "text": "He's a computer scientist, and he does unconventional cognition and slime molds, all kinds of weird."}, {"time": 6185, "text": "He's a real weird, weird cat, really interesting."}, {"time": 6190, "text": "Anyway, so so that's, you know, it's a bunch of terms that I've come up with."}, {"time": 6195, "text": "But that's not one of mine."}, {"time": 6195, "text": "So I think like many terms, that one is, is really defined by the times, meaning that unconventional cognitive things that are unconventional cognition today are not going to be considered unconventional cognition at some point."}, {"time": 6206, "text": "It's one of those, it's one of those things."}, {"time": 6211, "text": "And so it's, you know, it's, it's, it's this, it's this really deep question of how do you recognize, communicate with, classify cognition, when you cannot rely on the typical milestones, right?"}, {"time": 6226, "text": "So typical, you know, again, if you stick with the with the, the history of life on Earth, like these, these exact model systems, you would say, Ah, here's a particular structure of the brain."}, {"time": 6236, "text": "And this one has fewer of those."}, {"time": 6236, "text": "And this one has a bigger frontal cortex."}, {"time": 6240, "text": "And this one, right, so these are these are landmarks that that we're that we're used to, and and allows us to make very kind of rapid judgments about things."}, {"time": 6244, "text": "But if you can't rely on that, either because you're looking at a synthetic thing, or an engineered thing, or an alien thing, then what do you do?"}, {"time": 6256, "text": "How do you and so and so that's what I'm really interested."}, {"time": 6256, "text": "I'm interested in mind in all of its possible implementations, not just the obvious ones that we know from from looking at brains here on Earth."}, {"time": 6265, "text": "Whenever I think about something like unconventional cognition, I think about cellular automata, I'm just captivated by the beauty of the thing."}, {"time": 6276, "text": "The fact that from simple little objects, you can create some such beautiful complexity that very quickly, you forget about the individual objects, and you see the things that it creates as its own organisms."}, {"time": 6293, "text": "That blows my mind every time."}, {"time": 6293, "text": "Like, honestly, I could full time just eat mushrooms and watch cellular automata."}, {"time": 6301, "text": "Don't even have to do mushrooms."}, {"time": 6306, "text": "Just cellular automata."}, {"time": 6306, "text": "It feels like, I mean, from the engineering perspective, I love when a very simple system captures something really powerful, because then you can study that system to understand something fundamental about complexity about life on Earth."}, {"time": 6324, "text": "Anyway, how do I communicate with a thing?"}, {"time": 6324, "text": "If cellular automata can do cognition, if a plant can do cognition, if a xenobot can do cognition, how do I like whisper in its ear and get an answer back to how do I have a conversation?"}, {"time": 6340, "text": "How do I have a xenobot on a podcast?"}, {"time": 6346, "text": "It's a really interesting line of investigation that opens up."}, {"time": 6346, "text": "I mean, we've thought about this."}, {"time": 6353, "text": "So you need a few things."}, {"time": 6353, "text": "You need to understand the space in which they live."}, {"time": 6353, "text": "So not just the physical modality, like can they see light, can they feel vibration?"}, {"time": 6360, "text": "I mean, that's important, of course, because that's how you deliver your message."}, {"time": 6363, "text": "But not just the ideas for a communication medium, not just the physical medium, but saliency, right?"}, {"time": 6368, "text": "So what's important to this system?"}, {"time": 6376, "text": "And systems have all kinds of different levels of sophistication of what you could expect to get back."}, {"time": 6382, "text": "And I think what's really important, I call this the spectrum of persuadability, which is this idea that when you're looking at a system, you can't assume where on the spectrum it is."}, {"time": 6393, "text": "You have to do experiments."}, {"time": 6393, "text": "And so for example, if you look at a gene regulatory network, which is just a bunch of nodes that turn each other on and off at various rates, you might look at that and you say, well, there's no magic here."}, {"time": 6405, "text": "I mean, clearly this thing is as deterministic as it gets."}, {"time": 6410, "text": "It's a piece of hardware."}, {"time": 6410, "text": "The only way we're going to be able to control it is by rewiring it, which is the way molecular biology works, right?"}, {"time": 6414, "text": "We can add nodes, remove nodes, whatever."}, {"time": 6417, "text": "Well, so we've done simulations and shown that biological, and now we're doing this in the lab, the biological networks like that have associative memory."}, {"time": 6423, "text": "So they can actually learn, they can learn from experience."}, {"time": 6428, "text": "They have habituation, they have sensitization, they have associative memory, which you wouldn't have known if you assume that they have to be on the left side of that spectrum."}, {"time": 6458, "text": "You have to start and you'll find out."}, {"time": 6462, "text": "So when you're going to, so here's a simple, I mean, here's one way to communicate with something."}, {"time": 6467, "text": "If you can train it, that's a way of communicating."}, {"time": 6467, "text": "So if you can provide, if you can figure out what the currency of reward of positive and negative reinforcement is, right, and you can get it to do something it wasn't doing before based on experiences you've given, you have taught it one thing."}, {"time": 6481, "text": "You have communicated one thing, that such and such an action is good, some other action is not good."}, {"time": 6486, "text": "That's like a basic atom of a primitive atom of communication."}, {"time": 6491, "text": "What about in some sense, if it gets you to do something you haven't done before, is it answering back?"}, {"time": 6499, "text": "Yeah, most certainly."}, {"time": 6499, "text": "And there's, I've seen cartoons, I think maybe Gary Larson or somebody had had a cartoon of these rats in the maze and the one rat, you know, assist to the other."}, {"time": 6509, "text": "You look at this every time, every time I walk over here, he starts scribbling in that on the, you know, on the clipboard that he has, it's awesome."}, {"time": 6512, "text": "If we step outside ourselves and really measure how much, like if I actually measure how much I've changed because of my interaction with certain cellular automata."}, {"time": 6526, "text": "I mean, you really have to take that into consideration about like, well, these things are changing you too."}, {"time": 6532, "text": "I know, you know how it works and so on, but you're being changed by the thing."}, {"time": 6538, "text": "I think I read, I don't know any details, but I think I read something about how wheat and other things have domesticated humans in terms of, right, but by their properties change the way that the human behavior and societal structures."}, {"time": 6553, "text": "In that sense, cats are running the world because they've took over the, so first off, so first they, while not giving a shit about humans, clearly with every ounce of their being, they've somehow got just millions and millions of humans to take them home and feed them."}, {"time": 6575, "text": "And then not only the physical space did they take over, they took over the digital space."}, {"time": 6583, "text": "They dominate the internet in terms of cuteness, in terms of memeability."}, {"time": 6588, "text": "And so they're like, they got themselves literally inside the memes, they become viral and spread on the internet."}, {"time": 6595, "text": "And they're the ones that are probably controlling humans."}, {"time": 6601, "text": "That's my theory."}, {"time": 6601, "text": "Another, that's a follow up paper after the frog kissing."}, {"time": 6606, "text": "I mean, you mentioned sentience and consciousness."}, {"time": 6606, "text": "You have a paper titled Generalizing Frameworks for Sentience Beyond Natural Species."}, {"time": 6618, "text": "So beyond normal cognition, if we look at sentience and consciousness, and I wonder if you draw an interesting distinction between those two elsewhere, outside of humans, and maybe outside of Earth, you think aliens have sentience."}, {"time": 6634, "text": "And if they do, how do we think about it?"}, {"time": 6645, "text": "So when you have this framework, what is this paper?"}, {"time": 6645, "text": "What is the way you propose to think about sentience?"}, {"time": 6650, "text": "Yeah, that particular paper was a very short commentary on another paper that was written about crabs."}, {"time": 6657, "text": "It was a really good paper on them, crabs and various, like a rubric of different types of behaviors that could be applied to different creatures, and they're trying to apply it to crabs and so on."}, {"time": 6667, "text": "Consciousness, we can talk about if you want, but it's a whole separate kettle of fish."}, {"time": 6673, "text": "I almost never talk about crabs."}, {"time": 6678, "text": "In this case, yes."}, {"time": 6678, "text": "I almost never talk about consciousness, per se."}, {"time": 6678, "text": "I've said very, very little about it, but we can talk about it if you want."}, {"time": 6684, "text": "Mostly what I talk about is cognition, because I think that that's much easier to deal with in a kind of rigorous experimental way."}, {"time": 6696, "text": "I think that all of these terms have, you know, sentience and so on, have different definitions, and I fundamentally, I think that people can, as long as they specify what they mean ahead of time, I think people can define them in various ways."}, {"time": 6713, "text": "The only thing that I really think that I really kind of insist on is that the right way to think about all this stuff is from an engineering perspective."}, {"time": 6726, "text": "What does it help me to control, predict, and does it help me do my next experiment?"}, {"time": 6732, "text": "That's not a universal perspective."}, {"time": 6732, "text": "Some people have philosophical kind of underpinnings, and those are primary, and if anything runs against that, then it must automatically be wrong."}, {"time": 6745, "text": "Some people will say, I don't care what else."}, {"time": 6745, "text": "If your theory says to me that thermostats have little tiny goals, I'm not, so that's it."}, {"time": 6751, "text": "That's my philosophical preconception."}, {"time": 6758, "text": "Thermostats do not have goals, and that's it."}, {"time": 6758, "text": "That's one way of doing it, and some people do it that way."}, {"time": 6763, "text": "I do not do it that way, and I think that we can't, I don't think we can know much of anything from a philosophical armchair."}, {"time": 6767, "text": "I think that all of these theories and ways of doing things stand or fall based on just basically one set of criteria."}, {"time": 6777, "text": "Does it help you run a rich research program?"}, {"time": 6781, "text": "I agree with you totally, but forget philosophy."}, {"time": 6781, "text": "What about the poetry of ambiguity?"}, {"time": 6781, "text": "What about at the limits of the things you can engineer using terms that can be defined in multiple ways and living within that uncertainty in order to play with words until something lands that you can engineer?"}, {"time": 6802, "text": "I mean, that's to me where consciousness sits currently."}, {"time": 6802, "text": "Nobody really understands the heart problem of consciousness, the subject, what it feels like, because it really feels like, it feels like something to be this biological system."}, {"time": 6813, "text": "This conglomerate of a bunch of cells in this hierarchy of competencies feels like something, and yeah, I feel like one thing, and is that just a side effect of a complex system, or is there something more that humans have, or is there something more that any biological system has?"}, {"time": 6838, "text": "Some kind of magic, some kind of, not just a sense of agency, but a real sense with a capital letter S of agency."}, {"time": 6852, "text": "Ah, boy, yeah, that's a deep question."}, {"time": 6853, "text": "Is there room for poetry in engineering or no?"}, {"time": 6856, "text": "No, there definitely is, and a lot of the poetry comes in when we realize that none of the categories we deal with are sharp as we think they are, right?"}, {"time": 6862, "text": "And so in the different areas of all these spectra are where a lot of the poetry sits, I have many new theories about things, but I, in fact, do not have a good theory about consciousness that I plan to trot out."}, {"time": 6878, "text": "And you almost don't see it as useful for your current work to think about consciousness?"}, {"time": 6882, "text": "I think it will come."}, {"time": 6882, "text": "I have some thoughts about it, but I don't feel like they're going to move the needle yet on that."}, {"time": 6887, "text": "And you want to ground it in engineering always."}, {"time": 6890, "text": "So, well, I mean, so if we really tackle consciousness per se, in the terms of the hard problem, that isn't necessarily going to be groundable in engineering, right?"}, {"time": 6898, "text": "That aspect of cognition is, but actual consciousness per se, first person perspective, I'm not sure that that's groundable in engineering."}, {"time": 6910, "text": "And I think specifically what's different about it is there's a couple of things."}, {"time": 6916, "text": "So let's, you know, here we go."}, {"time": 6916, "text": "I'll say a couple of things about consciousness."}, {"time": 6920, "text": "One thing is that what makes it different is that for every other thing, other aspect of science, when we think about having a correct or a good theory of it, we have some idea of what format that theory makes predictions in."}, {"time": 6935, "text": "So whether those be numbers or whatever, we have some idea."}, {"time": 6941, "text": "We may not know the answer, we may not have the theory, but we know that when we get the theory, here's what it's going to output, and then we'll know if it's right or wrong."}, {"time": 6949, "text": "For actual consciousness, not behavior, not neural correlates, but actual first person consciousness."}, {"time": 6954, "text": "If we had a correct theory of consciousness, or even a good one, what the hell would, what format would it make predictions in, right?"}, {"time": 6959, "text": "Because all the things that we know about basically boil down to observable behaviors."}, {"time": 6965, "text": "So the only thing I can think of when I think about that is, it'll be poetry, or it'll be something to, if I ask you, okay, you've got a great theory of consciousness, and here's this creature, maybe it's a natural one, maybe it's an engineered one, whatever."}, {"time": 6983, "text": "And I want you to tell me what your theory says about this being, what it's like to be this being."}, {"time": 6990, "text": "The only thing I can imagine you giving me is some piece of art, a poem or something, that once I've taken it in, I share, I now have a similar state as whatever."}, {"time": 7005, "text": "That's about as good as I can come up with."}, {"time": 7005, "text": "Well, it's possible that once you have a good understanding of consciousness, it would be mapped to some things that are more measurable."}, {"time": 7016, "text": "So for example, it's possible that a conscious being is one that's able to suffer."}, {"time": 7016, "text": "So you start to look at pain and suffering."}, {"time": 7027, "text": "You can start to connect it closer to things that you can measure that, in terms of how they reflect themselves in behavior and problem solving and creation and attainment of goals, for example, which I think suffering is one of the, you know, life is suffering."}, {"time": 7051, "text": "It's one of the big aspects of the human condition."}, {"time": 7051, "text": "And so if consciousness is somehow a, maybe at least a catalyst for suffering, you could start to get like echoes of it."}, {"time": 7060, "text": "You start to see like the actual effects of consciousness and behavior."}, {"time": 7068, "text": "That it's not just about subjective experience."}, {"time": 7072, "text": "It's like it's really deeply integrated in the problem solving decision making of a system, something like this."}, {"time": 7079, "text": "But also it's possible that we realize, this is not a philosophical statement."}, {"time": 7086, "text": "Philosophers can write their books."}, {"time": 7086, "text": "I welcome it."}, {"time": 7086, "text": "You know, I take the Turing test really seriously."}, {"time": 7093, "text": "I don't know why people really don't like it."}, {"time": 7093, "text": "When a robot convinces you that it's intelligent, I think that's a really incredible accomplishment."}, {"time": 7100, "text": "And there's some deep sense in which that is intelligence."}, {"time": 7106, "text": "If it looks like it's intelligent, it is intelligent."}, {"time": 7106, "text": "And I think there's some deep aspect of a system that appears to be conscious."}, {"time": 7112, "text": "In some deep sense, it is conscious."}, {"time": 7123, "text": "At least for me, we have to consider that possibility."}, {"time": 7123, "text": "And a system that appears to be conscious is an engineering challenge."}, {"time": 7131, "text": "Yeah, I don't disagree with any of that."}, {"time": 7138, "text": "I mean, especially intelligence, I think, is a publicly observable thing."}, {"time": 7138, "text": "Science fiction has dealt with this for a century or much more, maybe."}, {"time": 7146, "text": "This idea that when you are confronted with something that just doesn't meet any of your typical assumptions, so you can't look in the skull and say, oh, well, there's that frontal cortex, so then I guess we're good."}, {"time": 7157, "text": "So this thing lands on your front lawn, and the little door opens, and something trundles out, and it's shiny and aluminum looking, and it hands you this poem that it wrote while it was flying over, and how happy it is to meet you."}, {"time": 7175, "text": "What's going to be your criteria for whether you get to take it apart and see what makes it tick, or whether you have to be nice to it and whatever?"}, {"time": 7180, "text": "All the criteria that we have now and that people are using, and as you said, a lot of people are down on the Turing test and things like this, but what else have we got?"}, {"time": 7191, "text": "Because measuring the cortex size isn't going to cut it in the broader scheme of things."}, {"time": 7195, "text": "So I think it's a wide open problem."}, {"time": 7203, "text": "Our solution to the problem of other minds, it's very simplistic."}, {"time": 7203, "text": "We give each other credit for having minds just because we're sort of on an anatomical level, we're pretty similar, and so it's good enough."}, {"time": 7215, "text": "But how far is that going to go?"}, {"time": 7215, "text": "So I think that's really primitive."}, {"time": 7221, "text": "So yeah, I think it's a major unsolved problem."}, {"time": 7221, "text": "It's a really challenging direction of thought to the human race that you talked about, like embodied minds."}, {"time": 7228, "text": "If you start to think that other things other than humans have minds, that's really challenging."}, {"time": 7236, "text": "Because all men are created equal starts being like, all right, well, we should probably treat not just cows with respect, but like plants, and not just plants, but some kind of organized conglomerates of cells in a petri dish."}, {"time": 7262, "text": "In fact, some of the work we're doing, like you're doing and the whole community of science is doing with biology, people might be like, we were really mean to viruses."}, {"time": 7273, "text": "I mean, yeah, the thing is, you're right."}, {"time": 7273, "text": "And I certainly get phone calls about people complaining about frog skin and so on."}, {"time": 7280, "text": "But I think we have to separate the sort of deep philosophical aspects versus what actually happens."}, {"time": 7286, "text": "So what actually happens on Earth is that people with exactly the same anatomical structure kill each other on a daily basis."}, {"time": 7297, "text": "So I think it's clear that simply knowing that something else is equally or maybe more cognitive or conscious than you are is not a guarantee of kind behavior, that much we know of."}, {"time": 7311, "text": "And so then we look at a commercial farming of mammals and various other things."}, {"time": 7311, "text": "And so I think on a practical basis, long before we get to worrying about things like frog skin, we have to ask ourselves, why are we, what can we do about the way that we've been behaving towards creatures, which we know for a fact, because of our similarities are basically just like us."}, {"time": 7333, "text": "That's kind of a whole other social thing."}, {"time": 7333, "text": "But fundamentally, of course, you're absolutely right in that we are also, think about this, we are on this planet in some way, incredibly lucky."}, {"time": 7344, "text": "It's just dumb luck that we really only have one dumb animal."}, {"time": 7351, "text": "We only have one dominant species."}, {"time": 7351, "text": "It didn't have to work out that way."}, {"time": 7351, "text": "So you could easily imagine that there could be a planet somewhere with more than one equally or maybe near equally intelligent species."}, {"time": 7363, "text": "But they may not look anything like each other."}, {"time": 7363, "text": "So there may be multiple ecosystems where there are things of similar to human like intelligence."}, {"time": 7369, "text": "And then you'd have all kinds of issues about how do you relate to them when they're physically like you at all."}, {"time": 7379, "text": "But yet in terms of behavior and culture and whatever, it's pretty obvious that they've got as much on the ball as you have."}, {"time": 7384, "text": "Or maybe imagine that there was another group of beings that was on average 40 IQ points lower."}, {"time": 7390, "text": "We're pretty lucky in many ways."}, {"time": 7390, "text": "We don't really have, even though we still act badly in many ways."}, {"time": 7398, "text": "But the fact is, all humans are more or less in that same range, but didn't have to work out that way."}, {"time": 7404, "text": "Well, but I think that's part of the way life works on Earth, maybe human civilization works, is it seems like we want ourselves to be quite similar."}, {"time": 7418, "text": "And then within that, you know, where everybody's about the same relatively IQ, intelligence, problem solving capabilities, even physical characteristics."}, {"time": 7429, "text": "But then we'll find some aspect of that that's different."}, {"time": 7429, "text": "And that seems to be like, I mean, it's really dark to say, but that seems to be the, not even a bug, but like a feature of the early development of human civilization."}, {"time": 7447, "text": "You pick the other, your tribe versus the other tribe and you war, it's a kind of evolution in the space of memes, a space of ideas, I think, and you war with each other."}, {"time": 7462, "text": "So we're very good at finding the other, even when the characteristics are really the same."}, {"time": 7468, "text": "And that's, I don't know what that, I mean, I'm sure so many of these things echo in the biological world in some way."}, {"time": 7475, "text": "There's a fun experiment that I did."}, {"time": 7475, "text": "My son actually came up with this and we did a biology unit together."}, {"time": 7481, "text": "He's a homeschool."}, {"time": 7481, "text": "And so we did this a couple of years ago."}, {"time": 7486, "text": "We did this thing where, imagine you get this slime mold, right?"}, {"time": 7490, "text": "Fisarum polycephalum, and it grows on a Petri dish of agar and it sort of spreads out and it's a single cell protist, but it's like this giant thing."}, {"time": 7497, "text": "And so you put down a piece of oat and it wants to go get the oat and it sort of grows towards the oat."}, {"time": 7502, "text": "So what you do is you take a razor blade and you just separate the piece of the whole culture that's growing towards the oat."}, {"time": 7510, "text": "You just kind of separate it."}, {"time": 7510, "text": "And so now think about the interesting decision making calculus for that little piece."}, {"time": 7515, "text": "I can go get the oat and therefore I won't have to share those nutrients with this giant mass over there."}, {"time": 7520, "text": "So the nutrients per unit volume is going to be amazing."}, {"time": 7525, "text": "I should go eat the oat."}, {"time": 7525, "text": "But if I first rejoin, because Fisarum, once you cut it, has the ability to join back up."}, {"time": 7530, "text": "If I first rejoin, then that whole calculus becomes impossible because there is no more me anymore."}, {"time": 7536, "text": "There's just we and then we will go eat this thing, right?"}, {"time": 7536, "text": "So this interesting, you can imagine a kind of game theory where the number of agents isn't fixed and that it's not just cooperate or defect, but it's actually merge and whatever, right?"}, {"time": 7550, "text": "So that computation, how does it do that decision making?"}, {"time": 7554, "text": "And so empirically, what we found is that it tends to merge first."}, {"time": 7560, "text": "It tends to merge first and then the whole thing goes."}, {"time": 7560, "text": "But it's really interesting that that calculus, I mean, I'm not an expert in the economic game theory and all that, but maybe there's some sort of hyperbolic discounting or something."}, {"time": 7569, "text": "But maybe this idea that the actions you take not only change your payoff, but they change who or what you are, and that you could take an action after which you don't exist anymore, or you are radically changed, or you are merged with somebody else."}, {"time": 7587, "text": "As far as I know, that's a whole different thing."}, {"time": 7593, "text": "As far as I know, we're still missing a formalism for even knowing how to model any of that."}, {"time": 7599, "text": "Do you see evolution, by the way, as a process that applies here on Earth?"}, {"time": 7599, "text": "Where did evolution come from?"}, {"time": 7607, "text": "So this thing from the very origin of life that took us to today, what the heck is that?"}, {"time": 7639, "text": "Now you're off to the races."}, {"time": 7645, "text": "And so that can be, it's not just on Earth because it can be done in the computer, it can be done in chemical systems, it can be done in, you know, Lee Smolin says it works on cosmic scales."}, {"time": 7653, "text": "So I think that that kind of thing is incredibly pervasive and general."}, {"time": 7662, "text": "It's a general feature of life."}, {"time": 7662, "text": "It's interesting to think about, you know, the standard thought about this is that it's blind, right?"}, {"time": 7669, "text": "Meaning that the intelligence of the process is zero, it's stumbling around."}, {"time": 7675, "text": "And I think that back in the day, when the options were it's dumb like machines, or it's smart like humans, then of course, the scientists went in this direction, because nobody wanted creationism."}, {"time": 7687, "text": "They said, okay, it's got to be like completely blind."}, {"time": 7690, "text": "I'm not actually sure, right?"}, {"time": 7690, "text": "Because I think that everything is a continuum."}, {"time": 7695, "text": "And I think that it doesn't have to be smart with foresight like us, but it doesn't have to be completely blind either."}, {"time": 7700, "text": "I think there may be aspects of it."}, {"time": 7700, "text": "And in particular, this kind of multi scale competency might give it a little bit of look ahead maybe or a little bit of problem solving sort of baked in."}, {"time": 7710, "text": "But that's going to be completely different in different systems."}, {"time": 7716, "text": "I do think it's general."}, {"time": 7716, "text": "I don't think it's just on Earth."}, {"time": 7721, "text": "I think it's a very fundamental thing."}, {"time": 7724, "text": "And it does seem to have a kind of direction that it's taking us that's somehow perhaps is defined by the environment itself."}, {"time": 7730, "text": "It feels like we're headed towards something."}, {"time": 7730, "text": "Like, we're playing out a script that was just like a single cell defines the entire organism."}, {"time": 7743, "text": "It feels like from the origin of Earth itself, it's playing out a kind of script."}, {"time": 7743, "text": "You can't really go any other way."}, {"time": 7752, "text": "I mean, so this is very controversial, and I don't know the answer."}, {"time": 7752, "text": "But people have argued that this is called, you know, sort of rewinding the tape of life, right?"}, {"time": 7757, "text": "And some people have argued, I think, I think Conway Morris, maybe has argued that it is that there's a deep attractor, for example, to human to the human kind of structure and that and that if you were to rewind it again, you'd basically get more or less the same thing."}, {"time": 7774, "text": "And then other people have argued that, no, it's incredibly sensitive to frozen accidents."}, {"time": 7777, "text": "And then once certain stochastic decisions are made downstream, everything is going to be different."}, {"time": 7786, "text": "You know, we're very bad at predicting attractors in the space of complex systems, generally speaking, right?"}, {"time": 7792, "text": "So maybe, so maybe evolution on Earth has these deep attractors that no matter what has happened, it pretty much would likely to end up there or maybe not."}, {"time": 7803, "text": "What's a really difficult idea to imagine that if you ran Earth a million times, 500,000 times you would get Hitler?"}, {"time": 7810, "text": "Like, yeah, we don't like to think like that."}, {"time": 7810, "text": "We think like, because at least maybe in America, you'd like to think that individual decisions can change the world."}, {"time": 7823, "text": "And if individual decisions could change the world, then surely any perturbation could result in a totally different trajectory."}, {"time": 7830, "text": "But maybe there's a, in this competency hierarchy, it's a self correcting system."}, {"time": 7838, "text": "There's just ultimately, there's a bunch of chaos that ultimately is leading towards something like a super intelligent, artificial intelligence system that answers 42."}, {"time": 7847, "text": "I mean, there might be a kind of imperative for life that it's headed to."}, {"time": 7856, "text": "And we're too focused on our day to day life of getting coffee and snacks and having sex and getting a promotion at work, not to see the big imperative of life on Earth that is headed towards something."}, {"time": 7874, "text": "Yeah, maybe, maybe."}, {"time": 7874, "text": "I think one of the things that's important about Chimerica bioengineering technologies, all of those things are that we have to start developing a better science of predicting the cognitive goals of composite systems."}, {"time": 7889, "text": "So we're just not very good at it, right?"}, {"time": 7895, "text": "We don't know if I create a composite system, and this could be Internet of Things or swarm robotics or a cellular swarm or whatever."}, {"time": 7901, "text": "What is the emergent intelligence of this thing?"}, {"time": 7908, "text": "First of all, what level is it going to be at?"}, {"time": 7908, "text": "And if it has goal directed capacity, what are the goals going to be?"}, {"time": 7911, "text": "Like, we are just not very good at predicting that yet."}, {"time": 7916, "text": "And I think that it's an existential level need for us to be able to because we're building these things all the time, right?"}, {"time": 7926, "text": "We're building both physical structures like swarm robotics, and we're building social financial structures and so on, with very little ability to predict what sort of autonomous goals that system is going to have, of which we are now cogs."}, {"time": 7941, "text": "And so learning to predict and control those things is going to be critical."}, {"time": 7946, "text": "So in fact, if you're right and there is some kind of attractor to evolution, it would be nice to know what that is and then to make a rational decision of whether we're going to go along or we're going to pop out of it or try to pop out of it because there's no guarantee."}, {"time": 7959, "text": "I mean, that's the other kind of important thing."}, {"time": 7964, "text": "A lot of people, I get a lot of complaints from people who email me and say, you know, what you're doing, it isn't natural."}, {"time": 7969, "text": "And I'll say, look, natural, that'd be nice if somebody was making sure that natural was matched up to our values, but no one's doing that."}, {"time": 7976, "text": "Evolution optimizes for biomass."}, {"time": 7982, "text": "Nobody's optimizing."}, {"time": 7982, "text": "It's not optimizing for your happiness."}, {"time": 7987, "text": "I don't think necessarily it's optimizing for intelligence or fairness or any of that stuff."}, {"time": 7992, "text": "I'm going to find that person that emailed you, beat them up, take their place, steal everything they own and say, no, this is natural."}, {"time": 8002, "text": "Because it comes from an old worldview where you could assume that whatever is natural, that that's probably for the best."}, {"time": 8008, "text": "And I think we're long out of that garden of Eden kind of view."}, {"time": 8012, "text": "So I think we can do better."}, {"time": 8012, "text": "I think we, and we have to, right?"}, {"time": 8017, "text": "Natural just isn't great for a lot of life forms."}, {"time": 8022, "text": "What are some cool synthetic organisms that you think about, you dream about?"}, {"time": 8022, "text": "When you think about embodied mind, what do you imagine?"}, {"time": 8026, "text": "What do you hope to build?"}, {"time": 8031, "text": "Yeah, on a practical level, what I really hope to do is to gain enough of an understanding of the embodied intelligence of the organs and tissues such that we can achieve a radically different regenerative medicine so that we can say, basically, and I think about it as, you know, in terms of like, okay, can you, what's the goal kind of end game for this whole thing?"}, {"time": 8058, "text": "To me, the end game is something that you would call an anatomical compiler."}, {"time": 8062, "text": "So the idea is you would sit down in front of the computer and you would draw the body or the organ that you wanted."}, {"time": 8067, "text": "Not molecular details, but like, yeah, this is what I want."}, {"time": 8071, "text": "I want a six legged, you know, frog with a propeller on top, or I want a heart that looks like this, or I want a leg that looks like this."}, {"time": 8076, "text": "And what it would do if we knew what we were doing is put out, convert that anatomical description into a set of stimuli that would have to be given to cells to convince them to build exactly that thing, right?"}, {"time": 8087, "text": "I probably won't live to see it, but I think it's achievable."}, {"time": 8091, "text": "And I think with that, if we can have that, then that is basically the solution to all of medicine except for infectious disease."}, {"time": 8103, "text": "So birth defects, right?"}, {"time": 8103, "text": "Traumatic injury, cancer, aging, degenerative disease."}, {"time": 8103, "text": "If we knew how to tell cells what to build, all of those things go away."}, {"time": 8107, "text": "So those things go away."}, {"time": 8111, "text": "And the positive feedback spiral of economic costs, where all of the advances are increasingly more heroic and expensive interventions of a sinking ship when you're like 90 and so on, right?"}, {"time": 8122, "text": "All of that goes away because basically, instead of trying to fix you up as you degrade, you progressively regenerate, you apply the regenerative medicine early before things degrade."}, {"time": 8133, "text": "So I think that that'll have massive economic impacts over what we're trying to do now, which is not at all sustainable."}, {"time": 8138, "text": "And that's what I hope."}, {"time": 8143, "text": "I hope that we get it."}, {"time": 8143, "text": "So to me, yes, the xenobots will be doing useful things, cleaning up the environment, cleaning out your joints and all that kind of stuff."}, {"time": 8150, "text": "But more important than that, I think we can use these synthetic systems to try to develop a science of detecting and manipulating the goals of collective intelligences of cells specifically for regenerative medicine."}, {"time": 8170, "text": "And then sort of beyond that, if we think further beyond that, what I hope is that kind of like what you said, all of this drives a reconsideration of how we formulate ethical norms because this old school, so in the olden days, what you could do is if you were confronted with something, you could tap on it, right?"}, {"time": 8189, "text": "And if you heard a metallic clanging sound, you'd say, ah, fine, right?"}, {"time": 8193, "text": "So you could conclude it was made in a factory."}, {"time": 8193, "text": "I can take it apart."}, {"time": 8197, "text": "I can do whatever, right?"}, {"time": 8197, "text": "If you did that and you got sort of a squishy kind of warm sensation, you'd say, ah, I need to be more or less nice to it and whatever."}, {"time": 8200, "text": "That's not going to be feasible."}, {"time": 8206, "text": "It was never really feasible, but it was good enough because we didn't have any, we didn't know any better."}, {"time": 8209, "text": "That needs to go."}, {"time": 8209, "text": "And I think that by breaking down those artificial barriers, someday we can try to build a system of ethical norms that does not rely on these completely contingent facts of our earthly history, but on something much, much deeper that really takes agency and the capacity to suffer and all that takes that seriously."}, {"time": 8236, "text": "The capacity to suffer and the deep questions I would ask of a system is can I eat it and can I have sex with it?"}, {"time": 8241, "text": "Which is the two fundamental tests of, again, the human condition."}, {"time": 8241, "text": "So I can basically do what Dali does that's in the physical space."}, {"time": 8250, "text": "So print out like a 3D print Pepe the Frog with a propeller head, propeller hat is the dream."}, {"time": 8266, "text": "Well yes and no."}, {"time": 8266, "text": "I mean, I want to get away from the 3D printing thing because that will be available for some things much earlier."}, {"time": 8270, "text": "I mean, we can already do bladders and ears and things like that because it's micro level control, right?"}, {"time": 8275, "text": "When you 3D print, you are in charge of where every cell goes."}, {"time": 8279, "text": "And for some things that, you know, for, for like this thing, they had that I think 20 years ago or maybe earlier than that, you could do that."}, {"time": 8287, "text": "So yeah, I would like to emphasize the Dali part where you provide a few words and it generates a painting."}, {"time": 8291, "text": "So here you say, I want a frog with these features and then it would go direct a complex biological system to construct something like that."}, {"time": 8305, "text": "The main magic would be, I mean, I think from, from looking at Dali and so on, it looks like the first part is kind of solved now where you go from, from the words to the image, like that seems more or less solved."}, {"time": 8314, "text": "The next step is really hard."}, {"time": 8314, "text": "This is what keeps things like CRISPR and genomic editing and so on."}, {"time": 8319, "text": "That's what limits all the impacts for regenerative medicine because going back to, okay, this is the knee joint that I want, or this is the eye that I want."}, {"time": 8331, "text": "Now, what genes do I edit to make that happen, right?"}, {"time": 8331, "text": "Going back in that direction is really hard."}, {"time": 8336, "text": "So instead of that, it's going to be, okay, I understand how to motivate cells to build particular structures."}, {"time": 8339, "text": "Can I rewrite the memory of what they think they're supposed to be building such that then I can, you know, take my hands off the wheel and let them, let them do their thing."}, {"time": 8349, "text": "So some of that is experiment, but some of that may be AI can help too."}, {"time": 8349, "text": "Just like with protein folding, this is exactly the problem that protein folding in the most simple medium tried and has solved with alpha fold, which is how does the sequence of letters result in this three dimensional shape?"}, {"time": 8371, "text": "And you have to, I guess it didn't solve it because you have to, if you say, I want this shape, how do I then have a sequence of letters?"}, {"time": 8383, "text": "The reverse engineering step is really tricky."}, {"time": 8385, "text": "I think, I think we're, we're, and we're doing some of this now is, is to use AI to try and build actionable models of the intelligence of the cellular collectives."}, {"time": 8397, "text": "So try to help us and help us gain models that, that, that, and, and we've had some success in this."}, {"time": 8402, "text": "So we, we did something like this for, for, you know, for repairing birth defects of the brain in frog."}, {"time": 8408, "text": "We've done some of this for normalizing melanoma where you can really start to use AI to make models of how would I impact this thing if I wanted to given all the complexities, right."}, {"time": 8420, "text": "And, and, and given all the, the, the, the controls that it, that it knows how to do."}, {"time": 8427, "text": "So when you say regenerative medicine, so we talked about creating biological organisms, but if you regrow a hand, that information is already there, right?"}, {"time": 8434, "text": "The biological system has that information."}, {"time": 8441, "text": "So how does regenerative medicine work today?"}, {"time": 8441, "text": "How do you hope it works?"}, {"time": 8448, "text": "What's the hope there?"}, {"time": 8450, "text": "How do you make it happen?"}, {"time": 8452, "text": "Well today there's a set of popular approaches."}, {"time": 8452, "text": "So, so one is 3d printing."}, {"time": 8452, "text": "So the idea is I'm going to make a scaffold of the thing that I want."}, {"time": 8457, "text": "I'm going to seed it with cells and then, and then there it is, right?"}, {"time": 8460, "text": "So kind of direct, and then that works for certain things."}, {"time": 8463, "text": "You can make a bladder that way or an ear, something like that."}, {"time": 8463, "text": "The other, the other ideas is some sort of stem cell transplant."}, {"time": 8468, "text": "These are the ideas."}, {"time": 8468, "text": "If we, if we put in stem cells with appropriate factors, we can get them to generate certain kinds of neurons for certain diseases and so on."}, {"time": 8477, "text": "All of those things are good for relatively simple structures, but when you want an eye or a hand or something else, I think in this maybe an unpopular opinion, I think the only hope we have in any reasonable kind of timeframe is to understand how the thing was motivated to get made in the first place."}, {"time": 8496, "text": "So what is it that, that made those cells in the, in the beginning, create a particular arm with a particular set of sizes and shapes and number of fingers and all that."}, {"time": 8508, "text": "And why is it that a salamander can keep losing theirs and keep regrowing theirs and a planarian can do the same even more?"}, {"time": 8511, "text": "So to me, uh, kind of ultimate regenerate medicine was when you can tell the cells to build whatever it is you need them to build."}, {"time": 8522, "text": "And so the, so that we can all be like planaria basically, do you have to start at the very beginning or can you, um, do a shortcut?"}, {"time": 8527, "text": "Cause we're going to hand, you already got the whole organism."}, {"time": 8533, "text": "So here's what we've done, right?"}, {"time": 8533, "text": "So, we've, we've more or less solved that in frogs."}, {"time": 8539, "text": "So frogs, unlike salamanders do not regenerate their legs as adults."}, {"time": 8544, "text": "And so, so, uh, we've shown that with a very, um, uh, kind of simple intervention."}, {"time": 8551, "text": "So what we do is there's two things you need to, uh, you need to have a signal that tells the cells what to do, and then you need some way of delivering it."}, {"time": 8556, "text": "And so this is work together with, um, with David Kaplan and I should do a, um, a disclosure here."}, {"time": 8564, "text": "We have a company called morphosuticals and spin off where we're trying to, uh, to address, uh, uh, regenerate, you know, limb regeneration."}, {"time": 8568, "text": "So we've solved it in the frog and we're now in trials and mice."}, {"time": 8572, "text": "So now we're going to, we're in mammals now."}, {"time": 8572, "text": "It's, I can't say anything about how it's going, but the frog thing is solved."}, {"time": 8576, "text": "So what you do is, um, after you have a little frog, Lou Skywalker with every growing hand."}, {"time": 8579, "text": "Yeah, basically, basically."}, {"time": 8584, "text": "So what you do is we did, we did with legs instead of forearms."}, {"time": 8587, "text": "And what you do is, um, after amputation, normally they, they don't regenerate."}, {"time": 8587, "text": "You put on a wearable bioreactor."}, {"time": 8591, "text": "So it's this thing that, um, that goes on and, uh, Dave Kaplan does lab makes these things and inside it's a, it's a very controlled environment."}, {"time": 8601, "text": "It is a silk gel that carries, uh, some drugs, for example, ion channel drugs."}, {"time": 8601, "text": "And what you're doing is you're saying to the cells, you should regrow what normally goes here."}, {"time": 8606, "text": "So, uh, that whole thing is on for 24 hours and you take it off and you don't touch the leg."}, {"time": 8613, "text": "Again, this is really important because what we're not looking for is a set of micromanagement, uh, you know, printing or controlling the cells we want to trigger."}, {"time": 8621, "text": "We want to, we want to interact with it early on and then not touch it again because, because we don't know how to make a frog leg, but the frog knows how to make a frog leg."}, {"time": 8629, "text": "So 24 hours, 18 months of leg growth after that, without us touching it again."}, {"time": 8634, "text": "And after 18 months, you get a pretty good leg that kind of shows this proof of concept that early on when the cells right after injury, when they're first making a decision about what they're going to do, you can, you can impact them."}, {"time": 8645, "text": "And once they've decided to make a leg, they don't need you after that."}, {"time": 8649, "text": "They can do their own thing."}, {"time": 8649, "text": "So that's an approach that we're now taking."}, {"time": 8654, "text": "What about cancer suppression?"}, {"time": 8654, "text": "That's something you mentioned earlier."}, {"time": 8654, "text": "How can all of these ideas help with cancer suppression?"}, {"time": 8660, "text": "So let's, let's go back to the beginning and ask what, what, what, what cancer is."}, {"time": 8660, "text": "So I think, um, you know, asking why there's cancer is the wrong question."}, {"time": 8663, "text": "I think the right question is why is there ever anything but cancer?"}, {"time": 8668, "text": "So, so in the normal state, you have a bunch of cells that are all cooperating towards a large scale goal."}, {"time": 8673, "text": "If that process of cooperation breaks down and you've got a cell that is isolated from that electrical network that lets you remember what the big goal is, you revert back to your unicellular lifestyle as far as, now think about that border between self and world, right?"}, {"time": 8687, "text": "Normally when all these cells are connected by gap junctions into an electrical network, they are all one self, right?"}, {"time": 8696, "text": "That meaning that, um, their goals, they have these large tissue level goals and so on."}, {"time": 8701, "text": "As soon as a cell is disconnected from that, the self is tiny, right?"}, {"time": 8701, "text": "And so at that point, and so, so people, a lot of people model cancer cell cells as being more selfish and all that."}, {"time": 8711, "text": "They're not more selfish."}, {"time": 8711, "text": "They're equally selfish."}, {"time": 8711, "text": "It's just that their self is smaller."}, {"time": 8714, "text": "Normally the self is huge."}, {"time": 8714, "text": "Now they got tiny little selves."}, {"time": 8714, "text": "Now what are the goals of tiny little selves?"}, {"time": 8718, "text": "Well, proliferate, right?"}, {"time": 8718, "text": "And migrate to wherever life is good."}, {"time": 8722, "text": "And that's metastasis."}, {"time": 8722, "text": "That's proliferation and metastasis."}, {"time": 8722, "text": "So, so one thing we found and people have noticed years ago that when cells convert to cancer, the first thing they see is they close the gap junctions."}, {"time": 8731, "text": "And it's a lot like, I think it's a lot like that experiment with the slime mold where until you close that gap junction, you can't even entertain the idea of leaving the collective because there is no you at that point, right?"}, {"time": 8741, "text": "Your mind melded with this, with this whole other network."}, {"time": 8744, "text": "But as soon as the gap junction is closed, now the boundary between you and now, now the rest of the body is just outside environment to you."}, {"time": 8753, "text": "You're just a, you're just a unicellular organism and the rest of the body's environment."}, {"time": 8758, "text": "So, so we, so we studied this process and we worked out a way to artificially control the bioelectric state of these cells to physically force them to remain in that network."}, {"time": 8764, "text": "And so then, then what that, what that means is that nasty mutations like KRAS and things like that, these really tough oncogenic mutations that cause tumors."}, {"time": 8775, "text": "If you, if you do them and then, but then within artificially control of the bioelectrics, you greatly reduce tumor genesis or, or normalize cells that had already begun to convert."}, {"time": 8789, "text": "You basically, they go back to being normal cells."}, {"time": 8793, "text": "And so this is another, much like with the planaria, this is another way in which the bioelectric state kind of dominates what the, what the genetic state is."}, {"time": 8803, "text": "So if you sequence the, you know, if you sequence the nucleic acid, you'll see the KRAS mutation, you'll say, ah, well that's going to be a tumor, but there isn't a tumor because, because bioelectrically you've kept the cells connected and they're just working on making nice skin and kidneys and whatever else."}, {"time": 8814, "text": "So, so we've started moving that to, to, to human glioblastoma cells and we're hoping for, you know, a patient in the future interaction with patients."}, {"time": 8827, "text": "So is this one of the possible ways in which we may quote cure cancer?"}, {"time": 8832, "text": "I think, I think the actual cure, I mean, there are other technology, you know, immune therapy, I think is a great technology."}, {"time": 8837, "text": "Chemotherapy, I don't think is a good, is a good technology."}, {"time": 8841, "text": "I think we've got to get, get off of that."}, {"time": 8845, "text": "So chemotherapy just kills cells."}, {"time": 8847, "text": "Well, chemotherapy hopes to kill more of the tumor cells than of your cells."}, {"time": 8852, "text": "It's a fine balance."}, {"time": 8852, "text": "The problem is the cells are very similar because they are your cells."}, {"time": 8856, "text": "And so if you don't have a very tight way of distinguishing between them, then the toll that chemo takes on the rest of the body is just unbelievable."}, {"time": 8866, "text": "And immunotherapy tries to get the immune system to do some of the work."}, {"time": 8869, "text": "I think that's potentially a very good, a very good approach."}, {"time": 8869, "text": "If, if the immune system can be taught to recognize enough of, of the cancer cells, that that's a pretty good approach."}, {"time": 8879, "text": "But I, but I think, but I think our approach is in a way more fundamental because if you can, if you can keep the cells harnessed towards organ level goals as opposed to individual cell goals, then nobody will be making a tumor or metastasizing and so on."}, {"time": 8895, "text": "So we've been living through a pandemic."}, {"time": 8895, "text": "What do you think about viruses in this full beautiful biological context we've been talking about?"}, {"time": 8901, "text": "Are they beautiful to you?"}, {"time": 8901, "text": "Are they terrifying?"}, {"time": 8910, "text": "Also maybe let's say, are they, since we've been discriminating this whole conversation, are they living?"}, {"time": 8916, "text": "Are they embodied minds?"}, {"time": 8916, "text": "Embodied minds that are assholes?"}, {"time": 8923, "text": "As far as I know, and I haven't been able to find this paper again, but, but somewhere I saw in the last couple of months, there was some, there was some papers showing an example of a virus that actually had physiology."}, {"time": 8931, "text": "So there was some, something was going on, I think proton flux or something on the virus itself."}, {"time": 8935, "text": "But, but barring that, generally speaking, viruses are very passive."}, {"time": 8941, "text": "They don't do anything by themselves."}, {"time": 8941, "text": "And so I don't see any particular reason to attribute much of a mind to them."}, {"time": 8946, "text": "I think, you know, they represent a way to hijack other minds for sure, like, like cells and other things."}, {"time": 8958, "text": "But that's an interesting interplay though."}, {"time": 8958, "text": "If they're hijacking other minds, you know, the way we're, we were talking about living organisms that they can interact with each other and have it alter each other's trajectory by having interacted."}, {"time": 8968, "text": "I mean, that's, that's a deep, meaningful connection between a virus and a cell."}, {"time": 8976, "text": "And I think both are transformed by the experience."}, {"time": 8985, "text": "And so in that sense, both are living."}, {"time": 8989, "text": "You know, the whole category, I, this question of what's living and what's not living, I really, I'm not sure."}, {"time": 8996, "text": "And I know there's people that work on this and I don't want to piss anybody off, but, but I have not found that particularly useful as, as to try and make that a binary kind of a distinction."}, {"time": 9005, "text": "I think level of cognition is very interesting of, but as a, as a continuum, but, but living and nonliving, I, you know, I don't, I really know what to do with that."}, {"time": 9017, "text": "I don't, I don't know what you do next after, after making that distinction."}, {"time": 9021, "text": "That's why I make the very binary distinction."}, {"time": 9021, "text": "Can I have sex with it or not?"}, {"time": 9021, "text": "Can I eat it or not?"}, {"time": 9027, "text": "Those, cause there's, those are actionable, right?"}, {"time": 9030, "text": "Well, I think that's a critical point that you brought up because how you relate to something is really what this is all about, right?"}, {"time": 9034, "text": "As an engineer, how do I control it?"}, {"time": 9040, "text": "But maybe I shouldn't be controlling it."}, {"time": 9040, "text": "Maybe I should be, you know, can I have a relationship with it?"}, {"time": 9044, "text": "Should I be listening to its advice?"}, {"time": 9044, "text": "Like, like all the way from, you know, I need to take it apart all the way to, I better do what it says cause it seems to be pretty smart and everything in between, right?"}, {"time": 9052, "text": "That's really what we're asking about."}, {"time": 9056, "text": "We need to understand our relationship to it."}, {"time": 9056, "text": "We're searching for that relationship, even in the most trivial senses."}, {"time": 9061, "text": "You came up with a lot of interesting terms."}, {"time": 9061, "text": "We've mentioned some of them."}, {"time": 9068, "text": "Agential material."}, {"time": 9068, "text": "That's a really interesting one for the future of computation and artificial intelligence and computer science and all of that."}, {"time": 9079, "text": "There's also, let me go through some of them."}, {"time": 9079, "text": "If they spark some interesting thought for you, there's teleophobia, the unwarranted fear of erring on the side of too much agency when considering a new system."}, {"time": 9096, "text": "That's the opposite."}, {"time": 9096, "text": "I mean, being afraid of maybe anthropomorphizing the thing."}, {"time": 9101, "text": "This'll get some people ticked off, I think."}, {"time": 9101, "text": "But I don't think, I think the whole notion of anthropomorphizing is a holdover from a pre scientific age where humans were magic and everything else wasn't magic and you were anthropomorphizing when you dared suggest that something else has some features of humans."}, {"time": 9120, "text": "And I think we need to be way beyond that."}, {"time": 9125, "text": "And this issue of anthropomorphizing, I think it's a cheap charge."}, {"time": 9125, "text": "I don't think it holds any water at all other than when somebody makes a cognitive claim."}, {"time": 9132, "text": "I think all cognitive claims are engineering claims, really."}, {"time": 9138, "text": "So when somebody says this thing knows or this thing hopes or this thing wants or this thing predicts, all you can say is fabulous."}, {"time": 9142, "text": "Give me the engineering protocol that you've derived using that hypothesis and we will see if this thing helps us or not."}, {"time": 9153, "text": "And then, and then we can, you know, then we can make a rational decision."}, {"time": 9157, "text": "I also like anatomical compiler, a future system representing the longterm end game of the science of morphogenesis that reminds us how far away from true understanding we are."}, {"time": 9169, "text": "Someday you will be able to sit in front of an anatomical computer, specify the shape of the animal or a plant that you want, and it will convert that shape specification to a set of stimuli that will have to be given to cells to build exactly that shape."}, {"time": 9179, "text": "No matter how weird it ends up being, you have total control."}, {"time": 9185, "text": "Just imagine the possibility for memes in the physical space."}, {"time": 9192, "text": "One of the glorious accomplishments of human civilizations is memes in digital space."}, {"time": 9198, "text": "Now this could create memes in physical space."}, {"time": 9198, "text": "I am both excited and terrified by that possibility."}, {"time": 9205, "text": "Cognitive light cone, I think we also talked about the outer boundary in space and time of the largest goal a given system can work towards."}, {"time": 9211, "text": "Is this kind of like shaping the set of options?"}, {"time": 9222, "text": "It's a little different than options."}, {"time": 9222, "text": "It's really focused on..."}, {"time": 9222, "text": "I first came up with this back in 2018, I want to say."}, {"time": 9229, "text": "There was a conference, a Templeton conference where they challenged us to come up with frameworks."}, {"time": 9235, "text": "I think actually it's the diverse intelligence community."}, {"time": 9242, "text": "Summer Institute."}, {"time": 9243, "text": "Yeah, they had a Summer Institute."}, {"time": 9244, "text": "That's the logos, the bee with some circuits."}, {"time": 9246, "text": "Yeah, it's got different life forms."}, {"time": 9246, "text": "The whole program is called diverse intelligence."}, {"time": 9246, "text": "They challenged us to come up with a framework that was suitable for analyzing different kinds of intelligence together."}, {"time": 9258, "text": "Because the kinds of things you do to a human are not good with an octopus, not good with a plant and so on."}, {"time": 9263, "text": "I started thinking about this."}, {"time": 9269, "text": "I asked myself what do all cognitive agents, no matter what their provenance, no matter what their architecture is, what do cognitive agents have in common?"}, {"time": 9275, "text": "It seems to me that what they have in common is some degree of competency to pursue a goal."}, {"time": 9281, "text": "What you can do then is you can draw."}, {"time": 9286, "text": "What I ended up drawing was this thing that it's kind of like a backwards Minkowski cone diagram where all of space is collapsed into one axis and then here and then time is this axis."}, {"time": 9298, "text": "Then what you can do is you can draw for any creature, you can semi quantitatively estimate what are the spatial and temporal goals that it's capable of pursuing."}, {"time": 9313, "text": "For example, if you are a tick and all you really are able to pursue is maximum or a bacterium and maximizing the level of some chemical in your vicinity, that's all you've got, it's a tiny little icon, then you're a simple system like a tick or a bacterium."}, {"time": 9329, "text": "If you are something like a dog, well, you've got some ability to care about some spatial region, some temporal."}, {"time": 9337, "text": "You can remember a little bit backwards, you can predict a little bit forwards, but you're never ever going to care about what happens in the next town over four weeks from now."}, {"time": 9346, "text": "As far as we know, it's just impossible for that kind of architecture."}, {"time": 9351, "text": "If you're a human, you might be working towards world peace long after you're dead."}, {"time": 9351, "text": "You might have a planetary scale goal that's enormous."}, {"time": 9356, "text": "Then there may be other greater intelligences somewhere that can care in the linear range about numbers of creatures, some sort of Buddha like character that can care about everybody's welfare, really care the way that we can't."}, {"time": 9376, "text": "It's not a mapping of what you can sense, how far you can sense."}, {"time": 9376, "text": "It's not a mapping of how far you can act."}, {"time": 9380, "text": "It's a mapping of how big are the goals you are capable of envisioning and working towards."}, {"time": 9385, "text": "I think that enables you to put synthetic kinds of constructs, AIs, aliens, swarms, whatever on the same diagram because we're not talking about what you're made of or how you got here."}, {"time": 9400, "text": "We're talking about what are the size and complexity of the goals towards which you can work."}, {"time": 9406, "text": "Is there any other terms that pop into mind that are interesting?"}, {"time": 9410, "text": "I'm trying to remember."}, {"time": 9410, "text": "I have a list of them somewhere on my website."}, {"time": 9414, "text": "Human morphology, yeah, definitely check it out."}, {"time": 9414, "text": "Morphosutical, I like that one."}, {"time": 9414, "text": "Ionisutical."}, {"time": 9421, "text": "Those refer to different types of interventions in the regenerative medicine space."}, {"time": 9421, "text": "Amorphosutical is something that it's a kind of intervention that really targets the cells decision making process about what they're going to build."}, {"time": 9436, "text": "Ionisuticals are like that, but more focused specifically on the bioelectrics."}, {"time": 9440, "text": "There's also, of course, biochemical, biomechanical, who knows what else, maybe optical kinds of signaling systems there as well."}, {"time": 9449, "text": "Target morphology is interesting."}, {"time": 9449, "text": "It's designed to capture this idea that it's not just feedforward emergence and oftentimes in biology, I mean, of course that happens too, but in many cases in biology, the system is specifically working towards a target in anatomical morphospace."}, {"time": 9468, "text": "It's a navigation task really."}, {"time": 9468, "text": "These kinds of problem solving can be formalized as navigation tasks and that they're really going towards a particular region."}, {"time": 9477, "text": "Because you deviate them and then they go back."}, {"time": 9517, "text": "Boy, it's dangerous to give advice because things change so fast, but one central thing I can say, moving up and through academia and whatnot, you will be surrounded by really smart people."}, {"time": 9527, "text": "What you need to do is be very careful at distinguishing specific critique versus kind of meta advice."}, {"time": 9536, "text": "What I mean by that is if somebody really smart and successful and obviously competent is giving you specific critiques on what you've done, that's gold."}, {"time": 9551, "text": "It's an opportunity to hone your craft, to get better at what you're doing, to learn, to find your mistakes."}, {"time": 9557, "text": "If they are telling you what you ought to be studying, how you ought to approach things, what is the right way to think about things, you should probably ignore most of that."}, {"time": 9563, "text": "The reason I make that distinction is that a lot of really successful people are very well calibrated on their own ideas and their own field and their own area."}, {"time": 9576, "text": "They know exactly what works and what doesn't and what's good and what's bad, but they're not calibrated on your ideas."}, {"time": 9586, "text": "The things they will say, oh, this is a dumb idea, don't do this and you shouldn't do that, that stuff is generally worse than useless."}, {"time": 9593, "text": "It can be very demoralizing and really limiting."}, {"time": 9601, "text": "What I say to people is read very broadly, work really hard, know what you're talking about, take all specific criticism as an opportunity to improve what you're doing and then completely ignore everything else."}, {"time": 9614, "text": "I just tell you from my own experience, most of what I consider to be interesting and useful things that we've done, very smart people have said, this is a terrible idea, don't do that."}, {"time": 9626, "text": "I think we just don't know."}, {"time": 9632, "text": "We have no idea beyond our own."}, {"time": 9632, "text": "At best, we know what we ought to be doing."}, {"time": 9632, "text": "We very rarely know what anybody else should be doing."}, {"time": 9639, "text": "Yeah, and their ideas, their perspective has been also calibrated, not just on their field and specific situation, but also on a state of that field at a particular time in the past."}, {"time": 9651, "text": "There's not many people in this world that are able to achieve revolutionary success multiple times in their life."}, {"time": 9657, "text": "Whenever you say somebody very smart, usually what that means is somebody who's smart, who achieved a success at a certain point in their life and people often get stuck in that place where they found success."}, {"time": 9669, "text": "To be constantly challenging your worldview is a very difficult thing."}, {"time": 9674, "text": "Also at the same time, probably if a lot of people tell, that's the weird thing about life, if a lot of people tell you that something is stupid or is not going to work, that either means it's stupid, it's not going to work, or it's actually a great opportunity to do something new and you don't know which one it is and it's probably equally likely to be either."}, {"time": 9702, "text": "Well, I don't know, the probabilities."}, {"time": 9709, "text": "Depends how lucky you are, depends how brilliant you are, but you don't know and so you can't take that advice as actual data."}, {"time": 9715, "text": "Yeah, you have to and this is kind of hard to describe and fuzzy, but I'm a firm believer that you have to build up your own intuition."}, {"time": 9766, "text": "So you mentioned planaria being in some sense immortal."}, {"time": 9773, "text": "What's the role of death in this whole process we have?"}, {"time": 9773, "text": "Is it, when you look at biological systems, is death an important feature, especially as you climb up the hierarchy of competency?"}, {"time": 9788, "text": "Boy, that's an interesting question."}, {"time": 9788, "text": "I think that it's certainly a factor that promotes change and turnover and an opportunity to do something different the next time for a larger scale system."}, {"time": 9804, "text": "So apoptosis, it's really interesting."}, {"time": 9804, "text": "I mean, death is really interesting in a number of ways."}, {"time": 9809, "text": "One is like you could think about like what was the first thing to die?"}, {"time": 9813, "text": "What was the first creature that you could say actually died?"}, {"time": 9817, "text": "It's a tough thing because we don't have a great definition for it."}, {"time": 9817, "text": "So if you bring a cabbage home and you put it in your fridge, at what point are you going to say it's died, right?"}, {"time": 9828, "text": "So it's kind of hard to know."}, {"time": 9828, "text": "There's one paper in which I talk about this idea that, I mean, think about this and imagine that you have a creature that's aquatic, let's say it's a frog or something or a tadpole, and the animal dies, in the pond it dies for whatever reason."}, {"time": 9851, "text": "Most of the cells are still alive."}, {"time": 9851, "text": "So you could imagine that if when it died, there was some sort of breakdown of the connectivity between the cells, a bunch of cells crawled off, they could have a life as amoebas."}, {"time": 9863, "text": "Some of them could join together and become a xenobot and twiddle around, right?"}, {"time": 9868, "text": "So we know from planaria that there are cells that don't obey the Hayflick limit and just sort of live forever."}, {"time": 9873, "text": "So you could imagine an organism that when the organism dies, it doesn't disappear, rather the individual cells that are still alive, crawl off and have a completely different kind of lifestyle and maybe come back together as something else, or maybe they don't."}, {"time": 9886, "text": "So all of this, I'm sure, is happening somewhere on some planet."}, {"time": 9890, "text": "So death in any case, I mean, we already kind of knew this because the molecules, we know that when something dies, the molecules go through the ecosystem, but even the cells don't necessarily die at that point, they might have another life in a different way."}, {"time": 9905, "text": "You can think about something like HeLa, right?"}, {"time": 9909, "text": "The HeLa cell line, you know, that has this, that's had this incredible life."}, {"time": 9909, "text": "There are way more HeLa cells now than there ever been, than there, than there were when, when she was alive."}, {"time": 9919, "text": "It seems like as the organisms become more and more complex, like if you look at the mammals, their relationship with death becomes more and more complex."}, {"time": 9922, "text": "So the survival imperative starts becoming interesting and humans are arguably the first species that have invented the fear of death."}, {"time": 9937, "text": "The understanding that you're going to die, let's put it this way, like long, so not like instinctual, like, I need to run away from the thing that's going to eat me, but starting to contemplate the finiteness of life."}, {"time": 9953, "text": "I mean, one thing, so, so one thing about the human light, cognitive light cone is that for the first, as far as we know, for the first time, you might have goals that are longer than your lifespan, that are not achievable, right?"}, {"time": 9964, "text": "So if you're, if you are, let's say, and I don't know if this is true, but if you're a goldfish and you have a 10 minute attention span, I'm not sure if that's true, but let's say, let's say there's some organism with a, with a short kind of cognitive light cone that way, all of your goals are potentially achievable because you're probably going to live the next 10 minutes."}, {"time": 9980, "text": "So whatever goals you have, they are totally achievable."}, {"time": 9983, "text": "If you're a human, you could have all kinds of goals that are guaranteed not achievable because they just take too long, like guaranteed you're not going to achieve them."}, {"time": 9991, "text": "So I wonder if, you know, is that, is that a, you know, like a perennial, you know, sort of thorn in our, in our psychology that drives some, some psychosis or whatever?"}, {"time": 9999, "text": "I have, I have no idea."}, {"time": 9999, "text": "Another interesting thing about that, actually, I've been thinking about this a lot in the last couple of weeks, this notion of giving up."}, {"time": 10007, "text": "So you would think that evolutionarily, the most adaptive way of being is that you go, you, you, you, you fight as long as you physically can."}, {"time": 10018, "text": "And then when you can't, you can't, and there's in, there's this photograph, there's videos you can find of insects are crawling around where like, you know, like, like most of it is already gone, and it's still sort of crawling, you know, like, Terminator style, right?"}, {"time": 10030, "text": "Like, as far as as long as you physically can, you keep going."}, {"time": 10035, "text": "Mammals don't do that."}, {"time": 10035, "text": "So a lot of mammals, including rats, have this thing where when, when they think it's a hopeless situation, they literally give up and die when physically, they could have kept going."}, {"time": 10045, "text": "I mean, humans certainly do this."}, {"time": 10049, "text": "And there's, there's some like, really unpleasant experiments that the this guy forget his name did with drowning rats, where if he where where rats normally drown after a couple of minutes, but if you teach them that if you just tread water for a couple of minutes, you'll get rescued, they can tread water for like an hour."}, {"time": 10061, "text": "And so right, and so they literally just give up and die."}, {"time": 10065, "text": "And so evolutionarily, that doesn't seem like a good strategy at all evolutionarily, since why would you like, what's the benefit ever of giving up, you just do what you can, and you know, one time out of 1000, you'll actually get rescued, right?"}, {"time": 10077, "text": "But this issue of actually giving up suggests some very interesting metacognitive controls where you've now gotten to the point where survival actually isn't the top drive."}, {"time": 10083, "text": "And that for whatever, you know, there are other considerations that have like taken over."}, {"time": 10091, "text": "And I think that's uniquely a mammalian thing."}, {"time": 10091, "text": "But then I don't know."}, {"time": 10095, "text": "Yeah, the Camus, the existentialist question of why live, just the fact that humans commit suicide is a really fascinating question from an evolutionary perspective."}, {"time": 10107, "text": "And what was the first and that's the other thing, like, what is the simplest system, whether whether evolved or natural or whatever, that is able to do that?"}, {"time": 10113, "text": "Like, you can think, you know, what other animals are actually able to do that?"}, {"time": 10122, "text": "Maybe you could see animals over time, for some reason, lowering the value of survive at all costs, gradually, until other objectives might become more important."}, {"time": 10135, "text": "I don't know how evolutionarily how that how that gets off the ground."}, {"time": 10135, "text": "That just seems like that would have such a strong pressure against it, you know."}, {"time": 10139, "text": "Just imagine, you know, a population with a lower, you know, if you were a mutant in a population that had less of a less of a survival imperative, would you put your genes outperform the others?"}, {"time": 10159, "text": "Is there such a thing as population selection?"}, {"time": 10159, "text": "Because maybe suicide is a way for organisms to decide themselves that they're not fit for the environment?"}, {"time": 10166, "text": "Somehow?"}, {"time": 10171, "text": "Yeah, that's a that's a really contrary, you know, population level selection is a kind of a deep controversial area."}, {"time": 10176, "text": "But it's tough because on the face of it, if that was your genome, it wouldn't get propagated because you would die and then your neighbor who didn't have that would would have all the kids."}, {"time": 10189, "text": "It feels like there could be some deep truth there that we're not understanding."}, {"time": 10189, "text": "What about you yourself as one biological system?"}, {"time": 10199, "text": "To be honest, I'm more concerned with especially now getting older and having helped a couple of people pass."}, {"time": 10205, "text": "I think about what's a what's a good way to go?"}, {"time": 10205, "text": "Basically, like nowadays, I don't know what that is, I, you know, sitting in a, you know, a facility that sort of tries to stretch you out as long as you can, that doesn't seem that doesn't seem good."}, {"time": 10219, "text": "And there's not a lot of opportunities to sort of, I don't know, sacrifice yourself for something useful, right?"}, {"time": 10229, "text": "There's not terribly many opportunities for that in modern society."}, {"time": 10229, "text": "So I don't know, that's that's that's more of I'm not I'm not particularly worried about death itself."}, {"time": 10238, "text": "But I've seen it happen."}, {"time": 10238, "text": "And and it's not it's not pretty."}, {"time": 10238, "text": "And I don't know what what a better what a better alternative is."}, {"time": 10248, "text": "So the existential aspect of it does not worry you deeply?"}, {"time": 10248, "text": "The fact that this ride ends?"}, {"time": 10256, "text": "No, it began."}, {"time": 10256, "text": "I mean, the ride began, right?"}, {"time": 10256, "text": "So there was I don't know how many billions of years before that I wasn't around."}, {"time": 10264, "text": "But isn't the experience of life?"}, {"time": 10264, "text": "It's almost like feels like you're immortal."}, {"time": 10264, "text": "Because the way you make plans, the way you think about the future."}, {"time": 10270, "text": "I mean, if you if you look at your own personal rich experience, yes, you can understand, okay, eventually, I died as people I love that have died."}, {"time": 10282, "text": "So surely, I will die and it hurts and so on."}, {"time": 10282, "text": "But like, he sure doesn't."}, {"time": 10288, "text": "It's so easy to get lost in feeling like this is going to go on forever."}, {"time": 10294, "text": "Yeah, it's a little bit like the people who say they don't believe in free will, right?"}, {"time": 10297, "text": "I mean, you can say that but but when you go to a restaurant, you still have to pick a soup and stuff."}, {"time": 10301, "text": "So right, so so I don't know if I know I've actually seen that that happened at lunch with a with a well known philosopher and he didn't believe in free will and the other waitress came around and he was like, Well, let me see."}, {"time": 10309, "text": "I was like, What are you doing here?"}, {"time": 10313, "text": "You're gonna choose a sandwich, right?"}, {"time": 10313, "text": "So it's I think it's one of those things."}, {"time": 10318, "text": "I think you can know that, you know, you're not going to live forever."}, {"time": 10322, "text": "But you can't you can't."}, {"time": 10322, "text": "It's not practical to live that way unless you know, so you buy insurance and then you do some stuff like that."}, {"time": 10327, "text": "But but but mostly, you know, I think you just you just live as if as if as if you can make plans."}, {"time": 10337, "text": "We talked about all kinds of life."}, {"time": 10337, "text": "We talked about all kinds of embodied minds."}, {"time": 10342, "text": "What's the meaning of all the biological lives we've been talking about here on Earth?"}, {"time": 10353, "text": "I don't know that that's a that that's a well posed question other than the existential question you post before."}, {"time": 10360, "text": "Is that question hanging out with the question of what is consciousness and there at retreat somewhere?"}, {"time": 10367, "text": "Not sure because sipping pina coladas and because they're ambiguously defined."}, {"time": 10375, "text": "Maybe I'm not sure that any of these things really ride on the correctness of our scientific understanding."}, {"time": 10381, "text": "But I mean, just just for an example, right?"}, {"time": 10381, "text": "I've always found I've always found it weird that people get really worked up to find out realities about their their bodies, for example."}, {"time": 10396, "text": "You've seen them."}, {"time": 10396, "text": "Ex Machina."}, {"time": 10396, "text": "And so there's this great scene where he's cutting his hand to find out, you know, a piece full of cock."}, {"time": 10402, "text": "Now, to me, right?"}, {"time": 10406, "text": "If if I open up and I find out and I find a bunch of cogs, my conclusion is not, oh, crap, I must not have true cognition."}, {"time": 10411, "text": "My conclusion is, wow, cogs can have true cognition."}, {"time": 10417, "text": "So it seems to me, I guess I guess I'm with Descartes on this one, that whatever whatever the truth ends up being of of of how is what is consciousness, how it can be conscious?"}, {"time": 10428, "text": "None of that is going to alter my primary experience, which is this is what it is."}, {"time": 10433, "text": "And if and if a bunch of molecular networks can do it, fantastic."}, {"time": 10436, "text": "If it turns out that there's a there's a non corporeal, you know, so great."}, {"time": 10443, "text": "We can we'll study that, whatever."}, {"time": 10443, "text": "But but the fundamental existential aspect of it is, you know, if somebody if somebody told me today that, yeah, yeah, you were created yesterday and all your memories are, you know, sort of fake, you know, kind of like like like Boltzmann brains, right."}, {"time": 10458, "text": "And the human, you know, human skepticism, all that."}, {"time": 10458, "text": "OK. Well, so so but but here I am now."}, {"time": 10463, "text": "So so it's the experience."}, {"time": 10463, "text": "It's primal, so like that's the that's the thing that matters."}, {"time": 10471, "text": "So the the backstory doesn't matter."}, {"time": 10471, "text": "From a first person perspective, now from a third person, like scientifically, it's all very interesting."}, {"time": 10479, "text": "From a third person perspective, I could say, wow, that's that's amazing that that this happens and how does it happen and whatever."}, {"time": 10483, "text": "But from a first person perspective, I could care less."}, {"time": 10488, "text": "Like I just it's just what I've what I learned from any of these scientific facts is, OK, well, I guess then that's that that then I guess that's what is sufficient to to give me my, you know, amazing first person perspective."}, {"time": 10497, "text": "I think if you dig deeper and deeper and get a get surprising answers to why the hell we're here, it might give you some guidance on how to live."}, {"time": 10510, "text": "That would be nice."}, {"time": 10510, "text": "On the one hand, you might be right, because on the one hand, if I don't know what else could possibly give you that guidance."}, {"time": 10523, "text": "So so you would think that it would have to be that or you would do it would have to be science because there isn't anything else."}, {"time": 10526, "text": "So so that's so maybe on the other hand, I am really not sure how you go from any, you know, what they call from an is to an odd right from any factual description of what's going on."}, {"time": 10536, "text": "This goes back to the natural."}, {"time": 10541, "text": "Just because somebody says, oh, man, that's that's completely not natural."}]}]