[{"title": "Tim Dillon: Comedy, Power, Conspiracy Theories, and Freedom | Lex Fridman Podcast #156", "id": "8wYZjOzfTUk", "quotes": [{"time": 264, "text": "In the same way that anger, your tombstone would arouse will last longer."}, {"time": 270, "text": "And that's deeply like a human thing."}, {"time": 273, "text": "Like why do we attach happiness to the way we should remember others?"}, {"time": 278, "text": "It could be just anger."}, {"time": 280, "text": "I know so many people who will have deeply complicated feelings when..."}, {"time": 285, "text": "I did drugs for many years and I spent time with some wild people."}, {"time": 290, "text": "And their parents were also wild people."}, {"time": 293, "text": "And some of their parents have done crazy things to them."}, {"time": 298, "text": "And have created situations that were not productive for child rearing."}, {"time": 306, "text": "And so I know that when those people die, it's going to be a very mixed bag."}, {"time": 311, "text": "Like there's going to be a lot of complex emotions."}, {"time": 313, "text": "Like, hey, we loved that guy."}, {"time": 316, "text": "But also when we look back, he was a horrible father, a horrible husband, but he was fun."}, {"time": 325, "text": "And we don't put enough stock in that, but that will be a push and pull."}, {"time": 329, "text": "And I'll be the one kind of bringing up like, hey, he was a lot of fun."}, {"time": 333, "text": "He was a lot."}, {"time": 333, "text": "Remember when he stuck us, one of the things this particular person I'm talking about, we were at a bar and me and my friend were there, we're having dinner."}, {"time": 342, "text": "And his father, who was an alcoholic, a guy that would go out every night and didn't work, refused to work, would lie and say he was going to work and then go to a bar."}, {"time": 353, "text": "I mean, just a fun person."}, {"time": 355, "text": "And we were sitting at this bar restaurant and the bartender, we see his father walk up to the bartender and say, point at us, point at our table and go and put the thumbs up."}, {"time": 367, "text": "And the bartender nodded."}, {"time": 368, "text": "And then the father walked over to our table and he said, listen, I just want to let you know I just bought you dinner."}, {"time": 374, "text": "And I looked at his son and I said, he's a pretty good guy."}, {"time": 377, "text": "And then he climbed over the little fence down to the water and got in his little boat."}, {"time": 381, "text": "It was a little cigarette boat and he just drove away."}, {"time": 383, "text": "And then about an hour later, we went and we said, I think that guy took care of the bill."}, {"time": 388, "text": "But she said, well, go talk to the bartender."}, {"time": 390, "text": "So we talked to the bartender and he goes, he handed us a bill and the bill was for like $1,000."}, {"time": 396, "text": "And we said, wait a minute, what the hell's going on?"}, {"time": 398, "text": "And he goes, the guy that left an hour ago said, you were going to take care of his bill."}, {"time": 402, "text": "He's been drinking here all week."}, {"time": 404, "text": "And we go, what are you talking about?"}, {"time": 406, "text": "And he goes, remember, he pointed at you."}, {"time": 407, "text": "He put the thumbs up and you guys waved."}, {"time": 410, "text": "You remember that?"}, {"time": 412, "text": "And the guy go, and we went, yeah."}, {"time": 413, "text": "And I just looked at my friends, my friend and I went, you know, your dad is just, we're going to remember him for all kinds of reasons."}, {"time": 420, "text": "But to you, he was fun."}, {"time": 421, "text": "He was a lot of fun."}, {"time": 422, "text": "He wasn't my dad, but I spent a lot of time with him."}, {"time": 424, "text": "I was in two boating accidents with him."}, {"time": 427, "text": "You know, two boating accidents."}, {"time": 428, "text": "Alcohol involved, drugs involved."}, {"time": 430, "text": "Yes, he was, usually alcohol was involved when he left his house and when he was at home as well."}, {"time": 435, "text": "But I was in two boating accidents."}, {"time": 437, "text": "And do you know how fun someone has to be to get in a second boating accident?"}, {"time": 442, "text": "Do you know what a good time someone has to be to get in a boat with them after you've already gotten in one wreck?"}, {"time": 450, "text": "Never get fooled again."}, {"time": 451, "text": "What was that line?"}, {"time": 452, "text": "George Bush, never get fooled again."}, {"time": 455, "text": "Yeah, so if you're getting fooled again, you know, there's a reason for it, but he was a fun guy."}, {"time": 459, "text": "He did have a death wish."}, {"time": 460, "text": "The second boating accident, he grabbed me and said, you can't hang out with me anymore."}, {"time": 463, "text": "And I said, why?"}, {"time": 464, "text": "He goes, I'm trying to kill myself."}, {"time": 465, "text": "And I was like, oh."}, {"time": 467, "text": "And then I understood that like all of the fun under the fun lived a very destructive person who not only was destructive, but wanted to die."}, {"time": 477, "text": "So speaking of fun people that want to die, I don't know if you're, we can go Hunter S. Thompson, but Charles Bukowski."}, {"time": 485, "text": "I don't know if you're aware of the guy."}, {"time": 486, "text": "I'm aware of him, sure."}, {"time": 487, "text": "I've read some of his stuff."}, {"time": 488, "text": "So his tombstone says, I just want to ask you a question about it."}, {"time": 492, "text": "His tombstone says, don't try."}, {"time": 496, "text": "What do you think about that advice as a way to approach life?"}, {"time": 499, "text": "I think for many people, it's a good advice because the people that are going to try will do anyway."}, {"time": 506, "text": "And the people that need to be told, there's a whole cottage industry now of motivational speakers and life coaches and gurus that tell people that they all have to own their own business and be their own boss and be a disruptor and get into industries."}, {"time": 525, "text": "That's incredibly unrealistic for most people."}, {"time": 527, "text": "Most people are not suited for that."}, {"time": 530, "text": "And the Gary Vees of the world that tell everybody that they should just hustle and grind and hustle and grind."}, {"time": 534, "text": "They're very light on the specifics of what they should actually do."}, {"time": 538, "text": "Yeah, I think a lot of people, that's not horrible advice to give to a lot of people."}, {"time": 542, "text": "I think my generation got horrible advice from our parents, from our teachers."}, {"time": 547, "text": "And that advice was follow your dreams and nobody, and that was it, by the way."}, {"time": 552, "text": "There was no like, what are your dreams?"}, {"time": 554, "text": "Are they realistic?"}, {"time": 555, "text": "What happens when they don't work out?"}, {"time": 557, "text": "Will your dreams make you happy?"}, {"time": 558, "text": "Are your dreams real?"}, {"time": 560, "text": "Do they exist on earth?"}, {"time": 562, "text": "Can you follow, anybody follow your dreams?"}, {"time": 565, "text": "You can be anything you want to be."}, {"time": 566, "text": "Horrible advice, horrible advice."}, {"time": 569, "text": "Worst advice you could ever give a generation of people."}, {"time": 575, "text": "If you were talking to somebody and you were trying to make them succeed, are there any two worse pieces of advice to give them than follow your dreams and you can be anything you want to be?"}, {"time": 588, "text": "Those to me are the two most destructive pieces of information I've ever heard."}, {"time": 593, "text": "So let me push back because."}, {"time": 594, "text": "Okay, that's fair."}, {"time": 595, "text": "This is."}, {"time": 595, "text": "Many people do."}, {"time": 597, "text": "So yeah, this is like a rigorous journalistic interview."}, {"time": 601, "text": "Larry King, by the way, passed away today."}, {"time": 604, "text": "So I'm taking over the."}, {"time": 605, "text": "It's very sad."}, {"time": 606, "text": "I'm carrying the."}, {"time": 608, "text": "RIP King."}, {"time": 609, "text": "Yeah, what was I even gonna say?"}, {"time": 611, "text": "Oh, let me push back on the follow your dream thing is I come from an immigrant family where I was always working extremely hard at stuff, like in a stupid way."}, {"time": 624, "text": "I would, I love, there's something about me that loves hitting my head against the wall over and over and over until either my head breaks or the wall breaks."}, {"time": 632, "text": "Just like, I love that dedication for no purpose whatsoever."}, {"time": 636, "text": "It's like the mouse that's stuck in a cage or whatever."}, {"time": 639, "text": "And no, and everybody always told me, my family, the people around me, the sort of the epitome of what I could achieve is to be kind of a stable job."}, {"time": 652, "text": "You know, the old like lawyer doctor, in my case, it's like scientists and so on."}, {"time": 657, "text": "But I had these dreams at this fire, you know, about love robots."}, {"time": 663, "text": "And that nobody ever gave me permission to pursue those dreams."}, {"time": 668, "text": "I know you're supposed to grab it yourself."}, {"time": 670, "text": "Nobody's supposed to give you permission, but there's something about just people saying, you know, fuck what everyone else thinks, like giving you permission, a parent or somebody like that saying, do your own thing."}, {"time": 683, "text": "Go become an actor, go become like, do the crazy thing you're not supposed to do, an artist, go build a company, quit school, all that kind of stuff."}, {"time": 693, "text": "That's the push back against the, follow your dreams as bad advice."}, {"time": 698, "text": "In mass, if you were to look at, in mass, if you were to look at statistically how few people that works out for, I'm just, no, but let's be very honest."}, {"time": 707, "text": "Be very honest."}, {"time": 708, "text": "So I mean like, yeah, if you're gonna go be an, hey, I was broke for 10 years before I became a, before I was making money as a comedian."}, {"time": 715, "text": "I didn't need Gary Vaynerchuk to tell me to follow my thing, right?"}, {"time": 719, "text": "And here's the other thing."}, {"time": 720, "text": "I was kind of funny and like, I was kind of, a lot of things were in my favor of being a comedian, right?"}, {"time": 727, "text": "I had this kind of crazy fucked up life."}, {"time": 729, "text": "I had a lot of stories."}, {"time": 730, "text": "I had exhausted, I was willing to fail."}, {"time": 732, "text": "I had failed before."}, {"time": 734, "text": "I was broke."}, {"time": 735, "text": "I didn't care about being broke."}, {"time": 736, "text": "I knew how to be broke."}, {"time": 738, "text": "I had, I was shameless to a degree."}, {"time": 741, "text": "I was, I would get on a stage night after night and be laughed at."}, {"time": 744, "text": "I would, I had a high threshold for being embarrassed."}, {"time": 748, "text": "I had a high threshold for people thinking that I was a scumbag, right?"}, {"time": 751, "text": "And showing up at family parties and being like, yeah, I still really don't have a job."}, {"time": 755, "text": "And I'm just, I work at comedy clubs kind of, and I get booked when I can."}, {"time": 761, "text": "And I was, you know, suited for it."}, {"time": 764, "text": "There's this idea that people can just roam around the world injecting themselves into other things they have no aptitude for at all."}, {"time": 776, "text": "And will that to happen?"}, {"time": 778, "text": "A small percentage of people might be able to do that, but the vast majority of people have something they might key into that they're meant to do."}, {"time": 786, "text": "Like you loved robots, you love technology, and you found a place in that world where you thrive."}, {"time": 792, "text": "But I think many people, a lot of people love robots, right?"}, {"time": 796, "text": "So a lot of people think everything you do is interesting."}, {"time": 798, "text": "I think your shit is fascinating."}, {"time": 800, "text": "I watch you or podcasts, and I think it's very interesting."}, {"time": 803, "text": "I have no place in your world."}, {"time": 807, "text": "I have no place in that world."}, {"time": 809, "text": "I don't like remedial math."}, {"time": 812, "text": "I don't like community college math."}, {"time": 815, "text": "I think it's a waste of my time."}, {"time": 817, "text": "What do you think about robot?"}, {"time": 818, "text": "Would you ever buy a robot for your home?"}, {"time": 821, "text": "What will it do?"}, {"time": 823, "text": "I'd be a companion, a friend."}, {"time": 824, "text": "Oh yeah, I mean, I would like to start replacing friends and family with robots immediately."}, {"time": 829, "text": "I mean, truly, truly."}, {"time": 831, "text": "I mean, I'm not even kidding."}, {"time": 832, "text": "Like I would like to have a Thanksgiving with four robots."}, {"time": 837, "text": "I'm dead serious."}, {"time": 838, "text": "Are they into QAnon?"}, {"time": 840, "text": "Like are the robots, when do the robots start going crazy?"}, {"time": 845, "text": "That's my question is like, how long do the robots live with me before they are also a problem and I got to replace them?"}, {"time": 853, "text": "You're gonna indoctrinate the robot."}, {"time": 855, "text": "The robot's gonna call me like my aunt does and talk about coronavirus for an hour every morning and tell me everyone in America who's died of coronavirus."}, {"time": 862, "text": "One of the things I enjoy in life is how terrified people like you, I'm a huge fan by the way, get a robot."}, {"time": 872, "text": "Well, I'm concerned about AI completely getting rid of the need for human beings because human beings, I mean, usually you go out in the street and you go, so few of these people are necessary, even now."}, {"time": 886, "text": "Even now you look at people and you go, they're hanging on by a thread, right?"}, {"time": 891, "text": "And you can just imagine how many jobs are gonna get replaced, how many industries are going to be completely remade with AI and the pace of change worries me a little bit because we do a very bad job in this country of mitigation when we have problems."}, {"time": 907, "text": "We don't do a great job."}, {"time": 908, "text": "We did not great job with COVID, right?"}, {"time": 911, "text": "We don't do a good job."}, {"time": 912, "text": "It's just something we don't do well."}, {"time": 913, "text": "We're good in booms and busts."}, {"time": 915, "text": "We're good when it's good."}, {"time": 917, "text": "And we're actually, we kind of know how to kind of like, hey, we're bottomed out."}, {"time": 920, "text": "We're like a gambling addict in this country."}, {"time": 922, "text": "We like, we know what it feels like to be outside of an OTB at 9 a.m. drinking coffee and smoking cigarettes going, I'm gonna build it back."}, {"time": 929, "text": "And we know what it's like to win, but anything in between, it seems not that great."}, {"time": 935, "text": "So to me, it feels like are we gonna be able to like help people that are displaced and that have their jobs taken by, I mean, do you not fear sort of a world where you have a lot of artificial intelligence replacing workers and then what happens?"}, {"time": 953, "text": "There's a lot of fears around artificial intelligence."}, {"time": 956, "text": "One of them is, yes, displacement of jobs, workers."}, {"time": 959, "text": "That's technology in general."}, {"time": 961, "text": "That's just any kind of new innovations displace jobs."}, {"time": 966, "text": "I'm less worried about that."}, {"time": 969, "text": "I'm more worried about other impacts of artificial intelligence."}, {"time": 971, "text": "For example, the nature of our discourse, like social, the effects of algorithms on the way we communicate with each other, the spread of information, what that information looks like, the creation of silos, all that kind of stuff."}, {"time": 983, "text": "I think that would just make worse the effects that the displacement of jobs has."}, {"time": 992, "text": "I think ultimately, I have a hope that technology creates more opportunities than it destroys."}, {"time": 997, "text": "I hope so too."}, {"time": 998, "text": "So in that sense, AI to me is an exciting possibility, but the challenges this world presents will create divisions, will create chaos and so on."}, {"time": 1012, "text": "So I'm more focused on the way we deal as a society with that chaos, the way we talk to each other."}, {"time": 1018, "text": "Creating the platform that's healthy for that."}, {"time": 1020, "text": "Now, as a comedian creator, whatever you want to call it, people that put out content, the gatekeepers are now algorithmic, right?"}, {"time": 1030, "text": "So they are kind of almost AI ready."}, {"time": 1032, "text": "So if you are a person that puts out YouTube videos, podcasts, whatever you're doing, it used to be a guy in the back of the room with a cigar saying, I like you or get him out of here."}, {"time": 1047, "text": "Now, it's an algorithm you barely understand."}, {"time": 1050, "text": "I've talked to people at YouTube, but I don't know if they understand the algorithm."}, {"time": 1056, "text": "This is fascinating."}, {"time": 1058, "text": "Because I speak to people at YouTube and I go, hey, man, what's going on here?"}, {"time": 1061, "text": "One of my episode titles of my podcast was called Knife Fight in Malibu."}, {"time": 1065, "text": "It was about real estate."}, {"time": 1067, "text": "And it was because a realtor in Malibu, I was trying to get a summer rental, which I can't really afford, but I don't think that's a huge problem."}, {"time": 1075, "text": "I follow my dreams."}, {"time": 1076, "text": "So I called a realtor and she said, listen, she goes, I don't know what the government's saying, but she goes, it's a real knife fight out here."}, {"time": 1083, "text": "You know, an old grizzled woman, real realtor, tanned skin, sig out the mouth, driving a Porsche."}, {"time": 1088, "text": "It's a real knife fight out here."}, {"time": 1090, "text": "Her entire life had become real estate."}, {"time": 1092, "text": "Her soul had been hollowed out."}, {"time": 1094, "text": "Her kids hate her."}, {"time": 1095, "text": "No one's made her come in years, but she just loves heated kitchen floors infused."}, {"time": 1100, "text": "She's a demon from hell and we need them, truly."}, {"time": 1103, "text": "We're getting rid of them."}, {"time": 1104, "text": "It's not good."}, {"time": 1106, "text": "And she goes, it's a real knife fight out here."}, {"time": 1107, "text": "So we put that in the episode title."}, {"time": 1110, "text": "And of course, I guess some algorithm thought that we were showing like people stabbing each other in a Wendy's and we got like demonetized."}, {"time": 1117, "text": "Did we get demonetized?"}, {"time": 1121, "text": "We lost a lot of views because we were kicked out of whatever out, like we're just kicked out."}, {"time": 1124, "text": "And then I was asking YouTube about it."}, {"time": 1126, "text": "They were kind of understanding it."}, {"time": 1127, "text": "But even the people that work there didn't truly seem to understand the algorithm."}, {"time": 1131, "text": "So can you explain to me how that works where they barely know what's going on?"}, {"time": 1135, "text": "No, they do not understand the full dynamics of the monster or the amazing thing that they've created."}, {"time": 1141, "text": "It's the amount of content that's being created is larger than anyone understands."}, {"time": 1146, "text": "Like this is huge."}, {"time": 1147, "text": "They can't deal with it."}, {"time": 1148, "text": "The teams aren't large enough to deal with it."}, {"time": 1150, "text": "There's like special cases."}, {"time": 1153, "text": "So if you fall into the category of special case, so we can maybe talk about that, like a Donald Trump, where you like actually have meetings about what to do with this particular account."}, {"time": 1162, "text": "But everything outside of that is all algorithms."}, {"time": 1164, "text": "They get reported by people and they get, like if enough people report a particular video, a particular tweet, it rises up to where humans look over it."}, {"time": 1176, "text": "But the initial step of the reporting and the rising up to the human supervision is done by algorithm."}, {"time": 1186, "text": "And they don't understand the dynamics of that because we're talking about billions of tweets."}, {"time": 1190, "text": "We're talking about hundreds of thousands of hours of video uploaded every day."}, {"time": 1198, "text": "Now, the hilarity of it is that most of the YouTube algorithm is based on the title."}, {"time": 1209, "text": "And the description is a small contribution in terms of filtering, in terms of the knife fight situation."}, {"time": 1214, "text": "And that's all they can do."}, {"time": 1217, "text": "They don't have algorithms at all that are able to process the content of the video."}, {"time": 1222, "text": "So they try to also infer information based on if you're watching all of these QAnon videos or something like that, or Flat Earth videos, and you also watch, are really excitedly watching the whole knife fight in Malibu video, that says that increases the chance that the knife fight is a dangerous video for society or something like that."}, {"time": 1248, "text": "Based on their contribution."}, {"time": 1249, "text": "So people are watching something, because I watch QAnon and Flat Earth videos to ridicule them."}, {"time": 1256, "text": "That, you know what I mean?"}, {"time": 1257, "text": "I watch these videos and I make fun of them on my show."}, {"time": 1259, "text": "But what's interesting is, if I then go watch something else, I'm increasing the likelihood that that video is gonna get looked at as potentially subversive or dangerous."}, {"time": 1269, "text": "So they make decisions about who you are, who you are as a human being, as a watcher, as a visual user, based on the clusters of videos you're in."}, {"time": 1277, "text": "But those clusters are not manually determined."}, {"time": 1280, "text": "They're automatically clustered."}, {"time": 1283, "text": "It's so weird."}, {"time": 1284, "text": "We have titles where they got upset about, I don't even understand."}, {"time": 1289, "text": "Like we had a title that was so innocuous, in my opinion, and the title of the episode was called Bomb Disney World."}, {"time": 1296, "text": "And I was asking people to consider bombing Disney World."}, {"time": 1301, "text": "And YouTube got angry at that."}, {"time": 1303, "text": "So you don't know why."}, {"time": 1305, "text": "You can never understand why."}, {"time": 1306, "text": "You could have said Disney World is the bombs."}, {"time": 1310, "text": "It's just rearranging."}, {"time": 1312, "text": "That's what it probably meant."}, {"time": 1312, "text": "I wasn't saying do it, but I was saying let's start thinking about plans to do, not let's do it, but let's get in the mind."}, {"time": 1321, "text": "Let's change the conversation."}, {"time": 1323, "text": "I think it's very interesting because as a comedian, you don't wanna live in that world of worrying about algorithms."}, {"time": 1328, "text": "You don't wanna worry about deplatforming and shadowbanning."}, {"time": 1330, "text": "I mean, all these conversations that I've had with other comedians about shadowbanning, I mean, it's hilarious."}, {"time": 1334, "text": "We all call each other, I think I'm being shadowbanned."}, {"time": 1336, "text": "Are you being shadowbanned?"}, {"time": 1338, "text": "Nobody knew what that word was a month ago, I mean, a year ago, but everyone now is convinced that everything they do that isn't succeeding is being shadowbanned."}, {"time": 1346, "text": "So it's this new paranoia, this algorithmic paranoia now that we all kinda have because there are genuine instances of people being taken out of an algorithm, you know, rightly or wrongly, however you wanna believe."}, {"time": 1362, "text": "But then there are also things that just don't perform as well for a myriad of reasons."}, {"time": 1366, "text": "And then we're all saying like, well, they're against me."}, {"time": 1370, "text": "They're shutting me down."}, {"time": 1371, "text": "And you don't know if that's true or not, you know?"}, {"time": 1374, "text": "What do you think about this moment in history, which was really troubling to me?"}, {"time": 1381, "text": "We could talk about several troubling aspects, but one is Amazon removing Parler from AWS."}, {"time": 1389, "text": "To me, that was the most clearly troubling."}, {"time": 1393, "text": "It felt like it created a more dangerous world when the infrastructure on which you have competing medium of communications now puts its finger on the scale, now influences who wins and who loses."}, {"time": 1410, "text": "Absolutely, you're right."}, {"time": 1412, "text": "And what you're always told is like, if you don't like Twitter, create your own service."}, {"time": 1417, "text": "Or if you don't like something, you can do your own thing."}, {"time": 1420, "text": "Or if you are, and basically because, you know, tech, you have to be in business with one of five companies."}, {"time": 1426, "text": "And I think it's like Amazon, Facebook, Google, YouTube, and Twitter, whatever, they're like, you know, I mean, Amazon puts everything on the cloud, you know, Google and YouTube, it's all basically the SEO and the advertising."}, {"time": 1437, "text": "And you got to get your name out there."}, {"time": 1438, "text": "You don't wanna be buried in it."}, {"time": 1439, "text": "Like, because you have to do business with it, it's a cartel of these companies."}, {"time": 1443, "text": "You understand it better than anybody that you are prevented, truly."}, {"time": 1447, "text": "And I think whatever you think about Parler, whatever you think about what people are saying on Parler, whatever you think about Alex Jones, whatever you thought about Milianopolis, the state has an interest in, and has always had an interest in crushing dissent."}, {"time": 1465, "text": "This is what the state has done."}, {"time": 1466, "text": "This is how they, you know, retain the power they have by eliminating dissent where they can."}, {"time": 1474, "text": "Now, because you don't have, you know, three broadcast networks anymore, and a handful of newspapers that were all run, by the way, by people that had been either compromised or happily, you know, happily going with the program, and you have this wild west of the internet, people like me, people that make, I make funny content that I hope is funny, but a lot of it is wild and crazy."}, {"time": 1499, "text": "I say a lot of wild and crazy things."}, {"time": 1501, "text": "They're very funny."}, {"time": 1502, "text": "I say a lot of wild and crazy things about powerful people."}, {"time": 1505, "text": "You mock the powerful in there by bringing them down a notch."}, {"time": 1509, "text": "We'll probably talk about it, but humor is one of the tools to balance the powers in society."}, {"time": 1518, "text": "And to make people feel better about things and to, you know, whatever the case may be, right?"}, {"time": 1522, "text": "That's my goal is to kind of like, hey, people have had a shitty day."}, {"time": 1525, "text": "If this video or podcast makes you laugh, that's great."}, {"time": 1529, "text": "I think that it won't ever, it was never gonna stop at Alex Jones."}, {"time": 1532, "text": "Not that I think he should have been taking off everything the way he was, but this keeps going until we have sanitized all of social media."}, {"time": 1542, "text": "And what they really want it to be is what Instagram is kind of becoming, which is a marketplace of, you could just go and buy sneakers, go buy a sweatshirt, go buy jeans, go buy this, go buy that."}, {"time": 1553, "text": "And the idea of the free exchange of information seems to be the old internet."}, {"time": 1558, "text": "And it seems the new internet seems to be, you know, hyper, and I'm a capitalist, but this seems to be like hyper capitalist in the sense of like, they only want you consuming things and they don't want you thinking too much."}, {"time": 1572, "text": "And that seems to be where it's heading."}, {"time": 1573, "text": "I've even seen that with Instagram where it's like everything on Instagram is like, buy a sweatshirt, you know?"}, {"time": 1579, "text": "And I'm like, all right, man."}, {"time": 1581, "text": "Hey man, if I want a sweatshirt, I'll get it."}, {"time": 1583, "text": "Like, relax."}, {"time": 1585, "text": "You know, just every ad seems to be encouraging consumption, but very few things seem geared towards, hey, let's have a dialogue or let's, and not that Instagram was ever great for that, but like, if everything's are geared now towards content on Instagram, a lot of it seems geared towards shopping."}, {"time": 1604, "text": "See, I don't know, that's an interesting point."}, {"time": 1606, "text": "I don't know if the consumerism that capitalism leads to is necessarily gets in the way of nuanced conversation."}, {"time": 1613, "text": "I feel like you could still sell Tim Dillon sweatshirts and have a difficult nuanced conversation or mock the current president, the previous president, mock the powerful, all that kind of stuff."}, {"time": 1625, "text": "Yeah, we try."}, {"time": 1626, "text": "We try to balance that."}, {"time": 1627, "text": "Do you have sweatshirts?"}, {"time": 1629, "text": "Are they on sale now, fake business?"}, {"time": 1632, "text": "We do, fake business sweatshirt with the Enron logo, fake business, because I do fake business all the time."}, {"time": 1637, "text": "It would be nice if you talk about Alex Jones if you plug the sweatshirt during that conversation."}, {"time": 1641, "text": "Yeah, we'll do that, absolutely."}, {"time": 1643, "text": "But what I tend to worry about with, I see social media and technology existing to flatten society."}, {"time": 1652, "text": "It makes people very boring."}, {"time": 1654, "text": "All of the experiences kids have right now are online."}, {"time": 1658, "text": "Many of their closest friendships are online."}, {"time": 1660, "text": "Their first relationships are online."}, {"time": 1662, "text": "The culture is very homogenous, and I think it's eliminating characters."}, {"time": 1667, "text": "It's eliminating interesting people."}, {"time": 1669, "text": "It's making people into AI."}, {"time": 1672, "text": "All of their tastes."}, {"time": 1673, "text": "Whoa, whoa, whoa, whoa, whoa."}, {"time": 1673, "text": "Yeah, yeah, yeah, yeah, yeah, that's right."}, {"time": 1674, "text": "AI could be Charles Bukowski as well."}, {"time": 1676, "text": "Let's not get crazy."}, {"time": 1677, "text": "It's not there yet, right?"}, {"time": 1679, "text": "I mean, the $75,000 dog is not doing anything."}, {"time": 1683, "text": "So we're not there yet."}, {"time": 1686, "text": "Listen, I hate people."}, {"time": 1687, "text": "I get why you like AI so much."}, {"time": 1688, "text": "I hate people too, and I'm very amenable to AI, and I agree with you."}, {"time": 1692, "text": "Listen, I think the future, we gotta get everyone out of here."}, {"time": 1695, "text": "I'm with you on that, so don't think I'm."}, {"time": 1698, "text": "He's manipulating my mind and my."}, {"time": 1700, "text": "That's why the flash of light in your eyes when you talked about that dog was so much more than any person."}, {"time": 1707, "text": "And I get it, by the way."}, {"time": 1708, "text": "I hate people, but if we could."}, {"time": 1710, "text": "They're not excited."}, {"time": 1710, "text": "If we could just use robots to kill most of them, I think that would be good for society."}, {"time": 1715, "text": "I'm with that too, but I think that social media flattens people."}, {"time": 1720, "text": "Flattening the personalities of characters."}, {"time": 1722, "text": "Flatten the personalities of people, man."}, {"time": 1723, "text": "And it's just, you know, when's the last time?"}, {"time": 1725, "text": "Like, I like the idea of like, you know, and I'm, you know, somebody showing up to high school with like a backpack and taking out an old CD and being like, hey man, here's this band you've never heard of that I love or whatever, you gotta get into this."}, {"time": 1738, "text": "And I'm like, you know, when I talk to young, you know, I have friends that have younger brothers and everything."}, {"time": 1742, "text": "And I know that the dominant culture was always dominant."}, {"time": 1744, "text": "I'm not an idiot, but like, I feel like it's harder to be unique and original now because so much of what's promoted is just this way to kind of corral people into believing and thinking a certain set of ideals that's constantly shifting and evolving."}, {"time": 1760, "text": "And people are just caught up in that."}, {"time": 1763, "text": "And to me, it gets very boring very quickly."}, {"time": 1767, "text": "I hate being bored and that's what it is."}, {"time": 1769, "text": "I don't know what to do with that because at the same time, podcasts are really popular, long form podcasts are really popular and people are hungry for those kinds of conversations."}, {"time": 1778, "text": "There's a lot of dangerous ideas, quote unquote, flowing, being spread around through podcasts, meaning just like debates."}, {"time": 1787, "text": "You know, so that's still popular."}, {"time": 1789, "text": "So I don't know what to."}, {"time": 1791, "text": "That gives me hope, I guess."}, {"time": 1793, "text": "And like I said, I look at the negative a lot because that's what I usually make fun of, but there's a lot of positive stuff happening too."}, {"time": 1800, "text": "Let's talk a bit about Alex Jones."}, {"time": 1804, "text": "So you've gotten a chance to talk to him while you were on the Joe Rogan Experience."}, {"time": 1809, "text": "I've been on Alex's show."}, {"time": 1810, "text": "I've talked, I've had Alex on my show."}, {"time": 1812, "text": "I've talked to Alex for three hours in front of, I guess it was maybe like 15 million people right on Joe's show."}, {"time": 1819, "text": "It was a really wild conversation."}, {"time": 1820, "text": "I think it was one of the coolest moments in broadcasting that clearly that I've ever been a part of."}, {"time": 1826, "text": "But I think it goes in the lexicon of like, these are big podcasts."}, {"time": 1831, "text": "Like I think it's one of the biggest podcasts."}, {"time": 1833, "text": "A week before the election, Alex Jones."}, {"time": 1835, "text": "I'm really grateful that Joe gave me the opportunity to be there."}, {"time": 1838, "text": "And it was just an amazing conversation to watch."}, {"time": 1841, "text": "What was the shirt you wore?"}, {"time": 1843, "text": "Fridges Lane."}, {"time": 1844, "text": "It was a fun joke that no one in tech got because we all know how funny they are."}, {"time": 1848, "text": "But the tech writers, which is mainly blue haired."}, {"time": 1850, "text": "I do not agree with these statements."}, {"time": 1851, "text": "It's mainly blue haired people whose goal in life is to find things to give them orgasms with."}, {"time": 1857, "text": "If you want to dye your hair blue, it's your choice."}, {"time": 1860, "text": "I respect it."}, {"time": 1861, "text": "Yeah, but is it your choice?"}, {"time": 1862, "text": "But at the end of the day, it's like, all the tech writers, like a lot of people just, and I'm not, I'm just maligning tech unfairly."}, {"time": 1868, "text": "But a lot of people that sense there's a humor were like, he's advocating for human trafficking."}, {"time": 1872, "text": "I'm like, it's clearly a joke because we're coming off the believe all women."}, {"time": 1876, "text": "We're coming off that."}, {"time": 1877, "text": "And it's very funny to just say Fridges Lane, hey man, believe all women."}, {"time": 1881, "text": "Like, it's just our politics and our public sphere is so schizophrenic right now that when you point that out, people are going to be angry with you."}, {"time": 1889, "text": "But that was a fun shirt to wear."}, {"time": 1891, "text": "But on Alex, you know, I was one of the people that found him really entertaining, that the same kind of thing as with Bukowski, these kinds of personalities that are wild, crazy, full of ideas."}, {"time": 1906, "text": "They don't have to be grounded in truth at all, or they can be grounded in truth a little bit."}, {"time": 1910, "text": "Like, he's just playing with ideas, like a jazz musician, screaming sometimes."}, {"time": 1915, "text": "Obviously he has some demons."}, {"time": 1917, "text": "Sometimes he's super angry for no reason whatsoever at some weird thing that he's constructing in his own head."}, {"time": 1924, "text": "Sometimes he's super loving and peaceful, especially lately that I've heard him, I don't know if you've seen with him, with Michael Malice, where he's doing, like Malice was doing, like telling Alex Jones, I love you, Alex."}, {"time": 1937, "text": "Just this loving kind of softness and kindness underneath it all."}, {"time": 1941, "text": "I don't know what to make of any of it."}, {"time": 1942, "text": "And then there's this huge number of people that tell me that Alex Jones is dangerous for society."}, {"time": 1949, "text": "So what do you do with that?"}, {"time": 1950, "text": "Do you think he's dangerous for society?"}, {"time": 1952, "text": "Do you think he is one of the sort of entertaining personalities of our time that shouldn't be suppressed or somewhere in between?"}, {"time": 1959, "text": "I don't think that Alex per se is dangerous for society."}, {"time": 1963, "text": "I think the greater danger for society comes again from stifling all dissent, right?"}, {"time": 1970, "text": "All, like anybody with a voice that uses it, that critiques the government, and putting all of those people in a category and getting rid of them is incredibly dangerous."}, {"time": 1980, "text": "To me, more so."}, {"time": 1981, "text": "I think the biggest problem that Alex has ever had was when he questioned the Sandy Hook shooting."}, {"time": 1988, "text": "And that really was, because it really is this identifiable incident that you can look at where it did get away from him and a lot of his fans who, the people that are attracted to conspiracy stuff, and I have some of those fans, some of them are really smart people, some of them are mentally unwell."}, {"time": 2003, "text": "A lot of them happen to be mentally unwell."}, {"time": 2005, "text": "So when you have a fan base of people where some of them are mentally unwell, and you are questioning tragic events, okay?"}, {"time": 2013, "text": "And Alex was right about Epstein."}, {"time": 2015, "text": "He was right about a lot of things, and he's got no credit for that."}, {"time": 2018, "text": "And I understand that this, sometimes when you write about 10 things and you're wrong about something, and the thing you're wrong about is so offensive to people, you're never gonna get any credit for being right, even though you were right more than when you were wrong."}, {"time": 2032, "text": "The problem was a lot of his fans who were crazy stalked, harassed these families and accused them of being actors and accused them of faking their children's deaths."}, {"time": 2042, "text": "It was just horrific experience."}, {"time": 2046, "text": "And Alex is tied to that."}, {"time": 2048, "text": "And how much he inspired that by what he did on his show, I don't know because I haven't watched hours and hours of that particular thing, the whole Sandy Hook thing."}, {"time": 2062, "text": "If you listen to him, he says, I really covered it."}, {"time": 2064, "text": "I kind of covered it and moved on."}, {"time": 2066, "text": "Other people go, no, he spent a long time on it."}, {"time": 2069, "text": "But that's the real danger of going into that territory over and over again, going everything's a false flag or everything's fake."}, {"time": 2077, "text": "I think Alex has actually been kind of reasonable."}, {"time": 2079, "text": "He's resisted a lot of the politics of racial resentment on the alt right, for example, he's resisted that."}, {"time": 2086, "text": "He's resisted the antisemitic currents of a lot of that politics."}, {"time": 2091, "text": "He's resisted a lot of the virulently anti trans or anti gay stuff."}, {"time": 2096, "text": "Now he does dip his toe into the water of like the culture wars, of course he does."}, {"time": 2100, "text": "But I've never really seen him, and I could be wrong about this, embrace white nationalism or identitarianism."}, {"time": 2108, "text": "I've never seen him really go antisemitic."}, {"time": 2110, "text": "I've never seen him take that route."}, {"time": 2112, "text": "When I grew up and I would turn him on every now and then, he was talking about NAFTA, the WTO, he's talking about 9 11, he was talking about the world trade organizations and a lot of these big conferences, whether it was the Bilderberg group, whether it was a Bohemian Grove, which he infiltrated."}, {"time": 2128, "text": "And he was talking about, hey, here are the most powerful people in the world."}, {"time": 2131, "text": "Here's what they're doing."}, {"time": 2132, "text": "And here's how it affects you."}, {"time": 2134, "text": "And that was interesting to me because no one else was really talking about it except Alex Jones, occasionally Art Bell on WABC."}, {"time": 2142, "text": "You'd listen to him at night, right?"}, {"time": 2145, "text": "I think Alex became very controversial when he decided to back Donald Trump."}, {"time": 2150, "text": "And then he has a considerable following and a considerable audience that he was then able to marshal in the direction of supporting Donald Trump."}, {"time": 2159, "text": "That was when the spotlight, because then he was talking to Trump, Trump did his show, Alex Jones just got bigger, right?"}, {"time": 2167, "text": "And he blew up, that's the term, right?"}, {"time": 2169, "text": "He blew off, he put out the Good HBO special, whatever you wanna call it."}, {"time": 2174, "text": "He has a hit song, he blew up."}, {"time": 2176, "text": "And then people started looking at the things that he was associated with."}, {"time": 2180, "text": "The Sandy Hook thing is a blemish on his record."}, {"time": 2182, "text": "I do believe he regrets it."}, {"time": 2183, "text": "But again, I do see the point of the families who are like, dude, fuck this guy forever."}, {"time": 2187, "text": "This is the worst thing I ever went through."}, {"time": 2189, "text": "It's a very tough, I understand the people that say that."}, {"time": 2195, "text": "I understand, and I understand the people that go, when you have tech companies that act in a coordinated manner to just get rid of someone, they don't have any way to defend themselves."}, {"time": 2206, "text": "It's a little terrifying when you think about that power being abused and how wouldn't it be?"}, {"time": 2213, "text": "Do you think he should have not have been banned from all these platforms?"}, {"time": 2217, "text": "I don't think, I do think that if you are a private company, right?"}, {"time": 2221, "text": "I do think, and this is where you run into this problem."}, {"time": 2224, "text": "I don't know if these tech companies were government utilities, would that decrease people's likelihood of being banned?"}, {"time": 2232, "text": "So I understand the benefit of them being treated like public utilities and people thinking they have the right to a Twitter."}, {"time": 2241, "text": "I've never, I don't know, I have very little confidence."}, {"time": 2245, "text": "I mean, the government's trying to roll out a vaccine in California and we vaccinated like five people."}, {"time": 2249, "text": "I mean, in terms of what we need to do in the state, right?"}, {"time": 2252, "text": "So maybe if it was a government utility, I do think someone like Alex, like there should be some process."}, {"time": 2260, "text": "So if you're gonna get rid of someone, they should have a way to defend themselves."}, {"time": 2264, "text": "There should be more democratic process that you can go through than just being unilaterally taken off something."}, {"time": 2274, "text": "But like, then you run into the, you're like, am I gonna say that everyone deserves?"}, {"time": 2278, "text": "No, if you're threatening or harassing people or threatening to kill them, publishing their private information, if you're committing crimes on these platforms, obviously the people that own these platforms are gonna be like, we're not gonna allow this to happen."}, {"time": 2290, "text": "So I understand that there is a line, right?"}, {"time": 2294, "text": "There is some, like people that say there's no line aren't really thinking, like there is a line."}, {"time": 2299, "text": "I just thought that line seems to be moving all the time and it seems to be a very hard thing to police."}, {"time": 2304, "text": "But I don't think you can remove a guy off everything and then also bank accounts won't give him debit cards or credit cards, I don't know if you talked to him about that, but like, you know, there were financial institutions that were refusing to let him park his money there."}, {"time": 2318, "text": "So, I mean, it really does get pretty terrifying pretty quickly."}, {"time": 2324, "text": "Probably without any transparency from those companies."}, {"time": 2326, "text": "So you're right, it feels like there should be a process of just having, for him to defend himself."}, {"time": 2334, "text": "I think there needs to be a process for people to defend themselves."}, {"time": 2339, "text": "Every day I wake up and I go, is something I said in a video gonna get taken out of context, is somebody gonna get angry, is somebody gonna be, you know, I say wild stuff because that's what makes me laugh, that's what makes my friends laugh and that's what makes my audience laugh."}, {"time": 2352, "text": "So I never ever, people, you know, whatever political side you come down on, I think if you make your living speaking, it's always interesting to me if you are pro the deplatforming, that's odd."}, {"time": 2367, "text": "It's interesting to consider a kind of a jury context to where, you know, there's transparency about why your video about bombing Disney World might be taken down, like it gets taken down and then there is, it's almost like creating a little court case, a mini court case and not in a legal sense, but in the public sphere."}, {"time": 2391, "text": "And then people should be able to have, you know, we pick representatives of our current society and have a discussion about that and make a real vote."}, {"time": 2400, "text": "You know, just have like jury locks himself up in a discussion, that kind of process might be necessary."}, {"time": 2408, "text": "Right now, what happens is Twitter is completely, first of all, they're just mostly not aware of everything they're doing, there's too much stuff, but the stuff they're aware about, they make the decision in closed doors meetings and without any transparency to the rest of the company actually, but also transparency to the rest of the world."}, {"time": 2429, "text": "And so, and then all they say is we're making decisions because the people, they use things like violence."}, {"time": 2437, "text": "So violence equals bad and if this person is quote unquote, inciting violence, therefore that gives us enough reason to ban them without any kind of process."}, {"time": 2448, "text": "I mean, it's interesting, I'm torn in the whole thing."}, {"time": 2451, "text": "If it was indeed, there's no transparency about it, but if Parler was indeed inciting violence, like if there was brewing of violence, potential violence where, you know, thousands of people might die because of some kind of riot, like this is the scary thing about mob, about when a lot of people get together."}, {"time": 2501, "text": "Well, in fairness to defend the people at the Capitol, they didn't shoot the cop, they bludgeoned him to death with a fire extinguisher."}, {"time": 2510, "text": "So I do wanna just kind of put that out as a defense of them."}, {"time": 2514, "text": "Listen, I'm sure there was some wild shit going on on Parler and I think the problem, here's the problem, right, there's a lot of people that just wanna go on these sites and say they wanna kill everyone."}, {"time": 2526, "text": "And the problem is, you know, at what point do you shut them all down?"}, {"time": 2531, "text": "Like I think a lot of people are just living in a world where they're powerless, they don't have any political power, they don't have any economic power, right?"}, {"time": 2539, "text": "They can't throw their money around."}, {"time": 2542, "text": "They don't have healthcare, their job security isn't great."}, {"time": 2546, "text": "They might be living in a community that doesn't have the resources they would like it to have."}, {"time": 2551, "text": "They're not happy and thrilled."}, {"time": 2554, "text": "And then they have these sites where they can go on and just say, man, I'd like to fucking burn it all down."}, {"time": 2559, "text": "And distinguishing a guy blowing off steam and saying wild stuff from a genuine threat is a very hard thing to do, you know?"}, {"time": 2569, "text": "Like I've threatened to kill, I got banned from Airbnb, I threatened to kill the people that banned me, comedically, comedically, this is a joke."}, {"time": 2580, "text": "I'm not going to kill you, this is a joke because I'm blowing off steam and I'm angry."}, {"time": 2585, "text": "Do you know how many people that my parents, like my dad's like, I'm gonna fucking kill this guy, my mom's like, I'm gonna fucking kill."}, {"time": 2591, "text": "They were talking about each other."}, {"time": 2593, "text": "But none of it ever happened, but we should be, I think you have to create a space for people to threaten to overthrow the government as long as they don't violently do it."}, {"time": 2606, "text": "I mean, does that make any sense?"}, {"time": 2608, "text": "I mean, as long as they're not gonna go hurt innocent people, what are you gonna do?"}, {"time": 2613, "text": "Like there's so many people out there that, that's why a lot of these things like 4chan, these sites, a lot of people going on there, they just wanna say the most fucked up shit because it's the thing that gives them, they can laugh or they can release steam and it is immature, it is stupid."}, {"time": 2628, "text": "It's not productive, it's not, you know, but at the end of the day, if you're not gonna give people health insurance, you gotta give them something."}, {"time": 2637, "text": "It's like when someone in this country dies that everyone disagrees with, right?"}, {"time": 2641, "text": "Political figure, media figure, a lot of people dance on their grave online and then everyone, people goes, and the other side will always do it."}, {"time": 2649, "text": "Like if a conservative dies and everyone goes, great, conservatives goes, this is grotesque that you, and then when RBG dies, they all have parties and the conservatives go, great."}, {"time": 2660, "text": "You have to let people in this country enjoy the deaths of their enemies."}, {"time": 2666, "text": "You do because they don't have much else."}, {"time": 2669, "text": "Again, if you gave them other things, you might say, guy, you can go get an E operation."}, {"time": 2674, "text": "Why don't you stop?"}, {"time": 2676, "text": "But if they're working for shit wages and you haven't figured out a way to treat them, treat their cancer diagnosis, and they don't like, I mean, life, you know, you gotta, you gotta derive pleasure from something, right?"}, {"time": 2694, "text": "It's an interesting point that anger is a good valve, like to, if your life is suffering, that there's something very powerful about anger, but I still have hope that it doesn't have to be."}, {"time": 2707, "text": "I mean, that kind of channeling into anger that then becomes hate led us into a lot of troubles in human history."}, {"time": 2715, "text": "So you have to be careful empowering people too much in that anger, especially, I think my, I think I understand why people are nervous about Parler, about Twitter and so on."}, {"time": 2730, "text": "Because all that shit talking about violence was now paired with let's get together at this location."}, {"time": 2740, "text": "This was a new thing."}, {"time": 2741, "text": "Like it's not just being on whatever platform talking shit, it's saying we're going to in physical space meet."}, {"time": 2749, "text": "And then everybody got, all these platforms got nervous."}, {"time": 2752, "text": "Well, what happens when all these shit talkers, all these angry people that are just steam, letting off steam meet in a physical space."}, {"time": 2761, "text": "And there was probably overreach, almost definitely overreach, but I can understand why they were nervous."}, {"time": 2768, "text": "There doesn't seem to be, and this is when Trump got elected and when you have like, whatever you have, right?"}, {"time": 2771, "text": "Whether you have riots in Portland and Seattle, where you have the Antifa people doing crazy things, you have like the people storming the Capitol."}, {"time": 2778, "text": "There never seems to be a ton of an examination of why these ideas are becoming popular."}, {"time": 2784, "text": "Why are people so angry?"}, {"time": 2786, "text": "What is leading people to this?"}, {"time": 2789, "text": "What about their lives is to the point where they need to show up at these places?"}, {"time": 2794, "text": "And like, and obviously there's going to be people on the fringe."}, {"time": 2797, "text": "There'll always be the mentally unwell."}, {"time": 2798, "text": "There'll always be people that want to destroy society."}, {"time": 2801, "text": "But when you look at how popular, large, long discredited things, whether it's fascism, totalitarian communism, all of these things are like, why are they back?"}, {"time": 2813, "text": "Why are they back in a big way?"}, {"time": 2814, "text": "And why are people so fed up with the status quo that they're finding solace in the most extreme discredited theories of how to run and operate societies, theories that have led to deaths of a lot of people."}, {"time": 2831, "text": "So to me, I'm like, if those people at the Capitol, yes, if they were going to work, if they were able to go out and drink at Chili's, if they were able to get a fucking checkup, right?"}, {"time": 2849, "text": "Like if their job paid a little bit better, and I'm not saying that this is all the reason, right?"}, {"time": 2854, "text": "I'm sure that there's a lot of people there that are doing quite well and they're still nuts."}, {"time": 2858, "text": "But like the anger and the rage that's boiling to the surface of this society, does it come from the fact that across the board people in very different areas and with very different political beliefs feel like they are being fucked over and there's nothing they can do about it."}, {"time": 2879, "text": "That's what the baseline to me, they look at the people that run the country and run the world, whether they're tech titans, the guys that you talked to, or whether they're people that run the government, whether they're people that run large banks, large media companies, the people that have created this kind of infrastructure that everyone lives in, these people are incredibly powerless."}, {"time": 2903, "text": "And when you push people to that point, logically, sadly, and unfortunately, the next thing does seem to be violence."}, {"time": 2913, "text": "Yeah, the thing that troubles me a lot is you said nobody's asking why these beliefs are out there, but sometimes it's not even acknowledged that people are hurting, people are angry, just even acknowledging that all the conspiracy theories that are out there, acknowledging that they're out there."}, {"time": 2935, "text": "And then people are thinking about it and talking about it just because otherwise, so it's not acknowledged in this nuanced way."}, {"time": 2943, "text": "What happens is you say, okay, 70 million people are white supremacists."}, {"time": 2947, "text": "It's just throwing a kind of blanket statement."}, {"time": 2952, "text": "And of course that gets them angrier and makes them feel more powerless."}, {"time": 2959, "text": "And that ultimately, that's what's been painful for me to see is that there's not an acknowledgement that most people are good."}, {"time": 2972, "text": "There's circumstances where it's just you're pissed off."}, {"time": 2977, "text": "Because you are powerless."}, {"time": 2978, "text": "I mean, most of us are powerless."}, {"time": 2979, "text": "You could fall in with a bad crowd."}, {"time": 2982, "text": "That's the thing, you can just fall in."}, {"time": 2984, "text": "And it doesn't mean that there's not blame."}, {"time": 2987, "text": "Obviously you have agency, you're a person."}, {"time": 2991, "text": "But the idea that you could be rehabilitated, you could do something stupid or you could fall into a group of people that are, and then in a few years you can go, what the fuck was I doing?"}, {"time": 3002, "text": "I'm an ex drug addict."}, {"time": 3003, "text": "I know what it's like to go from being one thing to being another thing."}, {"time": 3006, "text": "I'm still a drug addict."}, {"time": 3007, "text": "If I would use drugs right now or drink, I would still be addicted to them."}, {"time": 3011, "text": "I mean, it's not something that I can ever change about myself, but I know what it's like to go from one thing to another thing."}, {"time": 3016, "text": "So when you look at racism or whatever ism, homophobia, misogyny, whatever you're looking at, antisemitism, and you go, that's a fixed condition where nobody's ever going to be able to change."}, {"time": 3028, "text": "Nobody's ever gonna be able to be rehabilitated."}, {"time": 3030, "text": "Nobody's ever going to be able to reimagine themselves in a different way."}, {"time": 3035, "text": "To me, you're just, you're throwing away someone and you're making them feel helpless and worthless."}, {"time": 3041, "text": "And that's gonna lead to antisocial behavior that spills out into the violence."}, {"time": 3045, "text": "We don't have a very redemptive society."}, {"time": 3048, "text": "That's a huge factor."}, {"time": 3050, "text": "We don't have a redemptive society."}, {"time": 3052, "text": "That's why I like O.J."}, {"time": 3052, "text": "Simpson."}, {"time": 3054, "text": "Because O.J."}, {"time": 3054, "text": "Simpson, yes, he did a bad thing supposedly."}, {"time": 3058, "text": "But he's very kind now on Twitter and he makes very nice points about how we all have to get involved in the political process and he's on golf courses and I like watching people golf."}, {"time": 3067, "text": "I don't do it, but I like watching him do it."}, {"time": 3070, "text": "And he's like an elder statesman because I remember him from the naked gun."}, {"time": 3073, "text": "And I choose to forgive him for whatever happened there, which I don't know."}, {"time": 3080, "text": "But I choose to forgive him really for, I mean, obviously, what they say is he cut his wife's head off."}, {"time": 3087, "text": "But I can look past that and redeem him because he's very stable on Twitter and he's a good, like I see all these people going crazy on Twitter and I'm like, O.J."}, {"time": 3097, "text": "'s lived a full life."}, {"time": 3101, "text": "I think there's a benefit to that."}, {"time": 3103, "text": "There's a benefit to kind of living a full life."}, {"time": 3105, "text": "Yeah, how many of us have not at least tried to murder somebody?"}, {"time": 3108, "text": "100%, listen, O.J."}, {"time": 3108, "text": "'s had the highs and the lows, but he did it on his terms."}, {"time": 3116, "text": "And there's a real."}, {"time": 3117, "text": "It's like a Frank Sinatra song."}, {"time": 3119, "text": "Yeah, he did it my way."}, {"time": 3120, "text": "I mean, there's a benefit to that."}, {"time": 3122, "text": "And he seems like a very well adjusted person now."}, {"time": 3124, "text": "So I mean, I don't know, how is that a fact?"}, {"time": 3127, "text": "But it is a fact and that's an uncomfortable fact."}, {"time": 3129, "text": "Well, this is a strong case of forgiveness in one of the more extreme cases, I suppose."}, {"time": 3136, "text": "But yeah, there's not a process of forgiveness."}, {"time": 3138, "text": "It seems like people just take a single event from your, sometimes a single statement from your past and use that as a categorical like capture of the essence of this particular human being."}, {"time": 3151, "text": "So murder might be a thing that you should get a time out for a little while."}, {"time": 3158, "text": "Murder is bad."}, {"time": 3159, "text": "Murder, and let's just say that."}, {"time": 3162, "text": "Murder is not good."}, {"time": 3164, "text": "I'm glad you make this definitive statement."}, {"time": 3166, "text": "O.J."}, {"time": 3166, "text": "is an interesting cat because you're like, he's very stable on Twitter."}, {"time": 3173, "text": "He's very like, he's like, let's take a look at it, guys."}, {"time": 3175, "text": "Like we need more of his energy."}, {"time": 3178, "text": "I know like, yes, it was bad."}, {"time": 3180, "text": "He killed the woman in the waiter."}, {"time": 3183, "text": "I was not for that."}, {"time": 3184, "text": "I wish he didn't do that."}, {"time": 3185, "text": "But the trial, the O.J."}, {"time": 3185, "text": "Simpson trial was such a fun thing."}, {"time": 3190, "text": "And like you said, we need more fun people in society."}, {"time": 3192, "text": "Speaking of fun people, you've, your politics have been all over the place."}, {"time": 3199, "text": "I mean, imagine not, imagine someone whose politics weren't all over the place."}, {"time": 3204, "text": "It would seem odd."}, {"time": 3206, "text": "In the 10 years that I've been politically conscious, just because I'm 35 and 20."}, {"time": 3210, "text": "No, I've probably been conscious for over two decades, but like Democrats have become Republicans, Republicans become Democrats."}, {"time": 3216, "text": "I remember when Ann Coulter said, we need to, he defended George W. Bush when he said, we need to go out and Christianize or modernize the Arab world."}, {"time": 3224, "text": "We need to democratize the Arab world."}, {"time": 3225, "text": "And then Ann Coulter backed Donald Trump."}, {"time": 3228, "text": "And all the right wing in America believed in nation building."}, {"time": 3231, "text": "They believed in going out and democratizing areas that might breed radical terrorists, whether it was Iraq or wherever you were going, toppling regimes and instituting new democratic norms in those countries."}, {"time": 3245, "text": "That was the right wing point of view when I grew up."}, {"time": 3247, "text": "Then the right wing switched to, we are going to be isolationist."}, {"time": 3253, "text": "We're going to take care of America."}, {"time": 3255, "text": "First and foremost, we're not going to go into other countries."}, {"time": 3258, "text": "And then the Democrats who, when I grew up, were doves and the right wing people were more hawkish."}, {"time": 3263, "text": "And the Democrats were like, the military solutions aren't the way."}, {"time": 3267, "text": "We need to have multilateral diplomatic coalitions to solve all the problems."}, {"time": 3272, "text": "Now, Rachel Maddow's like, let's nuke Russia every night on MSNBC."}, {"time": 3277, "text": "The Democrats are like, we need strong presence in Syria."}, {"time": 3281, "text": "We need a strong presence."}, {"time": 3283, "text": "We need to counter Putin all over the globe."}, {"time": 3285, "text": "We need to get, so they're more hawkish on things."}, {"time": 3288, "text": "So literally I have watched two political parties literally flip and it's crazy to watch."}, {"time": 3294, "text": "And in some sense I've watched that as well because when I first saw Barack Obama, I admired that he was against the war."}, {"time": 3303, "text": "This is whatever, maybe before he was a Senator, he spoke out against the Iraq war."}, {"time": 3310, "text": "And then it doesn't feel like, it feels like his administration was more hawkish than dovish in a sense with all the drone attacks, with the sort of inability to pull back, or at least in mass efficiently pull back from all the military involvement that we have all over the world."}, {"time": 3334, "text": "So, and just the language."}, {"time": 3336, "text": "What I think is interesting about that, what's interesting about Obama, cause this is a very interesting study, is that presidents are controlled in very different ways."}, {"time": 3343, "text": "Presidents can be controlled by different factors, power factions within Washington."}, {"time": 3351, "text": "I think one of the reasons that Obama was maybe, you had a very close relationship with John Brennan, he was a CIA director."}, {"time": 3385, "text": "They go, they call it like blue book information, which is five levels above top secret, and they go like, hey man, a guy in Iran at a cafe said he's blowing everything up next week, and you know, I mean, it's the same thing as Parler, you don't know if it's true or not."}, {"time": 3399, "text": "But now the president's making a decision on usually a lot of uncorroborated intelligence that goes into a presentation for the president, where you're just terrified every day, and you don't want a terrorist attack on your watch."}, {"time": 3411, "text": "Now, so why are they getting all this information?"}, {"time": 3413, "text": "Because a lot of the people in Washington have an interest in perpetual, constant, ongoing warfare, and there's a lot of financial gain to be had from that."}, {"time": 3422, "text": "So they're sneaking their information into the presentations that are going to the president, and then the president is now behaving and going, fuck, I don't want a bomb going off, we gotta do what we gotta do."}, {"time": 3433, "text": "And whatever version of that happens, that is really kind of what is happening, whereas the presidents are being controlled by forces that are outside of the political sphere, but very much still in it."}, {"time": 3447, "text": "And they have a lot of, that's what the deep state is."}, {"time": 3449, "text": "You know, Trump, there's a lot of ridiculing Trump of going, the deep state doesn't exist."}, {"time": 3453, "text": "It absolutely exists, there's been books about it written by liberal journalists."}, {"time": 3456, "text": "The deep state is only a term for unelected, largely, power factions in Washington, DC, that outlive any presidential administration."}, {"time": 3467, "text": "These are people that might work at the State Department, they might work at the Defense Department."}, {"time": 3472, "text": "These are people that are not always working officially in any government capacity."}, {"time": 3477, "text": "They might be private companies, they might be military contractors, they might be people at Boeing or Raytheon or General Dynamics."}, {"time": 3486, "text": "And they constitute a group of people that Trump kind of called the swamp, but Trump had really no interest in draining the swamp."}, {"time": 3494, "text": "But he articulated these things, and this is what it is."}, {"time": 3498, "text": "You have a lot of interested parties that have budgets that they want, big budgets."}, {"time": 3504, "text": "Everybody wants a budget in Washington, whether you know what it is, they want money."}, {"time": 3509, "text": "And these are the people who really control press."}, {"time": 3511, "text": "So this idea that the president is the be all end all has got to be smashed, which is why the horse race model of politics and being like, is it right wing?"}, {"time": 3519, "text": "Is it left wing?"}, {"time": 3520, "text": "Is it, what team am I on and what color am I wearing?"}, {"time": 3523, "text": "It's very simplistic, but the reality is this is an empire."}, {"time": 3527, "text": "It's past its peak."}, {"time": 3529, "text": "We're in trouble."}, {"time": 3530, "text": "The United States is an empire past its peak."}, {"time": 3531, "text": "Yeah, I mean, that's just, you could prove that case in court."}, {"time": 3535, "text": "Well, let's go to court right now."}, {"time": 3537, "text": "But I do love the more complex idea that there's just human beings who crave power and seek ways to attain that power through different ways."}, {"time": 3548, "text": "If you have Barack Obama or George Bush or Donald Trump, there's different attack vectors."}, {"time": 3556, "text": "There's different ways to attain that power and then you can use that to leverage."}, {"time": 3559, "text": "And it probably doesn't have to be just in Washington, DC."}, {"time": 3563, "text": "There's people who crave power all over the world."}, {"time": 3566, "text": "Of course, but where we are now in Los Angeles, these people are all good."}, {"time": 3571, "text": "LA."}, {"time": 3572, "text": "Studio executives and people that I, from what I understand, they treat everyone fairly and they're nice, but he sees the bad guys, but out here in LA, everyone's lovely."}, {"time": 3583, "text": "So amidst this fun exploration in your mind through the political landscape that you've done over the past couple of decades that you've been conscious politically, where does Donald Trump fit into this picture for you?"}, {"time": 3602, "text": "Well, he didn't, right?"}, {"time": 3604, "text": "Cause we didn't, he wasn't political until four years ago, right?"}, {"time": 3607, "text": "He got political very quickly before."}, {"time": 3610, "text": "I mean, he was always firing off crazy tweets about where Obama was born or whatever, but he was, he got into politics like very quickly and then he became the president, right?"}, {"time": 3619, "text": "So it was like, we didn't, I knew him as Donald Trump, this crazy New York city character, the coast of the apprentice."}, {"time": 3626, "text": "I didn't think much about him."}, {"time": 3627, "text": "He was just constant, you know, like he was just this constant figure."}, {"time": 3631, "text": "Like I don't think much about Warren Buffett."}, {"time": 3633, "text": "Like I know like Trump's like, he's married to a new show girl all the time and he's always opening another casino and he's on TV."}, {"time": 3641, "text": "Wait, Warren Buffett really?"}, {"time": 3641, "text": "No, Trump."}, {"time": 3642, "text": "Trump, but like Warren Buffett is the opposite, right?"}, {"time": 3644, "text": "Warren Buffett's like been married for a billion years, lives in a little house in Omaha, but these are the, that's what I associate Trump."}, {"time": 3650, "text": "Like I don't think about Warren Buffett."}, {"time": 3652, "text": "I don't think about these people."}, {"time": 3653, "text": "They're just guys that I've known forever that have like, you know, you associate certain things with them, right?"}, {"time": 3662, "text": "And Trump, we always associated with kind of vulgar, garish, new money, billionaire, married a lot, you know, casinos, Miss Universe pageants."}, {"time": 3670, "text": "But again, you know, but it makes perfect sense that he really was able to become president at the moment where we were about to have Hillary Clinton versus Jeb Bush."}, {"time": 3682, "text": "And I think Americans felt like this is, now the oligarchy is spitting right in our face."}, {"time": 3687, "text": "You're not even making it feel like there's an appearance of democracy."}, {"time": 3692, "text": "We have two crime families vowing for control of the country every four years."}, {"time": 3697, "text": "And then there was this rogue kind of upstart guy that was really about himself."}, {"time": 3702, "text": "You know, Trump doesn't really care that much about the, I mean, really was summarized perfectly when he left and he just said, hey, have a good life."}, {"time": 3708, "text": "That's what he said before he got on Andrews Air Force Base."}, {"time": 3711, "text": "If you watch his speech, he goes, hey, have a good life."}, {"time": 3713, "text": "That's what he really feel."}, {"time": 3716, "text": "Like, hey, have a good life."}, {"time": 3718, "text": "I'm gonna get on a plane right now and fly to a castle I own in Florida."}, {"time": 3725, "text": "And really, I'm not gonna think too much about you people outside of how I can get more attention in the future."}, {"time": 3732, "text": "Can I ask you like a therapy question?"}, {"time": 3734, "text": "What is your favorite and least favorite quality of Donald Trump?"}, {"time": 3741, "text": "So my least favorite quality of Donald Trump, I think because there's a few of them, his lack of empathy, complete and total lack of empathy."}, {"time": 3755, "text": "I don't feel that he cares about human beings on any level."}, {"time": 3759, "text": "And I feel like that's, maybe it should be a requirement, right?"}, {"time": 3763, "text": "I mean, I don't think he cares."}, {"time": 3765, "text": "I think it's obvious that he doesn't care."}, {"time": 3766, "text": "I mean, he sent, you know, basically he's saying like, they're in there, Mike Pence is in there."}, {"time": 3770, "text": "He knows that his people are going to get, try to get into a Capitol."}, {"time": 3774, "text": "I mean, those motherfuckers are not gonna have jobs."}, {"time": 3776, "text": "They're gonna go to federal prison and he doesn't care."}, {"time": 3780, "text": "As long as they're storming the Capitol to prove the point that he thinks he won the election, he has no concern for these people, his followers."}, {"time": 3788, "text": "He leads them lambs to the slaughter, right?"}, {"time": 3791, "text": "So that's not a respectable quality."}, {"time": 3793, "text": "My favorite quality of Donald Trump is his willingness to call bullshit."}, {"time": 3798, "text": "So his willingness to call bullshit out."}, {"time": 3800, "text": "He doesn't play the game."}, {"time": 3802, "text": "He will, you know, when people say about Putin, Putin kills people, he goes, we kill a lot of people here too."}, {"time": 3806, "text": "Like he's willing and able to break the fourth wall and say things that no politician has ever said."}, {"time": 3813, "text": "He's willing to call out hypocrisy, you know, of course not his own, but the media, the members of the political establishment, that's a laudable quality."}, {"time": 3823, "text": "It's an entertaining quality, right?"}, {"time": 3825, "text": "We all like it."}, {"time": 3826, "text": "I love, I'm like this guy saying something that a lot of people want said."}, {"time": 3830, "text": "That being said, it's coupled with no real work or action."}, {"time": 3834, "text": "So it's not coupled with anything behind it that he just wants to, we did an episode of my podcast once where it's like essentially he's like criticizing the deep state, he wants a deeper state."}, {"time": 3843, "text": "He wants a deeper state."}, {"time": 3844, "text": "Like he hired his daughter and her husband."}, {"time": 3847, "text": "I mean, this is not a guy that's interested in transparency and openness."}, {"time": 3851, "text": "He's a guy that would just prefer, he wants to run the mafia state."}, {"time": 3856, "text": "But he shakes up the norms of social discourse, political discourse, and that people are just hungry for that."}, {"time": 3864, "text": "Like he got banned from Twitter, from all the different platforms."}, {"time": 3869, "text": "Do you think, is there an argument to be made for and against banning Twitter?"}, {"time": 3873, "text": "There's always arguments to be made for everything."}, {"time": 3875, "text": "A permanent ban seems to be an overreaction to me."}, {"time": 3878, "text": "He's the president of the United States."}, {"time": 3879, "text": "It also rearranges the power, like whether you like him or hate him, love him or hate him, he was the president."}, {"time": 3885, "text": "We've elevated Twitter is now more powerful than the president."}, {"time": 3888, "text": "It's like, do you want that to be longterm the salute, that the reality, like now Jack at Twitter is more powerful than the president of the United States."}, {"time": 3896, "text": "Is that a good paradigm going forward?"}, {"time": 3901, "text": "I'm not, listen, maybe give him a little time out for a few days."}, {"time": 3905, "text": "I think a time out, a little spanking, certainly, but I don't know if a permanent ban across the board on every social media."}, {"time": 3911, "text": "I mean, they banned them on Grindr."}, {"time": 3913, "text": "I mean, this is how hilarious it is, right?"}, {"time": 3914, "text": "I mean, they banned them across the board on everything."}, {"time": 3917, "text": "I don't think he could get an Airbnb now, neither can I, but like, I don't think he can do anything."}, {"time": 3922, "text": "Again, I just, I look back and there's so many people, my very smart, intelligent friends that go, yeah, but who cares?"}, {"time": 3927, "text": "Yeah, but he's bad."}, {"time": 3928, "text": "Yeah, but blah, blah, blah."}, {"time": 3929, "text": "Yeah, but I don't like Milianopolis."}, {"time": 3931, "text": "Yeah, but blah, blah, blah, blah, blah."}, {"time": 3932, "text": "And I'm like, you have such faith."}, {"time": 3935, "text": "You have such faith that it's always gonna be the people you dislike that are banned."}, {"time": 3940, "text": "It's always gonna be the, it's never gonna be you."}, {"time": 3943, "text": "Man, you have so much faith in the government."}, {"time": 3945, "text": "You have so much faith in tech oligarchs you've never met."}, {"time": 3948, "text": "You have so much faith in the security state that they're gonna always make the right decisions and they're not gonna penalize people that shouldn't be penalized."}, {"time": 3956, "text": "To me, I'm like, wow, I've never had that much faith in any human being ever, including myself."}, {"time": 3962, "text": "I wouldn't want that power."}, {"time": 3963, "text": "I would start deplatforming people that I hate."}, {"time": 3965, "text": "I would deplatform my aunt, you know what I mean?"}, {"time": 3968, "text": "I would deplatform everyone I know."}, {"time": 3970, "text": "I mean, so it's such an insane power to give somebody, like who gets heard, who gets to speak?"}, {"time": 3976, "text": "Yeah, I'm worried about the effect it has on people like you, actually."}, {"time": 3980, "text": "Of being, like everybody's a little more nervous in what they say."}, {"time": 3988, "text": "And that is a big problem."}, {"time": 3990, "text": "Because then you're just like longterm unmasked, like we're talking about."}, {"time": 3993, "text": "It has an effect where people just become more bland."}, {"time": 3997, "text": "Yeah, self censorship, anxiety, all of these things go into it."}, {"time": 4003, "text": "We try to fight it."}, {"time": 4004, "text": "I try to fight it."}, {"time": 4004, "text": "I think I gotta still do what makes me laugh and what makes me laugh is often fucked up."}, {"time": 4009, "text": "And it's often, it's not always fucked up in a way that it's gonna get me thrown off something, but I think pushing certain buttons is funny to me, so I gotta keep doing that."}, {"time": 4020, "text": "Part of the problem is that so many of the lines are blurred, right?"}, {"time": 4023, "text": "So you have comedians that are commentators and commentators that are comedians and politicians."}, {"time": 4028, "text": "So it's harder to get the defense of like, hey, I'm a comedian, leave me alone."}, {"time": 4031, "text": "That defense becomes harder when all of these lines are blurring."}, {"time": 4035, "text": "Everybody's kind of everything now."}, {"time": 4038, "text": "So like people say to me, you should run for office and they're serious and I'm like, you're crazy, but they're serious."}, {"time": 4043, "text": "Like, so the blurring of everything means that people aren't in their lanes as much and that you go, well, this guy is dangerous because he's not just making a joke."}, {"time": 4054, "text": "He's doing something else and he's using humor."}, {"time": 4058, "text": "And I'm like, I'm really not."}, {"time": 4058, "text": "I'm really just trying to make a joke."}, {"time": 4060, "text": "That's all, that's really what I'm trying to do."}, {"time": 4062, "text": "But I do think that because of the flattening, there's a lot of people out there that go, they take aim at humor because they go, humor is where bad ideas can kind of start and flourish."}, {"time": 4074, "text": "But don't you, to put some responsibility on you, don't you think humor is a way to, that you are the modern, like Jordan Peterson style intellectual, that humor is actually a tool of."}, {"time": 4088, "text": "It can be."}, {"time": 4089, "text": "Changing the zeitgeist, changing the social norms."}, {"time": 4090, "text": "It absolutely can be, but it also cannot be."}, {"time": 4092, "text": "I don't think it's any one thing and I think there's a lot of pressure for a comedian."}, {"time": 4097, "text": "You can be funny and right."}, {"time": 4098, "text": "You can be funny and wrong."}, {"time": 4101, "text": "If your goal is to be right, you might end up being right and not funny."}, {"time": 4105, "text": "So the reality is funny has to come first."}, {"time": 4107, "text": "There are brilliant people that have been funny and correct according to people, right?"}, {"time": 4113, "text": "But at the end of the day, people that put way too much faith in what comedy is, most of what comedy is, is people showing up to strip malls and telling jokes for an hour while people eat chicken fingers and they all get drunk and they laugh and they feel a little bit better about their lives."}, {"time": 4128, "text": "That's really the majority of comedy."}, {"time": 4130, "text": "Then there's like 10 famous people that are really famous that do a version of that in an arena."}, {"time": 4135, "text": "But the amount of cultural power they have has always been greatly exaggerated."}, {"time": 4139, "text": "My uncles loved George Carlin, who was anti military industrial complex, anti this, anti that."}, {"time": 4145, "text": "And then they would go vote for Ronald Reagan."}, {"time": 4147, "text": "They didn't care."}, {"time": 4150, "text": "It's not as powerful as you think."}, {"time": 4152, "text": "I wish it was."}, {"time": 4153, "text": "It feels good."}, {"time": 4155, "text": "It feels good for me to say I am the new thing."}, {"time": 4158, "text": "It really isn't."}, {"time": 4159, "text": "It truly isn't."}, {"time": 4160, "text": "No one is, comedians are the people that get on stage and say, we're fucked up."}, {"time": 4164, "text": "We're drug addicts."}, {"time": 4166, "text": "We're sex addicts."}, {"time": 4167, "text": "We're fat."}, {"time": 4168, "text": "We're gross."}, {"time": 4168, "text": "We can't manage our money."}, {"time": 4169, "text": "We can't stop eating."}, {"time": 4171, "text": "We can't stop fucking doing horrible things."}, {"time": 4173, "text": "We're liars."}, {"time": 4173, "text": "We're narcissists."}, {"time": 4174, "text": "We're scumbags."}, {"time": 4175, "text": "We're the people that get out and say that."}, {"time": 4177, "text": "Only a psychopath would look at us and go, show me the way."}, {"time": 4183, "text": "I disagree with you because then I'm a psychopath."}, {"time": 4186, "text": "Well, and that's, I mean, I don't think, no pushback here."}, {"time": 4191, "text": "That's another issue."}, {"time": 4194, "text": "But you know what I'm saying."}, {"time": 4195, "text": "Well, and I don't because, I mean, I understand you using this as a psychological tool for yourself to give yourself freedom."}, {"time": 4203, "text": "But the reality is you are one of the rare comedians like a George Carlin who is, besides being funny."}, {"time": 4210, "text": "When I hear things like that, I'm like, okay, you're being very sweet."}, {"time": 4212, "text": "But like, I agree."}, {"time": 4214, "text": "I understand what you're saying."}, {"time": 4214, "text": "I do stuff that makes, hopefully makes you think."}, {"time": 4217, "text": "I hope that's what good comedy is."}, {"time": 4218, "text": "But I think I try to do that."}, {"time": 4221, "text": "But I also would hate to feel shackled to the idea of that I had to make a point and that point had to be correct."}, {"time": 4231, "text": "I think the best comedy makes fun of everything."}, {"time": 4233, "text": "It makes fun of both sides."}, {"time": 4234, "text": "And then there's a deeper truth about humanity revealed."}, {"time": 4238, "text": "But then what happens is people take that deeper truth and go, let's politicize it."}, {"time": 4242, "text": "But what does he mean?"}, {"time": 4243, "text": "Is it the right or the left?"}, {"time": 4244, "text": "And I'm like, I'm doing something that I think speaks to hopefully people on both sides for everybody."}, {"time": 4249, "text": "Cause I'm making fun of people on the left and the right and in the center and people that don't care and people that do care."}, {"time": 4253, "text": "And I'm trying to figure out a way to do it."}, {"time": 4255, "text": "But then immediately anything of value in this culture right now is like, how do we politicize it?"}, {"time": 4259, "text": "How do we put it in a box?"}, {"time": 4260, "text": "So yes, I think comedy can produce a lot of inherently valuable things, reflective, thoughtful things."}, {"time": 4267, "text": "But then immediately, can it be put in this box where all of those things can be used politically?"}, {"time": 4274, "text": "And unfortunately, like when they say like, comedy is a great way to speak truth to power."}, {"time": 4277, "text": "It is, but I don't know how much it changes things."}, {"time": 4283, "text": "I don't know how much a joke can dethrone a king."}, {"time": 4288, "text": "I know the idea is nice, but let's look at the practical applications."}, {"time": 4294, "text": "I mean, we had brilliant comics, Bill Hicks, George Carlin, Richard Pryor."}, {"time": 4300, "text": "We had people talk about so many problems in society, illustrate them, put a spotlight on them."}, {"time": 4307, "text": "And we still have them."}, {"time": 4308, "text": "They're worse now than they've ever been."}, {"time": 4311, "text": "I think the society is better."}, {"time": 4312, "text": "And so to push back in my perspective, it's very possible that those voices were the exact reason we have the world today, which I do believe is actually, I mean, on the boring old measures of what makes a good world, which is the amount of violence in the world, the amount of opportunity that all those kinds of measures, even happiness, all of those things measured, things have been improving."}, {"time": 4339, "text": "Steven Pinker gets a lot of shit for this, but he's really good at articulating how the data says pretty clearly that the world is getting better."}, {"time": 4346, "text": "And it's arguable that the freedoms we do enjoy currently are thanks to the comedic voices or the people who mock."}, {"time": 4354, "text": "So to me, it's possible that humor is the very thing that saves the world."}, {"time": 4359, "text": "Humor is the very thing that keeps, is the balance of power in the world."}, {"time": 4364, "text": "But I think a lot of the things that those guys criticize, whether it was militarism or the elites, the lying, the corruption, the bribery, that's still going on."}, {"time": 4373, "text": "And it's always gonna go on, right?"}, {"time": 4374, "text": "Because that's the nature of human beings."}, {"time": 4376, "text": "We call it out, we point it out, but we don't have a plan to change."}, {"time": 4381, "text": "It's not really our job."}, {"time": 4382, "text": "And I think that too much now is like, well, comedians should have a, like, I don't tell people who to vote for."}, {"time": 4389, "text": "Like the idea that comedians went and told people who to vote for, it's like, to me, it's crazy."}, {"time": 4393, "text": "I understand like people have strong opinions, but like, I believe I have a job."}, {"time": 4397, "text": "And my job is to make you laugh or whatever, maybe make you think, but like, my job is not to tell you who to vote for."}, {"time": 4403, "text": "I mean, it's absurd."}, {"time": 4404, "text": "But see, the thing you do by the comedy, like on your Twitter, that people should definitely follow."}, {"time": 4410, "text": "I believe that, Jim J. Dillon, I agree with you."}, {"time": 4413, "text": "Oh, on this point of, I agree with you wholeheartedly."}, {"time": 4417, "text": "That people should follow you."}, {"time": 4418, "text": "Yeah, you give me, you give me freedom to think on my own."}, {"time": 4425, "text": "Meaning like you're shaking things up to where I don't feel constrained about what I can think about."}, {"time": 4431, "text": "And that's awesome."}, {"time": 4434, "text": "So you're not telling me what to think, you're giving me the freedom to think."}, {"time": 4437, "text": "And that's what great comedy does, is I don't often agree with George Carlin."}, {"time": 4444, "text": "He can get pretty political sometimes."}, {"time": 4446, "text": "But just the ability to do that's so rare."}, {"time": 4450, "text": "Podcasts do that too now."}, {"time": 4451, "text": "Like there's certain people that can really just challenge you to, even when you disagree with them, to sort of be like, oh, it's okay to think about this kind of stuff."}, {"time": 4459, "text": "Yeah, and I appreciate that, because that's awesome."}, {"time": 4461, "text": "And I mean, that's great."}, {"time": 4463, "text": "And a guy like you, who's a brilliant guy, that's great."}, {"time": 4465, "text": "If I'm giving you the license to think, then man, the world is completely fucked."}, {"time": 4470, "text": "But I'm happy about that."}, {"time": 4472, "text": "No, it's... Well, you know."}, {"time": 4475, "text": "Speaking about the world being completely fucked, Alex Jones turned on QAnon."}, {"time": 4480, "text": "I know almost nothing..."}, {"time": 4481, "text": "It's a very tough match."}, {"time": 4482, "text": "They had a rough marriage."}, {"time": 4483, "text": "They fought it."}, {"time": 4484, "text": "They fought it out for years."}, {"time": 4486, "text": "And eventually we just knew someone was gonna leave someone."}, {"time": 4490, "text": "Hewlett tried to leave him a few months ago."}, {"time": 4492, "text": "Oh, so... Yeah, he was staying at someone else's house."}, {"time": 4495, "text": "The car wasn't in the driveway."}, {"time": 4498, "text": "Well, the thing about QAnon that makes it a lot of fun is it's kind of a make it up as you go along."}, {"time": 4504, "text": "I'm a drug addict, right?"}, {"time": 4506, "text": "So often my lies aren't planned."}, {"time": 4509, "text": "They're in the moment."}, {"time": 4510, "text": "A lot of what I do on the podcast, a lot, you know, it's all in the moment."}, {"time": 4512, "text": "I'll have an idea what I wanna talk about, and I rant and I go."}, {"time": 4514, "text": "And I've been like stoned, and I show up at home, and my parents are like, what's going on?"}, {"time": 4519, "text": "There was $50 on the mantle."}, {"time": 4521, "text": "Now it's not there."}, {"time": 4522, "text": "And I'm like, well, and I gotta make something up on the spot, right?"}, {"time": 4528, "text": "I've been, you know, are you drinking again?"}, {"time": 4533, "text": "And then you gotta have a, well, you were gone for two days."}, {"time": 4535, "text": "No one knows where you were."}, {"time": 4536, "text": "And somebody said you left your car."}, {"time": 4537, "text": "Well, I was at, well, this is, I was at a sales conference and I left my car."}, {"time": 4542, "text": "I flew to Phoenix."}, {"time": 4543, "text": "Like, I understand what that is."}, {"time": 4545, "text": "QAnon is an ever evolving conspiracy theory where the events are happening in the past, in the present, and in the future."}, {"time": 4552, "text": "Every conspiracy theory is like Kennedy, something like that, that there's a lot of truth in that, or all truth."}, {"time": 4557, "text": "But at the end of the day, it's like you're looking back from 30,000 feet, analyzing little things that have already happened."}, {"time": 4562, "text": "QAnon's like, so I think Alex is kind of like got a little tired of the constant evolving nature of that conspiracy theory."}, {"time": 4571, "text": "So he's not a fan of like the jazz that is QAnon."}, {"time": 4574, "text": "So they're not, because they're improvising constantly."}, {"time": 4575, "text": "They're improvising."}, {"time": 4576, "text": "Alex is like, hey man, I was on board a little bit, but at the end of the day, it's getting a little annoying because it can turn on you."}, {"time": 4582, "text": "Eventually you become part of the conspiracy."}, {"time": 4585, "text": "Alex is controlled opposition."}, {"time": 4586, "text": "That's what they'll say."}, {"time": 4587, "text": "Eventually you, because QAnon just eats things."}, {"time": 4591, "text": "So it's a conspiracy that just eats things."}, {"time": 4593, "text": "The minute you start to say, hey man, maybe that's not, it just eats you and go, well, you're in on it."}, {"time": 4598, "text": "Everyone's in on it."}, {"time": 4599, "text": "Everyone's a satanic pedophile."}, {"time": 4601, "text": "Everyone that questions it is eating children."}, {"time": 4603, "text": "And you go, wait a minute, that seems illogical."}, {"time": 4606, "text": "But now there's not enough children."}, {"time": 4608, "text": "Now there's not enough."}, {"time": 4609, "text": "And I think QAnon's over now, unfortunately, because for these people, but I think fortunately for them, they're gonna have to find a new hobby."}, {"time": 4617, "text": "But I think it's over now because even the best QAnon people now are starting to go, hey man, this might not be going down the way we thought."}, {"time": 4623, "text": "But they've literally gone as far as to say that like Biden and Trump switched faces."}, {"time": 4627, "text": "Trump's actually still the president except Biden."}, {"time": 4630, "text": "You have to be a real moron now."}, {"time": 4633, "text": "You gotta be real stupid now."}, {"time": 4636, "text": "It's at the end."}, {"time": 4637, "text": "Like it was cool when the Epstein stuff happened, QAnon was like, it was party at Q."}, {"time": 4642, "text": "And then when the Hunter Biden laptop stuff started to happen, they were like dancing, like it's time."}, {"time": 4648, "text": "And then Biden wins and they're like, wait, whoa."}, {"time": 4654, "text": "And it's just like, it's the day after the party."}, {"time": 4656, "text": "QAnon, if you ever went to a party in high school or college, QAnon right now is the day after the party."}, {"time": 4660, "text": "You wake up, it's 12 noon."}, {"time": 4663, "text": "The sun is hitting you in the face."}, {"time": 4664, "text": "You're hung over."}, {"time": 4665, "text": "There's a stench of disgusting beer and cigarettes all over the house."}, {"time": 4668, "text": "You're like, what the fuck happened here?"}, {"time": 4670, "text": "I gotta get out of here and get a bacon, egg and cheese."}, {"time": 4673, "text": "That's what QAnon is."}, {"time": 4675, "text": "They gotta sober up, get out of that house, get a bacon, egg and cheese and go, man, we were fucking whacked."}, {"time": 4680, "text": "We were high, dude."}, {"time": 4682, "text": "I thought Nancy Pelosi was eating children for four years and that Donald Trump was gonna put her in Guantanamo Bay."}, {"time": 4688, "text": "Wow, that was, cause I mean, it's interesting."}, {"time": 4692, "text": "People had to do that after the sixties."}, {"time": 4694, "text": "They were like, yeah, I just did a bunch of acid and I lived in a ranch in Malibu and fucked everyone I ever saw."}, {"time": 4699, "text": "And they're like, I thought that was the way the world was gonna go and I followed some shaman guy, some guru who just wanted to fuck me and 10 other people that were living there."}, {"time": 4708, "text": "And we did that for three years."}, {"time": 4710, "text": "Apparently we never created the utopia we thought we were gonna have."}, {"time": 4713, "text": "And now I'm back working here at Allstate Insurance and we have great policies and we'd love you to come in the office so we can break them down for you."}, {"time": 4722, "text": "It all ends folks, all the love, all the bullshit ends, but it's fun, they have so much fun."}, {"time": 4727, "text": "QAnon was hard to get mad at because they were, this was all they had."}, {"time": 4733, "text": "Yeah, and they were quite good at it."}, {"time": 4736, "text": "And they were good at it and it was a lot of desperate people, but they were also rich idiots."}, {"time": 4742, "text": "There's also like dumb rich people and those are like the saddest people in Q cause it's like they should, they have the resources to do other things, but they just love Q."}, {"time": 4753, "text": "They're like, I'm just into this."}, {"time": 4754, "text": "And I'm like, you're rich, go do something."}, {"time": 4758, "text": "How in curious are you?"}, {"time": 4760, "text": "Go to the Amazon, go bird walk."}, {"time": 4763, "text": "I don't know, but they're, you know, so."}, {"time": 4765, "text": "Play golf."}, {"time": 4765, "text": "It's sad, but they're like done now."}, {"time": 4766, "text": "I mean, it's over."}, {"time": 4769, "text": "I see you think this is the."}, {"time": 4771, "text": "I think everything's ending."}, {"time": 4771, "text": "My whole thing is that Trump's out, QAnon's over, the quarantine is gonna end."}, {"time": 4775, "text": "Everything's gonna go back to something that's more recognizable."}, {"time": 4780, "text": "I think that."}, {"time": 4782, "text": "Are you optimistic about the 2021 and what."}, {"time": 4784, "text": "To a degree in certain aspects, I have optimism."}, {"time": 4788, "text": "And then I have, I have short term optimism and longterm pessimism."}, {"time": 4792, "text": "Meaning that I think in the short term, things can get better."}, {"time": 4795, "text": "I think longterm, because there's so many forces that are out of our control that are evolving in ways I barely understand that are carving up society."}, {"time": 4802, "text": "It's gonna be very tough longterm to be completely optimistic."}, {"time": 4807, "text": "Like, Hey, it's gonna be great."}, {"time": 4808, "text": "It's gonna be good forever."}, {"time": 4809, "text": "But short term, I think, yeah, this quarantine will end."}, {"time": 4812, "text": "Things will get better."}, {"time": 4812, "text": "The economy will get a little better."}, {"time": 4814, "text": "The constant Trump craziness will die down a little bit."}, {"time": 4818, "text": "That's my hope."}, {"time": 4819, "text": "And people can go back to focusing on things that matter, which is the things that are near you and close to you."}, {"time": 4826, "text": "Yeah, the humans around you."}, {"time": 4827, "text": "Humans around you, not Nancy Pelosi."}, {"time": 4830, "text": "I have uncles that talk about Nancy Pelosi."}, {"time": 4832, "text": "I'm like, you've never met her."}, {"time": 4833, "text": "You'll never meet her, shut up."}, {"time": 4836, "text": "And I have a belief that this kind of local love and kindness that you naturally can have for human beings that you actually know can be expanded at scale through the social networks that we use, that we build."}, {"time": 4852, "text": "Twitter is currently failing at that miserably."}, {"time": 4854, "text": "That would be great."}, {"time": 4855, "text": "But that's..."}, {"time": 4856, "text": "If we were able to increase the love through the social networks, that would be great."}, {"time": 4860, "text": "It feels very hard to."}, {"time": 4863, "text": "It's a worthy challenge."}, {"time": 4864, "text": "You've tweeted, one of the underreported reasons conspiracy theories take hold is because some of them are true."}, {"time": 4873, "text": "What conspiracy theories do you believe that are sort of important for people to think about, would you say?"}, {"time": 4884, "text": "Kennedy was not killed by a lone gunman with no connections to any other situation, government."}, {"time": 4891, "text": "I believe that JFK was removed from office by a group of people that had very different interests."}, {"time": 4901, "text": "This is the question of like deep state."}, {"time": 4902, "text": "So these are powerful people that are able now to dictate through basically the threat of violence what the presidents, the surface powerful people in our society."}, {"time": 4913, "text": "Yeah, I mean, again, I'm not..."}, {"time": 4915, "text": "I want another investigation into 9 11, not because I think that George Bush pressed a button and made 9 11 happen, but because we invaded the country of Iraq."}, {"time": 4923, "text": "And then we, 15 out of 19 hijackers were from Saudi Arabia."}, {"time": 4929, "text": "There was tons of stuff in the 9 11 report that didn't make sense to anybody."}, {"time": 4932, "text": "There's tons of stuff about that day that I feel like we just don't know."}, {"time": 4936, "text": "Yeah, that's..."}, {"time": 4938, "text": "That's when I, my little aunt life touched upon conspiracy theory world and first learned about Alex Jones is when 9 11 happened."}, {"time": 4947, "text": "It was very frustrating to me how poorly the reporting and the transparency around what exactly happened, who knew what, all that kind of a basic information that you would hope the government would release, reveal, and use as like a lesson for how we prevent this."}, {"time": 4965, "text": "Instead, it felt like a lot of stuff was being hidden in order to manipulate some kind of machine that leads us to war."}, {"time": 4974, "text": "Yeah, I mean, I just don't feel like we've gotten the full story."}, {"time": 4977, "text": "I don't know what the full story is."}, {"time": 4978, "text": "I can't, I don't know what it is, but I don't feel like we've gotten the full story."}, {"time": 4982, "text": "Yeah, there are groups of powerful pedophiles, right?"}, {"time": 4986, "text": "Whether they're in the Catholic church or they're in the government or wherever they are, they are able to cover things up that they do."}, {"time": 4991, "text": "They're able to silence people that try to out them in terms of like, you know, disrupt their operations."}, {"time": 4996, "text": "QAnon has nuggets of truth."}, {"time": 4998, "text": "It just went crazy."}, {"time": 5000, "text": "Any conspiracy theory that involves the Knights Templar and also Chrissy Teigen is probably wrong, you know?"}, {"time": 5007, "text": "What's the Knights Templar?"}, {"time": 5008, "text": "Well, it was just this group of Knights back in the day."}, {"time": 5012, "text": "You know, it's that supposedly secret meetings."}, {"time": 5014, "text": "And like in every conspiracy, they talk about like, you know, if you go deep enough, it's like the Knights Templar, the Rosicrucians, you know, all of these secret groups throughout history, the Illuminati, the... Oh, and there's a thread that connects all of this."}, {"time": 5026, "text": "Oh yes, it connects it all to David Spade."}, {"time": 5029, "text": "I mean, it's a little much."}, {"time": 5030, "text": "Well, how do you, if you're David Spade, defend yourself, by the way?"}, {"time": 5033, "text": "You ignore it because it's hilarious."}, {"time": 5034, "text": "And I know David Spade."}, {"time": 5035, "text": "It's like Hollywood's kind of boring."}, {"time": 5037, "text": "Yes, there are sex orgies."}, {"time": 5038, "text": "I'm not invited."}, {"time": 5039, "text": "I'm sure there's shit going on."}, {"time": 5040, "text": "Kids do get abused, women get abused."}, {"time": 5042, "text": "I'll invite you to one."}, {"time": 5043, "text": "Please, we got the $75,000 dog and then we'll get one."}, {"time": 5048, "text": "But, you know, me and David Spade, we go out to sushi restaurants, like, and you sit there and you listen to people complain."}, {"time": 5055, "text": "That's what a lot of it is."}, {"time": 5056, "text": "What a lot of Hollywood is is deeply sad tragedy that people don't understand that some of it is nefarious and dark and there are problems and there are real power brokers here."}, {"time": 5066, "text": "It's a dark town, 100%."}, {"time": 5069, "text": "But the idea that everybody that lives here is in some wide ranging vast conspiracy isn't true."}, {"time": 5074, "text": "It ignores how humdrum, boring, deeply sad most people's lives are in Hollywood."}, {"time": 5081, "text": "And it ignores how sad fame is in general."}, {"time": 5084, "text": "Fame's a sad thing."}, {"time": 5086, "text": "Not always, but a lot of times it's a sad thing."}, {"time": 5089, "text": "It's fleeting, it's ephemeral, it doesn't last."}, {"time": 5092, "text": "It separates you from other people."}, {"time": 5095, "text": "It's isolating."}, {"time": 5097, "text": "It can be traumatic depending on what's going on."}, {"time": 5099, "text": "Obviously it's better than the alternative."}, {"time": 5101, "text": "If you're trying to be famous, it's better to be famous than not famous, right?"}, {"time": 5106, "text": "But it's a mixed bag to a degree."}, {"time": 5109, "text": "There are things about it that aren't great."}, {"time": 5111, "text": "And Hollywood has a deep undercurrent of sadness of people that have not realized their dreams and people that have realized them."}, {"time": 5118, "text": "Both of those people."}, {"time": 5121, "text": "The people that win Olympic gold medals can sometimes suffer from depression."}, {"time": 5125, "text": "They've lost."}, {"time": 5126, "text": "Well, somebody said, and I forget who said it, it's a great quote, it's not mine."}, {"time": 5129, "text": "I think it's from a book, or it might be from a TV show."}, {"time": 5131, "text": "Sometimes I quote something and they're like, \"'That's from like, Charlotte's Web.\""}, {"time": 5135, "text": "I'm like, oh."}, {"time": 5136, "text": "The two worst things are, oh, I think it's from the movie Limitless."}, {"time": 5139, "text": "I'm like an idiot."}, {"time": 5140, "text": "But anyway, thanks for having me on."}, {"time": 5142, "text": "Tomorrow you're gonna make some genius."}, {"time": 5143, "text": "I will not publish this."}, {"time": 5146, "text": "It's from the movie, and I think he says, \"'The two worst things in the world are not good.\""}, {"time": 5150, "text": "Oh, you know what's not from Limitless?"}, {"time": 5152, "text": "I think it's from the movie where Nicolas Cage sold weapons."}, {"time": 5158, "text": "It was called Lord of War."}, {"time": 5159, "text": "It's a little better than Limitless."}, {"time": 5160, "text": "That's a good movie."}, {"time": 5161, "text": "It's a great movie."}, {"time": 5162, "text": "He said, the two worst things in the world are not getting what you want and getting it."}, {"time": 5166, "text": "So the undercurrents of sadness that run through Hollywood are, there are two rivers that converge, and there are people that just never had it, and people that have it and go, now what?"}, {"time": 5174, "text": "And so it's a sad place, a tragic place."}, {"time": 5176, "text": "And there's a lot of, it's boring."}, {"time": 5177, "text": "That's what people don't realize is like, it's actually kind of boring."}, {"time": 5180, "text": "Well, life is kind of boring."}, {"time": 5181, "text": "Life is kind of boring."}, {"time": 5182, "text": "But there's also like, you know, so I think QAnon's this way to make a lot of it seem like it's super exciting."}, {"time": 5188, "text": "And listen, I don't want to diminish the experiences of people who've been abused here, because there is a lot of horror here."}, {"time": 5193, "text": "But the whole QAnon thing was like, everybody in everything is doing, and that's not true."}, {"time": 5198, "text": "Well, see, just to linger on that a little bit is, Bill Gates, the conspiracy theories around Bill Gates bother me because, this is me, dumb, naive Lex, thinks that Bill Gates did a lot of good for this world."}, {"time": 5214, "text": "First, by creating a company that empowered personal computers."}, {"time": 5218, "text": "And second, by donating a ton of money for like treating malaria in Africa and all those kinds of things."}, {"time": 5226, "text": "And there's these huge amounts of conspiracies, I think, based on like just replies to whenever Bill Gates does anything."}, {"time": 5235, "text": "Like, to me, the top replies should be about how inspiring that guy is, to donate so much money."}, {"time": 5242, "text": "And so sorry to, the thing I'm struggling with is, if I'm Bill Gates, like, how do you behave differently?"}, {"time": 5252, "text": "How do you show people that you're, if you're not, I don't know, doing creepy stuff that they're saying he's doing?"}, {"time": 5258, "text": "Well, I think part of it is that he's done some really good stuff, right?"}, {"time": 5262, "text": "He's an innovative guy, he's on the vanguard of a lot of things, but he's also the antichrist."}, {"time": 5267, "text": "And I think that that is, you know, they're not mutually exclusive."}, {"time": 5271, "text": "He is the prince of darkness, as well as some, no."}, {"time": 5274, "text": "Here's my deal with Bill Gates."}, {"time": 5275, "text": "He's a Batman villain billionaire, meaning that he's not a villain, but he's got all this money, right?"}, {"time": 5279, "text": "Here's the thing, and I love Musk and all these guys, I know you love these guys."}, {"time": 5282, "text": "Listen, when you have the kind of money that these guys have and you have the vision that they have, and they want society to look a certain way, and a lot of them are doing great things, people, they need to get better at the pushback."}, {"time": 5293, "text": "They need to get a little better."}, {"time": 5294, "text": "When somebody says, hey man, what's going on over there?"}, {"time": 5296, "text": "Bill Gates needs to be a little better at going, here's what, because, you know, Bill Gates has the money."}, {"time": 5303, "text": "You know, I think once he wanted to shoot a missile of dust at the atmosphere to help global warming, and a lot of scientists were like, hey man, that might not be the way to do it."}, {"time": 5311, "text": "But no one in history, like so few people in history have had the resources to even have that thought, that if you have the resources to have that thought, and you have designs on the way you want society to look, whether it's public health policy or vaccinations, whatever, you have to get a little better at dealing with legitimate critiques."}, {"time": 5326, "text": "And obviously you're not defending yourself against people that say you're the Antichrist, but like, you need to get a little better."}, {"time": 5331, "text": "And I feel like Bill Gates and some of those people at that level are like, ugh, PR is kind of like, you know."}, {"time": 5337, "text": "They're terrible at it."}, {"time": 5340, "text": "Him and Zuckerberg are really bad at it."}, {"time": 5341, "text": "Zuckerberg's horrible at it."}, {"time": 5342, "text": "He seems especially bad at public."}, {"time": 5348, "text": "Yeah, and it makes me feel so bad because the problem with being a billionaire is you lose touch with reality if you're not careful."}, {"time": 5356, "text": "I think Elon is good at, at least so far, maintaining touch with reality."}, {"time": 5362, "text": "No, if you look at the name of his child, you can clearly see."}, {"time": 5365, "text": "Listen, I do like him, and I do think what he's done with Tesla, you know, my producer has a Tesla, and he never shuts up about it."}, {"time": 5371, "text": "Most people that have Teslas never shut up about them, and they think they're part of the development team at SpaceX, and I like that he's created a world where people can get excited about a $37,000 car and never shut the fuck up about it to the point where I have to threaten people with physical violence to get them to stop telling me about that their car drives itself."}, {"time": 5390, "text": "Oh, you should get a Tesla."}, {"time": 5391, "text": "Maybe have a few less drinks and a few fewer Vicodin, and you can drive yourself."}, {"time": 5395, "text": "Have you thought about getting a Tesla?"}, {"time": 5397, "text": "I've never thought about it."}, {"time": 5397, "text": "You should get a Tesla."}, {"time": 5398, "text": "I don't like them, they're minimalist."}, {"time": 5399, "text": "I don't like, I want more."}, {"time": 5402, "text": "I want more."}, {"time": 5403, "text": "Get the Cybertruck."}, {"time": 5404, "text": "I want a Cybertruck."}, {"time": 5404, "text": "I'm just being a, trolling you by being a salesman."}, {"time": 5407, "text": "My producer wants a Cybertruck."}, {"time": 5409, "text": "I want a stagecoach."}, {"time": 5410, "text": "Old school, stagecoach, horse thief shit."}, {"time": 5415, "text": "It's going back to that."}, {"time": 5416, "text": "I live in an area with a lot of horses."}, {"time": 5418, "text": "It's going back to like whipping a horse."}, {"time": 5420, "text": "I want an animal to shriek while I go by."}, {"time": 5422, "text": "You want more suffering in the world, not less."}, {"time": 5427, "text": "Oh, I think we need it."}, {"time": 5428, "text": "Okay, but I just don't like that billionaire is a bad word."}, {"time": 5433, "text": "And it's not necessarily, not every billionaire is a pedophile."}, {"time": 5437, "text": "I know, but the problem is a lot of like, it's just, you know, Epstein was very smart at like just getting people at that house and taking photos of them."}, {"time": 5444, "text": "Nobody knew what they were doing, but it's like, it was one of those things where it's like, Epstein was the most social guy ever."}, {"time": 5449, "text": "Like every photo he's like, hey, and it's like everyone that's ever done anything in the world has been at that fucking island."}, {"time": 5457, "text": "Every human being is like in a photo."}, {"time": 5459, "text": "It's just weird, like I'm in, like it's funny me and my friends get together."}, {"time": 5462, "text": "We don't ever take photos, right?"}, {"time": 5464, "text": "Like last night, a few people, it was my birthday yesterday, I'm 17."}, {"time": 5467, "text": "And my friends came over and we're just eating dinner, right?"}, {"time": 5471, "text": "And we had a fun night, and just four people that are over, nobody, right?"}, {"time": 5474, "text": "Nobody ever thought like, let's, hey, I wanna remember it."}, {"time": 5478, "text": "Let's take photos, I'm 36, woo!"}, {"time": 5481, "text": "But everything Epstein did, there's just photos of everybody, it's interesting."}, {"time": 5486, "text": "Do you think Jeffrey Epstein killed himself?"}, {"time": 5489, "text": "No, I think he was killed by that guy, that guy that they put in his cell, that lunatic, who was that big muscled guy."}, {"time": 5498, "text": "I think he was just, he did it for money, kept his mouth shut."}, {"time": 5502, "text": "Money from whom do you think?"}, {"time": 5503, "text": "Mossad, MI6, CIA, all three."}, {"time": 5507, "text": "So there's a lot of pressure from a lot of different powerful people."}, {"time": 5509, "text": "Probably Mossad, CIA more."}, {"time": 5512, "text": "I mean, it seems very clear that he was working inside of a honeypot intelligence operation."}, {"time": 5517, "text": "Ghislaine Maxwell's father was an Israeli super spy."}, {"time": 5521, "text": "Ghislaine Maxwell's working for Israeli intelligence."}, {"time": 5523, "text": "It would be odd to think, and of course the CIA knows about everything that Israeli intelligence is doing with Americans."}, {"time": 5528, "text": "So I would think that it's a very cozy relationship with those two intelligence agencies."}, {"time": 5533, "text": "And I think if you ran it by anyone, I think if you ran it by French intelligence, they'd go, yeah, no, get him."}, {"time": 5539, "text": "I don't think there was any intelligence service in the world whose job is to protect the powerful people that live in their countries that was against him getting whacked."}, {"time": 5547, "text": "But do you think it's possible that he's just an evil person who is after manipulating people and also was a pedophile?"}, {"time": 5553, "text": "So that there's a bigger thing."}, {"time": 5556, "text": "It's not factual that there's a bigger thing."}, {"time": 5557, "text": "Evil people don't get handed."}, {"time": 5559, "text": "Those are your facts, Tim Dillon."}, {"time": 5560, "text": "No, there's the facts of the case."}, {"time": 5562, "text": "You don't get handed a 65."}, {"time": 5564, "text": "Show me another evil guy who was handed a $65 million place by Les Wexner."}, {"time": 5570, "text": "Show me another evil guy that got that type of a handshake deal where he was basically let off without anything after a judge had made a very sweetheart deal for him after he was accused of molesting a 14 year old."}, {"time": 5586, "text": "Show me another evil guy that doesn't have that kind of backing that has those types of friends, those connections, those types of properties."}, {"time": 5593, "text": "Show me multiple passports all over the world."}, {"time": 5596, "text": "So show me a guy without anyone backing him that's doing it."}, {"time": 5600, "text": "Why did they, so you think he's just an evil guy who is doing this for whom is his own just shits and giggles."}, {"time": 5606, "text": "He's just getting off on it."}, {"time": 5608, "text": "Human nature, yeah."}, {"time": 5609, "text": "Human nature, huh?"}, {"time": 5610, "text": "It's human nature."}, {"time": 5611, "text": "$70 million limestone mansion."}, {"time": 5613, "text": "I'm being visibly mocked."}, {"time": 5614, "text": "Yeah, is it human nature?"}, {"time": 5616, "text": "And it's like poetry."}, {"time": 5617, "text": "I don't think it's human nature."}, {"time": 5618, "text": "I think they manipulated human nature, but I think they did it."}, {"time": 5623, "text": "I think JustLane, I think Epstein was really just a functionary and I think JustLane was kind of a pimp and Epstein was kind of a guy that made the money okay and hid money and things like that and worked for a lot of powerful people."}, {"time": 5636, "text": "I don't believe in lone pedophiles anymore."}, {"time": 5640, "text": "I don't even believe that."}, {"time": 5641, "text": "If you're a pedophile, you're like in a group."}, {"time": 5647, "text": "Well, I'm not even going there, but staying on JustLane, so you believe there's some power in her."}, {"time": 5653, "text": "What do you think happens to her now?"}, {"time": 5655, "text": "Like what are the differences?"}, {"time": 5657, "text": "I mean, I don't know what'll happen to her, but I imagine she'll get some type of deal, closed door thing years from now when people don't really care about the case and she'll serve some time in a very lax thing or she'll be killed."}, {"time": 5671, "text": "I mean, again, it's like if she was doing what she was doing, which is I believe a fact that she was compromising powerful people so that they could be blackmailed by the intelligence services of the US and Israel, probably, I don't see how she wasn't doing that."}, {"time": 5691, "text": "Someone's black, someone's using the photos and the tapes, right?"}, {"time": 5695, "text": "Someone's using that against these people."}, {"time": 5697, "text": "Someone wants to control these people."}, {"time": 5699, "text": "Well, who and why?"}, {"time": 5700, "text": "That's the real question."}, {"time": 5702, "text": "And I think the real question is you wanna exert control over congressmen and senators and presidents because they have the power to make decisions to affect the, but the CIA just works for a lot of very wealthy people."}, {"time": 5715, "text": "That's what the CIA, so how the CIA started, right?"}, {"time": 5718, "text": "It was lawyers, bankers."}, {"time": 5719, "text": "They're protecting financial interests of multinational corporations all over the world, overthrowing democratically elected governments, going in and doing subterfuge campaigns, encouraging terror."}, {"time": 5730, "text": "They were doing all kinds of crazy stuff."}, {"time": 5731, "text": "I don't see why that would change."}, {"time": 5733, "text": "I think that's who they still represent."}, {"time": 5734, "text": "And I think those people want certain policies and certain people pushed forward."}, {"time": 5740, "text": "And I think those people are controlled."}, {"time": 5742, "text": "And I think one of the ways to control people is their sexual problems."}, {"time": 5746, "text": "And that's the way they did it."}, {"time": 5749, "text": "I wish there was a way to, because everything you just said now is."}, {"time": 5754, "text": "It makes a lot of sense, doesn't it?"}, {"time": 5756, "text": "I'm being indoctrinated on air."}, {"time": 5760, "text": "You think there's just a, Jeff Ramsey is just a fun, random guy who just wanted to make home movies of presidents?"}, {"time": 5768, "text": "Well, you think I'm just some random guy."}, {"time": 5769, "text": "I'm just trying to sell myself as somebody who's friendly with the American audience."}, {"time": 5774, "text": "I believe you are backed by people that want people to be more comfortable with robot dogs."}, {"time": 5780, "text": "I believe that."}, {"time": 5781, "text": "I believe you're pushed to be the happy face of AI."}, {"time": 5783, "text": "Which is why I will edit this part."}, {"time": 5784, "text": "They shouldn't pick the happier face."}, {"time": 5788, "text": "No editing."}, {"time": 5788, "text": "Joe Rogan's rule, no editing."}, {"time": 5790, "text": "This is live."}, {"time": 5791, "text": "No, I mean, I wish there was a way to, for some of the conspiracy theories, to prove that that's not the case."}, {"time": 5797, "text": "Like what the CIA is."}, {"time": 5799, "text": "There is some possibility in my mind that institutions like the CIA and different kinds of organizations are driven less by organized malevolence and more by just incompetence."}, {"time": 5814, "text": "Just bureaucracy, being incompetent."}, {"time": 5816, "text": "I think that argument gets less and less persuasive when you look at all the things they've been able to do."}, {"time": 5823, "text": "It's very certain, just like you said, that there's a bunch of them that have done, because there's some conspiracy theories that are dramatic and true."}, {"time": 5834, "text": "The question is, I wish there was a way to prove that some of them are not."}, {"time": 5839, "text": "And it's very difficult, because so much is shrouded in mystery."}, {"time": 5842, "text": "Like one of the things I'm bothered by is when people accuse other athletes of using steroids, for example."}, {"time": 5848, "text": "And it's just, yes, a lot of people use steroids, but it sucks that people just don't believe you."}, {"time": 5855, "text": "There's some incredible athletes that look shredded, that look just incredible performers, and everybody just says that they're on steroids."}, {"time": 5863, "text": "They kind of assume."}, {"time": 5864, "text": "Yeah, I mean, and people accuse me all the time of being on performance enhancing drugs and steroids."}, {"time": 5870, "text": "And it is hard, but what I remind them is, it's what my appearance is a result of dedication."}, {"time": 5878, "text": "But no, it's hard work, diet, exercise, dedication."}, {"time": 5882, "text": "Are you on keto?"}, {"time": 5884, "text": "I'm on, I'm on keto."}, {"time": 5885, "text": "I'm doing a version of, you're keto, right?"}, {"time": 5888, "text": "So I'm doing a version of keto right now with Brad."}, {"time": 5891, "text": "And it's, do you see what I mean?"}, {"time": 5893, "text": "You carb up in order to be able."}, {"time": 5895, "text": "So it's keto with sugar."}, {"time": 5896, "text": "It's called keto plus sugar."}, {"time": 5898, "text": "And it's a good diet for, I grew up in the 90s when nobody ever lost weight sadly, because every diet was like, you can eat what you want, just be accountable."}, {"time": 5908, "text": "No one even knew what that meant."}, {"time": 5910, "text": "So it would be like my mother being like, if you have chocolate chip pancakes, have a glass of water."}, {"time": 5915, "text": "Just take a walk around the block."}, {"time": 5917, "text": "You can go to McDonald's three times a day."}, {"time": 5920, "text": "Just walk around the block."}, {"time": 5921, "text": "It's what my parents used to say."}, {"time": 5922, "text": "My mother would be like, just walk around the block."}, {"time": 5924, "text": "You're fine."}, {"time": 5926, "text": "Gonna have a cigarette?"}, {"time": 5927, "text": "Walk 20 steps, walk 20 steps back."}, {"time": 5930, "text": "It's exercise."}, {"time": 5931, "text": "So, you know, there's too many conspiracies out there."}, {"time": 5934, "text": "A lot of them aren't true."}, {"time": 5935, "text": "A lot of them are bitter, angry people trying to justify their own impotence, not being able to do anything in life."}, {"time": 5941, "text": "And they're like the people that have done something in life, they're all nefarious."}, {"time": 5944, "text": "It's all, the car just attacked against me."}, {"time": 5945, "text": "That's 100% true, 100%."}, {"time": 5948, "text": "It attracts usually people that have not figured out a way to succeed or haven't succeeded on the level that they want to."}, {"time": 5957, "text": "But that also being true, there is a fair amount of fuckery going on and provable."}, {"time": 5965, "text": "And, you know, we just have to, I think, separate, know that these things are often inflated or not true, but know that sometimes they are true."}, {"time": 5976, "text": "Otherwise it wouldn't exist."}, {"time": 5977, "text": "If there was no, if there was nothing to JFK, there was nothing to 9 11, if people felt like they were being dealt with honestly, this wouldn't exist."}, {"time": 5987, "text": "I mean, this exists because there are real questions that people have that don't get answered for whatever reason."}, {"time": 5993, "text": "And then the vacuum of the refusal to answer those questions, that information vacuum is filled with people like Alex Jones, who are curious and sometimes they're right and sometimes they're horribly wrong."}, {"time": 6005, "text": "And sometimes they're all over the place."}, {"time": 6007, "text": "And they're good storytellers and people love stories."}, {"time": 6009, "text": "And then when there's an absence of actual."}, {"time": 6011, "text": "Alex is a uniquely American person, like a very interesting, I don't know how many countries, like how many people make a living as a conspiracy theorist, a good living in other countries, right?"}, {"time": 6020, "text": "It's very rare, right?"}, {"time": 6021, "text": "I mean, it's very interesting."}, {"time": 6022, "text": "And he became like, I know people that knew him when he was a kid, because I'd go to Austin and perform a lot."}, {"time": 6027, "text": "And he was a guy that would take a bullhorn and yell at cops because he thought DEI checkpoints were unconstitutional."}, {"time": 6032, "text": "That's what he was doing in college."}, {"time": 6033, "text": "And he's just went through, he was hated by the right."}, {"time": 6035, "text": "He was hated by the Bush people."}, {"time": 6037, "text": "He was hated by them."}, {"time": 6038, "text": "And he went from being this guy that was considered like a leftist even, like even though he was never a leftist, he was considered this like enemy of mainstream conservatism."}, {"time": 6050, "text": "Like he was not considered a guy that wasn't a patriot, wasn't this, wasn't that."}, {"time": 6055, "text": "And he just, wow, like he whines and whines and ends up just being this confidant of a Republican president, very divisive Republican president."}, {"time": 6064, "text": "And he becomes this populist and everything like that."}, {"time": 6066, "text": "It's really wild to watch that."}, {"time": 6068, "text": "But I mean, I do think he should retire eventually just so we could get some, I don't know, it seems like it's a lot to keep doing."}, {"time": 6074, "text": "Well, I hope this world allows for Alex Jones to continue having a voice because just like you said, he's a, use the word fun, but really he shakes up the norms of our discourse."}, {"time": 6088, "text": "I do too."}, {"time": 6089, "text": "I do think we need to put more value."}, {"time": 6090, "text": "I think entertainment, we do need to say that like there are people that should be allowed to have a voice for entertainment purposes."}, {"time": 6098, "text": "And that's part of what Donald Trump, now that he's not the president, come on, let the guy, let him talk."}, {"time": 6106, "text": "Who do you think is the best comedian of all time?"}, {"time": 6109, "text": "Oh, that's a great question."}, {"time": 6110, "text": "Greatest of all time."}, {"time": 6113, "text": "You mentioned Carlin, your uncle's liking Carlin."}, {"time": 6118, "text": "Well, Carlin is great."}, {"time": 6120, "text": "Carlin is really hard to argue with, but Chappelle is also really great."}, {"time": 6128, "text": "Louis C.K."}, {"time": 6128, "text": "is really great."}, {"time": 6131, "text": "I don't know that there's what Joan Rivers is great."}, {"time": 6135, "text": "You smile at that."}, {"time": 6136, "text": "Well, she's a beast of a comic."}, {"time": 6138, "text": "I'm not aware of her standup actually."}, {"time": 6139, "text": "She's a beast of a comic."}, {"time": 6140, "text": "Ask Rogue and ask any of them."}, {"time": 6143, "text": "Kennison's great."}, {"time": 6144, "text": "So what makes a great comic do you think in the history of comedy?"}, {"time": 6149, "text": "Just like that."}, {"time": 6149, "text": "Said something at the moment in a way, found a way to communicate with people in the funniest possible way at that moment and illustrated larger truths about life in what they did."}, {"time": 6164, "text": "And I think that guys like Louis and Chappelle and Pryor and Kennison and Hicks, people like Joan Rivers have done that."}, {"time": 6173, "text": "And even modern people, people like Maria Bamford's an amazing comedian."}, {"time": 6177, "text": "It's just a different style of comedy per se, but she's an amazing comedian."}, {"time": 6183, "text": "Cat Williams is an amazing comedian."}, {"time": 6185, "text": "He really is."}, {"time": 6186, "text": "Does he have any, was he the one of the things you kind of mentioned, the communities you mentioned, they were kind of fearless in saying the difficult things that needs to be said."}, {"time": 6195, "text": "Cat Williams is more, I don't remember his comedy, but I think it's just more wild out there."}, {"time": 6200, "text": "Well, to an extent that you can watch it."}, {"time": 6201, "text": "He's got stuff."}, {"time": 6202, "text": "He talks about stuff."}, {"time": 6203, "text": "He talks about race brilliantly."}, {"time": 6204, "text": "He talks about America brilliantly."}, {"time": 6206, "text": "No, I think there's a lot of stuff there."}, {"time": 6208, "text": "Of course, Chris Rock."}, {"time": 6209, "text": "Of Chris Rock, of course."}, {"time": 6210, "text": "It's so hard."}, {"time": 6211, "text": "You can't really pick one."}, {"time": 6212, "text": "You just gotta, there's a class of people that throughout this history of this business, which is not that long of a history."}, {"time": 6218, "text": "It's pretty much within the last century, that have been really influential."}, {"time": 6224, "text": "Sometimes it's style, the way they deliver things."}, {"time": 6227, "text": "Sometimes it's substance of how they, what they're saying, or sometimes it's just a style of what they're saying."}, {"time": 6232, "text": "And we're only talking about standup comedians, right?"}, {"time": 6235, "text": "So there's a million great comedians."}, {"time": 6236, "text": "If we're gonna talk about Jim Carrey and Adam Sandler and Chris Farley, these are brilliant."}, {"time": 6241, "text": "And those guys are bigger influences on comedy, I think, than standups, really, truly."}, {"time": 6246, "text": "So there's so many brilliant people in the business."}, {"time": 6249, "text": "Who was, for you, influential, just early on?"}, {"time": 6252, "text": "Hicks was influential, because I'd watch Bill Hicks, and I'd be like, this guy's saying crazy shit on stage, and this is the only way he can get away with it, is because it's so funny."}, {"time": 6260, "text": "And he was calling out the military industrial complex, and he was talking about the first Gulf War."}, {"time": 6265, "text": "I remember he said a joke that I heard."}, {"time": 6267, "text": "It made me sit up straight, and he goes, he was in Canada, and he said, we had a war in the States."}, {"time": 6271, "text": "He was talking about the first Gulf War."}, {"time": 6273, "text": "And he said, I was in the unenviable position of being for the war, but against the troops."}, {"time": 6278, "text": "And to me, I love that joke."}, {"time": 6280, "text": "It was so funny to me, and I was like, oh, you can't get away with that anywhere other than standing on a stage."}, {"time": 6286, "text": "You couldn't ever say that in an office, really."}, {"time": 6288, "text": "And this was before, like, it was like PC, and they said, the other thing, I always knew that comedians had to say shit and have it be funny enough that you couldn't get away with it in polite society."}, {"time": 6299, "text": "That was why it was a dark theater or a dark nightclub."}, {"time": 6302, "text": "That's when people had a few drinks."}, {"time": 6303, "text": "That's what the art form was, and that's why."}, {"time": 6306, "text": "So a guy like that was influential because I started watching him."}, {"time": 6309, "text": "And then, of course, I loved SNL when I was a kid, and I would watch Chris Farley, and I would watch people like even John Belushi going back in the day, but I'd watch Adam Sandler and Will Ferrell and all these guys."}, {"time": 6320, "text": "I mean, there's so many funny people, but Bill Hicks was kind of funny."}, {"time": 6324, "text": "And then Patrice O Neill was probably my favorite comedian who's made me laugh more than anybody else."}, {"time": 6329, "text": "So I think it was you, actually, that maybe on your podcast, we're talking about Patrice O Neill and that he was actually vicious to others."}, {"time": 6340, "text": "I think he was a little mean to other people, but he was very good to people that he liked, I guess."}, {"time": 6344, "text": "I think he was like not, I mean, he wasn't, and I've never met him."}, {"time": 6347, "text": "I have no inside info, but from what I've heard, he was like no nonsense guy, right?"}, {"time": 6351, "text": "He just said what he wanted to say."}, {"time": 6353, "text": "But I think in terms of comedians, I don't know of anyone funnier than Patrice O Neill who said, in modern times, that said more about our society than him."}, {"time": 6363, "text": "I mean, he was just a brilliantly funny guy."}, {"time": 6365, "text": "On the radio, he was funny."}, {"time": 6366, "text": "On his specials, he was funny."}, {"time": 6368, "text": "Everywhere, he was funny."}, {"time": 6370, "text": "And there's something else to be said about the whole medium of comedians doing podcasts."}, {"time": 6375, "text": "Because it unlocks a weird, special, new thing that changed everything."}, {"time": 6380, "text": "I mean, Rogan started with that."}, {"time": 6382, "text": "You're doing that."}, {"time": 6385, "text": "I think that's a whole nother form of like standups, the ones that have a lot to say."}, {"time": 6391, "text": "Almost like we get to witness the process of the creation of the jokes in a way, or the mind."}, {"time": 6399, "text": "The sort of the evolution of the mind behind the jokes."}, {"time": 6405, "text": "Comedians relate to social media."}, {"time": 6407, "text": "Comedians, comedy's, it's a performance based medium."}, {"time": 6412, "text": "So it's about getting up and doing it, getting up in a club, getting up in a theater, getting up in a bar, getting up wherever you can get up."}, {"time": 6418, "text": "And comedy for years was about performance."}, {"time": 6423, "text": "And then on the higher end, it was about movies and TV shows."}, {"time": 6426, "text": "But we were very slow to get on YouTube."}, {"time": 6429, "text": "We're very slow to adapt to technology."}, {"time": 6431, "text": "We're very slow to monetize anything we did on the internet."}, {"time": 6436, "text": "So podcasting was a way for comics and funny people to kind of get into that space, start earning money."}, {"time": 6443, "text": "And now because of the pandemic, it's really become essential."}, {"time": 6447, "text": "And it helps you, and even without the pandemic, it was how you were building a fan base."}, {"time": 6452, "text": "And that's like, but comics were very reticent to embrace social media at all because they thought it was cheap and they didn't like it."}, {"time": 6459, "text": "And they thought the people on it were idiots and were unfunny and it was just a blatant, whatever it was, whether it was a money grab or it was just too commercial in a sense where they're like, hey, look at me."}, {"time": 6469, "text": "Like it was just goofy, right?"}, {"time": 6471, "text": "And then comics, I think got displaced because all the YouTubers came in and all the social media stars came in and they really knocked comics off because now people are much more, like if you ask anyone under 30 who their favorite comedian is, they say David Dobrik."}, {"time": 6488, "text": "And there's nothing wrong with that."}, {"time": 6489, "text": "David's a funny guy, but like what you, not especially to me a ton, but that's okay."}, {"time": 6497, "text": "I don't, but he makes people laugh, so he's funny."}, {"time": 6501, "text": "But he's what people, that's a comedian now."}, {"time": 6504, "text": "So comics got beat by other people coming into a digital space before they did laying the groundwork and taking it over."}, {"time": 6514, "text": "And now comics are just trying to stay alive."}, {"time": 6518, "text": "Like even my podcast, which is people really like it, thank God, and I love doing it."}, {"time": 6523, "text": "The Tim Dillon Show."}, {"time": 6525, "text": "I was late, you know, I mean, I was, I just, you know, I've been podcasting for a long time, but really dedicating myself and putting the resources behind it, I was late to it."}, {"time": 6535, "text": "Like, I was like, hey, I'm telling jokes on stage, which is great, but I should have been allocating more time to building an infrastructure online."}, {"time": 6542, "text": "And I wasn't doing it and a lot of comics weren't doing it."}, {"time": 6544, "text": "Funny comics weren't doing it."}, {"time": 6546, "text": "Comics should be doing it."}, {"time": 6548, "text": "And I think when the pandemic ends, a lot of comics will just keep doing live standup, but I will keep, obviously I'm gonna go back on the road and do live standup, but I will keep doing this podcast and building digitally too."}, {"time": 6557, "text": "But you're also exploring ideas."}, {"time": 6559, "text": "You're doing like short videos and so on."}, {"time": 6561, "text": "You're trying to look for different mediums of how to be funny."}, {"time": 6566, "text": "I wanna be funny everywhere."}, {"time": 6568, "text": "I love making things too."}, {"time": 6569, "text": "My producer, Ben Avery, is like a brilliant editor and comedic mind, even though he's not a standup."}, {"time": 6576, "text": "He's able to, he understands funny, he understands what makes me funny."}, {"time": 6579, "text": "We're able to make these really, I mean, some of those videos, they're just brilliant little videos, even though they're tiny little videos, they're fucking as funny as anything."}, {"time": 6587, "text": "And it's not me."}, {"time": 6588, "text": "It's me working with somebody else to make something really great."}, {"time": 6592, "text": "And it's that relationship that's very important."}, {"time": 6596, "text": "In some sense, the medium of a short video is a challenge, just like the medium of a short tweet."}, {"time": 6603, "text": "How to say something."}, {"time": 6604, "text": "I mean, whatever the flavor is of what's in your heart, what's in your mind, how to say it, whether it's the goal is funny or something, or just an expressing idea."}, {"time": 6615, "text": "I think the whole thing that's important to us is that it's an extension of, really like an extension of your friendship in a way."}, {"time": 6622, "text": "Like, are you guys laughing at it?"}, {"time": 6624, "text": "Are you guys making each other laugh about this idea?"}, {"time": 6627, "text": "And if that's the case, other people are going to laugh at it."}, {"time": 6631, "text": "I think so much of the old medium was like, everything was top down."}, {"time": 6635, "text": "Okay, pitch me this idea."}, {"time": 6637, "text": "I pitch it to the showrunner."}, {"time": 6638, "text": "They pitch it to the network."}, {"time": 6639, "text": "They pitch it to this, to that, to that."}, {"time": 6642, "text": "Standards and practices, sales, and we got to go through everything."}, {"time": 6645, "text": "Now it's just like, are me and a few buddies or even just one buddy laughing at this idea?"}, {"time": 6651, "text": "Does it captivate us?"}, {"time": 6652, "text": "And do we see it visually?"}, {"time": 6655, "text": "And also a great line from Roseanne, a guy, not Roseanne, but a guy that worked on Roseanne, the old Roseanne, the great one."}, {"time": 6663, "text": "He said, is it funny with the sound off?"}, {"time": 6667, "text": "That's what we try to do."}, {"time": 6669, "text": "Is it funny with the sound off?"}, {"time": 6670, "text": "When you see me in the dumb things, or me in the Meghan McCain, or me in the thing, is it funny with the sound off?"}, {"time": 6675, "text": "And if it's funny with the sound off, you have a good starting point."}, {"time": 6678, "text": "That's hilarious, because you, I would say you're one of the people, because most people are not funny with the sound off, most comedians."}, {"time": 6686, "text": "Like you, Will Ferrell's another example of that."}, {"time": 6688, "text": "There's something about when I click on one of your videos, it's funny, just like the first thing I see, just your face."}, {"time": 6696, "text": "We, well, thank you."}, {"time": 6697, "text": "That's very sweet."}, {"time": 6698, "text": "But I mean, thank God."}, {"time": 6700, "text": "I mean, that's what we try to do, right?"}, {"time": 6701, "text": "We're trying to be funny."}, {"time": 6703, "text": "So we're trying to be funny."}, {"time": 6705, "text": "Can we talk about love a little bit?"}, {"time": 6708, "text": "So you came out of the closet as being gay when you were 25."}, {"time": 6713, "text": "Yeah, it was late, very late."}, {"time": 6715, "text": "Very late."}, {"time": 6716, "text": "Before then."}, {"time": 6717, "text": "By today's standards."}, {"time": 6718, "text": "During and after, how has your view on love evolved?"}, {"time": 6725, "text": "It's so hard to say, because like I would, I'd like to make a very like Disneyfied statement about like that you can't be in love secretively."}, {"time": 6735, "text": "You should be honest."}, {"time": 6736, "text": "Love should all be about honesty, but that's not true."}, {"time": 6739, "text": "There's people that are in love that are lying to everyone else, but they're deeply in love."}, {"time": 6745, "text": "I would love to say something like, honesty is an ingredient for love, you know?"}, {"time": 6750, "text": "But I don't know, maybe honesty with each other."}, {"time": 6753, "text": "But I mean, I think there's a lot of people in the world that aren't honest."}, {"time": 6756, "text": "My view on love is super important."}, {"time": 6759, "text": "I think that it's, a lot of society in America is all about love."}, {"time": 6764, "text": "We don't tend to focus on other things in terms of like, you know, friendship or sustainability of that."}, {"time": 6774, "text": "Cause I think that a lot, I know a lot of people in relationships where it's like, I don't know, they're not, they are, they love each other, but like, it's also a rock solid couple because they are, they're very compatible in many other ways."}, {"time": 6789, "text": "So I think that like, They're friends."}, {"time": 6791, "text": "They have, right."}, {"time": 6792, "text": "I see friendship and love as the same thing."}, {"time": 6793, "text": "There's just parts of it that are, right?"}, {"time": 6795, "text": "So it's like, I look at it as like, there is, there needs to be more than just like that, like amazing, like chemistry or physical attraction that is this chemical thing that happens."}, {"time": 6808, "text": "There should be like some underlying, I mean, again, that's from what I, that's what I've observed as really long lasting, successful relationships."}, {"time": 6817, "text": "Well, is there something about coming out that, that was, that you took away, that you remember as profound, Yes."}, {"time": 6828, "text": "That it was my, that I, it wasn't society, it was me."}, {"time": 6832, "text": "So there were kids that were out in my high school that I waited years later to do it."}, {"time": 6838, "text": "That was no one's fault but my own."}, {"time": 6840, "text": "So I was taking a cowardly way out and a lot of people."}, {"time": 6843, "text": "So I could blame society or like, oh, I lived in a conservative area and I grew up in that."}, {"time": 6849, "text": "You should take responsibility for your own decisions."}, {"time": 6851, "text": "And if you're being cowardly, admit that you're being cowardly."}, {"time": 6854, "text": "So that's what I took out of it is that it's not society's fault that you chose to be a coward."}, {"time": 6859, "text": "Society will never be perfect."}, {"time": 6861, "text": "You have to be honest when you're ready to be honest or however you want to be honest, but it's not somebody, too much now is it's everyone else's fault that you didn't take, make a hard choice or a hard decision."}, {"time": 6871, "text": "So that's kind of what I took out of it."}, {"time": 6873, "text": "So now in retrospect, you see yourself as, were being afraid."}, {"time": 6878, "text": "Do you think at the time?"}, {"time": 6880, "text": "Well, I wanted people to like me, which is the disease of humanity, right?"}, {"time": 6885, "text": "Is that we want to be liked."}, {"time": 6886, "text": "And what happens is if you want people to like you and love you even, you want people to feel comfortable with you."}, {"time": 6892, "text": "And those were people like your family?"}, {"time": 6893, "text": "Friends more."}, {"time": 6895, "text": "My family I would always, could always throw in the street, but I'm kidding."}, {"time": 6899, "text": "I mean, but I am not, but my friends, my circle of friends, which I were my family at the time when you're a senior, when you're 10th, 11th grade in high school, your friends are your family."}, {"time": 6910, "text": "Like that's your, so you don't want to do anything that puts you on the outside of the circle."}, {"time": 6915, "text": "It's just thinking back to that fear."}, {"time": 6916, "text": "Is there things you're afraid of now?"}, {"time": 6919, "text": "That you're not doing, you're afraid to do?"}, {"time": 6921, "text": "I'm afraid of all kinds of things."}, {"time": 6923, "text": "I'm afraid of not being good at my job, not being funny, letting people down, not putting out products that are good, whether it's the podcast every week or stand up or the videos, like I'm afraid of like, there's a ton of people that really enjoy what we do."}, {"time": 6940, "text": "So when you're in that position, you're nervous that you're going to start doing things that they don't like."}, {"time": 6945, "text": "So the new things you want to do, the evolution you want to do, you want to make sure you're evolving in the right way."}, {"time": 6951, "text": "You want to make sure that you're doing things that are consistent with why people liked you, but also you don't want to put yourself in a box and limit what you can be going forward."}, {"time": 6959, "text": "So like, I had a talk with the CEO of NBC Universal once."}, {"time": 6962, "text": "I was doing some internal sketch for them."}, {"time": 6965, "text": "And I was playing like a cab driver and he was a, and he's not the current CEO, but he's a former CEO."}, {"time": 6970, "text": "And I said to him, what's the hardest part of running a corporation of this size?"}, {"time": 6974, "text": "And he said something very interesting."}, {"time": 6977, "text": "He said, the hardest part is maximizing the current profit model of what you have at the same time, getting ready, getting ready, getting the company ready for where it's going to be in five years."}, {"time": 6987, "text": "He said, those are often at odds."}, {"time": 6989, "text": "And that's the toughest thing."}, {"time": 6990, "text": "He goes, cause I could just bang out everything I got to do right now."}, {"time": 6994, "text": "And we're going to make a lot of money doing this, but am I devoting enough resources into digital so that in five years, when that's where everything lives, are we competitive in that space?"}, {"time": 7026, "text": "What should I, should I have a bigger presence on TikTok?"}, {"time": 7029, "text": "Should I have a bigger presence here?"}, {"time": 7030, "text": "Should I have a business, or should I be on Twitch?"}, {"time": 7032, "text": "Should I be doing this?"}, {"time": 7032, "text": "Should I be doing that?"}, {"time": 7033, "text": "What am I not doing that I should be doing that I'll regret not doing?"}, {"time": 7037, "text": "And those are, those are the conversations I think I have in my own head all the time."}, {"time": 7041, "text": "And I guess there's parallels to coming out as gay or just parallels in like a career path so you're taking all that, that's ultimately just fear."}, {"time": 7049, "text": "It's fear."}, {"time": 7051, "text": "It's the fear of, you know, the best thing that happened in my career was that I came to LA."}, {"time": 7057, "text": "I didn't have an idea of what was going to happen."}, {"time": 7061, "text": "I met somebody who was really committed to making funny things that we just wanted to be funny."}, {"time": 7070, "text": "No one would let us be funny."}, {"time": 7071, "text": "We didn't have Comedy Central letting us be funny."}, {"time": 7073, "text": "We didn't have HBO, we didn't have Netflix."}, {"time": 7075, "text": "We just had a garage and a phone in the beginning and then a camera and then a thing."}, {"time": 7080, "text": "And we just wanted to be funny."}, {"time": 7081, "text": "And that was the greatest risk really I took because I was like, well, I don't know what else is going to happen right now, but I just want to be funny."}, {"time": 7088, "text": "And funny saved my life, right?"}, {"time": 7090, "text": "I mean, funny got me out of drugs."}, {"time": 7091, "text": "Funny probably got me out of the closet."}, {"time": 7092, "text": "Funny was the thing that I was able to do that made everything okay in my own head."}, {"time": 7096, "text": "So I was like, as long as I'm being funny, something good will happen."}, {"time": 7099, "text": "So we did that and then something really cool happened that we were able to do a lot of cool things, but that's what it is."}, {"time": 7105, "text": "It's fear that keeps you from being the better version of yourself."}, {"time": 7109, "text": "Your mom, I mean, you have so many complicated, fascinating parts of your story."}, {"time": 7115, "text": "Your mom, as you were growing up, suffered."}, {"time": 7119, "text": "Schizophrenic, yeah."}, {"time": 7120, "text": "Well, from mental illness, yeah, schizophrenia."}, {"time": 7123, "text": "Can you tell her story and how that relationship has changed over the years?"}, {"time": 7126, "text": "Yeah, well, she was always eccentric and always, you know, the terms for schizophrenia in an Irish Catholic household where we didn't talk about anything were eccentric, fun."}, {"time": 7137, "text": "There's a theme to this conversation."}, {"time": 7138, "text": "She's unpredictable."}, {"time": 7139, "text": "She's a wire, she was a live wire."}, {"time": 7144, "text": "Any of the words you would use to describe somebody who was a fucking lunatic, but you wouldn't say that."}, {"time": 7151, "text": "Pop that spin."}, {"time": 7152, "text": "Right, she started experiencing symptoms probably early on in her life, but she also, I think, started really manifesting them when I was in my mid teens, so like 14, 13, 14 area."}, {"time": 7169, "text": "And she got really, really bad."}, {"time": 7170, "text": "And then I think she was institutionalized about 10 years ago, a little over 10 years ago."}, {"time": 7175, "text": "And she could really no longer live on her own."}, {"time": 7177, "text": "She was unable to go to work."}, {"time": 7179, "text": "She was unable to function."}, {"time": 7180, "text": "So I visit her when I can."}, {"time": 7182, "text": "Obviously, I'm not in New York."}, {"time": 7182, "text": "Whenever I go to New York, I visit her."}, {"time": 7184, "text": "She's aware of what I do, my career and everything like that."}, {"time": 7187, "text": "She has good days and bad days, but mental illness is a thing that's very tough."}, {"time": 7191, "text": "We don't talk about it as a society."}, {"time": 7193, "text": "People with mental problems don't get that much attention."}, {"time": 7197, "text": "We tend to think that they did something wrong or that they deserve it or that they are to be ignored."}, {"time": 7204, "text": "And we don't devote a lot of resources into it, which is unfortunate because then you have the junk gurus come in and go like, let's diagnose your mental illness off Instagram."}, {"time": 7212, "text": "And it's like, that's not the move."}, {"time": 7215, "text": "Do you love her?"}, {"time": 7219, "text": "I love her, but I also remember her that isn't her now."}, {"time": 7224, "text": "And when someone has mental illness that's severe, you make peace with their death before they die."}, {"time": 7231, "text": "Wow, yeah."}, {"time": 7232, "text": "Because the part of them that you love and remember a lot of cases is not evident or obvious."}, {"time": 7241, "text": "Now, my mother's still a loving person that I love, but the fun, her ability to be present in the moment and to not, that is lost with the progression of realness so that you still love her."}, {"time": 7256, "text": "And I mean, again, your parents, the time horizons you have with your parents are unknown."}, {"time": 7261, "text": "People don't know."}, {"time": 7262, "text": "I have friends that their parents were in their lives for their entire life."}, {"time": 7266, "text": "And I have friends whose parents were in their life, but my mother was a very, she knew what I was."}, {"time": 7270, "text": "When I was a little kid, I was an actor."}, {"time": 7271, "text": "When I was like six to 12, my mother knew that I was a performer."}, {"time": 7274, "text": "She knew what I was and what I'd ultimately do."}, {"time": 7276, "text": "She recognized that in me."}, {"time": 7277, "text": "And when I said to her, I want to audition for shows, I want to be on stage, I want to be on this, I want to do this, she let me do it because she knew who I was and she didn't want to get in the way of me being a human being, a fully realized person at six."}, {"time": 7290, "text": "So that's probably the best thing a parent can do for a kid is let them be who they are."}, {"time": 7295, "text": "And my mother did that."}, {"time": 7297, "text": "So that, I mean, that's good."}, {"time": 7300, "text": "We ate too much fast food."}, {"time": 7302, "text": "There were negatives, but she did let me be who I was."}, {"time": 7304, "text": "That's why you want to throw them out into the street."}, {"time": 7306, "text": "Yeah, sometimes."}, {"time": 7310, "text": "But coming to accept the mortality of her, I guess, identity as you remember it from childhood, do you ponder your own mortality?"}, {"time": 7326, "text": "I'm afraid of death."}, {"time": 7326, "text": "I don't like the idea of death, but I know it's happening."}, {"time": 7330, "text": "I know it's going to happen eventually."}, {"time": 7332, "text": "I don't love it."}, {"time": 7334, "text": "I think about, I want to do some good stuff that people can look back at."}, {"time": 7336, "text": "And I think I'm proud of the show where if people look back at the show, I don't know how comedy ages or whatever, but I think I put out a lot of stuff and I want to continue to put out stuff and I want to put out a few specials that people can look back at and go, oh, this guy was really funny in this really crazy, he lived in the latter part of this century when all this shit was going on."}, {"time": 7353, "text": "And he kind of made fun of it."}, {"time": 7355, "text": "And he did something to make people's lives a little better just by having a few laughs."}, {"time": 7363, "text": "What do you think about, this is something like in the podcast context, do you think you'll have just one or two or three shows out of thousands maybe that are like the truly special ones?"}, {"time": 7376, "text": "That's probably the case."}, {"time": 7377, "text": "Or do you think it's an entirety of the body of work?"}, {"time": 7380, "text": "I think people will take 10 minute clips from all different shows and put them together."}, {"time": 7385, "text": "And there's a highlight."}, {"time": 7386, "text": "Yeah, like a highlight reel of just like, these are like the best things that he's ever done or the best rants he's ever had, the best things, whatever."}, {"time": 7393, "text": "So the legacy would be that this was an important voice in a very weird time."}, {"time": 7398, "text": "I would hope that that's part of it."}, {"time": 7401, "text": "And I hope that I continue to be, you say important, I say funny, but hopefully I continue to be a voice."}, {"time": 7408, "text": "And that's what I think when I think about death, I think about like, what do people come on earth to do?"}, {"time": 7413, "text": "And I think I came, I think my main purpose on this planet other than to experience whatever love or worthiness or whatever is to entertain people."}, {"time": 7424, "text": "And there's a lot of people in comedy right now that are not entertainers, and that's really the problem."}, {"time": 7429, "text": "But, and they got into comedy sort of the way that you can walk into the wrong store in a mall and then not realize you're in the wrong store and try on a bunch of clothes and then go, fuck, I wasted my whole afternoon."}, {"time": 7440, "text": "But I think I've always kind of been an entertainer and that's what I wanna do."}, {"time": 7444, "text": "There's a, unfortunately, sadly, a lot of people that look up to you."}, {"time": 7448, "text": "That is a horrible thing, but life is a nightmare."}, {"time": 7454, "text": "If you were to give them advice, young folks, people in college, maybe even high school, but people in their 20s about what to do with their life, whether it's career, whether it's just life in general, what would you say?"}, {"time": 7467, "text": "Ignore everyone."}, {"time": 7469, "text": "Make a few good friends."}, {"time": 7472, "text": "Truly have honest conversations with yourself about your, when do you feel the most alive?"}, {"time": 7482, "text": "Figure that out."}, {"time": 7484, "text": "When and how do you feel the most alive?"}, {"time": 7490, "text": "Try to figure out a job or a career that can replicate that feeling."}, {"time": 7496, "text": "Don't listen to anyone."}, {"time": 7497, "text": "Don't listen to your parents."}, {"time": 7498, "text": "Don't listen to the gurus on the internet."}, {"time": 7503, "text": "Figure out where you feel the most alive."}, {"time": 7507, "text": "Where do you feel excited?"}, {"time": 7509, "text": "Where does your pulse quicken?"}, {"time": 7511, "text": "What do you feel matters?"}, {"time": 7513, "text": "When you're in a situation, do you feel like it matters?"}, {"time": 7517, "text": "What situation was that?"}, {"time": 7518, "text": "What got you excited?"}, {"time": 7520, "text": "What thing did you walk into where you looked around and were taken back and you're like, wow, this is amazing?"}, {"time": 7527, "text": "And I'm filled with awe."}, {"time": 7528, "text": "If you can figure out a life where you can excite yourself, you might not use drugs or alcohol or a sex addiction or gambling or irresponsibility."}, {"time": 7541, "text": "You might not have to get your fucking kicks in very destructive places if you can get them in a productive place."}, {"time": 7548, "text": "Well, you had a pretty weaving life that's full of mistakes and so on."}, {"time": 7556, "text": "Many mistakes."}, {"time": 7559, "text": "Is that, are mistakes a bug or a feature?"}, {"time": 7562, "text": "Like, do you recommend embrace the mistakes, make a bunch of them?"}, {"time": 7566, "text": "Depends what they are, right?"}, {"time": 7568, "text": "Well, you've had the full spectrum."}, {"time": 7569, "text": "I've had a lot, but a lot of mine could have sunk me."}, {"time": 7573, "text": "Like, they sound like fun when I talk about them, but they actually could have sunk me."}, {"time": 7577, "text": "And they were all part of what made me funny, but I don't know."}, {"time": 7582, "text": "I would never tell anyone else to just light their life on fire and hope it all works out on the other end."}, {"time": 7588, "text": "It would be pretty irresponsible."}, {"time": 7590, "text": "But hey, at the end of the day, it's like, you're gonna, we get, there's, you know, I think one of my themes is that there's too much."}, {"time": 7601, "text": "We give the power."}, {"time": 7602, "text": "We think we have too, the power of choice has been elevated on our society to an unhealthy degree."}, {"time": 7610, "text": "I think people are, I think you could get really good at something, but you're born with a certain aptitude."}, {"time": 7615, "text": "It might be to be a deal maker, might be to be an athlete."}, {"time": 7618, "text": "It might be to be an artist."}, {"time": 7619, "text": "It might be to be a romantic, just fall in and out of love, in and out of love, in and out of love."}, {"time": 7624, "text": "It might be to be like a world traveler."}, {"time": 7625, "text": "Like, but whatever you are, I think you are."}, {"time": 7628, "text": "I think that there's something about you that makes you something."}, {"time": 7631, "text": "And if you can figure it out and then refine, you're not gonna be good at it per se."}, {"time": 7635, "text": "But if you're an athlete, it might not mean that you're going to be a great athlete in the history, but it might mean you're the best coach anyone's ever had, or you're the person that, you know, builds a local scene for young athletes or whatever."}, {"time": 7647, "text": "If you are a really good deal maker, it doesn't mean you're gonna be Warren Buffett, but it might mean you're somebody who enjoys making deals all the time and things like that."}, {"time": 7656, "text": "Like if you're an entertainer, it might mean that you are an entertainer."}, {"time": 7660, "text": "It might mean that you are in the world of entertainment because you love it so much that if you lack the skillset to really pursue it on a degree, you just want to be like, there's a thing inside of you that makes you what you are."}, {"time": 7675, "text": "I think, I look at certain people and I go, you were born to be that thing."}, {"time": 7680, "text": "The whole purpose is to find it."}, {"time": 7681, "text": "I was a juror on that murder trial in Long Island and the woman who's the DA, I'm like, you were born to do this."}, {"time": 7687, "text": "You were born to put murderers away and this guy killed the mother of his children."}, {"time": 7692, "text": "I mean, he's a bad guy, but like, I was like, you are really good at what you do."}, {"time": 7695, "text": "She has a strong belief in whatever her moral code is and what her justice and ethics are."}, {"time": 7700, "text": "And she wants to communicate that to people."}, {"time": 7702, "text": "She was very good at doing what she did."}, {"time": 7705, "text": "I don't know the facts of the case."}, {"time": 7706, "text": "I didn't really listen."}, {"time": 7707, "text": "He seemed guilty, so I just voted guilty."}, {"time": 7709, "text": "But I didn't really listen to her, but I heard the shape of her mouth was very bovine, like a cow, and it conferred a certain level of expertise that I enjoyed."}, {"time": 7719, "text": "Well, it's funny."}, {"time": 7719, "text": "I mean, you could see, you're half joking."}, {"time": 7722, "text": "Yes, but I'm serious."}, {"time": 7723, "text": "You can often see that people just, they found their place."}, {"time": 7727, "text": "They found their role."}, {"time": 7728, "text": "They found their thing."}, {"time": 7729, "text": "They found their thing, and that's kind of the purpose of life."}, {"time": 7732, "text": "And once you are in a place that seems sticky, like the place that seems right, that's one of the problems with the generation that you're speaking to, is there's always a feeling like I should keep exploring, keep exploring."}, {"time": 7745, "text": "But it's okay to stay in a place that you found that works."}, {"time": 7748, "text": "Yeah, and listen, sometimes the best place you'll find is like when people are like, when did you feel really excited and alive?"}, {"time": 7755, "text": "It's like doing nothing."}, {"time": 7759, "text": "You know, like that's the other thing."}, {"time": 7760, "text": "It's like some people are gonna be like, I feel really excited and alive, and I'm laying in my backyard in a hammock."}, {"time": 7765, "text": "And I just wanted the simplest life and not have to do much, and I don't like doing anything."}, {"time": 7770, "text": "And I love laying around and going, wow, the sky looks good today."}, {"time": 7773, "text": "Bill Gates goes, the sky looks good today."}, {"time": 7774, "text": "Let's shoot a missile into it."}, {"time": 7776, "text": "He wants to do shit, right?"}, {"time": 7777, "text": "So it's like in between that and nothing is you can find something."}, {"time": 7782, "text": "But in that process, for you personally, I mean, for me and for others, I think there's a struggle."}, {"time": 7789, "text": "When you look in the, when Tim and Dylan looks in the mirror, do you love yourself or do you hate yourself?"}, {"time": 7794, "text": "Well, a lot of times I think I'm Amy Schumer, so I'm confused."}, {"time": 7799, "text": "I'm a detente to myself all the time."}, {"time": 7801, "text": "I don't love myself or hate myself."}, {"time": 7803, "text": "Addicts have a very bad problem where you can't just fall in love with yourself and you can't hate yourself."}, {"time": 7810, "text": "Both of them lead you to a negative place."}, {"time": 7812, "text": "You try to stay kind of even keel."}, {"time": 7814, "text": "I don't go like, hey man, you put out a video, get all these views, things are great."}, {"time": 7818, "text": "You sold a bunch of tickets."}, {"time": 7819, "text": "Let's fucking go out and like, maybe let's, hey man, let's have that drink that you've been waiting for for 11 years."}, {"time": 7824, "text": "And I don't look at myself and go, you ate a burger yesterday."}, {"time": 7827, "text": "You're a piece of shit."}, {"time": 7828, "text": "You're horrible."}, {"time": 7829, "text": "You'll never get into the shape you want."}, {"time": 7833, "text": "I try not to get too low or too high."}, {"time": 7835, "text": "Both of them are not good for my particular mind."}, {"time": 7838, "text": "Okay, I gotta ask, we kind of spoke about 2021 and you being potentially hopeful, hopeful short term, cynical long term."}, {"time": 7849, "text": "So let me ask, I forgot to ask, are you moving to Austin?"}, {"time": 7855, "text": "I mean, I don't think so immediately."}, {"time": 7857, "text": "I love Joe."}, {"time": 7858, "text": "I love what he's trying to do down there."}, {"time": 7859, "text": "I'm appreciative of everything that he's done for not only me, but for comedy in general."}, {"time": 7864, "text": "And I think as things happen in Austin and unfold is such a political answer, but as things unfold, I will consider it more and more."}, {"time": 7871, "text": "But I mean, I think I got another year in LA."}, {"time": 7874, "text": "So you've spoken so nicely about this magical place that is Los Angeles."}, {"time": 7880, "text": "LA is very funny."}, {"time": 7882, "text": "You think there's a place for comedy in LA?"}, {"time": 7885, "text": "There will always be a place for comedy in LA."}, {"time": 7887, "text": "So it's gonna be a place for comedy in New York."}, {"time": 7889, "text": "I mean, the question is how thriving of a comedy scene is Austin gonna be?"}, {"time": 7893, "text": "And Joe can probably make it one, but as of right now, it isn't."}, {"time": 7898, "text": "So that would be him doing that."}, {"time": 7899, "text": "But the question, there's a lot of people escaping Los Angeles, but I know better about New York."}, {"time": 7904, "text": "There's a lot of really brilliant people."}, {"time": 7906, "text": "Let them go."}, {"time": 7907, "text": "There's other people."}, {"time": 7909, "text": "It's like, this is the fear thing."}, {"time": 7910, "text": "It's like, no, but all the brilliant people are leaving."}, {"time": 7913, "text": "There'll be other people and they'll fill their shoes the way that they've done throughout history."}, {"time": 7917, "text": "And I think that New York and LA, listen, maybe in five to 10 years, they're not the two cities."}, {"time": 7922, "text": "It would be real rough in five years when this pandemic's over for people in Australia to go, dude, you gotta go to America and you gotta visit Charleston and Austin."}, {"time": 7934, "text": "Let's be adults here."}, {"time": 7935, "text": "Let's be adults."}, {"time": 7936, "text": "It's still gonna be New York and LA for a while."}, {"time": 7938, "text": "LA is an absolute hellscape, but I don't think you're gonna replace California with another place."}, {"time": 7948, "text": "And also, everyone's making decisions now because we're literally in the midst of a pandemic we've never had before."}, {"time": 7954, "text": "We've never had this before."}, {"time": 7955, "text": "Joe loved California up until the pandemic."}, {"time": 7957, "text": "He had problems with it."}, {"time": 7959, "text": "Like, we all have problems with it."}, {"time": 7960, "text": "There's a lot of benefits to being here."}, {"time": 7962, "text": "I think a lot of us made pretty bad decisions in 2020 because we were all locked up and stuck with our own thoughts."}, {"time": 7968, "text": "But, so it's funny, there's parallels because I don't necessarily, you know, I'm obviously a fan of comedy, but I don't care where comics move."}, {"time": 7979, "text": "But there's a parallel move that's happening, set of decisions which do influence my decision making, which is where to start a business that's tech centered."}, {"time": 7987, "text": "And that's more about the San Francisco, Silicon Valley."}, {"time": 7992, "text": "And there is a lot of people leaving there."}, {"time": 7995, "text": "That's already."}, {"time": 7996, "text": "And they're going to Austin."}, {"time": 7996, "text": "Well, Austin, there's a, I think, there's a bunch of different places."}, {"time": 8001, "text": "Phoenix, there's Denver."}, {"time": 8003, "text": "Austin will probably be a massive tech hub."}, {"time": 8006, "text": "Elon's there."}, {"time": 8007, "text": "It seems like it's all, everything about Austin says that it's going to be a massive tech hub."}, {"time": 8013, "text": "I just don't know if that means it'll be a massive comedy hub."}, {"time": 8016, "text": "I don't know if those two can actually coexist."}, {"time": 8018, "text": "It's interesting because."}, {"time": 8019, "text": "Yeah, I don't, I think, you know, comedy suffered in New York and LA when everyone got super rich."}, {"time": 8025, "text": "Like, you know, it just wasn't as cool."}, {"time": 8027, "text": "It's still much more fun on the road."}, {"time": 8028, "text": "It's still more fun to perform for people that want and need to laugh in strip malls than it is to perform for hedge fund managers and with their dates and, you know, Instagram models in LA."}, {"time": 8040, "text": "Comedy on the road is much more fun."}, {"time": 8041, "text": "So maybe in the spirit of that, Austin becomes, but you know, you know, if Austin is just colonized by tech bros and stuff like, yeah, I mean, sure, sure it'll be fun and it'll be great."}, {"time": 8050, "text": "I think Joe's made LA a scene."}, {"time": 8053, "text": "So if anyone's going to make Austin a scene, it's Joe."}, {"time": 8057, "text": "Yeah, and I like the, on the Elon side, which is what I'm much more familiar with, the promise of the possibility of what that could become because there's a lot of problems in Silicon Valley."}, {"time": 8067, "text": "And of course it might be naive to think that just because it's like the grass is greener thing, which is just because the place where you come from has a lot of problems, doesn't mean you can just create a new place that's not going to have those problems."}, {"time": 8079, "text": "Yeah, there's homelessness in Austin."}, {"time": 8081, "text": "There are problems in Austin."}, {"time": 8082, "text": "I mean, I think that with, by the way, with the influx of very rich people to an area, sometimes that helps things, but sometimes it just makes things more polarizing and it puts a spotlight on those problems and makes those problems even bigger, right?"}, {"time": 8095, "text": "So, I mean, I don't know that it's necessarily, it's hard to predict."}, {"time": 8099, "text": "I just know that LA right now is funny."}, {"time": 8101, "text": "It's funny that there's 15 year old TikTokers making millions of dollars dancing in a house while the world burns."}, {"time": 8106, "text": "That is very funny."}, {"time": 8107, "text": "Well, it's for your style of humor, yes."}, {"time": 8111, "text": "The absurdity of the world is that it's... No one cares about Hollywood starlets and actresses and actors and everyone goes, hey, fuck you."}, {"time": 8117, "text": "Even though they've won three Academy Awards, they're all being replaced by just mediocre dancer 15 year olds."}, {"time": 8123, "text": "I mean, it's like there's something hilarious about this city and it will burn in hell, but so will everything."}, {"time": 8131, "text": "Eventually the sun will die out and we will all be gone unless we colonize outside of our solar system."}, {"time": 8138, "text": "But I just sit here, I'm struggling with this because Boston, I'm currently at MIT, Boston doesn't feel like the right place to start a business in the tech sector."}, {"time": 8152, "text": "And so I'm choosing, I'm looking at San Francisco the way it is and I'm looking at Austin."}, {"time": 8156, "text": "Oh, Austin, clearly."}, {"time": 8158, "text": "So it seems clear, but it's such a difficult thing to predict what a place will look like in 10 years and 15 years and 20 years."}, {"time": 8168, "text": "And it's so hard to predict if you'll like it or not until you're there."}, {"time": 8172, "text": "And this is speaking to risk, there's not really a good reason for me to move anywhere."}, {"time": 8178, "text": "There's not a good reason to do anything in life."}, {"time": 8181, "text": "Part of me wants to just fucking do it and whatever and see what happens."}, {"time": 8186, "text": "Do you like Boston, do you like other things about Boston besides the tech thing?"}, {"time": 8190, "text": "You like MIT."}, {"time": 8191, "text": "MIT, that's the problem."}, {"time": 8193, "text": "Do you like the food in Boston?"}, {"time": 8195, "text": "Do you eat food?"}, {"time": 8196, "text": "I haven't eaten food or been outside for years."}, {"time": 8199, "text": "And I mean, that's probably the better version."}, {"time": 8202, "text": "But you're keto forever."}, {"time": 8204, "text": "You've been keto for a long time."}, {"time": 8205, "text": "Yeah, keto, fasting for a long time."}, {"time": 8209, "text": "15 years fasting, eating once or twice a day."}, {"time": 8214, "text": "But no sugar ever, no like and no pasta ever, no bread ever."}, {"time": 8220, "text": "No pasta, no bread, no, except like, so my source of... You could kind of live anywhere because like going out is such a big part of what city you live in."}, {"time": 8230, "text": "And like, do you like the food there?"}, {"time": 8231, "text": "Do you like the restaurants?"}, {"time": 8232, "text": "Can you meet people?"}, {"time": 8233, "text": "Whatever, but it's like, you really can just kind of... Yeah, so not married, no kids."}, {"time": 8237, "text": "Right, you have freedom."}, {"time": 8238, "text": "Me too, I have freedom."}, {"time": 8240, "text": "And that's, we have the curse of being vegan."}, {"time": 8243, "text": "We have too many choices."}, {"time": 8248, "text": "We don't have somebody else going, what about like, we don't have to justify our decisions to anyone."}, {"time": 8251, "text": "So we can just kind of like let our minds go run wild."}, {"time": 8254, "text": "So you just got to hone the instinct of just what feels right and just fucking do it."}, {"time": 8261, "text": "I think Austin with Joe down there and Elon down there, Austin seems like a real no brainer move for you."}, {"time": 8266, "text": "To try, you know, why the hell not?"}, {"time": 8269, "text": "And then I think I should go to MIT."}, {"time": 8271, "text": "Like, I mean, I think I should give those nerds a piece of my mind that you should go to."}, {"time": 8279, "text": "I was in an Uber pool once with a kid from MIT and I was eating this thing from Bova's Bakery."}, {"time": 8285, "text": "I forget what it was."}, {"time": 8286, "text": "It was like a, it's so good."}, {"time": 8289, "text": "You don't know Bova's Bakery, right?"}, {"time": 8290, "text": "Yeah, it's in Boston, it's famous."}, {"time": 8292, "text": "I was eating a thing and I was like covered in chocolate."}, {"time": 8294, "text": "This kid, like this little nerd, like this little like, you know, USB drive with feet was just staring at me and they just dropped him off at MIT."}, {"time": 8301, "text": "And he like scurried away."}, {"time": 8302, "text": "But that's a big school that, doesn't the NSA recruit out of their heavy, like MIT, places like that?"}, {"time": 8307, "text": "I can't, I can't speak to that."}, {"time": 8310, "text": "But what, this is a ridiculous question I sometimes ask myself when I'm alone."}, {"time": 8318, "text": "Do you think about the big existential kind of, why the hell we're here?"}, {"time": 8323, "text": "It's a cosmic kind of joke kind of in a weird way, right?"}, {"time": 8326, "text": "I mean, Joe said it the other day on, maybe it was you saying that like, he was just like, you know, by the time you figure out what it is, you're out of here."}, {"time": 8335, "text": "You know, it's kind of interesting."}, {"time": 8336, "text": "Or you even start to figure out what it is, you're out of here."}, {"time": 8339, "text": "It's like, that's kind of funny."}]}]