[{"title": "Natalya Bailey: Rocket Engines and Electric Spacecraft Propulsion | Lex Fridman Podcast #157", "id": "CejJ2aVRUE8", "quotes": [{"time": 303, "text": "Sort of, you work on the engineering side of things."}, {"time": 308, "text": "It's this very kind of focused pursuit of moving things through space efficiently."}, {"time": 315, "text": "But if you zoom out, one of the cool things that this enables us to do is find, get even intelligent life, just life on Mars or on Europa or something like that."}, {"time": 328, "text": "Does that excite you?"}, {"time": 329, "text": "Does that scare you?"}, {"time": 331, "text": "Oh, it's very exciting."}, {"time": 332, "text": "I mean, it's the whole reason I went into the field I'm in is to contribute to building the body of knowledge that we have as a species."}, {"time": 346, "text": "So very exciting."}, {"time": 347, "text": "Do you think there's life on Mars?"}, {"time": 350, "text": "Like no longer, well, already living, but currently living, but also no longer living, like that we might be able to find life, as some people suspect, basic microbial life."}, {"time": 363, "text": "I'm not so sure about in our own solar system."}, {"time": 367, "text": "And I do think it might be hard to untangle if we somehow contaminated other things as well."}, {"time": 375, "text": "So I'm not sure about this close to home."}, {"time": 379, "text": "That'd be really exciting."}, {"time": 381, "text": "Do you think about the Drake equation much of like?"}, {"time": 384, "text": "That was what got me into all of this, yeah."}, {"time": 388, "text": "Yeah, because one of the questions is how hard is it for life to start on a habitable planet?"}, {"time": 394, "text": "Like if you have a lot of the basic conditions, not exactly like Earth, but basic Earth like conditions, how hard is it for life to start?"}, {"time": 401, "text": "And if you find life on Mars or find life on Europa, that means it's way easier."}, {"time": 408, "text": "That's a good thing to confirm that if you have a habitable planet, then there's going to be life."}, {"time": 415, "text": "And that like immediately, that would be super exciting because that means there's like trillions of planets with basic life out there."}, {"time": 424, "text": "Though of all the planets in our solar system, Earth is clearly the most habitable."}, {"time": 429, "text": "So I would not be discouraged if we didn't find it on another planet in our solar system."}, {"time": 437, "text": "True, and again, that life could look very different."}, {"time": 439, "text": "It's habitable for Earth like life, but it could be totally different."}, {"time": 443, "text": "I still think that trees are quite possibly more intelligent than humans, but their intelligence is carried out over a time scale that we're just not able to appreciate."}, {"time": 453, "text": "Like they might be running the entirety of human civilization, and we're just like too dumb to realize that they're the smart ones."}, {"time": 460, "text": "Maybe that's the alien message."}, {"time": 463, "text": "It's in the trees."}, {"time": 467, "text": "Yeah, it's not in the monolith in the Utah desert."}, {"time": 472, "text": "So let's go to space exploration."}, {"time": 475, "text": "How do you think we would get humans to Mars?"}, {"time": 477, "text": "I think SpaceX and Elon Musk will be the ones that get the first human setting foot on Mars, and probably not that long from now from us having this conversation."}, {"time": 492, "text": "Maybe we'll inflate his timeline a little bit, but I tend to believe the goals he sets."}, {"time": 499, "text": "So I think that will happen relatively soon."}, {"time": 502, "text": "As far as when and what it will take to get humans living there in a more permanent way, I have a glib answer, which is when we can invent a time machine to go back to the early Cold War, and instead of uniting around sending people to the moon, we pick Mars as the destination."}, {"time": 525, "text": "So really, I say that because there's nothing truly scientifically or technologically impossible about doing that soon."}, {"time": 537, "text": "It's more politically and financially, and those are the obstacles, I think, to that."}, {"time": 544, "text": "Well, I wonder of when you colonize with more than, I say, five people on Mars, you have to start thinking about the kind of rules you have on Mars, and just speaking of the Cold War, who gets to own the land?"}, {"time": 561, "text": "You know, you start planting flags, and you start to make decisions."}, {"time": 565, "text": "And like SpaceX says, it's probably a little bit trolly, but they have this nice paragraph in their contracts where it talks about that human governments on Earth or Earth governments have no jurisdiction on Mars."}, {"time": 586, "text": "Like the rules, the Martians get to define their own rules."}, {"time": 590, "text": "It sounds very much like the founding fathers for this country."}, {"time": 594, "text": "That's the kind of language."}, {"time": 597, "text": "It's interesting that that's in there, and it makes you think perhaps that needs to be leveraged."}, {"time": 607, "text": "Like you have to be very clever about leveraging that to create a little bit of a Cold War feeling."}, {"time": 614, "text": "It seems like we humans need a little bit of a competition."}, {"time": 618, "text": "Do you think that's necessary to succeed and to get the necessary investment, or can the pure pursuit of science be enough?"}, {"time": 628, "text": "No, I think we're seeing right now the pure pursuit of science."}, {"time": 633, "text": "I mean, that results in pretty tiny budgets for exploration."}, {"time": 639, "text": "There has to be some disaster impending doom to get us onto another planet in a permanent way."}, {"time": 648, "text": "I don't know, financially, I just don't know if the private sector can support that, but I don't wish that there is some catastrophe coming our way that spurs us to do that."}, {"time": 663, "text": "Yeah, I'm unsure what the business model is for colonizing Mars."}, {"time": 669, "text": "Yeah, like there is for, we'll talk about satellites."}, {"time": 671, "text": "There's probably a lot of business models around satellites, but there's not enough short term business."}, {"time": 678, "text": "I guess that's how business works."}, {"time": 679, "text": "Like you should have a path to making money in like the next 10 years."}, {"time": 685, "text": "Well, and maybe even more broadly, and looping back to something we said earlier, I don't know that getting humans off this planet and spreading like bacteria is what we're supposed to be doing in the first place."}, {"time": 705, "text": "So maybe we can go, but should we?"}, {"time": 709, "text": "And I'm probably an unusual person for thinking that in my industry because humans want to explore, but I almost wonder, are we putting unnecessary obstacles?"}, {"time": 723, "text": "Like we're very finicky biological things in the way of some more robotic or more silicon based exploration."}, {"time": 735, "text": "And yeah, do we need to colonize and spread?"}, {"time": 740, "text": "What do you think is the role of AI in space?"}, {"time": 742, "text": "Do you, in your work, again, we'll talk about it, but do you see more and more of the space vehicles, spacecraft being run by artificial intelligence systems?"}, {"time": 757, "text": "More than just like the flight control, but like the management?"}, {"time": 761, "text": "Yeah, I don't have a lot of color to the dreams I have about way in the future in AI, but I do think that removing, it's hard for humans to even make a trip to Mars, much less go anywhere farther than that."}, {"time": 820, "text": "So I see, I think what I'm saying is, I see a much bigger role in the future of AI for space exploration."}, {"time": 827, "text": "It's kind of sad to think that, I mean, I'm sure we'll eventually send a spacecraft with efficient propulsion, like some of the stuff you work on out that travels just really far with some robots on it and with some DNA in a Petri dish, and then human civilization destroys itself, and then there'll just be this floating spacecraft that eventually gets somewhere or not."}, {"time": 853, "text": "That's a sad thought, like this lonely spacecraft just kind of traveling through space and humans are all dead."}, {"time": 860, "text": "Well, it depends on what the goal is, right?"}, {"time": 867, "text": "Another way to look at it is we've preserved, it's like a little time capsule of knowledge, DNA, that will outlive us."}, {"time": 876, "text": "Well, that's beautiful."}, {"time": 879, "text": "It's how I sleep at night."}, {"time": 881, "text": "So you also mentioned that you wanted to be an astronaut."}, {"time": 885, "text": "So even though you said you're unusual in thinking like, it's nice here on Earth, and then we might want to be sending robots up there, you wanted to be a human that goes out there."}, {"time": 897, "text": "Would you like to one day travel to Mars?"}, {"time": 901, "text": "You know, if it becomes sort of more open to civilian travel and that kind of thing?"}, {"time": 907, "text": "Like are you, like vacation wise, like if we're talking vacations, would you like to vacation on Earth or vacation on Mars?"}, {"time": 915, "text": "I wish that I had a better answer, but no."}, {"time": 920, "text": "I wanted to be an astronaut because I, first of all, I like working in labs and doing experiments."}, {"time": 928, "text": "And I wanted to go to like the coolest lab, the ISS, and do some experiments there."}, {"time": 937, "text": "That's being decommissioned, which is sad, but you know, there will be others, I'm sure."}, {"time": 943, "text": "The ISS is being decommissioned?"}, {"time": 944, "text": "Yes, I think by 2025, it's not going to be in use anymore."}, {"time": 949, "text": "But I think there are other, there are private companies that are going to be putting up stations and things."}, {"time": 955, "text": "So it's primarily like a research lab, essentially."}, {"time": 958, "text": "A research lab in space, that's a cool way to say it."}, {"time": 959, "text": "It's like the coolest possible research lobby."}, {"time": 962, "text": "That's where I wanted to go."}, {"time": 963, "text": "And now though, my risk profile has changed a little bit."}, {"time": 968, "text": "I have three little ones and I won't be in the first thousand people to go to Mars, let's put it that way."}, {"time": 978, "text": "Yeah, Earth is kind of nice."}, {"time": 980, "text": "We have our troubles, but overall, it's pretty nice."}, {"time": 983, "text": "Again, it's the Netflix."}, {"time": 985, "text": "Okay, let's talk rockets."}, {"time": 988, "text": "How does a rocket engine work or any kind of engine that can get us to space or float around in space?"}, {"time": 996, "text": "The basic principle is conservation of momentum."}, {"time": 1000, "text": "So you throw stuff out the back of the engine and that pushes the rocket and the spacecraft in the other direction."}, {"time": 1011, "text": "So there are two main types of rocket propulsion."}, {"time": 1017, "text": "The one people are more familiar with is chemical because it's loud and there's fire."}, {"time": 1024, "text": "And that's what's used for launch and is more televised."}, {"time": 1028, "text": "So in those types of systems, you usually have a fuel on an oxidizer and they react and combust and release stored chemical energy."}, {"time": 1038, "text": "And that energy heats the resultant gas and that's funneled out the back through a nozzle, directed out the back and then that momentum exchange pushes the spacecraft forward."}, {"time": 1052, "text": "Is there an interesting difference in liquid and solid fuel in those contexts?"}, {"time": 1056, "text": "They're both lumped in the same."}, {"time": 1058, "text": "So chemical just means that the release of energy from those bonds essentially."}, {"time": 1065, "text": "So a solid fuel works the same way."}, {"time": 1068, "text": "And the other main category is electric propulsion."}, {"time": 1072, "text": "So instead of chemical energy, you're using electrical energy, usually from batteries or solar panels."}, {"time": 1080, "text": "And in this case, the stuff you're pushing out the back would be charged particles."}, {"time": 1087, "text": "So instead of combustion and heat, you end up with charged particles and you force them out the back of the spacecraft using either an electrostatic field or electromagnetic."}, {"time": 1101, "text": "But it's the same momentum exchange and same idea stuff out the back and everything else goes forward."}, {"time": 1107, "text": "Cool, so those are the big two categories."}, {"time": 1110, "text": "What's the difference maybe in the challenges of each, in the challenges of each, the use cases of each and how they're used today, the physics of each and where they're used, all that kind of stuff."}, {"time": 1128, "text": "Anything interesting about the two categories that distinguishes them?"}, {"time": 1131, "text": "Besides the chemical one being the big sexy flames."}, {"time": 1136, "text": "Yeah, fire."}, {"time": 1137, "text": "Fire, yeah."}, {"time": 1139, "text": "Chemical is very well understood in its simplest form, it's like a firework."}, {"time": 1146, "text": "So it's been around since 400 BC or something like that."}, {"time": 1152, "text": "So that even the big engines are quite well understood."}, {"time": 1155, "text": "I think one of the last gaps there is probably what exactly are the products of combustion?"}, {"time": 1167, "text": "Our modeling abilities kind of fall apart there because it's hot and gases are moving and you end up kind of having to venture into lots of different interdisciplinary fields of science to try to solve that."}, {"time": 1187, "text": "And that's quite complex, but we have pretty good models for some of the more like emergent behaviors of that system anyways."}, {"time": 1195, "text": "But that's I think one of the last unsolved pieces."}, {"time": 1200, "text": "And really the kind of what people care about there is making it more fuel efficient."}, {"time": 1207, "text": "So the chemical stuff, you can get a lot of instantaneous thrusts, but it's not very fuel efficient."}, {"time": 1215, "text": "It's much more fuel efficient to go with the electric type of propulsion."}, {"time": 1219, "text": "So that's where people spend a lot of their time is trying to make that more efficient in terms of thrust per unit of fuel."}, {"time": 1228, "text": "And then there's always considerations like heating and cooling."}, {"time": 1233, "text": "It's very hot, which is good if it heats the gases, but bad if it melts the rocket and things like that."}, {"time": 1240, "text": "So there's always a lot of work on heating and cooling and the engine cycles and things like that."}, {"time": 1246, "text": "And then on electric propulsion, I find it like much more refreshingly poorly understood."}, {"time": 1256, "text": "Lots more mysteries."}, {"time": 1258, "text": "One of the classes I took in college, we spent 90% of the class on chemical propulsion and then the last 10% on electric."}, {"time": 1267, "text": "And the professor said like, we only sort of understand how it works, but it works kind of."}, {"time": 1273, "text": "And it's like, that's interesting."}, {"time": 1276, "text": "Yeah, and even an ion engine, which is probably one of the most straightforward because it's just an electrostatic engine, but it has this really awesome combination of like quantum mechanics and material science and fluid dynamics and electrostatics."}, {"time": 1298, "text": "And it's just very intriguing to me."}, {"time": 1302, "text": "First of all, can you actually zoom out even more?"}, {"time": 1304, "text": "Like, cause you mentioned ion propulsion engine is a subset of electric."}, {"time": 1311, "text": "So like maybe, is there a categories of electric engines and then we can zoom in on ion propulsion?"}, {"time": 1315, "text": "Yes, so sure."}, {"time": 1317, "text": "There's the two most kind of conventional types that have been around since the sixties are ion engines and hall thrusters."}, {"time": 1326, "text": "And ion engines are a little bit simpler because they don't use a magnetic field for generating thrust."}, {"time": 1332, "text": "And then there are also some other types of plasma engines, but that don't fit into those two categories."}, {"time": 1341, "text": "So just kind of other plasma, like a VASMIR engine, which we could get into."}, {"time": 1348, "text": "And then those are probably the main three categories that would be fun to talk about."}, {"time": 1353, "text": "Oh, and then of course, the category of engine that I work on, which has a lot of similarities to an ion engine, but could be considered its own class called a colloid thruster."}, {"time": 1364, "text": "Colloid, cool."}, {"time": 1365, "text": "Okay, so what is an ion propulsion, I imagine?"}, {"time": 1368, "text": "Okay, so in an ion engine, you have an ionization chamber and you inject the propellant into that chamber."}, {"time": 1377, "text": "And this is usually a neutral gas like xenon or argon."}, {"time": 1383, "text": "So you inject that into the chamber and you also inject a stream of really high energy electrons and everything's just moving around very randomly in there."}, {"time": 1396, "text": "And the whole goal is to have one of those electrons collide with one of those neutral atoms and turn it into an ion."}, {"time": 1406, "text": "So kick off a secondary electron and now you have..."}, {"time": 1409, "text": "Plasma."}, {"time": 1411, "text": "And now you have a charged xenon or argon ion and more electrons and so on."}, {"time": 1419, "text": "And then some fraction of those ions will happen to make it to this downstream electric field that we set up between two grids with holes in them."}, {"time": 1430, "text": "And in terms of area, the same amount of those ions also runs into the walls and lose their charge and that's where some of the inefficiencies come in."}, {"time": 1441, "text": "But the very lucky few make it to the downstream and the very lucky few make it to those holes in that grid and there are two grids actually and you apply a voltage differential between them and that sets up an electric field."}, {"time": 1457, "text": "And a charged particle in an electric field creates a force."}, {"time": 1461, "text": "And so those ions are accelerated out the back of the engine and the reaction force is what pushes the spacecraft forward."}, {"time": 1470, "text": "If you're following along and tallying these charges, now we've just sent a positive beam of ions out the back of the spacecraft and for our purposes here, the spacecraft is neutral."}, {"time": 1485, "text": "So eventually those ions will come back and hit the spacecraft because it's a positive beam."}, {"time": 1491, "text": "So you also have to have an external cathode producer of electrons outside the engine that pumps electrons into that beam and neutralizes that."}, {"time": 1502, "text": "So now it's net neutral everywhere and it won't come back to the spacecraft."}, {"time": 1505, "text": "So that's an ion engine."}, {"time": 1507, "text": "What temperature are we talking about here?"}, {"time": 1509, "text": "So in terms of like the chemical based engines, those are super hot."}, {"time": 1514, "text": "You mentioned plasma here."}, {"time": 1516, "text": "How hot does this thing get?"}, {"time": 1520, "text": "I mean, is that an interesting thing to talk about in a sense that is that an interesting distinction or is the heat, I mean, it's all gonna be hot."}, {"time": 1528, "text": "No, so it's important especially for some of these smaller satellites people are into launching these days."}, {"time": 1535, "text": "So it's important because you have the plasma but also those high energy electrons are hot and if you have a lot of those that are going into the walls you do have to care about the temperature."}, {"time": 1548, "text": "So I'm having trouble remembering off the top of my head."}, {"time": 1552, "text": "I think they're at like a hundred electron volts in terms of the electron energy and then I'd have to remember how to convert that into Kelvin."}, {"time": 1560, "text": "Can you stick your hand in it?"}, {"time": 1562, "text": "Not move the temperature."}, {"time": 1563, "text": "Not recommended, yeah."}, {"time": 1565, "text": "So what's a colloid engine?"}, {"time": 1567, "text": "So the same rocket people that came up with these ideas for electric propulsion probably in the middle of last century also realized that there's one more place to get charged particles from if you're going to be using electric propulsion."}, {"time": 1590, "text": "So you can take a gas and you can ionize it but there are also some liquids particularly ionic liquids which is what we use that you also can use as a source of ions and if you have ions and you put them in a field you generate a force."}, {"time": 1605, "text": "So they recognize that but part of being able to leverage that technique is being able to kind of manipulate those liquids on a scale of nanometers or very few microns."}, {"time": 1621, "text": "So the diameter of a human hair or something like that and in the 50s there was no way to do that."}, {"time": 1628, "text": "So they wrote about it in some books and then it kind of died for a little bit and then with silicon mems, computer processors and when foundry started becoming more ubiquitous and my advisor started at MIT kind of put those ideas back together and was like, hey actually there's now a way to build this and bring this other technique to life."}, {"time": 1656, "text": "And so the way that you actually get the ions out of those liquids is you put the liquid in again a strong electric field and the electric field stresses the liquid and you keep increasing the field and eventually the liquid will assume a conical shape."}, {"time": 1677, "text": "It's when the electric field pressure that's pulling on it exactly balances the liquid's own restoring force which is its surface tension."}, {"time": 1726, "text": "So the field becomes strong enough there that you can pull ions out of the liquid."}, {"time": 1730, "text": "What is the liquid?"}, {"time": 1731, "text": "We're talking about, there's a bunch of different ones."}, {"time": 1734, "text": "You can do it with different types of liquids."}, {"time": 1738, "text": "It depends on how easily you can free ions from their neighbors and if it has enough surface tension so that you can build up a high enough electric field but what we use are called ionic liquids and they're really just positive."}, {"time": 1753, "text": "They're very similar to salts but they happen to be liquid over a really wide range of temperatures."}, {"time": 1759, "text": "This sounds like really cool."}, {"time": 1761, "text": "Okay, so how big is the cone we're talking about?"}, {"time": 1765, "text": "What's the size of this cone that generates the ions?"}, {"time": 1767, "text": "So if you have a cone that's emitting pure ions, I can't remember if it's the radius or diameter but that emission is happening from, of that cone is something like 20 nanometers."}, {"time": 1781, "text": "Oh, I was imagining something slightly bigger but so like this is tiny, tiny."}, {"time": 1789, "text": "Hence the only being able to do it recently."}, {"time": 1792, "text": "So this is all controlled by a computer, I guess."}, {"time": 1795, "text": "Like, or like, how do you create a cone that generates ions at a scale of nanometers exactly?"}, {"time": 1804, "text": "So the kind of main trick to making this work is that physically we manufacture hundreds or thousands of sharp structures and then supply the liquid to the tips."}, {"time": 1817, "text": "So that does a few things."}, {"time": 1820, "text": "It makes sure that we know where the ion beams are forming."}, {"time": 1823, "text": "So we can put holes in the grid above them to let them actually leave instead of hitting, right?"}, {"time": 1829, "text": "But it also reduces the actual field we have, the voltage we have to apply to create that field because the field will be much stronger if we can already give the liquid a tip to form on."}, {"time": 1841, "text": "And those tips we form have radii of curvature on the order of probably like single microns."}, {"time": 1850, "text": "So we are working at a little bit larger scale but once we create that support and the electric field can be focused at that tip, then the tiny little cone can form on top of that."}, {"time": 1860, "text": "So wait, so there's something in them, there's already like a hard material that like gives you the base for the cone and then you're pouring like liquid over it, whatever the heck."}, {"time": 1868, "text": "From the bottom, yeah."}, {"time": 1870, "text": "It's porous, so we actually supply it from the back of the chip and then it wicks."}, {"time": 1873, "text": "And then liquid forms on top on that structure."}, {"time": 1877, "text": "And then you somehow make it like super sharp, the liquid, so the ions can leave."}, {"time": 1884, "text": "And then we've applied that field to get those ions and that same field then accelerates them."}, {"time": 1891, "text": "And there's like a bunch of these?"}, {"time": 1893, "text": "Yeah, I should have brought something."}, {"time": 1897, "text": "So we... You could just pretend that you have some nanometer cones on a table here."}, {"time": 1902, "text": "So actually, you know, kind of about this scale, we build, we call them thruster chips and it's just a convenient form factor and it's a square centimeter."}, {"time": 1911, "text": "And on each square centimeter today, we have about 500 of the actual physical, we call them emitters, those physical cones."}, {"time": 1920, "text": "And we're working on increasing that by a factor of four in the coming months."}, {"time": 1925, "text": "In size or in the density?"}, {"time": 1927, "text": "In number, in the density, the number of emitters within the same square centimeter chip."}, {"time": 1932, "text": "So that thing, cause I think I've seen pictures of you with like a tiny thing in your hand."}, {"time": 1935, "text": "That must be the..."}, {"time": 1937, "text": "Okay, so that's an engine."}, {"time": 1939, "text": "So that is kind of the ionization chamber and thrust producing part of it."}, {"time": 1946, "text": "What's not shown, you know, in that picture is the propellant tank."}, {"time": 1951, "text": "So we can keep supplying more and more of the liquid to those emission sites."}, {"time": 1956, "text": "And then we also provide a power electronic system that talks to the spacecraft and turns our device on and off."}, {"time": 1963, "text": "So that's the colloid engine."}, {"time": 1965, "text": "That's the core of the colloid engine."}, {"time": 1967, "text": "It's, the way I've been talking about it, it's more of ion electrospray colloid tends to mean like liquid droplets coming off of the jet."}, {"time": 1980, "text": "But if you make smaller and smaller cones, you get pure ions."}, {"time": 1984, "text": "So we're kind of like a subset of colloid, yes."}, {"time": 1987, "text": "What aspects of this, you said that it's been full of mysteries from the physics perspective."}, {"time": 1993, "text": "What aspects of this are understood and what are still full of mystery?"}, {"time": 1999, "text": "Yeah, recently we've been understanding the kind of instabilities and stable regimes of, you know, how much liquid do you supply and what field do you apply?"}, {"time": 2014, "text": "And why is it flickering on and off?"}, {"time": 2017, "text": "Or why does it have these weird behaviors?"}, {"time": 2019, "text": "So that's, in the past just couple of years, that's become much more understood."}, {"time": 2027, "text": "I think the two areas that come to mind as far as not as well understood are the boundary between, you know, you have, we actually use kind of big molecular ions."}, {"time": 2043, "text": "And if you're looking at the molecular scale, you have, you know, some ions that you've extracted and they're in this electric field."}, {"time": 2052, "text": "One ion, you know, it's a big molecule, it's getting energy from the electric field."}, {"time": 2059, "text": "And some of that energy is going into the bonds and making it vibrate and doing weird things to it."}, {"time": 2064, "text": "Sometimes it breaks them apart."}, {"time": 2066, "text": "And then zooming out to the whole beam, the beam has some behaviors as this beam of ions."}, {"time": 2074, "text": "And there's a big gap between what are those, how do you connect those?"}, {"time": 2080, "text": "And how do we understand that better so that we can understand the beam performance of the engine?"}, {"time": 2085, "text": "Is that a theory question or is it an engineering question?"}, {"time": 2088, "text": "Theory, definitely."}, {"time": 2090, "text": "We're, Axion is a startup and we're more in the business of building and testing and observing and characterizing."}, {"time": 2099, "text": "And we're not really diving much into that theory right now."}, {"time": 2103, "text": "Okay, zooming out a little bit on the physics, apologize for the way too big of a question, but to you from either, you mentioned Axion is, you know, more of sort of an engineering endeavor, right?"}, {"time": 2116, "text": "But from a perspective of physics in general, science in general, or the side of engineering, what do you think is the most, to you, like beautiful and captivating and inspiring idea in this space?"}, {"time": 2130, "text": "In this space, and then I'm gonna zoom out a little bit more, but in this space, I keep butting up against material science questions."}, {"time": 2141, "text": "So I, over the past 10 years, I feel like every problem or interesting thing I want to work on, if you dig deep enough, you end up in material science land, which I find kind of exciting and it makes me want to dig in more there."}, {"time": 2160, "text": "And I was just, you know, even for our technology, when we have to move the propellant from the tank to the tip of the emitters, we rely a lot on capillary action and you're getting into wetting and surface energies."}, {"time": 2175, "text": "At a scale of like nano scale."}, {"time": 2177, "text": "Yeah, I mean, it's, if you look further, it's quantum too, but it all is, you know, a capillary action at the quantum level."}, {"time": 2187, "text": "Yeah, so I would, it all comes back to me to, you know, material science, there's so much we don't understand at these sizes and I find that inspiring and exciting."}, {"time": 2235, "text": "Yeah, the patterns that mathematics reveals seems to echo in a bunch of different places."}, {"time": 2241, "text": "Yeah, there's just weirdness."}, {"time": 2242, "text": "It's like, it really makes you think, I think you're definitely living in a simulation, like whoever programmed it."}, {"time": 2249, "text": "I like that that's your conclusion."}, {"time": 2250, "text": "Is using like shortcuts to program it, like they didn't, they're just copying and pasting some codes for the different parts."}, {"time": 2258, "text": "Yeah, think of something new or just paste from over there."}, {"time": 2261, "text": "They won't notice."}, {"time": 2262, "text": "My conclusion from that was I'm gonna go interview for a finance job, so I had like a little detour."}, {"time": 2269, "text": "That's the backup option."}, {"time": 2271, "text": "So in terms of using call it engines, what's an interesting difference between a propulsion of a rocket from earth when you're standing on the ground to orbit and then the kind of propulsion necessary for once you get out to orbit or to like deep space to move around."}, {"time": 2293, "text": "Yes, the reason you can't use an engine like mine to get off the ground is, the thrust it generates is instantaneous thrust is very small, but if you have the time and can accumulate that acceleration, you can still reach speeds that are very interesting for exploration and even for missions with humans on them."}, {"time": 2321, "text": "An interesting direction I think we need to go as humans exploring space is the power supplies for electric propulsion are limiting us in that solar panels are really inefficient and bulky and batteries."}, {"time": 2341, "text": "I don't know when anybody's ever gonna improve battery technology."}, {"time": 2345, "text": "I know a lot of people that work on that."}, {"time": 2349, "text": "And nuclear power, we could have a lot more powerful electric propulsion system."}, {"time": 2355, "text": "So they would be extremely fuel efficient, but more instantaneous thrust to do more interesting missions if we could start launching more nuclear systems."}, {"time": 2365, "text": "So like something that's powered, nuclear powered, that's the right way to say it."}, {"time": 2372, "text": "But is in a small enough container that could be launched?"}, {"time": 2376, "text": "Yeah, so I mean, as a world we do launch spacecraft with nuclear power systems on board, but size is one consideration."}, {"time": 2387, "text": "It hasn't been a big focus."}, {"time": 2389, "text": "So the reactors and the heaters and everything are bulky."}, {"time": 2393, "text": "And so they're really only suitable for some of the much bigger interplanetary stuff."}, {"time": 2399, "text": "So that's one issue, but then it's a whole like rat's nest of political stuff as well."}, {"time": 2406, "text": "I heard, I think Elon described or somebody, I think it was Elon that described the EV to all like electrical, vertical takeoff and landing vehicles."}, {"time": 2417, "text": "So basically saying rockets, obviously Elon is interested in electric vehicles, right?"}, {"time": 2422, "text": "But he said that rockets can't, in the near term, it doesn't make sense for them to be electrical."}, {"time": 2432, "text": "What, do you see a world with the rockets that we use to get into orbit are also electric based?"}, {"time": 2439, "text": "It's possible, you can produce the thrust levels you need, but you need this, a much bigger power supply."}, {"time": 2446, "text": "And I think that would be nuclear."}, {"time": 2449, "text": "And the only way people have been able to launch them at all is that they're in a 100 times redundancy safe mode while they're being launched and they're not turned on until they're farther off."}, {"time": 2460, "text": "So if you were to actually try to use it on launch, I think a lot of people would still have an issue with that, but someday."}, {"time": 2468, "text": "It's an interesting concept, nuclear."}, {"time": 2471, "text": "It seems like people, like everybody that works on nuclear power has shown how safe it is as a source of energy."}, {"time": 2478, "text": "And yet we are, seem to be, I mean, based on the history, based on the excellent HBO series, I'm Russian with a Chernobyl."}, {"time": 2488, "text": "It seems like we have our risk estimation about this particular power source is drastically inaccurate, but that's a fascinating idea that we would use nuclear as a source for our vehicles and not just in outer space."}, {"time": 2505, "text": "I'm gonna have to look into that."}, {"time": 2505, "text": "That's super interesting."}, {"time": 2507, "text": "Well, just last year, Trump eased up a little bit on the regulations and NASA and hopefully others are starting to pick up on the development."}, {"time": 2517, "text": "So now is a good time to look into it because there's actually some movement."}, {"time": 2522, "text": "Is that a hope for you to explore different energy sources that the entirety of the vehicle uses something like the entirety of the propulsion systems for all aspects of the vehicle's life travel is the same or electric?"}, {"time": 2539, "text": "Is it possible for it to be the same?"}, {"time": 2540, "text": "Like the colloid engine being used for everything?"}, {"time": 2544, "text": "You could, and you would have to do it in the same way we do different stages of rockets now where once you've used up an engine or a stage, you let it go because there's really no point in holding onto it."}, {"time": 2557, "text": "So I wouldn't necessarily want to use the same engine for the whole thing, but the same technology I think would be interesting."}, {"time": 2565, "text": "Okay, so it's possible."}, {"time": 2566, "text": "All right, but in terms of."}, {"time": 2567, "text": "Yeah, it comes down to the power source."}, {"time": 2569, "text": "The power source, that's really interesting."}, {"time": 2571, "text": "But for the current power sources and its current use cases, what's the use case for electric, like the colloid engine?"}, {"time": 2578, "text": "Can you talk about where they're used today?"}, {"time": 2581, "text": "Sure, so chemical engines are still used quite a bit once you're in orbit, but that's also where you might choose instead to use an electric system and what people do with them."}, {"time": 2595, "text": "And this includes the ion engines and hall thrusters and our engine is basically any maneuvering you need to do once you're dropped off."}, {"time": 2604, "text": "Even if your only goal was to just stay in your orbit and not move for the life of your mission, you need propulsion to accomplish that because the Earth's gravity field changes as you go around in orbit and pulls you out of your little box."}, {"time": 2622, "text": "There are other perturbations that can throw you off a bit."}, {"time": 2627, "text": "And then most people want to do things a little bit more interesting like maneuver to avoid being hit by space debris or perhaps lower their orbit to take a higher resolution image of something and then return."}, {"time": 2642, "text": "At the end of your mission, you're supposed to responsibly get rid of your satellite, whether that's burning it up, but if you're in geo, you want to push it higher into graveyard orbit."}, {"time": 2657, "text": "What's geo and what's graveyard?"}, {"time": 2659, "text": "So low Earth orbit and then geosynchronous orbit or geostationary orbit."}, {"time": 2663, "text": "And there's a graveyard?"}, {"time": 2664, "text": "Yeah, so those satellites are at like 40,000 kilometers."}, {"time": 2669, "text": "So if they were to try to push their satellites back down to burn up in the atmosphere, they would need even more propulsion than they've had for the whole lifetime of their mission."}, {"time": 2680, "text": "So instead they push them higher where it'll take a million years for it to naturally deorbit."}, {"time": 2686, "text": "So we're also cluttering that higher bit up as well, but it's not as pressing as Leo, which is low Earth orbit where more of these commercial missions are going now."}, {"time": 2696, "text": "Well, so how hard is the collision avoidance problem there?"}, {"time": 2699, "text": "You said some debris and stuff."}, {"time": 2700, "text": "So like how much propulsion is needed?"}, {"time": 2703, "text": "Like how much is the life of a satellite is just like a crap trying to avoid like little things down there?"}, {"time": 2709, "text": "I think one of the recent rules of thumb I heard was per year some of these small satellites are doing like three collision avoidance maneuvers."}, {"time": 2721, "text": "So that's not, yeah, but it's not zero."}, {"time": 2725, "text": "And it takes a lot of planning and people on the ground and none of that really, I don't think right now is autonomous."}, {"time": 2736, "text": "Oh, that's not good."}, {"time": 2737, "text": "Yeah, and then we have a lot of folks taking advantage of Moore's law and cheaper spacecraft."}, {"time": 2742, "text": "So they're launching them up without the ability to maneuver themselves."}, {"time": 2746, "text": "And they're like, well, I don't know, just don't hit me."}, {"time": 2749, "text": "And three times a year that could become affordable if it gets hit, maybe it won't be damaged kind of thing, that kind of logic."}, {"time": 2757, "text": "Affordable in that instead of launching one satellite, they'll launch 20 small ones."}, {"time": 2762, "text": "Yeah, so if one gets taken out, that's okay."}, {"time": 2765, "text": "But the problem is that one good sized satellite getting hit, that's like a ballistic event that turns into 10,000 pieces of debris that then are the things that go and hit the other satellites."}, {"time": 2778, "text": "So do you see a world where, like in your sense, in your own work and just in the space industry in general, do you see the people moving towards bigger satellites or smaller satellites?"}, {"time": 2789, "text": "Is there going to be a mix?"}, {"time": 2791, "text": "Like what's, and what do we talk, what does it mean for a satellite to be big and small?"}, {"time": 2796, "text": "What size are we talking about?"}, {"time": 2797, "text": "So big, the space industry prior to, I don't know, 1990, I guess the bulk of, the majority of satellites were the size of a school bus and cost a couple billion dollars."}, {"time": 2813, "text": "And now our first launches were on satellites the size of shoe boxes that were built by high school students."}, {"time": 2823, "text": "So that's a very different, to give you the two ends of the spectrum."}, {"time": 2827, "text": "So big satellites will, I think they're here to stay, at least as far as I can see into the future for things like broadcasting."}, {"time": 2838, "text": "You want to be able to broadcast to as many people as possible."}, {"time": 2845, "text": "You also can't just go to small satellites and say Moore's law for things like optics."}, {"time": 2852, "text": "So if you have an aperture on your satellite, that just, that doesn't follow Moore's law."}, {"time": 2856, "text": "That's different."}, {"time": 2857, "text": "So it's always going to be the size that it will be, unless there's some new physics that comes out that I'm not aware of."}, {"time": 2864, "text": "But if you need a resolution and you're at an altitude, that kind of sets your, the size of your telescope."}, {"time": 2870, "text": "But because of Moore's law, we are able to do a lot more with smaller packages."}, {"time": 2876, "text": "And with that comes more affordability and opening up access to space to more and more people."}, {"time": 2883, "text": "Well, what's the smallest satellite you've seen go up there?"}, {"time": 2886, "text": "Like what are the smallest kind of, you said shoe boxes."}, {"time": 2889, "text": "Yeah, so I think the smallest common form factor can fit a softball inside."}, {"time": 2897, "text": "So that's 10 centimeters on each side."}, {"time": 2901, "text": "But then there are some companies working on fractions of that even."}, {"time": 2906, "text": "And they're doing things like IOT type application."}, {"time": 2910, "text": "So it's very low bandwidth type things, but they're finding some niches for those."}, {"time": 2917, "text": "Do you mean like there's a business, there's a thing to do with them?"}, {"time": 2920, "text": "Yes, either."}, {"time": 2921, "text": "What do you do with a small satellite like that?"}, {"time": 2924, "text": "You can track a ship going across the ocean."}, {"time": 2928, "text": "Like if you need to, if you're just pinging something, you can handle that amount of data and those latencies and so on."}, {"time": 2936, "text": "You have to have propulsion on that."}, {"time": 2937, "text": "You have to have a little engine."}, {"time": 2938, "text": "No, those are just letting fall out of the sky."}, {"time": 2942, "text": "Okay, so what kind of satellite would you equip a colloid engine on?"}, {"time": 2948, "text": "Anything that's bigger than probably about 20 kilograms, anything that needs to stay up for more than a year or anything somebody spent more than like 100K to build are kind of the ways I would think about it."}, {"time": 2961, "text": "That's a lot of use cases."}, {"time": 2963, "text": "What's a small sat?"}, {"time": 2966, "text": "Like what category?"}, {"time": 2966, "text": "Small sat is actually very big."}, {"time": 2968, "text": "I think it's like 700 kilograms, or I keep hitting my microphone, maybe 1,000 kilograms down to 200 kilograms."}, {"time": 2980, "text": "People have their own kind of definitions of how they break them up, but small sat is still quite large."}, {"time": 2986, "text": "And then it's kind of also applied as a blanket term for anything that's not a school bus size satellite."}, {"time": 2992, "text": "So we need to get our jargon straight in the industry."}, {"time": 2996, "text": "So do you see a possible future where, you know, there's a few thousand satellites up there now, a couple of thousand of them functioning."}, {"time": 3005, "text": "Do you see a future where there's like millions of satellites up in orbit?"}, {"time": 3009, "text": "Or forget millions, tens of thousands, which just seems like where the natural trajectory of the way things are going now is going."}, {"time": 3022, "text": "The two buckets of applications, one is imaging and the other is communication."}, {"time": 3030, "text": "So imaging, I think that will plateau because one satellite or one constellation can take an image or a video and sell it to, you know, infinity customers."}, {"time": 3044, "text": "But if you're providing communications like broadband internet or satellite cell or something like that, satellite phone, you know, you're limited by your transponders and so on."}, {"time": 3058, "text": "So to serve more people, you actually need more satellites and perhaps at the rate, you know, our data consumption and things are going these days."}, {"time": 3068, "text": "Yeah, I can see tens of thousands of satellites."}, {"time": 3072, "text": "Can I ask you a ridiculous question?"}, {"time": 3075, "text": "So I've recently watched this documentary on Netflix about flat earthers, you know, the people that believe in a flat earth."}, {"time": 3085, "text": "As somebody who develops propulsion systems for satellites and for spacecraft, what's, do you use the most convincing evidence that the earth is round?"}, {"time": 3100, "text": "Probably some of the photos taken from the moon."}, {"time": 3108, "text": "Photos from the moon?"}, {"time": 3109, "text": "Okay, so it's not from the satellite space."}, {"time": 3112, "text": "Yeah, I think seeing that perspective, maybe I'm just, I'm answering too personally because I really love those photos."}, {"time": 3123, "text": "Because they're beautiful, yeah."}, {"time": 3124, "text": "I really like the ones that show the moon and the lunar lander and they're taken a little bit farther back."}, {"time": 3130, "text": "So you see earth and first you're like, wow, that's tiny and we're insignificant and that's kind of sad."}, {"time": 3137, "text": "But then you see this really cool thing that we landed on another planetary body and you're like, oh, okay."}, {"time": 3144, "text": "Can you actually see earth?"}, {"time": 3146, "text": "I don't know if I remember this."}, {"time": 3147, "text": "Yeah, I'll send you that picture."}, {"time": 3149, "text": "Because I love the pictures or videos of just earth from orbit and so on."}, {"time": 3154, "text": "Just like those, that's really beautiful."}, {"time": 3156, "text": "That's like a perspective shifter."}, {"time": 3158, "text": "That's the pale blue dot, right?"}, {"time": 3159, "text": "It probably appears tiny."}, {"time": 3161, "text": "Yeah, and just that juxtaposition of the insignificance, but we built this, really cool thing."}, {"time": 3169, "text": "And I just love that, yeah."}, {"time": 3170, "text": "Oh, that'd be cool."}, {"time": 3171, "text": "I can't, I personally love the idea of humans stepping on Mars."}, {"time": 3174, "text": "I'm such a sucker for the romantic notion of that and being able to take pictures from Mars next."}, {"time": 3181, "text": "So you would go?"}, {"time": 3183, "text": "I, yeah, I would be, what did you say?"}, {"time": 3188, "text": "You said you wouldn't be the first one."}, {"time": 3189, "text": "Not in the first 1,000."}, {"time": 3190, "text": "1,000, which it's funny because to me, that's brave to be in the first million."}, {"time": 3197, "text": "I think when the Declaration of Independence was signed in the United States, that was like two million people."}, {"time": 3205, "text": "So I would like to show up when they're signing those documents."}, {"time": 3210, "text": "So maybe the two million."}, {"time": 3211, "text": "Oh, that's an interesting way to think about it."}, {"time": 3212, "text": "Because like then we're like participating in citizenry and defining the direction."}, {"time": 3218, "text": "So it's not the technical risk."}, {"time": 3221, "text": "You just don't wanna show up somewhere that's like America before."}, {"time": 3226, "text": "Yeah, because I, from a psychological perspective, it's just gonna be a stressful mess as people have studied, right?"}, {"time": 3236, "text": "It's like, it's people, most likely the process of colonization like looks like basically a prison."}, {"time": 3247, "text": "Like you're in a very tight and closed space with people."}, {"time": 3250, "text": "And it's just a really stressful environment."}, {"time": 3253, "text": "How do you select the kind of people that will go and then there'll be drama."}, {"time": 3256, "text": "There's always drama."}, {"time": 3257, "text": "And I just wanna show up when there's some rules."}, {"time": 3261, "text": "But I mean, you know, it depends."}, {"time": 3262, "text": "So I'm not worried about the health and the technical difficulties."}, {"time": 3266, "text": "I'm more worried about the psychological difficulties."}, {"time": 3269, "text": "And also just not being able to tweet."}, {"time": 3271, "text": "Like what are you gonna, how are you talking?"}, {"time": 3273, "text": "There's no Netflix."}, {"time": 3274, "text": "So yeah, maybe not in the first million, but the first 100,000."}, {"time": 3279, "text": "It's exciting to define the direction of a new, like how often do we not just have a revolution to redefine our government, as smaller countries are still doing to this day, but literally start over from scratch."}, {"time": 3294, "text": "There's just our financial system."}, {"time": 3296, "text": "It could be like based on cryptocurrency, you could think about like how democracy, we have now the technology that can enable pure democracy, for example, if we choose to do that, as opposed to representative democracy, all those kinds of things."}, {"time": 3312, "text": "So we talked about two different forms of propulsion, which are super exciting."}, {"time": 3318, "text": "So the chemical based, that's doing pretty well."}, {"time": 3320, "text": "And then the electric based is, are there types of propulsion that might sound like science fiction right now, but are actually within the reach of science in the next 10, 20, 30, 50 years that you kind of think about, or maybe even within the space of even just like, like even ION engines, is there like breakthroughs that might 10 X the thing, like really improve it?"}, {"time": 3347, "text": "So, you know, the real game changer would be propellantless propulsion."}, {"time": 3354, "text": "And so every couple of years you see a new, now a startup or a researcher comes up with some contraption for producing thrust that didn't require, you know, we've been talking about conservation of momentum, mass times velocity out the back, mass times velocity forward."}, {"time": 3374, "text": "And you have to, you know, carry that up with you or find it on an asteroid or harvest it from somewhere if you didn't bring it with you."}, {"time": 3382, "text": "So not having to do that would be, you know, one of the ultimate game changers."}, {"time": 3388, "text": "And I, you know, unless there are new types of physics, I don't know how we do it, but it comes up often, so it's something I do think about."}, {"time": 3399, "text": "And, you know, the one, I think it's called the Casimir effect."}, {"time": 3404, "text": "If you can, if you have two plates and the space between them is on the order of these, like the wavelength of these ephemeral vacuum particles that pop into and out of existence or something."}, {"time": 3417, "text": "I may be confusing multiple types of propellantless forces, but that could be real and could be something that we use eventually."}, {"time": 3430, "text": "What would be the power source?"}, {"time": 3432, "text": "Yeah, the most recent engine like this that was just debunked this year, I think, in March or something was called the M drive."}, {"time": 3442, "text": "And supposedly you used a power source, so, you know, batteries or solar panels to generate microwaves into this resonant cavity."}, {"time": 3452, "text": "And people claimed it produced thrust."}, {"time": 3455, "text": "So they went straight from this really loose concept to building a device and testing it."}, {"time": 3460, "text": "And they said, we've measured thrust and sure on their thrust balance, they saw thrust and different researchers built it and tested it and got the same measurements."}, {"time": 3469, "text": "And so it was looking actually pretty good."}, {"time": 3472, "text": "No one could explain how it worked, but what they said was that this inside the cavity, the microwaves themselves didn't change, but the speed of light changed inside the cavity."}, {"time": 3483, "text": "So relative to that, you know, their momentum was conserved."}, {"time": 3489, "text": "And I don't, you know, whatever."}, {"time": 3494, "text": "But finally someone, I think at NASA built the device, tested it, got the same thrust, then unhooked it, flipped it backwards and turned it on, but got the same thrust in the same direction again."}, {"time": 3504, "text": "And so they're like, this is just an interaction with the test setup or, you know, some of the chamber or something like that."}, {"time": 3510, "text": "So forwarded again, but, you know, it would be so wonderful for everybody if we could figure out how to do it, but I don't know."}, {"time": 3519, "text": "That's an interesting twist on it because that's more about efficient travel, long distance travel, right?"}, {"time": 3526, "text": "That's not necessarily about speed."}, {"time": 3529, "text": "That's more about enabling like, let's hook that up to the nuclear power supply."}, {"time": 3537, "text": "But still in terms of speed, in terms of trying to, so there's recently, already I think been debunked or close to being debunked, but the signal, a weird signal from our nearby friends, nearby exoplanets from Proxima Centauri, a signal that's 4.2 light years away."}, {"time": 3562, "text": "So, you know, the thought is it'd be kind of cool if there's life out there, alien life, but it'd be really cool if it could fly out there and check."}, {"time": 3574, "text": "And so what kind of propulsion, and do you think about what kind of propulsion will allow us to travel close to the speed of light or, you know, half the speed of light, all those kinds of things that would allow us to get to Proxima Centauri and have reasonable, in a lifetime?"}, {"time": 3590, "text": "You know, there's the project Breakthrough Starshot."}, {"time": 3595, "text": "That's looking at sending those tiny little chip sets."}, {"time": 3599, "text": "They're like accelerating really fast."}, {"time": 3601, "text": "Yeah, using a laser, so launching them and then while they're still relatively close to the earth, you know, blasting them with some, I forget what, even what power level you needed to accelerate them fast enough to get there in 20 years."}, {"time": 3615, "text": "Super crazy sounding, but a lot of people say that's a legitimate, like it's crazy sounding, but it can actually pull it off."}, {"time": 3622, "text": "Yeah, I love that project because there are a lot of different aspects."}, {"time": 3626, "text": "You know, there's the laser, there's how do you then get enough power when you're there to send a signal back."}, {"time": 3633, "text": "No part of that project is possible right now, but I think it's really exciting."}, {"time": 3638, "text": "But do you see like human, like a spacecraft with a human on it, so it's like a heavy one, being like us inventing new propulsion systems entirely."}, {"time": 3649, "text": "Like, do you ever see that on the radar of propulsion systems like that or are they completely out there in the impossible?"}, {"time": 3657, "text": "Well, we're going to quickly leave the realm of what I can describe with any credibility, but I think because of special relativity, if we try to accelerate some mass close to the speed of light, it becomes infinitely heavy and then we just don't, we'd have to like harness a lot of suns to do that."}, {"time": 3680, "text": "Or, you know, it's just that math doesn't quite work out, but, you know, in my child's, my childlike heart, I believe that, you know, we're missing something, whether it's, you know, dark matter or other dimensions."}, {"time": 3698, "text": "And if you can just have some anti matter and a black hole and then ride that around and somehow, you know, turn that into some."}, {"time": 3709, "text": "Mess with gravity somehow."}, {"time": 3711, "text": "Yeah, I feel like we're missing lots of things in this puzzle and that, you know."}, {"time": 3720, "text": "I want to heart that puzzle."}, {"time": 3722, "text": "I can speak with confidence as a descendant of apes that we don't know what the hell we're doing."}, {"time": 3729, "text": "So there's, we're like really confident, like physicists are really confident that we've like got most of the picture down, but it feels like, oh boy, it feels like that we might not even be getting started on some of the essential things that would allow us to engineer systems that would allow us to travel to space much, much faster."}, {"time": 3756, "text": "Yeah, and there's even things that are much more commonplace that we can't explain, but we've started to take for granted, like quantum tunneling, you know, just things like, oh, the electron was here with this energy and now it's here with this energy and it's just tunneling."}, {"time": 3775, "text": "But so, you know, we're missing a lot of the picture."}, {"time": 3778, "text": "So yeah, I don't know, to, you know, use your same question from earlier, I don't know if you and I will see it, but yeah, someday."}, {"time": 3787, "text": "You're the cofounder of, just like we've been talking about, Axion Systems."}, {"time": 3792, "text": "It's a, would you say a space propulsion company?"}, {"time": 3796, "text": "Broadly speaking."}, {"time": 3798, "text": "So how do you, big question, how do you build a rocket company from like a propulsion company from one person, from two people to 10 people plus, and actually, you know, take it to a successful product?"}, {"time": 3821, "text": "Yeah, well, I think the early stage is quite, I'm not supposed to use the word easy when you work in rocket science, but straightforward when you're working on something, you know, sexy, like an ion engine, it's more straightforward to raise money and get people to come work for you because the vision's really exciting."}, {"time": 3842, "text": "And actually that's something I would say is very important throughout, is a really exciting vision because when everything, you know, goes to crap, you need that to get people getting themselves out of bed in the morning and thinking of the higher purpose there."}, {"time": 3860, "text": "And, you know, another thing along the way that I think is key in building any company is the right early employees that also have their own networks and can bring in a lot of people that, you know, really make the whole greater than just the sum of the early team."}, {"time": 3886, "text": "How do you build that?"}, {"time": 3887, "text": "Like, how do you find people?"}, {"time": 3889, "text": "It's like asking, like, how do you make friends?"}, {"time": 3892, "text": "But is there, is it luck?"}, {"time": 3895, "text": "Is there a system?"}, {"time": 3897, "text": "Like how, in terms of the people you've connected with, the people you built the company with, is there some thread, some commonality, some pattern that you find to be, to hold for what makes a great team?"}, {"time": 3915, "text": "I think, you know, personally, a thread for me has been my network and being able to draw on that a lot, but also giving back to it as much as possible in like an unsolicited sort of way, like making connections between people that, you know, maybe didn't ask, but that I think could be really fruitful."}, {"time": 3939, "text": "And even, you know, weirder than that is just really getting, you know, having weird, uncomfortable conversations with people like at a conference and getting over the small talk quickly and getting to know them quickly and having a relationship that stands out and then being able to call on them later because of that."}, {"time": 3963, "text": "And I think that's been because I'm introverted and I, you know, want to poke my eyes out instead of go and do small talk."}, {"time": 3973, "text": "And so I huddle in a corner with one person and, you know, we talk about aliens or things like that."}, {"time": 3979, "text": "And so, you know, that's all to say that, you know, having a strong network, I think is really important, but a genuine one."}, {"time": 3988, "text": "And let's see, other ways to build a rocket company, kind of making sure you're paying attention to the sweeping trends of the industry so everybody just cares about cost and being able to get out ahead of that and even more than we ever thought we'd need to as far as what we needed to price our systems at."}, {"time": 4006, "text": "You know, people for, since the start of the US space industry, they've been paying 20, 25 million in adjusted dollars for an ion engine."}, {"time": 4018, "text": "And seeing that now people are going to want to pay 10K for an ion engine and just staying out ahead of that and those kinds of things."}, {"time": 4030, "text": "So, you know, being out in the industry and talking to as many people as possible."}, {"time": 4035, "text": "So there's a drive."}, {"time": 4035, "text": "I mean, I suppose SpaceX really pushed that."}, {"time": 4038, "text": "Frustrating for me."}, {"time": 4040, "text": "So SpaceX really pushed this, the application of, I guess, capitalism of driving the price down, of basically forcing people to ask the question, can this be done cheaper?"}, {"time": 4055, "text": "This can lead to like big problems, I would say, in the following sense."}, {"time": 4063, "text": "I see this in the car industry, for example, that people have, it's such a small margin for profit."}, {"time": 4073, "text": "Like they've driven the cost of everything down so much that there's literally no room for innovation for taking risks."}, {"time": 4081, "text": "So like cars, which is funny because not until Tesla, really, which is one of the, in a long, long time, one of the first successful new car companies that's constantly innovating, every other car company is really pouring in terms of their technological innovation."}, {"time": 4101, "text": "They innovate on design and style and so on, that people fall in love with the look and so on, but it's not really innovation."}, {"time": 4109, "text": "In terms of the technology in it, it's really boringly the same thing, and they're really afraid of taking risks."}, {"time": 4115, "text": "And that's a big problem for rocket space, too, is like if you're cutting out costs, you can't afford to innovate, to try out new things, and that's definitely true with ion engines, right?"}, {"time": 4131, "text": "So how do you compete in this space?"}, {"time": 4134, "text": "Do you, by the way, see SpaceX as a competitor?"}, {"time": 4137, "text": "And what do you say in general about the competition in this space?"}, {"time": 4141, "text": "Is it really difficult as a business to compete here?"}, {"time": 4145, "text": "No, I don't see SpaceX as a competitor, and I see them as one day, not too long from now, a customer, hopefully."}, {"time": 4156, "text": "I mean, to compete against that, I think you just have to do things in an unconventional way."}, {"time": 4163, "text": "So bringing silicon MEMS manufacturing to propulsion, NASA doesn't make ion engines using a batch mass producible technique."}, {"time": 4174, "text": "They have one guy that's been making their ion engines for 20 years bespoke pieces of jewelry."}, {"time": 4181, "text": "So bringing things to what you're trying to innovate to make them, in our case, more cost effective was really key."}, {"time": 4193, "text": "I like the idea of somebody putting out ion engines on like Etsy."}, {"time": 4197, "text": "Yeah, my advisor at MIT would, the thruster chip I was holding up, he would wear one as a lapel pin."}, {"time": 4205, "text": "But in general, just on the topic of SpaceX, 2020 has seen some difficult things for human civilization."}, {"time": 4214, "text": "And it's been a lot of, first of all, it's an election year, there's been a lot of drama and division about that."}, {"time": 4220, "text": "There's been riots of all different reasons, racial division, there's been obviously a virus that's testing the very fabric of our society."}, {"time": 4231, "text": "But there's been really, for me at least, super positive things, inspiring things, which is SpaceX and NASA doing the first commercial human flight, launching humans to space and did it twice successfully."}, {"time": 4250, "text": "What is that, did you get to watch that launch?"}, {"time": 4254, "text": "Did you, what does it make you feel?"}, {"time": 4257, "text": "Do you think this is first days for a new era of space exploration?"}, {"time": 4265, "text": "Yeah, I did watch it."}, {"time": 4266, "text": "We played it outside on a big screen at our place."}, {"time": 4269, "text": "And I was a little, they kept saying Bob and Doug, Bob and Doug, and astronauts usually are treated with a little bit more fanfare."}, {"time": 4280, "text": "So it felt very casual, but maybe that was a good, a good thing, like this is the era of commercial crewed missions."}, {"time": 4290, "text": "It was a little bit more, what is it?"}, {"time": 4294, "text": "What's his name?"}, {"time": 4294, "text": "Chris Hadfield, like playing guitar."}, {"time": 4298, "text": "It's more, it's a different flavor to it of."}, {"time": 4302, "text": "More like fun, playful, celebrity type."}, {"time": 4307, "text": "Astronaut versus the aura of the magical sort of heroic element of the single human representing us in space."}, {"time": 4316, "text": "Yes, I think that's all for the better though."}, {"time": 4320, "text": "It's so cool that it's such a commonplace thing now that we send."}, {"time": 4324, "text": "I can't believe that sometimes I'll have to, you don't even realize that astronauts are coming and going all the time, splashing back down."}, {"time": 4333, "text": "And it's just so common now, but that's quite magical, I think."}, {"time": 4339, "text": "So yes, we did watch that."}, {"time": 4340, "text": "I love, love, love that we finally have that capability again to send people to the space station."}, {"time": 4348, "text": "And it's just really exciting to see the private sector stepping up to fill in where the government has pulled back in the US."}, {"time": 4356, "text": "And I think pulled back way too soon as far as exploration and science goes."}, {"time": 4362, "text": "Probably pulled back at the right time for commercial things and getting that started."}, {"time": 4367, "text": "But I'm really happy that it's even possible to do that with private money and companies."}, {"time": 4375, "text": "Do you like the kind of the model of competition of NASA funding?"}, {"time": 4381, "text": "I guess that's how it works, is like they're providing quite a bit of money from the government and then private companies compete to be the delivery vehicles for whichever the government missions, like NASA missions."}, {"time": 4397, "text": "Yes, I think for this type of mission is a little bit kind of straddles commercial and science."}, {"time": 4405, "text": "So I think it's good, but I do in general feel like we've pulled back too much on NASA's role in the science and exploration part."}, {"time": 4416, "text": "And I think our pace is too slow there, for my liking, I suppose."}, {"time": 4423, "text": "Okay, so did you have, I mean, on the cost thing, do you feel like NASA was a little too bureaucratic in a sense, like too slow, too heavy cost wise in their effort, like when they were running things purely without any commercial involvement?"}, {"time": 4443, "text": "So I suppose it's more that I just want the government to fund."}, {"time": 4449, "text": "And maybe NASA's not the best organization to do it rapidly."}, {"time": 4455, "text": "But I think that, again, depending on the goals, we're just kind of at the very starting point of space exploration and science and understanding."}, {"time": 4468, "text": "So we should be spending more money there and not less."}, {"time": 4472, "text": "And other countries are starting to spend more and more, and I think we'll fall behind because of that."}, {"time": 4478, "text": "So you have quite a bit of experience, first of all, starting a company yourself, but also I saw, maybe you can correct me, but you have quite a bit of knowledge of just in general the startup experience of building companies that you've interacted with people."}, {"time": 4494, "text": "Is there advice that you can give to somebody, to a founder or cofounder who wants to launch and grow a new company and do something big and impactful in this world?"}, {"time": 4508, "text": "Yes, I would say, like I mentioned earlier, but make sure the vision is something that will get you out of bed in the morning and that you can rally other people around you to achieve."}, {"time": 4527, "text": "Because I see a lot of folks that sort of cared about something or saw a window of opportunity to do something, and startups are hard, and more often than not, just being opportunistic isn't going to be enough to make it through all the really crappy things that are going to happen."}, {"time": 4548, "text": "So the vision just helps you psychologically to carry through the hardships, for you and the team."}, {"time": 4553, "text": "Yeah, you and the team, yeah, exactly."}, {"time": 4591, "text": "So being able to think deeply, yeah."}, {"time": 4595, "text": "Yeah, have you been surprised about how much pivoting is involved, basically rethinking what you thought initially would be the right direction to go?"}, {"time": 4604, "text": "Or is there, if you think deeply enough, that you can stick in the same direction for long enough?"}, {"time": 4610, "text": "So our guiding star hasn't changed at all, so that's been pretty consistent, but within that, we flip flop on so many things all the time, and to give you one example, it's do you stop and build a first product that's well suited to maybe a smaller, less exciting segment of the market, or do you stay head down and focus on the big swing and trying to hit it out of the park right away?"}, {"time": 4645, "text": "And we've flip flopped between that, and there's not a blanket answer, and there are a lot of factors, but that's a hard one."}, {"time": 4694, "text": "And I think that it's starting to change, but just to be aware of it from the beginning is important."}, {"time": 4699, "text": "Right, I guess it should be part of the vision of what kind of place you want to create, or what kind of human beings."}, {"time": 4708, "text": "Yeah, exactly, you can't wait five, 10 years and then just slap an HR person onto trying to fix it."}, {"time": 4715, "text": "It has to be thoughtful from the beginning."}, {"time": 4717, "text": "Yeah, don't get me started on HR people."}, {"time": 4723, "text": "Don't leave HR to HR people, but I'll just leave it at that."}, {"time": 4726, "text": "You didn't say that, I said it, okay."}, {"time": 4728, "text": "Yeah, HR's actual HR is really important, is so important, culture is so important."}, {"time": 4738, "text": "And then I also was surprised, I thought you could say, here will be our culture and our values, and that it was kind of distinct from who I and my co founder were as people, and I was like, no, that's not how that works."}, {"time": 4752, "text": "We just kind of ooze out our behaviors and then the company grows around that."}, {"time": 4758, "text": "So you have to do a lot of introspection and self work to not end up with a shitty culture."}, {"time": 4764, "text": "It's kind of a, it's a relationship, but it's supposed to be a relationship with two people, it's a relationship with many people."}, {"time": 4772, "text": "And you communicate so much indirectly by who you are."}, {"time": 4775, "text": "You have to be, you have to live it, yeah."}, {"time": 4780, "text": "As somebody, I think about this a lot because generally I'm full of love and all those kinds of things, but I also get really passionate and when I see somebody in the context of work, especially, when I see somebody who I know can do a much better job and they don't do a great job, I can lose my shit in a way that's like Steve Jobsian."}, {"time": 4806, "text": "And you have to think about exactly the right way to lose your shit if you're going to, or if at all."}, {"time": 4813, "text": "You have to really think through that because it sends a big signal."}, {"time": 4816, "text": "You know, sometimes it's okay, like if you do it deliberately, like if you're going to do it deliberately, if you're going to say like, I'm going to be the kind of person that allows this and pays the cost of it, but you can't just think it's not gonna have a cost."}, {"time": 4830, "text": "Yes, this was like the first thing I worked on with my leadership coach was how not to just snap at people when they were being an idiot."}, {"time": 4841, "text": "And first I got really good at apologizing."}, {"time": 4846, "text": "That was the first step because it was going to take longer to fix the behavior."}, {"time": 4851, "text": "And then she, I'm actually a lot better at it now and it started with things."}, {"time": 4856, "text": "She's like, every time you walk through a doorway, think, you know, calm and take breaths before responding."}, {"time": 4863, "text": "And there were all sorts of these little things we did and it was mostly just changing the habit."}, {"time": 4868, "text": "Yeah, oh boy, it's a long road."}, {"time": 4873, "text": "Okay, so people love it and we talk about books."}, {"time": 4878, "text": "Is there books, maybe three or so technical fiction, philosophical that had an impact on your life and you might recommend and for each, is there an idea or so that you take away from it?"}, {"time": 4891, "text": "Yes, so I've been a voracious reader all my life and I'm always reading like three or four or five books at a time and now I use Audible a lot too and you know, podcasts and things like that."}, {"time": 4910, "text": "So I think the first one that stands out to me is 10, it's a novel, Tender is the Night by Fitzgerald."}, {"time": 4917, "text": "And I read it when I was much younger but I went back and read it recently and it's not that good."}, {"time": 4923, "text": "So I'm not sure why it has like such an important place in my literary history but I love Fitzgerald as an author because he's very like flowery prose that I can just picture what he's saying but he does it in such a creative way."}, {"time": 4944, "text": "I remember that one in particular because I read a ton as a kid too but it kind of set me, it was like the beginning of my adult reading life and getting into classics and I kind of, I do feel like they seem intimidating maybe and then I realized that they're all just like love stories."}, {"time": 4971, "text": "Yeah, isn't everything a love story?"}, {"time": 4973, "text": "Yeah, it's really."}, {"time": 4974, "text": "At the bottom."}, {"time": 4975, "text": "Even, you know, I don't know."}, {"time": 4977, "text": "I was surprised that even like a lot of the Russian authors, you know, they're all just love stories."}, {"time": 4984, "text": "We're humans are pretty simple."}, {"time": 4985, "text": "There's not much to worry, there's not much to work with."}, {"time": 4988, "text": "So I think maybe that was it."}, {"time": 4989, "text": "It made like that whole world less intimidating to me and cemented my love for reading."}, {"time": 4997, "text": "People should have just approached the classics like there's probably a love story in here."}, {"time": 5000, "text": "Chick flicks, yeah."}, {"time": 5001, "text": "So somehow it boils down to a chick flick."}, {"time": 5004, "text": "So just relax and enjoy the ride."}, {"time": 5010, "text": "Changing gears quite a bit."}, {"time": 5013, "text": "The Beginning of Infinity, do you know it?"}, {"time": 5015, "text": "By David Deutsch."}, {"time": 5017, "text": "So he's a physicist at Cambridge or Oxford."}, {"time": 5021, "text": "And so I was introduced like more formally to a lot of the ideas, like a lot of the things we've talked about, he has a lot more like formalism and physics rigor around."}, {"time": 5035, "text": "And so I got introduced to, you know, more like jargon of how to think about some of these ideas, you know, like memes and, you know, DNA as ultimate meme, the concept of infinity and objective beauty."}, {"time": 5056, "text": "But he has a really strong grounding in physics."}, {"time": 5060, "text": "There's a rigorous way of talking about these like big."}, {"time": 5063, "text": "So that was very mind opening to me to read that."}, {"time": 5068, "text": "But it also, I think it's probably part of why I ended up marrying my husband is related to that book."}, {"time": 5073, "text": "And then I've had some other really great connections with people because I had read it and so had they."}, {"time": 5080, "text": "I like how you turned that, even that book into a love story."}, {"time": 5084, "text": "I did, oh no."}, {"time": 5086, "text": "No, it's good, it's good."}, {"time": 5087, "text": "Your robot has a heart."}, {"time": 5090, "text": "And okay, the third series is, it's just, it's Harry Potter."}, {"time": 5097, "text": "Of course, which somehow connects to, I haven't read Harry Potter."}, {"time": 5101, "text": "I'm really sorry."}, {"time": 5102, "text": "Forgive me, forgive me."}, {"time": 5105, "text": "But I've read Tolkien, but just Harry Potter, just haven't gotten to it."}, {"time": 5109, "text": "But your company name is somehow I think connected to Harry Potter, right?"}, {"time": 5114, "text": "I think I heard this."}, {"time": 5115, "text": "My, I always feel like I have to justify my fandom."}, {"time": 5122, "text": "The first three books came out when I was 10."}, {"time": 5125, "text": "So I went along this journey with Harry, age wise."}, {"time": 5128, "text": "And I read them all like nine or 10 times, all seven books."}, {"time": 5134, "text": "And I think anything that just keeps you reading is what's important."}, {"time": 5141, "text": "And I have lulls where I don't feel like reading anything."}, {"time": 5144, "text": "So I'll reread a Harry Potter or a trashy detective novel or something, and I don't really care."}, {"time": 5152, "text": "And that's why I mentioned Harry Potter because whatever just keeps me reading, I think is important."}, {"time": 5159, "text": "And it was a big part of my life growing up."}, {"time": 5162, "text": "And then yes, Axion, the official story of the naming of the company is that Axion is like a concatenation of accelerate and ion."}, {"time": 5175, "text": "But it actually came from accio, the summoning charm."}, {"time": 5178, "text": "And then we just added an N and it was perfect."}, {"time": 5182, "text": "What's the summoning charm?"}, {"time": 5183, "text": "It's one of the spells in Harry Potter."}, {"time": 5185, "text": "Yeah, probably most notably Harry uses it to summon his broomstick out of his dorm room when he's battling a dragon somewhere else."}, {"time": 5197, "text": "So he says the spell and the broomstick comes to him."}, {"time": 5200, "text": "So summoning in that way."}, {"time": 5203, "text": "Okay, there we go."}, {"time": 5204, "text": "This is brilliant."}, {"time": 5205, "text": "So the big thing is that it's something that you've carry with, it's like your safe place you return to something like the Harry Potter."}, {"time": 5215, "text": "That, I reread them still, whatever keeps me reading I think is the most important thing."}, {"time": 5223, "text": "So I'm actually the same way in terms of the habit of it."}, {"time": 5227, "text": "It's important to just keep reading."}, {"time": 5232, "text": "But I have found myself struggling a little bit too because I listen to a lot of audio books now."}, {"time": 5239, "text": "I've struggled to then switch back to reading seriously."}, {"time": 5246, "text": "It's just I read so many papers, I read so many other things."}, {"time": 5248, "text": "It feels like if I'm gonna sit down and have the time to actually focus on the reading I should be reading like blog posts or papers or more condensed kind of things."}, {"time": 5258, "text": "But there's a huge value to just reading long form still."}, {"time": 5262, "text": "Yeah, and my husband was never that into fiction but then someone told him or he heard, you learn a lot of empathy through reading fiction."}, {"time": 5275, "text": "So you could think of it that way."}, {"time": 5276, "text": "Well, yeah, that's kind of what, yeah, yeah."}, {"time": 5278, "text": "And it's also fiction is a nice, unlike not less so with nonfiction is a chance to travel."}, {"time": 5286, "text": "I see it as kind of traveling."}, {"time": 5288, "text": "As you go to this other world and it's nice because it's like much more efficient."}, {"time": 5292, "text": "You don't have to get on a plane, and you get to meet all kinds of new people."}, {"time": 5297, "text": "It's like people say they love traveling and I say I love traveling too."}, {"time": 5301, "text": "I just, yeah, read fiction."}, {"time": 5303, "text": "I told my three year old that that was why we read so much because we see the places in our mind and I'm like, it's basically like we're watching a movie."}, {"time": 5316, "text": "That's how it feels."}, {"time": 5317, "text": "And she's like, I prefer watching Frozen with popcorn, was her response that."}, {"time": 5321, "text": "Okay, well, you're three."}, {"time": 5325, "text": "But yeah, there's some power to the imagination, right?"}, {"time": 5327, "text": "That's not just like watching a movie because something about our imagination because it's the words in the world that's painted somehow mixing in with our own understanding of our own hopes and dreams, our fears."}, {"time": 5342, "text": "It like mixes up in there and the way we can build up that world from just the page."}, {"time": 5347, "text": "Yeah, you're really creating the world just with the prompts from the book, right?"}, {"time": 5353, "text": "Yeah, that's different than watching a movie."}, {"time": 5355, "text": "Yeah, which is why it hurts sometimes to watch the movie version and then you're like, that's not at all how I imagined it."}, {"time": 5363, "text": "Well, we kind of brought this up in terms of depending on what the goals are."}, {"time": 5371, "text": "Let me ask the big, you're friends with Manolis, he's obsessed with this question."}, {"time": 5376, "text": "So let me ask the big ridiculous question about the meaning of life."}, {"time": 5381, "text": "Do you ever think about this one?"}, {"time": 5384, "text": "Do you ever ponder the reason we're here?"}, {"time": 5389, "text": "Descends as the vapes on this spinning ball in the middle of nowhere?"}, {"time": 5394, "text": "Yeah, I don't think one ends up in the field of space propulsion without thinking of these existential questions."}, {"time": 5404, "text": "Yeah, all the time."}, {"time": 5405, "text": "Or builds a business."}]}]