[{"title": "Tony Fadell: iPhone, iPod, Nest, Steve Jobs, Design, and Engineering | Lex Fridman Podcast #294", "id": "4oDZyOf6CW4", "quotes": [{"time": 215, "text": "Okay, so where was the magic?"}, {"time": 217, "text": "The magic was that you could create, you had a language and you could create what you wanted to create, right?"}, {"time": 223, "text": "You could create a world or what have you and have this interaction."}, {"time": 227, "text": "And you could compute things, you could, you know, do numbers, you could, I was playing Oregon Trail, right?"}, {"time": 233, "text": "So you were less like."}, {"time": 234, "text": "So you can play video games."}, {"time": 236, "text": "Well, video."}, {"time": 238, "text": "Right, without the video."}, {"time": 239, "text": "You could play text games and then imagine them in your brain, right?"}, {"time": 244, "text": "Oregon Trail, there's this meme I saw recently."}, {"time": 248, "text": "If you wanna feel bad about yourself as a programmer, realize that one person wrote Railroad Tycoon."}, {"time": 256, "text": "I think that's the name of the game."}, {"time": 257, "text": "It's this cool little builder game."}, {"time": 260, "text": "One person wrote it in assembly."}, {"time": 262, "text": "So like from scratch and for people who don't know, it kind of looks like a Sim City type game."}, {"time": 271, "text": "It's a city builder, but obviously centered on railroads."}, {"time": 275, "text": "And there's a nice graphics, it's three dimensional, all that kind of stuff."}, {"time": 278, "text": "All the things, all the rich colorful things you would imagine for a three dimensional video game, all written in assembly, meaning the lowest level code next to binary, which is fascinating."}, {"time": 290, "text": "And that's the, you had to notice the magic at that low level at that time."}, {"time": 295, "text": "You didn't have all the graphics."}, {"time": 297, "text": "You didn't have all the like APIs and all the sample codes, no stack overflow, no internet, none of that."}, {"time": 304, "text": "You just had, you had to know registers."}, {"time": 306, "text": "You know, had to know the op codes and you had to imagine the world in your brain and the memory structures and everything else."}, {"time": 312, "text": "There's no visualization."}, {"time": 313, "text": "You visualized it all yourself, right?"}, {"time": 315, "text": "And so that was magic."}, {"time": 316, "text": "But then the next part of the magic of where I got hooked even further was like I'm doing these little things."}, {"time": 322, "text": "And then Electronic Arts came out for the Apple II."}, {"time": 325, "text": "So I got an Apple II and Electronic Arts came out and I was programming and doing basic and making my own games."}, {"time": 331, "text": "But then there were two games that really blew my mind."}, {"time": 334, "text": "One was pinball construction set."}, {"time": 337, "text": "And the other one was music construction set."}, {"time": 339, "text": "And these were both places where I could create pinball games and I could create musical scores because I love music and I could then play them, right?"}, {"time": 348, "text": "And so when you had that, you were like, oh, this is something very different."}, {"time": 353, "text": "So I could create myself, but then there was others that create tools so you could create at a visual level."}, {"time": 360, "text": "And then you would read the backstories because Electronics Arts back in the day, it was one programmer who would program those games program those things, each of those things."}, {"time": 368, "text": "And you could read their backstories."}, {"time": 370, "text": "It was literally like a musician or someone else."}, {"time": 373, "text": "Like you could read Rick Rubens, like here's the thing."}, {"time": 375, "text": "They tell you all of that stuff."}, {"time": 376, "text": "And there was one guy who wrote music construction set."}, {"time": 380, "text": "He wrote it all in assembly and he was 16 years old."}, {"time": 385, "text": "And I was probably 12 or 13 at the time."}, {"time": 388, "text": "And I went, oh my, if he was able to do this and had published, right, and this amazing tool was created, I'm like, what could I do?"}, {"time": 398, "text": "And so then it just kept building off of that."}, {"time": 401, "text": "But really it was those seminal things."}, {"time": 403, "text": "First, the introduction and then the power through programming and turning these things into what you wanted to turn it into."}, {"time": 410, "text": "And you didn't have to be 40, 50 years old and have PhDs."}, {"time": 415, "text": "And then I was like, okay, this is really cool."}, {"time": 418, "text": "I wish we did that with programmers where we treated them like artists."}, {"time": 422, "text": "We would know the backstory these days today."}, {"time": 425, "text": "Or not just programmers, engineers."}, {"time": 427, "text": "Engineers, designers."}, {"time": 429, "text": "Yeah, like all the things about a product that I think we love are the little details."}, {"time": 434, "text": "And there's probably a human being behind each of those details that had their little inkling of genius that they put in."}, {"time": 442, "text": "I wish we knew those stories."}, {"time": 444, "text": "That's always sad to me when I, because obviously I love engineering and I interact with companies and they, you know, autonomous vehicles, something I'm really interested about."}, {"time": 453, "text": "And I see that companies generally, and we'll probably talk about this, but they seem to want to hide their engineers."}, {"time": 459, "text": "Like engineers hold the secrets."}, {"time": 462, "text": "Like the great secret, we did not speak of the great secret."}, {"time": 467, "text": "But then the result of that is you don't get to hear their stories."}, {"time": 472, "text": "The passion that is there behind the engineers."}, {"time": 476, "text": "Like, and also the genius, the little, there's a difference between the stuff that's patented, like the kernel of the idea and the beautiful sort of side effects of the idea."}, {"time": 486, "text": "And I wish companies revealed the beautiful side effects a little bit more, but sorry for the distraction."}, {"time": 493, "text": "So what, you mentioned Apple II."}, {"time": 495, "text": "What was the first computer you fell in love with?"}, {"time": 498, "text": "Like the product, the thing before you that was a personal computer?"}, {"time": 503, "text": "It was the Apple II."}, {"time": 505, "text": "So the Apple II was something I was just lusting over."}, {"time": 508, "text": "You know, it was, I think it was at the time, it was the, you know, the person of the year."}, {"time": 514, "text": "Maybe it was that year."}, {"time": 515, "text": "I don't remember what, but."}, {"time": 516, "text": "Well, Apple II was the person of the year?"}, {"time": 518, "text": "Yeah, for my magazine back in, I don't remember when, but it was around that same time."}, {"time": 523, "text": "I was so young, but I had, there was the Apple II and I didn't know what it was, but I knew about tools because my grandfather taught me about tools and creating things, right?"}, {"time": 533, "text": "And I saw this thing and I had the, you know, that IBM experience, that terminal experience."}, {"time": 539, "text": "And I'm like, oh, I could have that at home, right?"}, {"time": 541, "text": "And so I need to have that at home."}, {"time": 543, "text": "And the only thing that was really talked about in our circles was the Apple II."}, {"time": 546, "text": "And I was just like, that's it."}, {"time": 548, "text": "So I went, jumped up and down."}, {"time": 551, "text": "It was very expensive."}, {"time": 552, "text": "I have to have this."}, {"time": 553, "text": "My parents were like, what?"}, {"time": 554, "text": "You know, it was $2,500 back then in the 1981."}, {"time": 559, "text": "It was like crazy, right?"}, {"time": 560, "text": "So I was like, I'm gonna make as much money as I can this summer."}, {"time": 563, "text": "And my grandfather said, cause he helped me learn all about tools and build things together."}, {"time": 569, "text": "I will match whatever you make so you can get this computer."}, {"time": 572, "text": "So I worked very, very hard as a caddy, golf caddy."}, {"time": 576, "text": "Caddying actually for the, you know, the families in, you know, at the country clubs in the town where we lived."}, {"time": 583, "text": "And did whatever I could."}, {"time": 585, "text": "And that end of that summer, we got my Apple II."}, {"time": 588, "text": "And you couldn't tear it away from me."}, {"time": 590, "text": "It was my friend."}, {"time": 591, "text": "It was everything."}, {"time": 592, "text": "From a product perspective, what do you remember that was brilliant?"}, {"time": 596, "text": "The design choices, the ideas behind it, or is it just that it exists?"}, {"time": 602, "text": "Or the very idea of a personal computer is the brilliant design choice."}, {"time": 607, "text": "Yeah, it was that I could actually have this kind of tool in my house and I could use it anytime I wanted."}, {"time": 612, "text": "I could program it anyways."}, {"time": 614, "text": "There was no, you know, there was no internet connection."}, {"time": 616, "text": "There was no, it was all just you."}, {"time": 618, "text": "You either loaded software that you got from someone, right?"}, {"time": 622, "text": "Or you created it yourself."}, {"time": 624, "text": "And then there was the whole other thing which was started happening, which we were doing."}, {"time": 628, "text": "And this was kind of like MP3 and stuff."}, {"time": 630, "text": "We were sharing software, right?"}, {"time": 632, "text": "So you built this community of sharing software."}, {"time": 634, "text": "You would go and pirate."}, {"time": 635, "text": "That was what it called, pirate all this software."}, {"time": 637, "text": "You'd never use it all, but it was just that fun thing of like, I'm gonna get all this other stuff and then tear it apart and do disassembly on it and see behind the scenes."}, {"time": 645, "text": "So you really had a sense this was your world and you owned it, right?"}, {"time": 650, "text": "And you could like literally go into every register."}, {"time": 652, "text": "We didn't have all those security layers."}, {"time": 653, "text": "Like we do not like, you could really touch bits and you could poke bits and you can make this light turn on."}, {"time": 659, "text": "And the geek assignment just lit up."}, {"time": 661, "text": "Now there's, it's so abstract."}, {"time": 665, "text": "People don't even understand."}, {"time": 666, "text": "Like usually some programs don't even understand memory."}, {"time": 669, "text": "They just think it's unlimited, right?"}, {"time": 671, "text": "And security, it's like, now there's all this security you should have, but it's like the adults all showed up to the party and now you can't have all the fun, right?"}, {"time": 681, "text": "It's like, no, no."}, {"time": 683, "text": "This was the thing where if you, if the power went out, you lost your whole program, you might've worked a whole day on it."}, {"time": 688, "text": "And if you didn't press save at every other line and you were to save, save, save, and it would like, the disk drive or the tape drive."}, {"time": 698, "text": "Like every single step was contemplated because if you didn't, you lost maybe a ton of work."}, {"time": 705, "text": "So a lot of the magic was in the software."}, {"time": 707, "text": "The fact that you could have software, the fact that you could share software, the community around the software, it wasn't necessarily the hardware."}, {"time": 715, "text": "Well, that was the first step."}, {"time": 716, "text": "The second step around the hardware was I got things like the mocking board, which the mocking board paired with the music construction set, you could now generate all kinds of tones and notes and it was a synthesizer in the Apple II."}, {"time": 729, "text": "So you would plug in this card and you go, oh my God, look at this."}, {"time": 732, "text": "And it would, you know, you could start generating cool sounds."}, {"time": 735, "text": "You know, like it was a Moog, you know, like a Moog in a way, early Moog."}, {"time": 740, "text": "What year are we talking about?"}, {"time": 741, "text": "This is 82, I think, 81, 82."}, {"time": 745, "text": "And I bet you can make all the kind of synthetic sounds that are very cool in the 80s."}, {"time": 750, "text": "Yeah, the 8 bit, you know, chip tunes, right?"}, {"time": 752, "text": "Chip tune, ding, ding, ding, ding, ding, ding."}, {"time": 754, "text": "And then, you know, when you wanted to add a joystick, you had to pull a chip out and you had to like plug in a dip socket to put in a joystick."}, {"time": 762, "text": "And then I was like, oh, and then I had to get more memory."}, {"time": 765, "text": "And now I wanted to speed up progress."}, {"time": 767, "text": "So then that turned into a company actually from that, but it was, and a hardware software went at that."}, {"time": 774, "text": "But it was all about, you know, modifying this thing in every way, first with software."}, {"time": 778, "text": "And then you started gaining confidence."}, {"time": 780, "text": "And then I got a little bit more money and stuff."}, {"time": 781, "text": "And then you could get into the hardware and, you know, wire things."}, {"time": 785, "text": "And then the Apple II came with all the schematics, right?"}, {"time": 789, "text": "So in the back, in the early Apple IIs, you could open up and all the schematics were there."}, {"time": 794, "text": "So you purchased the Apple II and the schematics come with it."}, {"time": 798, "text": "Yeah, it came with it."}, {"time": 799, "text": "That's an interesting choice."}, {"time": 801, "text": "That's an interesting choice from a company perspective."}, {"time": 805, "text": "Right, it was like a real maker kind of thing."}, {"time": 809, "text": "Ah, I wonder what they, so that was intentional."}, {"time": 812, "text": "Like this is."}, {"time": 812, "text": "Absolutely intentional."}, {"time": 814, "text": "This is for the cutting edge folks too, or especially for the cutting edge."}, {"time": 818, "text": "It was only the cutting edge."}, {"time": 819, "text": "It was geeks for geeks."}, {"time": 821, "text": "So we were like, oh, how did they make it?"}, {"time": 823, "text": "And then we got to learn through that."}, {"time": 824, "text": "Apple I did the same thing, right?"}, {"time": 826, "text": "It just Apple II became more packaged up and had, you know, a little bit better software, right?"}, {"time": 832, "text": "Came with basic and then, you know, so it was really, it was what we might think of as a raspberry pie today or something like that, but not with so much software."}, {"time": 841, "text": "It was literally, and all the chips were out there so you could inspect the buses and the, right?"}, {"time": 846, "text": "Cause everything was just broken out."}, {"time": 848, "text": "So I guess that's the idea behind stable big projects and open source, like on GitHub, that you have the schematics there and it's kind of a product, but I wonder why more companies don't do that kind of thing."}, {"time": 863, "text": "Like we're going to release this to a small set of people, self selected, perhaps that are kind of the makers, the cutting edge folks, the builders, the at home engineers, like in some way, what Tesla is doing with the beta for the full self driving is kind of like that."}, {"time": 887, "text": "It's like selecting a group of people, but that has to do more with you, how safe of a driver you are versus how much of a tinkerer you are because you don't get to tinker."}, {"time": 896, "text": "I wonder, is that a crazy idea to do for really cutting edge technologies, especially you're interested in like hardware stuff."}, {"time": 905, "text": "Is that crazy?"}, {"time": 906, "text": "Why don't more companies do that kind of thing, you think?"}, {"time": 910, "text": "I think back then it was about a community and serving that community of builders."}, {"time": 915, "text": "Now this is about people who want to take, get the experience and want it really simple and easy."}, {"time": 920, "text": "And they're like, and so there's the audience or they believe the audience is small who would value those other things that we're just talking about."}, {"time": 929, "text": "But if we look at things like Raspberry Pi and all of these other little boards, right?"}, {"time": 933, "text": "There's a whole world more than I've seen."}, {"time": 936, "text": "Like it's amazing what you can do now with these little kits and the software that's created."}, {"time": 943, "text": "And so there's a whole nother, I think another batch of makers and builders that are coming up through the ranks."}, {"time": 949, "text": "And if you, we look at YouTube channels and stuff, right?"}, {"time": 951, "text": "They take these little boards, they hack them, then they print out parts on their 3D printer, assemble them and they create robots and what have you."}, {"time": 959, "text": "So I think it's happening."}, {"time": 961, "text": "It's just not as, you know, as, it's just not as, I guess, raw as it used to be, but it's there and it's really expanding around the world."}, {"time": 971, "text": "And that's really nice to see cause you know, it's a whole new generation who can, who are empowered."}, {"time": 977, "text": "I think there's a semi dormant genius amongst millions."}, {"time": 981, "text": "So like Raspberry Pi is revealing that a little bit."}, {"time": 983, "text": "It's probably, I wouldn't be surprised if it's several million Raspberry Pis that have been sold."}, {"time": 990, "text": "I think more than that."}, {"time": 991, "text": "And it's kind of this quiet storm of genius, brewing of engineers who don't get to hear because they're not organized."}, {"time": 1000, "text": "I mean, we get to hear their inklings here and there."}, {"time": 1002, "text": "Like I said, YouTube, there's little communities that are local and so on."}, {"time": 1005, "text": "But if they were organized, if a leader would emerge, no."}, {"time": 1011, "text": "Okay, so when did you first start to dream about building your own things, designing your own products, designing your own systems and software and hardware?"}, {"time": 1025, "text": "Well, in high school, there was a company that a friend of mine founded and I was the second employee, it was called Quality Computers."}, {"time": 1035, "text": "And it was a mail order, mail order cause there's no eCommerce then, there was no internet again."}, {"time": 1041, "text": "You either mailed in your little coupon and you said, this is what I wanted to order or you wrote in to get a catalog and delivered to you."}, {"time": 1048, "text": "Turn around time and this stuff was like, from the time you wanted, the time you bought it was maybe eight to 12 weeks."}, {"time": 1054, "text": "That was just the normal way of getting things."}, {"time": 1057, "text": "So Quality Computers was a mail order for Apple too and it was software and all kinds of accessories."}, {"time": 1066, "text": "So hardware accessories, so hardware, plug in cards, joysticks, all this stuff."}, {"time": 1070, "text": "And what we noticed was there were accelerators or memory cards."}, {"time": 1077, "text": "And to be able to use those cards, you had to actually go and change the software you use to access this new memory."}, {"time": 1085, "text": "So you literally had to go and you took the program that you had, let's say it was Apple works, which was like an early Microsoft office or something like that."}, {"time": 1092, "text": "And you had to literally change the code and you would install all these patches to then take advantage of the hardware."}, {"time": 1100, "text": "So what we started creating was software on top of it to do the automatic installation of all of these patches."}, {"time": 1107, "text": "So we made it much easier to take new hardware and the existing software you have and expand it into this new world."}, {"time": 1115, "text": "So it was creating tools and the really great customer support."}, {"time": 1118, "text": "And we started getting a lot of orders because we had the software make it easier to install, to give them the superpower."}, {"time": 1125, "text": "And at the same time, they would be able to change their software and have a new world that wasn't existing from the companies that were creating the initial products."}, {"time": 1136, "text": "And so it was more of that."}, {"time": 1138, "text": "And then that happened with hard drives."}, {"time": 1140, "text": "So I wrote a hard drive optimizer for the Apple II to like read, because you could get really fragmented."}, {"time": 1147, "text": "So I wrote that piece of software and we sold that through the company along with the hard drives that we sold from third parties."}, {"time": 1152, "text": "So that all happened in 12th grade, freshman year of college."}, {"time": 1160, "text": "You wrote a hard drive optimizer in 12th grade for the Apple II."}, {"time": 1164, "text": "Between 12th and freshman year."}, {"time": 1166, "text": "What programming language do you remember?"}, {"time": 1168, "text": "Is it assemblies?"}, {"time": 1169, "text": "There were certain inner loops were assembly and other loops actually there were really early Pascal, no C compilers."}, {"time": 1179, "text": "What was the motivation behind these?"}, {"time": 1181, "text": "Is it to make people's lives easier?"}, {"time": 1183, "text": "Is it to create a thing experience that is simpler and simpler and simpler, thereby more accessible to a larger number of people?"}, {"time": 1191, "text": "Or did you just like to tinker?"}, {"time": 1192, "text": "No, no, no, it was two things really."}, {"time": 1194, "text": "Cause one, we wanted to sell more hardware and software."}, {"time": 1197, "text": "So it was like, oh, make it easier for the user."}, {"time": 1199, "text": "And then the other thing was, because I was also manning the customer support line, people would call in and go, this doesn't work."}, {"time": 1206, "text": "And I'm like, oh, I gotta go fix the hardware and software."}, {"time": 1209, "text": "Or I gotta fix the software to make the hardware and the installation process better."}, {"time": 1212, "text": "So my whole world was out of box experience from when I was in high school."}, {"time": 1218, "text": "Cause I had to man the customer support line, pack the boxes and write some of the code while we were doing, while Joe, Joe Gleason, who was the founder of Quality Computers, he was off doing the mark, the ads, placing the ads for the mail order, making sure we were running the credit cards, right?"}, {"time": 1235, "text": "It was two of us."}, {"time": 1236, "text": "And then it turned into a third, and then we hired another person from high school to like pack boxes so I could stay on the customer support line or doing the software, right?"}, {"time": 1244, "text": "And it was all in his parents basement, right?"}, {"time": 1247, "text": "As you were scaling exponentially."}, {"time": 1250, "text": "Scaling, right, exactly, bootstrapping."}, {"time": 1252, "text": "So we'll jump around a little bit, but what were the, you said you love music."}, {"time": 1256, "text": "What were the ideas that gave birth to the iPod if we jump forward and how far back do those ideas stretch?"}, {"time": 1267, "text": "If you look at the history of technology, there's, I mean, not just the product, but the idea is truly revolutionary."}, {"time": 1277, "text": "Maybe it's time has come, but just if you look at the arc of history, sort of music is so fundamental to who we are as a humanity."}, {"time": 1290, "text": "And to be able to put that in your pocket, make it truly portable is fascinating in a way that's truly portable."}, {"time": 1300, "text": "So it's digital as opposed to sort of like a Walkman or something like that."}, {"time": 1305, "text": "So what were the ideas that gave birth to the iPod?"}, {"time": 1309, "text": "You know, I was in love with music since I was a kid."}, {"time": 1313, "text": "Just loved music from, I think, second grade when I got my first albums and stuff like that."}, {"time": 1318, "text": "What kind of music are we talking about?"}, {"time": 1319, "text": "So this was Led Zeppelin."}, {"time": 1324, "text": "This was the Stones, Hendrix, Aerosmith, Cheap Trick, Stix, Ted Nugent, just the real American and British rock and roll, right?"}, {"time": 1339, "text": "There's a bunch of people listening right now."}, {"time": 1342, "text": "Led Zeppelin?"}, {"time": 1344, "text": "Is that some kind?"}, {"time": 1346, "text": "It drove my parents crazy."}, {"time": 1350, "text": "You just blasted loud."}, {"time": 1351, "text": "Loud, just brr."}, {"time": 1352, "text": "And this was second, third grade, fourth grade."}, {"time": 1355, "text": "I just fell in love."}, {"time": 1356, "text": "And then we moved back to Detroit and I loved listening to the radio station because there was all kinds of crazy music because you'd have an amalgam of rock and then funk and R&B and I loved to listen at night."}, {"time": 1370, "text": "So I had a clock radio."}, {"time": 1372, "text": "But if I had the clock radio on, everyone, parents would go, go to sleep."}, {"time": 1378, "text": "Turn that stuff off."}, {"time": 1378, "text": "So I hacked the clock radio and put a headphone jack in it."}, {"time": 1384, "text": "So I said, oh, they're like, okay."}, {"time": 1387, "text": "And then I could listen to it all night and no one could hear me, right?"}, {"time": 1390, "text": "And I could just sit there and, you know."}, {"time": 1392, "text": "Just huddling around the radio."}, {"time": 1393, "text": "Groove out."}, {"time": 1394, "text": "Just listening to Zeppelin."}, {"time": 1395, "text": "Stairway to Heaven, what would you say is the greatest classic rock song of all time?"}, {"time": 1403, "text": "Greatest classic rock song of all time?"}, {"time": 1405, "text": "What pops into mind?"}, {"time": 1406, "text": "Well, no, you know what?"}, {"time": 1407, "text": "I mean, this has to be objectively number one."}, {"time": 1409, "text": "That's really hard, dude."}, {"time": 1410, "text": "This is so hard."}, {"time": 1411, "text": "No, you have to."}, {"time": 1412, "text": "This is a serious journalistic interview."}, {"time": 1414, "text": "You're not going to back down from these kinds of questions."}, {"time": 1418, "text": "What a challenge."}, {"time": 1419, "text": "Yeah, it's hard to pick."}, {"time": 1420, "text": "But to me, Stairway to Heaven is a safe fall."}, {"time": 1425, "text": "It's like, it's so often considered to be one of the greatest songs of all time that you almost don't want to pick it."}, {"time": 1432, "text": "But you've returned to it time and time again."}, {"time": 1434, "text": "It's like, yeah, this is something pretty special."}, {"time": 1438, "text": "This is a rock opera of sorts."}, {"time": 1440, "text": "Well, the rock opera that really blew me away and still continues to blow me away is all of Dark Side of the Moon."}, {"time": 1447, "text": "Like that, I love Zeppelin."}, {"time": 1450, "text": "I can't say which one's better."}, {"time": 1452, "text": "But Dark Side of the Moon for me was, it was a, you know, audio experience, right?"}, {"time": 1456, "text": "The whole thing from soup to nuts, plus all the synthesizers, all of those things."}, {"time": 1461, "text": "Okay, so back to the iPod."}, {"time": 1463, "text": "So that's, from the early age, you loved music."}, {"time": 1466, "text": "Loved it."}, {"time": 1467, "text": "Absolutely loved it."}, {"time": 1468, "text": "And, you know, always was just around it and always, I just, it was always playing, you know."}, {"time": 1474, "text": "I played it so loud that I actually hurt the earring in my right ear."}, {"time": 1479, "text": "And I still suffer from that today."}, {"time": 1482, "text": "No regrets."}, {"time": 1483, "text": "No regrets whatsoever."}, {"time": 1484, "text": "Going to concerts in downtown Detroit and all the crazy stuff."}, {"time": 1488, "text": "So moving forward."}, {"time": 1490, "text": "So in college, I was a DJ."}, {"time": 1494, "text": "So I would DJ and hang out and play all the tunes I love and whatever for the crowd."}, {"time": 1501, "text": "And then I continued to do that in Silicon Valley when I moved right after school."}, {"time": 1506, "text": "And so I was be lugging all of these CDs around with me."}, {"time": 1510, "text": "A thousand CDs to, right?"}, {"time": 1512, "text": "And at the same time, and so those were heavy."}, {"time": 1516, "text": "And at the same time I was doing the Philips Nino and Velo."}, {"time": 1520, "text": "Those were Windows CE based mobile computing products."}, {"time": 1525, "text": "Nino was the first device to actually put Audible books on tape."}, {"time": 1530, "text": "So I worked with Audible."}, {"time": 1532, "text": "We met in a conference and they were like, we don't want to do hardware."}, {"time": 1535, "text": "We just want to do content."}, {"time": 1536, "text": "I was like, well, we have this device."}, {"time": 1537, "text": "Let's get it together."}, {"time": 1539, "text": "And we got Audible on that."}, {"time": 1541, "text": "And this was in 96 or seven, first Audible books."}, {"time": 1546, "text": "And it, you know, I was like, oh my God, that's audio."}, {"time": 1549, "text": "Well, what if we put music on it, right?"}, {"time": 1552, "text": "And so I, and the memory was very small at the time, right?"}, {"time": 1556, "text": "There was almost no flash."}, {"time": 1557, "text": "It was all DRAM."}, {"time": 1558, "text": "When you did Audible, you stored it in DRAM, right?"}, {"time": 1563, "text": "Which was okay probably because how much books do you need is the idea."}, {"time": 1569, "text": "By the way, brilliant, I mean, just putting books."}, {"time": 1572, "text": "I know it's probably not the sexiest of things, but putting books on a mobile device is a brilliant step."}, {"time": 1583, "text": "Sometimes can't measure how much human progress occurred because of an invention."}, {"time": 1589, "text": "Like there's the sexy big products, but you never know."}, {"time": 1592, "text": "Like, like Wikipedia is one of those things that doesn't get enough, I think, credit for the transformational effects it has."}, {"time": 1599, "text": "It's not seen as the sexiest of products, but maybe it is."}, {"time": 1603, "text": "When you look at human history, Wikipedia arguably is one of the big things that basically unlocked human knowledge."}, {"time": 1612, "text": "Human knowledge and human editing and human, you know, just the human nature of building something together."}, {"time": 1621, "text": "Sometimes you can't measure those things, maybe until many, many decades later."}, {"time": 1625, "text": "So that was, that was, you know, that was, so that was there."}, {"time": 1629, "text": "And then there was Audible, that you put books, why not put music?"}, {"time": 1633, "text": "Music, and I'm carrying around the music for the DJ gigs."}, {"time": 1636, "text": "And you're like, wait a second, two and two together, right?"}, {"time": 1639, "text": "Like, let's get rid of this."}, {"time": 1640, "text": "And so, and then MP3 show up."}, {"time": 1643, "text": "The actual, like in COVID?"}, {"time": 1644, "text": "The format, the format, MP3 showed up around 97, 98."}, {"time": 1649, "text": "So MP3 is compressed so you can have, like the storage is reduced significantly."}, {"time": 1655, "text": "Right, so you could go from a, you know, a large full lossless, you know, digital track into something that can be stored in four to eight megabytes, something like that for the audio."}, {"time": 1669, "text": "Now, you know, that's a reduced quality, but you could get it down there and you're like, oh, okay."}, {"time": 1674, "text": "And now if we have enough flash or DRAM, we can put 10, 15, what have you all in that same memory."}, {"time": 1680, "text": "And it starts to replicate a CD."}, {"time": 1682, "text": "And then ultimately, if you put it on a hard drive, you could start to put, you know, thousands of songs."}, {"time": 1687, "text": "Yeah, that's also another brilliant invention."}, {"time": 1690, "text": "But like, people don't realize, I think people would be surprised how big in terms of storage raw audio is."}, {"time": 1697, "text": "And the fact that you can compress it, like, I don't know what the compression is, but it's like 10X, it's very significant compression."}, {"time": 1706, "text": "And still it sounds almost lossless."}, {"time": 1709, "text": "Much to the chagrin of Neil Young, who does not like that."}, {"time": 1713, "text": "But even Neil Young, even the stuff he talks about is still tiny files relative to the raw."}, {"time": 1720, "text": "So he wants us to increase it just a little bit more, a little bit more."}, {"time": 1724, "text": "But it's still, that's an invention."}, {"time": 1726, "text": "That's a thing that unlocks your ability to carry around a device like a Nino and listen to music."}, {"time": 1732, "text": "Because without that, there's no way you can carry on a gigantic hard drive."}, {"time": 1737, "text": "And so then that, so it was MP3s, the Nino, and my, you know, my hatred of carrying around all this heavy stuff that then spawned, you know, fuse and then ultimately, you know, became a lot of that, the ideas and things of that nature were, and my passions were born into then the iPod."}, {"time": 1759, "text": "You know, it was too, Apple needed something and I wanted to fix something and it all kind of, you know, came together at the right place, right time, plus the right technology came at this."}, {"time": 1769, "text": "It was just like the stars aligned."}, {"time": 1771, "text": "So how did it come to life?"}, {"time": 1773, "text": "The details of the stars aligning, but the actual design, the actual engineering of getting a device to be small, the storage of the, you know, the interface, how it looks, the storage, the details of the software, all that kind of stuff."}, {"time": 1792, "text": "What are some interesting memories from that design process?"}, {"time": 1797, "text": "What are some wisdoms you can impart from that process?"}, {"time": 1802, "text": "Okay, well, you know, how long do you want to go?"}, {"time": 1805, "text": "Cause I have, I can go deep."}, {"time": 1807, "text": "So, let's go at least 20 hours."}, {"time": 1811, "text": "Let's go, this is one of the lengthy documentaries."}, {"time": 1814, "text": "Are you going to turn it into episodic binge listening?"}, {"time": 1818, "text": "Yeah, it's Game of Thrones."}, {"time": 1820, "text": "So let's just start with, you know, after I was asked to be a consultant to put this thing together."}, {"time": 1826, "text": "So I already had knowledge of, you know, the space and the technology and all that stuff, but I had to very quickly, and a lot of the suppliers, because of what I was doing at Fuse, trying to create that thing."}, {"time": 1837, "text": "So as a contractor, I was like, okay, what is the first thing they need to do?"}, {"time": 1843, "text": "So after I showed a, you know, different architectures and what three different products could be to Steve about options for storage options, battery options, form factor options, there was three options."}, {"time": 1857, "text": "And as I was told, given very good advice, give the two options you really do not like, but they're options, and give the best option last, because Steve will shoot all those down and give the best option last, and then you could talk about that."}, {"time": 1871, "text": "And so that was the one that had a 1.8 inch hard drive and a small screen, like the screen, you know it, and the original iPod, classic iPod."}, {"time": 1886, "text": "And then I had enough of the idea of the three or three or four different CPUs and processor suppliers and kind of systems that were out there that I had gone and found and put together on power supplies, you know, disk drive interfaces, firewire interface, all that stuff."}, {"time": 1905, "text": "So I put together all of those schematics or, you know, block diagrams."}, {"time": 1909, "text": "They weren't schematics yet, because it was just me."}, {"time": 1912, "text": "And coming up with a bill of materials, coming up with what it could look like, what would be the input, output, how we could make a better headphone jack."}, {"time": 1922, "text": "That was also on there."}, {"time": 1923, "text": "Screen suppliers, tearing apart calculators."}, {"time": 1927, "text": "So got all calculators and all kinds of electronics to get the right size, different sizes of small LCDs."}, {"time": 1934, "text": "So I got all kinds of different battery types."}, {"time": 1937, "text": "I got different types of, you know, in different battery sizes, double A's, triple A's, working through all the different, and there was lithium ion, nickel metal hydride."}, {"time": 1946, "text": "So I took all the battery types."}, {"time": 1947, "text": "I took all of the memory types, processing types, LCD types, and connectivity and all that stuff, not wireless, but wired, and laid out these things as Lego blocks."}, {"time": 1964, "text": "So literally had all of these things as just, and so it made them so I could like, you know, put them together and figure out what the compact form factor would be."}, {"time": 1972, "text": "Oh, like how do we shove them together?"}, {"time": 1975, "text": "What's the smallest possible box you can get?"}, {"time": 1977, "text": "So the questions was on storage, so the hard drive, batteries, double A, triple A, screens."}, {"time": 1986, "text": "So screen size, and then for that, you're tearing apart calculators."}, {"time": 1989, "text": "Calculators, digital cameras, whatever, and getting little things, right?"}, {"time": 1992, "text": "So you can make it physical, right?"}, {"time": 1994, "text": "If you can make the intangible tangible, like, and so I can say, look, we can make this, and I brought this whole bag of goods, and it was like, right?"}, {"time": 2003, "text": "And like, here's this, here's this, this is why double A's won't work, and because it makes it too fat and everything."}, {"time": 2008, "text": "So just educate everybody through, here's the parts that we can use."}, {"time": 2012, "text": "You should not sheet of paper, it's physical."}, {"time": 2014, "text": "You're playing in the physical space."}, {"time": 2015, "text": "Oh, I would go back and forth."}, {"time": 2016, "text": "So truth be told, because there weren't a good enough graphical tools on the Mac, I was using a PC with Visio and some 3D tools, and I was doing 3D design at the same time I was taking all these physical parts and going, okay, what feels right?"}, {"time": 2032, "text": "Because you have to go from, you know, the details and then the rough, and you go back and forth and you iterate, right?"}, {"time": 2038, "text": "And so it was just a lot of fun."}, {"time": 2040, "text": "And then it ultimately ended up with a styrofoam model and printouts that came from Visio that I glued together and put my grandfather's fishing weights in, because I also modeled the weights, right?"}, {"time": 2051, "text": "So I said, oh, this is this many ounces, this is this many ounces and grams."}, {"time": 2055, "text": "And then I went and got all that and made the, weighted these styrofoam models to then match that."}, {"time": 2062, "text": "So when you picked it up, it felt more or less form factor, right?"}, {"time": 2065, "text": "And it also, you felt how much, you know, was it gonna be dense enough?"}, {"time": 2069, "text": "Is it gonna feel solid and rigid in your hand, right?"}, {"time": 2074, "text": "Why does it need to feel rigid?"}, {"time": 2076, "text": "Because it has to feel substantial."}, {"time": 2077, "text": "It has to feel like I have like a, like a bar of gold in my hand, right?"}, {"time": 2081, "text": "You know, maybe you know this, when you open and close a car door, you know that thunk and you go, bam, and you go, that feels solid, that feels real."}, {"time": 2089, "text": "And then you get this tinny car that's like ding, and you're like, does this feel safe?"}, {"time": 2094, "text": "Does this feel like a value?"}, {"time": 2095, "text": "And so you, when you have a device like that, and you wanna make sure that there's not too much air in it, that you distributed the density of the masses in the right way."}, {"time": 2105, "text": "So it feels like it's the right thing."}, {"time": 2107, "text": "So you have to model battery life, costs, you know, mass, sizes of different things."}, {"time": 2116, "text": "And then you have to also think about what the UI is gonna look like, right?"}, {"time": 2119, "text": "You have all of these constraints you're working, variables you're working with, and you have to kind of, you know, you can't get the perfect of everything."}, {"time": 2126, "text": "What's the best, you know, local maximum of all of these components that come together to provide an experience?"}, {"time": 2132, "text": "Local maximum, it's always trade offs."}, {"time": 2134, "text": "What about buttons?"}, {"time": 2135, "text": "Buttons, well, there was also the buttons too, right?"}, {"time": 2137, "text": "Oh, by the way, a lot of these battles fought inside your mind, or is it with other people?"}, {"time": 2141, "text": "Is it with Steve, is it lower, like what?"}, {"time": 2144, "text": "This was all independent."}, {"time": 2146, "text": "This was me before being able to present to Steve, because I had to feel really confident that if I was gonna put this in front of him, that it could be made, right?"}, {"time": 2155, "text": "So I had to convince myself and go work through all the details, through like the very, very rough mechanical design, electrical design, software things, because I didn't wanna present something that was gonna be fictional, right?"}, {"time": 2167, "text": "My credibility would be like trashed, right?"}, {"time": 2170, "text": "So you mentioned convince yourself."}, {"time": 2173, "text": "You're painting this beautiful picture of a driven engineer, designer, futurist."}, {"time": 2181, "text": "How much doubt were you plagued by through that?"}, {"time": 2184, "text": "Like this is even doable, because it's not obvious that this is even doable."}, {"time": 2189, "text": "Like to do this at scale, to do this kind of thing, to make it sexy, to shovel the screen, the batteries, the storage, to make the interface, the hardware and the software interface work, all of that."}, {"time": 2206, "text": "I would be overwhelmed by the doubt of that, because so many things have to work, plus the supply chain."}, {"time": 2211, "text": "Like at that point, I wasn't getting into any of those details or anything."}, {"time": 2215, "text": "There's the basic stuff that you have to put together."}, {"time": 2218, "text": "And then you have to, through my learnings at General Magic and my learnings at Phillips and delivering multiple large scale programs and manufacturing, you kind of get a rule of thumb and you know what to focus on at the beginning and what not to worry about over time."}, {"time": 2233, "text": "Like when I was early in my career, I worried about everything on the engineering details so much so that I would be a nervous wreck."}, {"time": 2239, "text": "Sooner or later, you learn how to filter out and figure out what to prioritize."}, {"time": 2243, "text": "And so 10 years later, I was able to do a much better job of filtering out the things of like, we'll get to that in weeks to come."}, {"time": 2251, "text": "But right now we gotta solve the very important things, which is could this actually be something real and that you could deliver enough battery life, right?"}, {"time": 2262, "text": "Enough of an interface of the right cost, right?"}, {"time": 2266, "text": "And the right price point."}, {"time": 2269, "text": "So you were sitting on a track record of successes and failures in your own mind where you had sort of already a confidence, a calmness, but still, was there a doubt that you can get this done?"}, {"time": 2283, "text": "Always, always."}, {"time": 2285, "text": "How hard is it to achieve a sort of a confidence to a level where you could present it to Steve and actually believe that this is doable?"}, {"time": 2293, "text": "Like what, do you remember when you felt?"}, {"time": 2295, "text": "Yeah, that moment?"}, {"time": 2296, "text": "I think it was after I triple checked my, I couldn't bring anyone in, right?"}, {"time": 2302, "text": "I couldn't let anyone in on this."}, {"time": 2304, "text": "So it was just me."}, {"time": 2305, "text": "Are they gonna trample on it, that kind of thing?"}, {"time": 2307, "text": "No, no, no, no, because I couldn't bring any, when I mean bring anyone in on this, one, it was a highly confidential program inside Apple."}, {"time": 2313, "text": "There was like four people who knew about it, right?"}, {"time": 2316, "text": "And so I couldn't bring anyone from Apple because I was a contractor."}, {"time": 2320, "text": "I couldn't bring anyone else from the outside world."}, {"time": 2322, "text": "I'm working for Apple and I'm under this crazy NDA, right?"}, {"time": 2325, "text": "In this contract."}, {"time": 2326, "text": "So it was just, so I'm doing this."}, {"time": 2330, "text": "Oh, and at the same time, I'm also buying every competitive product, MP3 player and tearing them all apart, right?"}, {"time": 2335, "text": "Tore them all apart and looking at them and trying to learn from those as well."}, {"time": 2340, "text": "So it was all of this stuff in six weeks."}, {"time": 2342, "text": "So I didn't sleep, right?"}, {"time": 2346, "text": "But I was like, because I was trying to make this, I was envisioning this since the Nino, right?"}, {"time": 2352, "text": "And I was like, oh my God, right?"}, {"time": 2355, "text": "But there was another doubt that I had and it wasn't just, could you make the product?"}, {"time": 2359, "text": "But could Apple actually have the balls to make it?"}, {"time": 2365, "text": "Because Apple was not the same company that you know it today in 2001."}, {"time": 2371, "text": "Really, it was cautious, conservative, careful?"}, {"time": 2374, "text": "No, no, it was barely break even."}, {"time": 2376, "text": "It was a four or $5 billion company."}, {"time": 2379, "text": "So the guts required there is not necessarily in the innovation."}, {"time": 2383, "text": "It's like, this is gonna cost a lot of money and we're gonna potentially lose all of it because it'll be a flop."}, {"time": 2389, "text": "Well, there's not just that, but there was only the Mac."}, {"time": 2392, "text": "And the Mac wasn't doing very well."}, {"time": 2395, "text": "There was less, it was about a 1% only in the US market share for the Mac, right?"}, {"time": 2401, "text": "The company was in debt."}, {"time": 2402, "text": "Bill Gates had to give him a loan, right?"}, {"time": 2407, "text": "Michael Dell at the time was saying, shut down the company and give the money back to the shareholders."}, {"time": 2413, "text": "So this is not the company that people, oh my God, the iPhone came out."}, {"time": 2418, "text": "It's a very different level of confidence and financial situation that the company was in versus the iPod."}, {"time": 2425, "text": "So given that, what was the conversation when you finally presented to Steve?"}, {"time": 2429, "text": "Steve, what was that conversation like?"}, {"time": 2434, "text": "The conversation was, well, we went through it, the presentation and all that stuff happened."}, {"time": 2440, "text": "And he was just like, and he never, he would flip through it real quick, throw the presentation aside and said, okay, let's talk about this, right?"}, {"time": 2449, "text": "And so we went through it all."}, {"time": 2451, "text": "And one was a big conversation about Sony."}, {"time": 2455, "text": "And Sony was the number one in all audio categories, home, portable, whatever, in the world, okay?"}, {"time": 2463, "text": "I had been already gone through 10 years of failure."}, {"time": 2466, "text": "And I was like, wait a second, how are we gonna compete with Sony?"}, {"time": 2470, "text": "And I was always worried that Sony was gonna come out with whatever it was that they were gonna come out with, their MP3 player."}, {"time": 2476, "text": "And that was it, game over, right?"}, {"time": 2479, "text": "And so I was like, Steve, Steve, and this is why it took me four weeks to finally sign on to join Apple after he green lighted the iPod program in that meeting, was because I had built other things in the past at Phillips, the Nino and Velo, but they didn't know how to sell it or market it."}, {"time": 2498, "text": "They didn't know how to retail it, right?"}, {"time": 2501, "text": "So I was like, we could build this."}, {"time": 2502, "text": "And I was like, Steve, I'm pretty sure I can build this."}, {"time": 2505, "text": "I've done this before, but how are we gonna sell it?"}, {"time": 2508, "text": "You have all your marketing dollars on the Mac."}, {"time": 2512, "text": "And he looked at me and he goes, you build this with, you know, a team and our team and Apple and this and this and the me, right?"}, {"time": 2519, "text": "And I dedicate that we will make sure that at least two quarters of all marketing dollars will only go to this product and nothing else."}, {"time": 2530, "text": "Right, Mac was the lifeblood of all revenue of the company."}, {"time": 2534, "text": "So Steve saw something special here."}, {"time": 2536, "text": "Exactly, and he said, I'm going to commit all the marketing dollars if you can deliver the experience that we're all talking about, if we can do that, and that was Jeff Robin as well, because iPod would have never happened without iTunes."}, {"time": 2549, "text": "You know, people don't understand that was a bundle."}, {"time": 2551, "text": "You couldn't do one without the other and vice versa."}, {"time": 2553, "text": "So Jeff and I were, you know, if Jeff and you can present and bring that experience to life, I will put all the marketing dollars behind it."}, {"time": 2562, "text": "When did the marriage of iPod and iTunes sort of, what was that birth of ideas that made up iTunes?"}, {"time": 2573, "text": "iTunes existed before the iPod, okay?"}, {"time": 2576, "text": "And so Jeff Robin had his company, oh man, I can't remember the name, but it was bought."}, {"time": 2580, "text": "He was making a MP3 player app for the Mac."}, {"time": 2585, "text": "Steve saw it because there was MP3 player apps like Winamp and other things that were on the PC, real player, and Steve saw that going on and saw that Jeff and his small team had this, I can't remember, sound something."}, {"time": 2599, "text": "Anyways, he bought that and that became the basis of iTunes and then Jeff ran all of iTunes."}, {"time": 2604, "text": "And so what happened specifically there was they were starting to hook up to all these third party MP3 players because there's a lot of Korean, the MP man, like Walkman, but MP man, all these, and they were trying to hook them up and they were like, these are horrible experiences."}, {"time": 2621, "text": "And through that, and they said, iTunes was something that was gonna help grow the Mac base because we were trying to get more on the Mac."}, {"time": 2629, "text": "So this program would be a great new thing you could add to the Mac."}, {"time": 2633, "text": "And there was also internet connectivity at the time for the iMac."}, {"time": 2636, "text": "And so they did that and then they're trying to do these hookups."}, {"time": 2640, "text": "They weren't going well."}, {"time": 2641, "text": "And that's when they said, we need to build our own."}, {"time": 2644, "text": "Or Steve said, we need to build our own since these are such horrible experiences."}, {"time": 2648, "text": "People don't wanna just burn CDs from iTunes."}, {"time": 2650, "text": "We need to get that music on the go, but in an Apple fashion."}, {"time": 2654, "text": "That's when I was called to come in to do that, the iPod thing after the six weeks."}, {"time": 2660, "text": "Then he already envisioned, I'm sure he had it envisioned because they were trying to do this thing."}, {"time": 2666, "text": "Okay, now that's it."}, {"time": 2668, "text": "iTunes, it wasn't called iPod yet."}, {"time": 2672, "text": "What would become the iPod?"}, {"time": 2673, "text": "That is gonna be the thing that then propels Apple into this new thing because you're gonna bring all these music lovers in that are gonna need their next generation or Sony Walkman version 2.0."}, {"time": 2686, "text": "So when you look at, again, apologies to linger on iPod, but it's one of the great inventions in tech history."}, {"time": 2698, "text": "What wisdom do you draw from that whole process about spotting an idea?"}, {"time": 2703, "text": "This is something you talk about in your book, Build."}, {"time": 2709, "text": "How do you know that an idea is brilliant?"}, {"time": 2711, "text": "At which stage?"}, {"time": 2712, "text": "When did you know it was a good idea?"}, {"time": 2716, "text": "And maybe is there like some phase shifts?"}, {"time": 2722, "text": "First you complete out, then maybe, and then maybe it becomes more than a hmm and becomes like a little more confidence, that kind of stuff."}, {"time": 2729, "text": "And also wisdom about who to talk to so they don't trample the idea in their early stages, that kind of stuff."}, {"time": 2739, "text": "Any thoughts about this?"}, {"time": 2740, "text": "We could go on again."}, {"time": 2741, "text": "How long do you wanna go?"}, {"time": 2742, "text": "20, this is a Netflix series, I told you."}, {"time": 2745, "text": "Multi season."}, {"time": 2747, "text": "So a lot of lessons learned over those years of failure and success, but the first thing it starts with, there's a whole chapter called Great Ideas Chase You."}, {"time": 2758, "text": "And so it kind of goes into in Build and it goes through kind of chapter and verse about all of those, how Nest became into being."}, {"time": 2767, "text": "But let's talk about it specifically for iPod, right?"}, {"time": 2770, "text": "So for me, I always had pain, the pain of carrying these CDs everywhere, right?"}, {"time": 2776, "text": "And I had the joy of music, right?"}, {"time": 2779, "text": "If you could say, all of a sudden I could get the music I love all the time in a portable package and I can have all the music I love all the time, I was solving a pain, which was, for me it was thousands of CDs, other people might be 10 or 15 CDs, right?"}, {"time": 2794, "text": "And then I can have the joy of all this music uninterrupted."}, {"time": 2798, "text": "That was taking the pain, making a painkiller for it."}, {"time": 2803, "text": "And then at the end was a superpower, an emotional superpower that said, oh my, this is something different."}, {"time": 2810, "text": "So when you can actually focus on a pain, not and get a painkiller for it, not a vitamin."}, {"time": 2817, "text": "So the difference between a painkiller and a vitamin is very clear."}, {"time": 2819, "text": "One, you need, I gotta get rid of this pain."}, {"time": 2822, "text": "A vitamin, maybe it works, maybe it doesn't, maybe somebody needs it, maybe not, it's all marketing story, right?"}, {"time": 2828, "text": "So you start with the pain, give them a painkiller, and hopefully if you can do it in the right way, you give them a superpower, an emotional superpower."}, {"time": 2837, "text": "That is always, and that's the way to know that you're hitting on something that's really powerful."}, {"time": 2843, "text": "The pain and the joy, are you always aware of the pain?"}, {"time": 2851, "text": "So it seems like a lot of great products, it's like we do a lot of painful things and we just kind of assume that's the way it's supposed to be, like with autonomous vehicles, we'll all assume we're supposed to be driving."}, {"time": 2866, "text": "And it doesn't, you don't think of it as a pain."}, {"time": 2870, "text": "Right, well, you've habituated it away."}, {"time": 2874, "text": "You've habituated it away."}, {"time": 2875, "text": "For me, when I go to other places, living in Bali or living in Paris or whatever, and I'm not driving, I'm walking or I'm using a scooter or what have you, different thing, and you go, oh my God, when you left that environment, because everyone else is driving all the time, you're like, that's what you do."}, {"time": 2893, "text": "And you find out there's other ways of living and there's freedom when you get rid of that, you're like, oh my God, I didn't know that this was so much better."}, {"time": 2901, "text": "So there's something in the book that's called out and I deemed it the virus of doubt."}, {"time": 2907, "text": "And what the virus of doubt is, is when there's pain and it's been habituated away, you use the right marketing messages to bring people back to that initial experience they had or the initial experience that they had of that pain."}, {"time": 2922, "text": "Do you remember when the first time you did blah and it felt like this, right?"}, {"time": 2928, "text": "And then you reawaken that habituated pain and people, and it becomes visceral and then they're like, oh, yes, I hate that."}, {"time": 2941, "text": "And then you go, now I have the painkiller and the joy for you."}, {"time": 2945, "text": "That's when it all comes together and it goes."}, {"time": 2950, "text": "Let me, on this, on the pain and the joy that's brilliantly put, you mentioned selling and marketing, right?"}, {"time": 2959, "text": "Marketing dollars."}, {"time": 2962, "text": "I have a love, hate relationship with marketing, like with a lot of things that require artistic genius."}, {"time": 2970, "text": "To me, the best marketing, I suppose, is the product itself and then word of mouth."}, {"time": 2977, "text": "So like create a thing that people love."}, {"time": 2980, "text": "Oh, absolutely, that's fundamental."}, {"time": 2981, "text": "Yeah, so any other marketing requires genius to be any extra thing."}, {"time": 2988, "text": "Because to me, I don't, yeah, maybe you can, by way of question, I'm just speaking off the top of my head as a consumer, what is great marketing?"}, {"time": 3003, "text": "What does it take to reveal the pain and the joy of a thing?"}, {"time": 3009, "text": "It all starts at the beginning."}, {"time": 3011, "text": "And let me give you, I'm gonna give you a couple of different ways of looking at it, okay?"}, {"time": 3015, "text": "And again, we might go a little long here."}, {"time": 3018, "text": "So just stay tuned in."}, {"time": 3022, "text": "So the first thing is."}, {"time": 3023, "text": "Start at the beginning."}, {"time": 3023, "text": "Let's start at the beginning."}, {"time": 3026, "text": "In the early part of my career, like General Magic and Philips and what have you, and especially when I was a teenager, when I was making my own chips and stuff like that, I really worried about just putting cool things together."}, {"time": 3044, "text": "I'm like that, when I put those two cool things together as an engineer, you go, that's cool."}, {"time": 3048, "text": "And then I would talk to the other friends who might be geeks too, and they go, yeah, that's cool."}, {"time": 3054, "text": "Because we knew the bits, so we put them together and that's a new way of doing it."}, {"time": 3058, "text": "And you're like, wow, that's all what?"}, {"time": 3062, "text": "It's not why?"}, {"time": 3064, "text": "Why are you doing this?"}, {"time": 3066, "text": "We know what we're doing, but we don't know why we're doing it, because we're not articulating it for ourselves, because it's just something we're like putting it together and like, yeah, that's cool because we think we're solving some problem we have, but we're not really articulating it."}, {"time": 3079, "text": "So what normally happens, and this happens because we invest in so many companies around the world, you have these brilliant engineers, designers, scientists, researchers, they put together these what's."}, {"time": 3092, "text": "And then they develop it, develop it, develop it."}, {"time": 3095, "text": "And then at the end, they call in marketing and say, now tell a story about this and let's get it out to the world, okay?"}, {"time": 3103, "text": "What happens then is marketing is like, well, why do people need this?"}, {"time": 3108, "text": "Tell us why people need it."}, {"time": 3110, "text": "And so they create a story around this product, but the product was born out of what's, not why's."}, {"time": 3117, "text": "And so they start telling, marketing starts telling a story and it turns out to be a fictional story usually."}, {"time": 3123, "text": "They say, oh, this is going to do these things."}, {"time": 3126, "text": "The product comes in as delivered."}, {"time": 3127, "text": "And it falls flat on its face because the marketing doesn't match the product because they weren't both created at the beginning together, right?"}, {"time": 3137, "text": "There are what's when you create a product, but there's a lot more why's and the why's help inform the what's."}, {"time": 3143, "text": "And the why's also inform the marketing."}, {"time": 3147, "text": "So that's what you mean deeply at we should start at the beginning."}, {"time": 3152, "text": "So the designer should be also the marketer."}, {"time": 3155, "text": "The engineer should be the marketer."}, {"time": 3158, "text": "Stop impressing the geek next to you."}, {"time": 3160, "text": "What is the superpower you're bringing or the pain you're killing for the end customer, right?"}, {"time": 3168, "text": "Now let's contrast that."}, {"time": 3171, "text": "Think about a movie."}, {"time": 3173, "text": "A movie starts with a treatment."}, {"time": 3174, "text": "It has an audience."}, {"time": 3175, "text": "This has the audience."}, {"time": 3176, "text": "Here's the characters."}, {"time": 3177, "text": "Here's the storyline, the plot."}, {"time": 3179, "text": "Here's the arc of the story, right?"}, {"time": 3182, "text": "It pulls that all out."}, {"time": 3184, "text": "Then there's a script that's written."}, {"time": 3187, "text": "And that script is then produced."}, {"time": 3189, "text": "And then you add all the flourishes and what have you music and graphics and what have you, right?"}, {"time": 3194, "text": "And then it comes out and then there's the marketing of the movie."}, {"time": 3197, "text": "And that story was created at the beginning."}, {"time": 3199, "text": "What you need to do if you're gonna do a great product is create that treatment for your product."}, {"time": 3204, "text": "And I call that the press release."}, {"time": 3206, "text": "Do the press release like the treatment."}, {"time": 3210, "text": "Who's the audience?"}, {"time": 3211, "text": "What features do you have?"}, {"time": 3213, "text": "What pains are you solving for people?"}, {"time": 3215, "text": "Have the virus of doubt there to remind them what pains they have and why you're solving them."}, {"time": 3220, "text": "The price, all of those things."}, {"time": 3221, "text": "And you use that as the bar, the measuring stick for what you do during development."}, {"time": 3228, "text": "Because what happens that along the route, you know this."}, {"time": 3232, "text": "Oh, we're not gonna be able to get that feature done on time."}, {"time": 3235, "text": "Throw that one overboard."}, {"time": 3236, "text": "We gotta hit the, we have to hit the date."}, {"time": 3238, "text": "Oh, we're not sure this product's right yet."}, {"time": 3241, "text": "Add another feature."}, {"time": 3242, "text": "Add another feature creep, right?"}, {"time": 3245, "text": "If you don't have that story you know you're gonna tell at the beginning, you don't have that bar, right?"}, {"time": 3251, "text": "And then at the end, you don't know when you're done if you don't have that story."}, {"time": 3254, "text": "So you can actually look at that press release."}, {"time": 3256, "text": "You know, you change it over time, that draft."}, {"time": 3261, "text": "But then when you're done, you know the what's and the whys."}, {"time": 3264, "text": "You have all the things, the audience and everything."}, {"time": 3266, "text": "And then you can give that to marketing and say, well, and marketing has been along the way, let's be clear."}, {"time": 3272, "text": "But then everybody's in sync."}, {"time": 3273, "text": "And that's when you can tell a cohesive, non fictional story about, and the product delivers on that story or hopefully over delivers on that story."}, {"time": 3281, "text": "So in the drafting from the beginning to the end of the press release, what does a successful team look like?"}, {"time": 3289, "text": "Who's part of the draft?"}, {"time": 3291, "text": "Is it engineers, designers?"}, {"time": 3293, "text": "What's the purpose of a marketing department in a company, small, let's say small company, but more than two people?"}, {"time": 3302, "text": "So from where does the why come from?"}, {"time": 3306, "text": "Should it always come from the designer or should there be a marketing person that yeah, steps in and ask the question."}, {"time": 3313, "text": "So I'll just keep asking random questions."}, {"time": 3316, "text": "No, these are great questions."}, {"time": 3318, "text": "So, cause you're just like, I'm like, I can't wait to tell you the answer."}, {"time": 3322, "text": "So it's in the book as well, but you have to separate out the various functions of marketing."}, {"time": 3327, "text": "That's what I thought, I was like, marketing's marketing, and it's really not."}, {"time": 3334, "text": "There's so many disciplines, just like in engineering, mechanical, electrical, software, and even software, it's cloud services, firmware applications, marketing has that much diversity as well."}, {"time": 3346, "text": "Okay, and you have to honor that."}, {"time": 3348, "text": "And so there is marketing communications like PR, press, there is social marketing, there is a marketing creative, right?"}, {"time": 3360, "text": "There's marketing activation, but there's another thing that also comes out and people confuse it with marketing, which is called product marketing or product management."}, {"time": 3373, "text": "And product management or product marketing is the voice of the customer."}, {"time": 3378, "text": "They're the person who sits there and listens to what's going on in the competition, in the marketplace, understanding the needs and those pains of the customer, and they're representing them in every single meeting so things don't get off track, right?"}, {"time": 3394, "text": "So that, and they're creating the messages, not the marketing."}, {"time": 3399, "text": "What happens is there's messages that product marketing creates, like those are the deep messages, like we need to save 20% of energy, let's say, right?"}, {"time": 3408, "text": "And then marketing turns that into something that's with creative and everything and brings that message across."}, {"time": 3413, "text": "Maybe it doesn't say that, but it comes maybe visually or some other way."}, {"time": 3417, "text": "So product management does that and holds that press release along the route and making sure that we're tracking."}, {"time": 3427, "text": "And then also marketing is tracking with that press release to make sure they're not telling a fictional story, right?"}, {"time": 3432, "text": "Because they can also add extra adjectives or something, and then the product can't deliver that."}, {"time": 3436, "text": "It's like, no, no, no, no, no."}, {"time": 3438, "text": "Keeps everybody in check."}, {"time": 3439, "text": "It has to be grounded to the press release, to the raws."}, {"time": 3442, "text": "Right, to the customer needs, right?"}, {"time": 3444, "text": "Cause they're always representing the customer."}, {"time": 3445, "text": "So you have to have a product manager."}, {"time": 3448, "text": "Typically that's the founder, right?"}, {"time": 3450, "text": "In the beginning."}, {"time": 3452, "text": "And then over time you hire a product management team to then really watch over this the whole way."}, {"time": 3460, "text": "And they are talking to customer support."}, {"time": 3462, "text": "They're talking to engineering, they're talking to design, they're talking to sales and marketing."}, {"time": 3467, "text": "And they are always in the mix."}, {"time": 3470, "text": "And it's the hardest thing to hire for."}, {"time": 3472, "text": "Ooh, yeah."}, {"time": 3473, "text": "So they have this very important job of developing and maintaining the why."}, {"time": 3479, "text": "Why is it the hardest to hire for?"}, {"time": 3481, "text": "Because you have to understand, first, nobody reports to you."}, {"time": 3486, "text": "You're alone."}, {"time": 3487, "text": "So you're alone and you have to build great ties with all of these different functions."}, {"time": 3493, "text": "You have to understand what they do, be empathetic with what they do."}, {"time": 3497, "text": "And you have to project the customer's empathy or empathy for the customer to them and tell them why and why this customer needs this, why this doesn't work."}, {"time": 3508, "text": "And so that they learn more."}, {"time": 3510, "text": "They're not just doing, but they learn about the customer's point of view and sit in there and stand in their shoes to be able to then make better decisions on the engineering details or the operational details, customer support details."}, {"time": 3522, "text": "So they understand that if they're not the customer that it's intended for, they start to live through their eyes and see through their eyes of that customer so they make better decisions."}, {"time": 3535, "text": "And there's probably fascinating, beautiful tensions between that and sort of the engineers."}, {"time": 3543, "text": "Oh, that's cool."}, {"time": 3544, "text": "Sort of the developing the what."}, {"time": 3549, "text": "Which makes it an extra hard job, I'm sure."}, {"time": 3552, "text": "Can I ask a sort of a little bit of a personal question on the one subfield of marketing you mentioned, comms and PR."}, {"time": 3562, "text": "How do I ask this?"}, {"time": 3563, "text": "I can hear your struggle in your sigh."}, {"time": 3567, "text": "Why or do the comms and PR folks sometimes kill the heart and soul of the magic that makes a company or is that wrong to say?"}, {"time": 3585, "text": "Give me an example."}, {"time": 3586, "text": "I will say the spirit of the example, which is it feels like often the jobs of communications is to provide caution."}, {"time": 3598, "text": "It almost works together with legal to say."}, {"time": 3601, "text": "A shield."}, {"time": 3602, "text": "Yeah, we probably should not say this."}, {"time": 3606, "text": "Let's be careful, let's be careful."}, {"time": 3609, "text": "Now, that makes sense except in this modern world, authenticity is extremely valuable and revealing the beauty that is in the engineering, the beauty of the ideas, the chaos of the ideas, I think requires throwing caution to the wind to some degree."}, {"time": 3635, "text": "And I just find that, boy, to push back on myself, I think it's an extremely difficult job because people hold you responsible if you're doing communications when you take risks."}, {"time": 3653, "text": "And especially when they fail."}, {"time": 3654, "text": "So it's a difficult job, so I understand why people become cautious, but to me, communications is about taking big risks and throwing caution to the wind at its best because your job is to communicate in the long term, communicate the genius, the joy, the genius of the product."}, {"time": 3679, "text": "And that sometimes is a tension with caution."}, {"time": 3683, "text": "Sorry, so because I've gotten the chance to meet a lot of very interesting people and interesting engineering teams and so on, I look at what they're doing and I look at what's being communicated and it's just, there's a mismatch because the communication is a lot more boring."}, {"time": 3700, "text": "It's like, there's something very like, just straight up boring about the way they're communicating because of caution."}, {"time": 3709, "text": "Okay, you have just teed me up for another diatribe, okay?"}, {"time": 3714, "text": "I'm gonna get on my podium here."}, {"time": 3718, "text": "Yeah, it all comes out of the leader."}, {"time": 3724, "text": "If the leader doesn't know how to storytell or the leader doesn't know how to do bold storytelling, then you get even more conservatism from the PR and communications folks because they're always, so if you have a, not a bold leader, they're always going to be a filter, right?"}, {"time": 3743, "text": "They're always gonna try to smooth things out and take off the rough edges and try, so they're gonna be even more, if you have a conservative messaging leader, you're gonna have an even more conservative communications department."}, {"time": 3756, "text": "Because they wanna keep their jobs."}, {"time": 3757, "text": "Okay, it's really simple."}, {"time": 3760, "text": "They gotta keep their jobs."}, {"time": 3761, "text": "If they say one wrong thing, it could be the end of it."}, {"time": 3764, "text": "So if you have very conservative leader, they're going to be even more conservative."}, {"time": 3768, "text": "If you have a bold leader, they'll always take a little more conservative bent, but you're still gonna have bold communications."}, {"time": 3777, "text": "Okay, so it starts with the leader."}, {"time": 3780, "text": "Now, that said, when you think about the messages and the joy and revealing things, right?"}, {"time": 3793, "text": "Many of these leaders don't tell great stories."}, {"time": 3798, "text": "So what we do at FutureShape, our investment firm, is we take those scientists all of, and the great minds and everything, and what do we surround them with?"}, {"time": 3808, "text": "Marketing and communication people and storytellers to give them the confidence to tell a much broader story about the impacts of what they're creating and how big the global change can be with those technologies."}, {"time": 3823, "text": "Because usually they don't, those leaders who created those technologies, they don't really know how to communicate really well and they don't feel very comfortable in how they speak."}, {"time": 3832, "text": "Yeah, so it's interesting because stories, I'm a huge fan of stories."}, {"time": 3837, "text": "Have you ever read the book, Story?"}, {"time": 3840, "text": "By Robert McKee?"}, {"time": 3842, "text": "You should read this."}, {"time": 3842, "text": "And this is what I read when I was 26."}, {"time": 3845, "text": "Story by Robert McKee, and it's a book all about the ways to do script writing, the prototypical types of scripts, drama, comedy, and how it's been shown over millennia, how these stories are done."}, {"time": 3861, "text": "It's a fascinating thing and it gives you an insight to, and it's written for obviously Hollywood and movies and things like that, but it's incredibly useful for what we do as designers and engineers and technology leaders."}, {"time": 3877, "text": "There's some aspect in this modern day where this podcast and so on, what I love is the humans behind the story too."}, {"time": 3887, "text": "So some part of the story is the human beings."}, {"time": 3889, "text": "So humor, drama, heartbreak, hope."}, {"time": 3899, "text": "That's not just about painting a beautiful story that's flawless, it's..."}, {"time": 3905, "text": "Vulnerability."}, {"time": 3907, "text": "It's being a dreamer, like overpromising, and then failing, so changing your mind, realizing sort of just the whole of it."}, {"time": 3918, "text": "And then also being like, depending of course where your personality is, embracing the full richness and the complexity of the personality of the leader or the different people involved."}, {"time": 3930, "text": "I mean, that's all part of it."}, {"time": 3931, "text": "Like you can't just present this beautiful, always pleasant view of a product."}, {"time": 3937, "text": "There has to be this humanity that's part of it, the full roller coaster of the humanity, which I think has been very difficult for companies to embrace, I'm not sure why."}, {"time": 3952, "text": "Maybe it's just an old school way of doing things that people think that we present a facade and we generate the story and we tell the story as opposed to sort of... Well, we learn, especially in the technical world, we present the story as it's faster, it's smaller, it's longer battery life, it's bits and numbers and metrics, that resonates sure with other geeks."}, {"time": 3982, "text": "What resonates with the planet?"}, {"time": 3986, "text": "It's all emotions, right?"}, {"time": 3988, "text": "And if you can bring a great emotional story, but with a great rational story at the same time, why you should do this, and it's like, oh my God, you bring that superpower, that joy, then it all hangs."}, {"time": 4001, "text": "And there's personal drama too, like the human."}, {"time": 4005, "text": "Right, here's the pain I had, remember that thing."}, {"time": 4008, "text": "And I mean, you're obviously this extremely well known human being that's behind a lot of these great inventions of the technology world, but you're also just a human being, you have clearly a distinct personality that comes through, like your eyes light up, just the way you communicate, it's you."}, {"time": 4035, "text": "Some people are more stoic, some people are, like Elon is all over the place, the chaos."}, {"time": 4044, "text": "Steve Jobs, I mean, it's hard to put into words, I can be poetic and so on, but there's a very distinct, comes on stage, you know, that personality is right there."}, {"time": 4054, "text": "That's not just the product, that's something else too."}, {"time": 4057, "text": "And like, you have to reveal that a little bit, and allow people to reveal that a little bit, and just let them be themselves."}, {"time": 4065, "text": "Well, look, why do I think your podcast is so amazing?"}, {"time": 4071, "text": "Because you are yourself."}, {"time": 4073, "text": "You talk about yourself, you bring your emotions into it, and you don't modulate it, you're you, right?"}, {"time": 4080, "text": "It comes through, it's true, it feels right."}, {"time": 4083, "text": "You are you, you dress the way you wanna dress, you say this is me, and this is all of me, and you become vulnerable, right?"}, {"time": 4091, "text": "It's much easier to do a podcast like that than run a very large company, where a lot of people would feel the pain if you make, if you say something stupid."}, {"time": 4100, "text": "So it's much more easy to be afraid and be careful."}, {"time": 4107, "text": "But nevertheless, the same applies."}, {"time": 4111, "text": "Authenticity and risk taking is the only way, unfortunately, to be successful in the long term."}, {"time": 4119, "text": "Let me, just because we're jumping all over the place, just link on the iPod."}, {"time": 4124, "text": "One of the great designs, broadly speaking, in the word design of all time, what does it take to design a great product?"}, {"time": 4133, "text": "If you look, we can jump around, we can look at Nest, we can look at iPod, we can look at iPhone, and many of the great things you design, but just looking at that one transformational thing, what can you say about what it takes to do a great design?"}, {"time": 4153, "text": "Or maybe what makes a great design?"}, {"time": 4160, "text": "Well, we talked about a painkiller, and we talked about the, we talked about that joy that comes from it."}, {"time": 4168, "text": "But then there's the behind the scenes, there's the team, there's everyone who brings it to life, brings that story to life."}, {"time": 4178, "text": "If you have a great story, and you know the why, then you can communicate it to those people who are working on it."}, {"time": 4185, "text": "And then they bring their own thing into it, right?"}, {"time": 4189, "text": "It becomes emotional for them too."}, {"time": 4191, "text": "It's not just a job, it's a mission."}, {"time": 4194, "text": "And so many of the details that are born out of these early prototypes, these things that you still haven't given full form to, there may be 80% done, or maybe even 60% done, but you can see enough in there."}, {"time": 4210, "text": "Then you take those great ideas, and you give the whys to the team."}, {"time": 4214, "text": "And so that they feel it, they can understand it, then they bring their best and their ideas to the table, and then you can select from those, and you can then start to, you know, it could be just a pixel change."}, {"time": 4229, "text": "It could be a slight change on how you do the audio for the feedback, or maybe a curve on the mechanics, or something like that, of how it feels."}, {"time": 4238, "text": "Because everybody brings themselves trying to feel this thing."}, {"time": 4241, "text": "They're not just doing something that someone told them to do."}, {"time": 4244, "text": "If you can instill that mission and that why into that team, it doesn't have to be big, you get, I feel, a 10X."}, {"time": 4252, "text": "Everyone comes together in a special way, and the magic is created."}, {"time": 4258, "text": "You put the love into it, the customer feels the love on the other side."}, {"time": 4262, "text": "So the, making the team, like taking them in onto the vision, onto the why, now they feel, all the little details we think of, the original iPod, and all the many generations after, all those little details are, in them is the emotion of the engineers and the designers, that working nights, struggling, this isn't right."}, {"time": 4293, "text": "Like you said, changing little pixels here and there, changing the shape of things, changing the feel of things, like the materials, the, I don't know, just everything on the software part of the packaging."}, {"time": 4308, "text": "Then the words on the packaging."}, {"time": 4311, "text": "Just everything."}, {"time": 4312, "text": "The words on the website."}, {"time": 4313, "text": "And always jumping from the very specific detail problem to the big picture, how the thing feels, the overall."}, {"time": 4320, "text": "Always jumping back and forth."}, {"time": 4321, "text": "What does it look like to the customer?"}, {"time": 4322, "text": "How are we gonna implement it in the most efficient way?"}, {"time": 4327, "text": "Because a lot of the stuff you don't know is, some of that stuff is hacked in, maybe hacked in at the end."}, {"time": 4333, "text": "It may not be the most beautiful architecture that a geek would look at and go, oh my God, that's so beautiful, because we can look at it and visualize this incredible software stack or hardware stack."}, {"time": 4344, "text": "Some of it could just be hacked in."}, {"time": 4346, "text": "You make it better over time, but it was that brilliant thing and we gotta get that in, because that's the way you do it now, and we'll make it more efficient later."}, {"time": 4355, "text": "Maybe this is a good moment to draw a distinction between design and engineering, and does such a distinction even exist?"}, {"time": 4363, "text": "Are these distinct disciplines or no?"}, {"time": 4366, "text": "I don't think they're distinct."}, {"time": 4367, "text": "I think they're different types of design."}, {"time": 4369, "text": "I think there's always this idea of this, oh, on the mount, designer, and it all comes down and it all flows down like some magic."}, {"time": 4382, "text": "There are electrical designers, there's AI designers, there is data scientist designers."}, {"time": 4387, "text": "Everybody has design, and there's a chapter in the book all about that, actually."}, {"time": 4392, "text": "That it's not just you go to the mount and it comes down and you're enlightened."}, {"time": 4397, "text": "It's each person brings their form of design and their craft, because if they're really good, they're artists in their own right."}, {"time": 4405, "text": "They're not just engineers, they're not just designers, they're artists, they're empathetic, they really wanna bring their best."}, {"time": 4410, "text": "A lot of the best engineers I have are not the technical, or that I've worked with, are not the technical gotta get it exactly right."}, {"time": 4418, "text": "They're the artists, they came from music or they came from other things, and they see that."}, {"time": 4423, "text": "When you work with very rigid engineers, this is the way, the only way, la la la, those are not the engineers I wanna work with."}, {"time": 4432, "text": "They're all like a bit artists at heart."}, {"time": 4434, "text": "Right, they understand the practicalness."}, {"time": 4439, "text": "They don't have to have the rigidity of, this is the way it's done."}, {"time": 4443, "text": "Like, mm mm."}, {"time": 4445, "text": "If you're building something new, all new and revolutionary, none of us are experts at it."}, {"time": 4451, "text": "And if you come with that expert mindset, just tell me, and I can give you a story, I should probably give you that story, about that if you come with the expert and I'm the expert, when you're doing something no one's ever done before, I don't want you on the team."}, {"time": 4465, "text": "Because we all are learning about something that has never been in existence before."}, {"time": 4470, "text": "And we have to bring that level of vulnerability and openness to new ideas and new ways of doing things throughout the team."}, {"time": 4479, "text": "So you want people that are able to have like beginner's mind or whatever, like don't come in as an expert."}, {"time": 4487, "text": "Okay, here's the story."}, {"time": 4488, "text": "No, I can tell it for sure."}, {"time": 4490, "text": "So, you know, you asked what were these risks, you know, like on the early iPod, and there was a few big risks."}, {"time": 4498, "text": "Like one, and this doesn't go in the story, but like putting rotating media in your pocket and it could drop at any time, what happens there?"}, {"time": 4507, "text": "And like you can damage, because the heads and the hard drive media are so close, it smacks, it's dead, right?"}, {"time": 4513, "text": "So that was one big one, like, holy shit, right?"}, {"time": 4516, "text": "So that was something we, and we had to design special tests and everything and special software on that."}, {"time": 4521, "text": "But then there was another one, which was at the early days, the way the first generations of iPods, I had to hack the IDE interface to the hard drives."}, {"time": 4532, "text": "So I was like, okay, what we're gonna use is we're gonna use this chip for hard drive, hard drive, to make a hard drive, you had to have a chip that did FireWire to a hard drive."}, {"time": 4543, "text": "Okay, and then that would become a portable hard drive."}, {"time": 4546, "text": "Well, then we had the MP3 player and the user interface and everything."}, {"time": 4552, "text": "So there was times when it was just this hard drive and there was times when it was a MP3 player and I had to hot switch between what the hard drive thinks it was talking to, right?"}, {"time": 4563, "text": "So designed this thing, tore it apart, did all this stuff."}, {"time": 4566, "text": "And I was like, you know, maybe I'm gonna screw up IDE and there's something, there's some holes I'm gonna see."}, {"time": 4573, "text": "So I go, who's the expert at Apple who understands IDE and everything?"}, {"time": 4578, "text": "So this person comes over, the mass storage specialist comes over and I put on the whiteboard and say, here's how we're gonna do this thing and here's the commands and da da, and this is how it hot switches and everything."}, {"time": 4588, "text": "He's like, that's never gonna work."}, {"time": 4592, "text": "It was never gonna work."}, {"time": 4593, "text": "I said, well, let me go over here and show you this right here."}, {"time": 4596, "text": "I have it prototyped and it's been working for days."}, {"time": 4598, "text": "I just wanna see if you're gonna have it, find any holes in the thing."}, {"time": 4601, "text": "Didn't even, and he just stormed out of the room and never even, right?"}, {"time": 4607, "text": "I've had a lot of experience like this with experts."}, {"time": 4610, "text": "Like for example, this ridiculous room."}, {"time": 4614, "text": "I had a person and there's many people like this that I showed them, here's the situation, you know."}, {"time": 4623, "text": "For acoustics or something?"}, {"time": 4624, "text": "For acoustics, yeah."}, {"time": 4624, "text": "They're like, no, no, no, no, this is horrible."}, {"time": 4627, "text": "This is not, this is not gonna work."}, {"time": 4631, "text": "The reflection, the curtains are not gonna stop."}, {"time": 4635, "text": "There's a bunch of terminology they're telling me."}, {"time": 4639, "text": "It's a similar kind of situation as the ID, which I was like, no, listen, I just need to see is there major issues and they're like a low hanging fruit that are fixable and major holes I should be aware of."}, {"time": 4652, "text": "Not like, let's."}, {"time": 4653, "text": "$100,000 to upgrade."}, {"time": 4655, "text": "To upgrade for what exact purpose?"}, {"time": 4658, "text": "What, not why?"}, {"time": 4660, "text": "The why, the focusing on the story, on the content, on the, the why, the why, the why."}, {"time": 4666, "text": "And that actually I've experienced that unfortunately in the artistic realms too, which is like photography and videography, cinematography."}, {"time": 4676, "text": "It's interesting, I talk to photographers that are quote unquote experts."}, {"time": 4681, "text": "And it's always about so much of the focus is on the equipment."}, {"time": 4688, "text": "The equipment behind the sensors and the lighting."}, {"time": 4692, "text": "And it's like, all right, all right."}, {"time": 4696, "text": "But what about, what about the feeling of the story you create visually?"}, {"time": 4706, "text": "The difference between a movie that's really well told and it doesn't have all the effects and everything versus maybe some of the superhero movies we see all the time, which is good luck if there's a story but man, there's a lot of action and CGI, right?"}, {"time": 4722, "text": "And there's also value to those, right?"}, {"time": 4726, "text": "CGI, superhero."}, {"time": 4728, "text": "Can tell a better story but you have to have a good story to begin with."}, {"time": 4731, "text": "Sure, exactly."}, {"time": 4733, "text": "But if you're focused on the story, I guess you need to start with a story."}, {"time": 4737, "text": "You need to start with a story."}, {"time": 4738, "text": "And if you bring in experts, they can often be detrimental, I guess, to the why."}, {"time": 4747, "text": "They're too good at doing the what."}, {"time": 4749, "text": "Well, you can bring in experts for why."}, {"time": 4751, "text": "There's lots of experts for why."}, {"time": 4753, "text": "Too many times we get experts for what."}, {"time": 4757, "text": "And then they only focus on the what."}, {"time": 4759, "text": "And so they come with the specs and feeds and the numbers and all the other stuff."}, {"time": 4764, "text": "But what you're really asking for is I need somebody about the why and understanding what we're trying to get done here and fitting the what's into that why, right?"}, {"time": 4772, "text": "That's why I do think that one of the qualities that I really enjoy for people to work with is like humility for a particular problem when you approach it."}, {"time": 4783, "text": "Basically, I don't know how to solve this but we're going to figure it out."}, {"time": 4787, "text": "As opposed to, oh, I've solved this thing many, many times before I know exactly what to do."}, {"time": 4793, "text": "Humility before the chaos."}, {"time": 4795, "text": "So having an open mind that this is going to require a totally new way of doing things."}, {"time": 4801, "text": "It's a really nice quality to see."}, {"time": 4805, "text": "You're one of the fascinating humans in the history of Silicon Valley."}, {"time": 4809, "text": "Steve is another one of those."}, {"time": 4811, "text": "So those two humans came together for a time to work together."}, {"time": 4815, "text": "What was it like working with Steve Jobs?"}, {"time": 4818, "text": "What aspect of his behavior and personality, let's say, brought out the best in you?"}, {"time": 4825, "text": "Pushing you, really pushing you, relentless on the details, challenging you for the right reasons."}, {"time": 4833, "text": "It wasn't bullying, it wasn't demeaning."}, {"time": 4836, "text": "He would critique the work, not judge the person, at least not in front of them."}, {"time": 4841, "text": "Or inside of a, you know, in front of a group or anything like that."}, {"time": 4844, "text": "I know it was really that attention to detail."}, {"time": 4846, "text": "And he, when he would make a decision, you know, there are, when you make the first version of anything, something revolutionary, there are a lot of opinion based decisions."}, {"time": 4856, "text": "And there's only one or two people, three people who hold those opinion based decisions and what they should be."}, {"time": 4863, "text": "And when you have those opinions and you're trying to work with the team to implement those decisions, you have to really tell the why of those decisions."}, {"time": 4876, "text": "Just don't go do it, but why it's there."}, {"time": 4879, "text": "So you can feel part of that decision."}, {"time": 4883, "text": "You can understand what were the trade offs of the different other answers to that opinion, right?"}, {"time": 4891, "text": "And say, this is the reason why we picked the route we picked because it's this for the customer or this for the whole world story, what have you."}, {"time": 4898, "text": "So that you felt really good because a lot of times most people want a data driven decision, but with the ones you don't get data, right?"}, {"time": 4908, "text": "Maybe in a B2B, you could a little bit cause you can talk to customers, but you can't do that with a consumer product."}, {"time": 4912, "text": "V1, version one, B2B, business to business versus what's the alternative?"}, {"time": 4919, "text": "Business to consumer, V1."}, {"time": 4921, "text": "Okay, we're just defining some terms."}, {"time": 4925, "text": "Yes, you're absolutely."}, {"time": 4926, "text": "And when you say data driven decisions versus what?"}, {"time": 4929, "text": "Opinion based decisions."}, {"time": 4931, "text": "So like gut, you have to use, you don't have any."}, {"time": 4934, "text": "You can't fall back on any data or any previous history to kind of inform you of what's going on, right?"}, {"time": 4943, "text": "And so if you look at most companies who are paralyzed and cannot make new innovations and new products, it's because they're trying to turn, and this is what I saw at Phillips, they're trying to turn opinion based decisions into data driven decisions so they don't lose their jobs."}, {"time": 4961, "text": "So if you look at management consulting, management consulting is all about taking those opinion based decisions, giving them to someone else to turn into data that comes back to them and says, they can blame the management consultants when something goes wrong, as opposed to it wasn't me, right?"}, {"time": 4981, "text": "When you need to have to tell that story, you have to understand that, especially V1, you need to be able to articulate those opinion based decisions and you need to own them."}, {"time": 4994, "text": "And if you fail with some of them, you didn't get it right, you then own them and fix them and move on, right?"}, {"time": 5001, "text": "Version one of the iPod wasn't perfect."}, {"time": 5003, "text": "Version one of the iPhone wasn't perfect."}, {"time": 5005, "text": "We got a lot of opinion based decisions wrong."}, {"time": 5009, "text": "But as you go through that, because you got more data, because V2, you had data on those original opinions and then you were able to then modulate off of that, right?"}, {"time": 5017, "text": "And you'll still have new opinions because those are differentiators that we call differentiators, the things that move the product forward in its evolution."}, {"time": 5028, "text": "But at the revolution stage, opinions, opinions, opinions, no data."}, {"time": 5032, "text": "And so you have this discussion, you and Steve in the stage and the whole team with opinions."}, {"time": 5042, "text": "And there you have to be harsh."}, {"time": 5044, "text": "And I wouldn't say harsh, but you have to be very determined, right?"}, {"time": 5050, "text": "You know, there are two real opinion based decisions that happened on the iPhone."}, {"time": 5055, "text": "One was the keyboard."}, {"time": 5058, "text": "Should we have a hardboard keyboard or should we have a virtual keyboard?"}, {"time": 5061, "text": "The Blackberry was the number one productivity messaging device of its time."}, {"time": 5066, "text": "It was called a Crackberry for a reason because people loved it because it was easy to type and they could get their work done."}, {"time": 5074, "text": "But when you're saying we're gonna move from that, everyone's talking about that in the market and you say we're gonna move to a virtual keyboard and it's not gonna work as well as the hardware keyboard, that's an opinion based decision, right?"}, {"time": 5086, "text": "Because the data is telling you all the best sales are over here."}, {"time": 5091, "text": "God, that takes guts."}, {"time": 5093, "text": "It takes guts, but you have to look at it from a different point of view."}, {"time": 5096, "text": "And this is how I learned to come to understand this because I had been building virtual keyboards before and I knew the goodness and the badness in them, right?"}, {"time": 5106, "text": "But he was like, look, those are productivity devices."}, {"time": 5109, "text": "We're making it, ours is born out of an entertainment device and productivity, right?"}, {"time": 5114, "text": "We need to show full screen videos."}, {"time": 5116, "text": "We are gonna have apps, not apps, but our apps, the Apple apps, cause there were no app store yet, are gonna take over the whole screen."}, {"time": 5123, "text": "You want a full screen web browser."}, {"time": 5125, "text": "You don't want one that's like half of the device is just a keyboard."}, {"time": 5128, "text": "Maybe you don't need that keyboard in every instance."}, {"time": 5130, "text": "So we want that part of the screen to change based on the tool you may need at the time."}, {"time": 5134, "text": "And maybe it's just full view, right?"}, {"time": 5136, "text": "So you have to go and understand it's a different type of device, just cause that's that and it's successful for that reason, the crackberry for the keyboard."}, {"time": 5143, "text": "That's not the only thing you're gonna do with this device cause people only did messaging and maybe a few phone calls, right?"}, {"time": 5149, "text": "This was gonna be so much more."}, {"time": 5150, "text": "It was gonna be an entertainment web browsing device."}, {"time": 5153, "text": "So you wanted those tools to go away, but it wouldn't be as good as the hardware keyboard."}, {"time": 5158, "text": "So that's an opinion."}, {"time": 5159, "text": "But let me give you another opinion based decision that got turned around before it shipped."}, {"time": 5164, "text": "Steve said, no SIM slot."}, {"time": 5167, "text": "I don't want any slots."}, {"time": 5168, "text": "We're gonna make it very pure."}, {"time": 5170, "text": "Johnny was like, of course, no slots."}, {"time": 5173, "text": "Johnny, hi."}, {"time": 5174, "text": "And we all looked around and go, that doesn't work."}, {"time": 5179, "text": "Well, why does Varite?"}, {"time": 5180, "text": "And then he would always, and this was the magic of Steve, like when you said, no, that doesn't work, you'd go, well, why does Verizon not have any SIM slots?"}, {"time": 5187, "text": "They showed that you can do a mobile phone with no SIM slots."}, {"time": 5190, "text": "And you're like, okay, here we go."}, {"time": 5192, "text": "And so a few days later, we come back with, so product marketing, voice of the customer, engineering, we all come back with all the data showing how many data networks and mobile networks required SIM cards versus did not and what the trends were."}, {"time": 5210, "text": "And so we showed the data and that killed the, or excuse me, brought back the SIM slot on the original iPhone."}, {"time": 5218, "text": "Because we're like, because he was just like, we're gonna tell AT&T to not use a SIM, right?"}, {"time": 5224, "text": "We're gonna just tell them to do it differently, right?"}, {"time": 5226, "text": "But we were like, if we want this thing to go anywhere around the world, you wanna put that friction in."}, {"time": 5231, "text": "People are gonna move from place to place."}, {"time": 5233, "text": "They have different SIMs because of the prices and all that stuff."}, {"time": 5236, "text": "We had to show all of that data."}, {"time": 5237, "text": "And then that opinion based decision got turned into a data driven decision."}, {"time": 5242, "text": "And the SIM slot obviously showed up."}, {"time": 5245, "text": "So those are two very, at the very same time, right?"}, {"time": 5249, "text": "Opinion can hold and so can data overrule opinion when data does exist for a V1."}, {"time": 5256, "text": "But at the end of the day, you don't know what the right answer is."}, {"time": 5260, "text": "So doing no SIM card slot may have been the right decision."}, {"time": 5267, "text": "We won't know."}, {"time": 5269, "text": "Because maybe if that was the decision, then like many times throughout Apple's history, you basically changed the tide of how technology is done."}, {"time": 5281, "text": "Absolutely, you never know."}, {"time": 5283, "text": "Apple started WiFi."}, {"time": 5285, "text": "People don't understand WiFi came out of there."}, {"time": 5286, "text": "There was no WiFi in 2001."}, {"time": 5290, "text": "And then everyone else got on board."}, {"time": 5293, "text": "If you look at now where we're going, we're going to phones without SIM slots."}, {"time": 5297, "text": "Cause we have eSIMs, right?"}, {"time": 5298, "text": "And now the SIM slots becoming legacy, legacy."}, {"time": 5301, "text": "It's a legacy port."}, {"time": 5303, "text": "That legacy port will probably be gone by six, maybe 10 years."}, {"time": 5308, "text": "It'll be gone."}, {"time": 5309, "text": "I'm pretty sure of that."}, {"time": 5311, "text": "Because it's so much easier for carriers."}, {"time": 5312, "text": "They don't have to have physical things to go out and right."}, {"time": 5315, "text": "So right now it's just the early days, but it will happen and it will go its way."}, {"time": 5321, "text": "It'll fall away, but it will take time."}, {"time": 5323, "text": "You just couldn't do it back then."}, {"time": 5324, "text": "So timing is essential here, but at the end of the day, it's opinions and that's where the genius is."}, {"time": 5329, "text": "Sometimes the data tells you one thing, but the data at the end of the day does represent the past."}, {"time": 5336, "text": "And the future may be different than the past."}, {"time": 5340, "text": "Sometimes there's wisdom in the past and sometimes it's actually representative of something that should be overcome and progress looks like leaving that stuff behind."}, {"time": 5352, "text": "Like the headphone jack."}, {"time": 5356, "text": "I mean that when different folks were getting rid of the headphone jack, boy, I would love to be a fly in the wall of those discussions."}, {"time": 5367, "text": "We had that, oh, that was a discussion that happened almost every year."}, {"time": 5374, "text": "That was an every year, should we get rid of headphone jacks on the iPod, right?"}, {"time": 5378, "text": "When are wireless headsets gonna happen, right?"}, {"time": 5381, "text": "And it took years to build all the right protocols, the chips, all those things to make the experience that is the iPods today, right?"}, {"time": 5390, "text": "To say, have the confidence, cause Bluetooth was good, but it wasn't Apple like."}, {"time": 5395, "text": "So that is like, we gotta make our own chips, we gotta make our own software stacks."}, {"time": 5399, "text": "Now we have the confidence to remove the headphone jack and actually make you pay $200 more for your iPhone that you were just paying because of the headphone jack."}, {"time": 5407, "text": "Now we've grown our revenue, we've given a new experience to the user, right?"}, {"time": 5411, "text": "And ta da, you know, and it's just, it's magic."}, {"time": 5415, "text": "And now the world's transformed to everyone, you know, moving to that, right?"}, {"time": 5419, "text": "But it took years to understand the problem, develop the technology and not just rush it to market to get a half experience, but to get it right and refine it, then ship it."}, {"time": 5431, "text": "And only then after it was probably four or five years in development, just like the M1 processor, right?"}, {"time": 5437, "text": "That was a work from 2008, right?"}, {"time": 5443, "text": "Grinding away, grinding away, grinding away, then saying, okay, now we have the confidence we're doing our own silicon for all the iPhones and iPads and such."}, {"time": 5454, "text": "Now we're gonna turn to the Mac and make sure we have the best processor, right?"}, {"time": 5458, "text": "Not just that we have the best integrated design team."}, {"time": 5461, "text": "And then saying we're gonna, you know, and then besting everyone, making sure the softwares and the hardware is designed at the same time, making sure the kernels, all those things are gonna use the best efficiency and then popping it out."}, {"time": 5476, "text": "And then it feels seamless."}, {"time": 5478, "text": "It's magic."}, {"time": 5479, "text": "There were no, as far as I could tell, unless you were in real esoteric drivers or something like that, it just worked."}, {"time": 5485, "text": "It was magic."}, {"time": 5487, "text": "Like the transition, it was not even a speed bump."}, {"time": 5489, "text": "It was not even a crack in the road."}, {"time": 5492, "text": "So perhaps famously Steve had a bit of a temper."}, {"time": 5496, "text": "Steve Jobs, would you say his particular personality in this aspect was constructive or destructive in the process of shaping these opinion based ideas?"}, {"time": 5515, "text": "So in Build, I write a chapter called Assholes."}, {"time": 5520, "text": "Yes, and you lay out beautifully the types of assholes and maybe you could speak to the constructive and the destructive types of assholes."}, {"time": 5533, "text": "So there's really two delineations that I've found of real fundamental ones."}, {"time": 5540, "text": "And that is again, the why."}, {"time": 5544, "text": "Why do I feel this person is an asshole?"}, {"time": 5547, "text": "They might not be."}, {"time": 5550, "text": "I feel this is a person who's an asshole."}, {"time": 5552, "text": "Are they motivated by their ego or are they motivated by their mission?"}, {"time": 5558, "text": "Something they're trying to do and doing in service of something else, right?"}, {"time": 5563, "text": "Sometimes those lines can be blurry, but it's usually pretty clear."}, {"time": 5568, "text": "When it's ego motivated, it's clear they're just trying to get up in the ranks, push people down, shove people aside."}, {"time": 5577, "text": "I think we saw a president do that on a stage once."}, {"time": 5580, "text": "I'm me and I'm the guy, right?"}, {"time": 5586, "text": "And I'm gonna prove it by pushing everyone away and being nefarious or what have you."}, {"time": 5591, "text": "Either passively aggressive or aggressively aggressive, but they're doing about themselves."}, {"time": 5598, "text": "There's another one, which is someone who's so attentive to detail and unrelenting that they're trying to get the right things for the country."}, {"time": 5608, "text": "They're trying to get the right things for the customer or in service of their mission."}, {"time": 5613, "text": "And they wanna make sure we fulfill those things, right?"}, {"time": 5617, "text": "And they really care."}, {"time": 5619, "text": "They don't micromanage all the details, but they micromanage the details where the customer, it touches the customer in some way."}, {"time": 5628, "text": "People who work with those types of people who are unrelenting and push you and might make you upset."}, {"time": 5635, "text": "A lot of times it's a knee jerk reaction to go, they are an asshole."}, {"time": 5641, "text": "Get off my back, you're an ass, blah, blah, blah, blah."}, {"time": 5645, "text": "Right, and you're protecting your ego because what's happening is that person is usually pushing you beyond your boundaries."}, {"time": 5653, "text": "They see something that we can do or you can do that you're just either not wanting to do for whatever reason, you're not confident in that."}, {"time": 5663, "text": "You're like, I don't wanna take the extra time and saying, no, we need to get that done and pushing you."}, {"time": 5668, "text": "Okay, and so when we came to those areas, it wasn't just a one on one, it could be Steve against the team going, we need glass instead of plastic on the front face of the iPhone, and we're going to do this."}, {"time": 5685, "text": "And we're like, God, you know, and so we did it."}, {"time": 5689, "text": "And he pushed us because he didn't know all the details, but he could see in our minds that we're like, yeah, we could probably, yeah, we could probably, but man, it's really putting us in risk."}, {"time": 5699, "text": "And we laid out the risks for him."}, {"time": 5701, "text": "And he's like, I'm willing to take those risks."}, {"time": 5703, "text": "We'll do that."}, {"time": 5704, "text": "We're like, we might be three months late."}, {"time": 5706, "text": "He's like, this is so important."}, {"time": 5708, "text": "We need to stay on time."}, {"time": 5711, "text": "You know, but it would be all the time, push, push, push."}, {"time": 5714, "text": "It reminds me of like kids growing up and me as growing up, you know, when your parents push you to make you grow beyond your boundaries, your personal boundaries."}, {"time": 5723, "text": "And you're like, God damn it, I'm so, you know, but they do it for the right reasons."}, {"time": 5728, "text": "Now let's see, it's not bullying."}, {"time": 5730, "text": "It's not about bullying."}, {"time": 5731, "text": "It's not about demeaning."}, {"time": 5733, "text": "It's about either pushing you to another part of the mission that needs to get done, or it's about critiquing your work, but not judging you."}, {"time": 5741, "text": "Well, there's a lot to say there."}, {"time": 5743, "text": "So one, it's fascinating."}, {"time": 5746, "text": "It really is fascinating."}, {"time": 5748, "text": "And you laid out a very nice picture, but it does feel like there's sometimes gray areas, which is why it makes all of this very complicated."}, {"time": 5757, "text": "So one question I have for you in terms of glass on the iPhone."}, {"time": 5763, "text": "How important is it that like Steve in that case is right?"}, {"time": 5769, "text": "Because I could argue each side."}, {"time": 5772, "text": "It seems like in one sense, just having a strong vision and opinion is already going to make everybody grow, even if it turns out to be the wrong."}, {"time": 5782, "text": "As long as you are sort of standing your ground, you know, Napoleon invading Russia or something in the winter, like it's just not gonna be a good idea."}, {"time": 5795, "text": "It's not a good idea, but I'm gonna hold to that."}, {"time": 5799, "text": "And then once you decide, you go all in."}, {"time": 5801, "text": "And then from that, even if the whole team knows it's the wrong decision, just sticking by it, powering through, you will learn through the pain of it."}, {"time": 5810, "text": "Like everybody will learn."}, {"time": 5811, "text": "So that's one side."}, {"time": 5813, "text": "The other is maybe the asshole, the vision driven asshole gets to be more and more of an asshole if they have a track record of through that process, having built people up, having made the correct decisions."}, {"time": 5830, "text": "They can't, they're not allowed to be an asshole."}, {"time": 5833, "text": "They're in rare air and no one can challenge them."}, {"time": 5836, "text": "Steve was never that."}, {"time": 5838, "text": "That's the great thing."}, {"time": 5839, "text": "He was never unchallengeable."}, {"time": 5842, "text": "You could challenge him."}, {"time": 5843, "text": "Now the plastic to glass story is a perfect example of this."}, {"time": 5851, "text": "So at the beginning of the project, well before we were going, we had always had these things about plastic front iPods, these kinds of things, scratches and all that stuff."}, {"time": 5861, "text": "So we said, oh, we're gonna have a glass or a plastic, a cover for the display."}, {"time": 5867, "text": "Cause the display was glass underneath it."}, {"time": 5871, "text": "We argued back and forth about glass versus plastic."}, {"time": 5874, "text": "And then we all landed together on plastic."}, {"time": 5880, "text": "Okay, the original decision was plastic."}, {"time": 5883, "text": "And the reasons were, okay, we don't wanna make a mistake."}, {"time": 5886, "text": "Glass can break, you know, people drop them all the time."}, {"time": 5891, "text": "So we don't wanna have a fragile device because you're gonna be using even more than a music player, right?"}, {"time": 5900, "text": "And you're gonna be holding your head and putting it in your pocket and misses and all that stuff."}, {"time": 5904, "text": "So we went down the road with plastic."}, {"time": 5907, "text": "When it was shown, when the product was shown at Mac World in 2007, the first time, that was plastic."}, {"time": 5915, "text": "We had just enough of them in the field at the time."}, {"time": 5919, "text": "We started to start seeing light scratches on the plastic."}, {"time": 5925, "text": "Reviewers who didn't have the device yet, cause it was behind glass."}, {"time": 5929, "text": "If you remember 2007, the Jesus phone comes up and no one could even touch them."}, {"time": 5934, "text": "You could just look at it in this beautiful museum quality box."}, {"time": 5937, "text": "Like it came from the future or whatever, the past."}, {"time": 5940, "text": "And it was just plastic."}, {"time": 5942, "text": "And it was like, oh, and you just looked and that was all you got."}, {"time": 5947, "text": "But then people said, well, what screen is, what covers on that, you know, reviewers who knew better, you know, it's plastic."}, {"time": 5955, "text": "And they were like, really?"}, {"time": 5957, "text": "And so there was enough of a doubt there."}, {"time": 5960, "text": "And then when we started to do it, and then Steve changed the frame of reference of the question or of the result of what the customer would think."}, {"time": 5968, "text": "And he was like, if we designed it with plastic, with plastic and it's in their pocket all the time and it gets scratched by coins, slightly scratched or by keys or something like that."}, {"time": 5979, "text": "That is a design problem."}, {"time": 5981, "text": "We need to fix the problem."}, {"time": 5982, "text": "That was our bad."}, {"time": 5985, "text": "If they go off and drop it or even slightly drop it and it cracks, it's the customer's fault."}, {"time": 5994, "text": "And they have much lower, they have less likelihood to complain."}, {"time": 5998, "text": "Yes, they'll complain, but they're part of that, of that failure."}, {"time": 6007, "text": "There's truth to that."}, {"time": 6009, "text": "Because then they were part of why it failed."}, {"time": 6011, "text": "Whereas the design, they didn't do anything wrong."}, {"time": 6013, "text": "It was just sitting in their pocket and it's scratching and that's normal use."}, {"time": 6018, "text": "Abnormal use has been dropped."}, {"time": 6019, "text": "And we're like, oh, now we get it."}, {"time": 6023, "text": "And so we all moved to that mindset when you framed the problem and the solution in that way versus the original framing where we all landed on plastic."}, {"time": 6034, "text": "So, and then he was unrelenting on that, but we all had moved and we had moved mindset and we understood the why and we marshaled together."}, {"time": 6045, "text": "And then by the end of June, and it was crazy, the mechanical product design teams sourcing, all of us, the partner Corning pulled together to make that happen because it was the right reason."}, {"time": 6060, "text": "So this, you look at these stories and you hear just the top line rumors of the takeaways, but that's not usually how it all happened of like one leader was, that's not how Steve was."}, {"time": 6072, "text": "Now I've seen leaders who are just pounding and just had no real empathy for the team and understanding the why."}, {"time": 6079, "text": "And it's just, it is the way I want it, right?"}, {"time": 6081, "text": "I am the supreme leader."}, {"time": 6083, "text": "That wasn't like that when."}, {"time": 6085, "text": "He just had a very strong opinion."}, {"time": 6087, "text": "Very strong opinion."}, {"time": 6089, "text": "But it was challengeable."}, {"time": 6090, "text": "It was challengeable and if you came with the right thing, you know, it was, you could modulate that, but you had to come with a team."}, {"time": 6097, "text": "It couldn't just be you."}, {"time": 6098, "text": "It had to become a team and data and to overcome because it was a very strong opinion."}, {"time": 6103, "text": "And there's personal quirks of character, like you said."}, {"time": 6106, "text": "Bad days and good days."}, {"time": 6108, "text": "So there's also the three options you said."}, {"time": 6111, "text": "You noticed that the third option is always going to be the one that's picked."}, {"time": 6116, "text": "Those kinds of."}, {"time": 6119, "text": "And that, so that brings up another thing."}, {"time": 6124, "text": "You said challenge the idea, not the person."}, {"time": 6130, "text": "I'm somebody who has a, you know, I have a temper."}, {"time": 6133, "text": "I use colorful language and so on."}, {"time": 6136, "text": "On teams I work."}, {"time": 6137, "text": "In my private life I'm much calmer and so on."}, {"time": 6139, "text": "But I get, when I get really passionate with engineering teams."}, {"time": 6143, "text": "I've been called an asshole."}, {"time": 6144, "text": "And you get, I mean, I am distinctly aware that you cross lines often."}, {"time": 6154, "text": "There's like levels, right?"}, {"time": 6156, "text": "You know, you could, it has to do with language and how language is heard."}, {"time": 6161, "text": "So for example, you could say a lot of stuff to me."}, {"time": 6163, "text": "You could swear."}, {"time": 6164, "text": "You could say stuff that sounds, like, I don't know."}, {"time": 6169, "text": "Lex, sometimes I think you're the dumbest human on the face of the earth or something."}, {"time": 6175, "text": "That sounds very personal, right?"}, {"time": 6177, "text": "But I'm not gonna take that personally."}, {"time": 6178, "text": "I understand what's being said."}, {"time": 6180, "text": "And then I also notice that there's other people that take stuff more personally."}, {"time": 6184, "text": "This has to do with teams and figuring out like, okay, who's going to take certain words personally and not, and you have to know."}, {"time": 6190, "text": "That's what makes a great coach, a great leader, a mentor, you have to like factor all that in."}, {"time": 6196, "text": "But it just, there's something about just being an asshole and being passionate and really driven that sometimes you do cross lines."}, {"time": 6206, "text": "And that's, I don't know what to do with that because it feels like it comes with the territory."}, {"time": 6212, "text": "Like you have, it seems like you can't just have a perfectly optimized."}, {"time": 6218, "text": "No, no, absolutely not."}, {"time": 6221, "text": "We're humans."}, {"time": 6222, "text": "We're humans, we don't have a program."}, {"time": 6223, "text": "Everyone's programmed the same way to react the same way to given stimulus, right?"}, {"time": 6228, "text": "So, you know, you said, I don't know if this was a real example, but you said, oh, you're the dumbest human on earth or whatever."}, {"time": 6236, "text": "I would never say that."}, {"time": 6238, "text": "Absolutely never."}, {"time": 6240, "text": "And if someone said that to me or I saw someone else say that to another person on the team, absolutely not."}, {"time": 6246, "text": "That is not allowed because that's judging someone."}, {"time": 6248, "text": "You may be heated and you can get heated and you can say it in your intonation, but to then try to put a label on it and put a label on a person, that is not allowed."}, {"time": 6257, "text": "So if you let that kind of culture happen and it becomes somewhat, you know, sometimes it's ingest, you know, it has to be very much ingest and those two people have to have a really good working relationship."}, {"time": 6301, "text": "You gotta snuff that out and you gotta be that, you gotta be that change or that model that you wanna show the team."}, {"time": 6308, "text": "Yes, it's too, even if it doesn't affect me, it's going to affect a significant enough fraction of brilliant people where that shouldn't be part of the culture."}, {"time": 6318, "text": "Exactly, and other people see that happen and then, oh, I guess that's acceptable, right?"}, {"time": 6322, "text": "Just like politics in the workplace, is that acceptable or not?"}, {"time": 6326, "text": "I call it out exactly when I see it in front of everyone, right, because it's just another ego driven thing."}, {"time": 6332, "text": "You have to set the tone as a leader for what you want your organization to be and how it gets reflected in the world and you have to uphold that and you can't, sure, you can have an excursion outside of that, but you have to go back and say, I'm sorry."}, {"time": 6349, "text": "You have to go and apologize, heal and said, I was not the person I wanted to be that day, I'm really sorry."}, {"time": 6356, "text": "This is, and even in front of the team and have that humility and say, we're all human here and just cause I'm the leader doesn't mean I don't make mistakes."}, {"time": 6363, "text": "So have the self awareness, apologize."}, {"time": 6367, "text": "And that's also part of the culture."}, {"time": 6372, "text": "How are you different from Steve as a leader and designer?"}, {"time": 6376, "text": "So you've spoken about sort of what made you strong, which is he was able to challenge, he was able to push you to bring out the best."}, {"time": 6386, "text": "Well, I come from the technical angle, right?"}, {"time": 6388, "text": "Deep technology, software, hardware, systems thinking, implementation, all that stuff."}, {"time": 6394, "text": "So I have a different bent."}, {"time": 6396, "text": "He wanted to be an engineer, started, but really he was much better at all the other things, the storytelling, the interfacing and being the voice of the customer and being that product marketer in a way, right?"}, {"time": 6407, "text": "That we talked about."}, {"time": 6409, "text": "I grew into being the product marketing, then marketing."}, {"time": 6411, "text": "He came really out the other way, right?"}, {"time": 6413, "text": "And never got really deep technically."}, {"time": 6415, "text": "So that's two different mindsets."}, {"time": 6417, "text": "One's not better or worse."}, {"time": 6418, "text": "It's just, that's how it is."}, {"time": 6420, "text": "And it takes all kinds and all kinds can do great designs."}, {"time": 6425, "text": "Did it manifest itself differently?"}, {"time": 6426, "text": "Just the fact that you came from those different places."}, {"time": 6430, "text": "Like what, so like the discussion about glass on the iPhone was probably had a different flavor to it."}, {"time": 6438, "text": "When you started getting into the technical details, enough so you're getting the third order technical details and he can't argue with that anymore."}, {"time": 6445, "text": "Then with somebody he's like, okay."}, {"time": 6447, "text": "At some point he's like, I can't win this war."}, {"time": 6450, "text": "And he learned that very early on because he didn't like the way the look of the Macintosh board, the PCB was laid out."}, {"time": 6459, "text": "He wanted it to be beautiful on the outside and on the inside."}, {"time": 6462, "text": "He's like, why are all these wires running this way?"}, {"time": 6464, "text": "Why doesn't it have all this symmetry?"}, {"time": 6467, "text": "And we have to make it beautiful on the inside."}, {"time": 6469, "text": "And even the traces on the boards have to look a certain way."}, {"time": 6473, "text": "So the teams made the board they knew that would work."}, {"time": 6476, "text": "And then they made the board that the way Steve wanted it."}, {"time": 6479, "text": "And that didn't work."}, {"time": 6481, "text": "And then Steve instantly figured out like at some point don't micromanage every single detail."}, {"time": 6485, "text": "There's some things he doesn't know enough about."}, {"time": 6487, "text": "And so he would get out of that."}, {"time": 6489, "text": "But that was one of those instances where he pushed really hard and that's his opinion."}, {"time": 6493, "text": "So they said, okay, we're gonna make it a data driven decision and we're gonna make both."}, {"time": 6496, "text": "I'm gonna show you the results, right?"}, {"time": 6498, "text": "And then from there, he didn't get into those details."}, {"time": 6501, "text": "So from that, you could have a great challenge, right?"}, {"time": 6505, "text": "Cause then you could get those data and say, we can't do that."}, {"time": 6507, "text": "And let me show you why, or we can do that."}, {"time": 6509, "text": "And then Steve would go, you can't do that."}, {"time": 6511, "text": "And you're like, oh, we can do that."}, {"time": 6512, "text": "Let me show you, right?"}, {"time": 6513, "text": "So there's certain times when you were like bringing something to reality that he didn't think could exist, right?"}, {"time": 6519, "text": "So it was always that creative tension, that interaction that was so successful, right?"}, {"time": 6526, "text": "I think, but there was one other fundamental thing that was different and that it graded on the team and that I made sure and I learned from to not do."}, {"time": 6536, "text": "And I maybe overdue now in the opposite direction, which is when there's a great idea that comes from the team, acknowledge that person and go, that is a great idea."}, {"time": 6547, "text": "As the leader, the opinion driven, that's a great idea."}, {"time": 6551, "text": "Let's build on that."}, {"time": 6551, "text": "Let's see if that can do that."}, {"time": 6553, "text": "Or it's a great idea, but not for now, put it aside."}, {"time": 6555, "text": "But call out when people have great ideas because it's infectious."}, {"time": 6559, "text": "And that means maybe not ideas that come bubble up to the customer level, but inside the organization."}, {"time": 6564, "text": "People like they get rewarded for their ideas and say, that's a great one."}, {"time": 6569, "text": "Steve was always like, you give an idea and he would go, okay, I don't know."}, {"time": 6577, "text": "The next day, 24 hours later, it would come back with slight modifications."}, {"time": 6580, "text": "I've had this genius idea, right?"}, {"time": 6583, "text": "And it's sooner or later we'd look around the table and we'd like roll our eyes and go, here we go again."}, {"time": 6589, "text": "So it demotivates you from generating ideas a little bit."}, {"time": 6593, "text": "Well, we got used to it, but later on in the team, it was just not, it doesn't want to bring the best, right?"}, {"time": 6602, "text": "Cause if you're always like, the reaction is never, that's a genius idea."}, {"time": 6607, "text": "It was always like, it was either negative or neutral."}, {"time": 6613, "text": "Then it doesn't have that same emotional effect that you want you to bring your best."}, {"time": 6617, "text": "Yeah, sometimes it's fun when people get excited by just, yeah, yeah, yeah, yeah."}, {"time": 6621, "text": "You kind of build on top excitement."}, {"time": 6623, "text": "It could be, but coupled with sort of harshness when the idea is bad and you call out the bad ideas too."}, {"time": 6628, "text": "So it's the good and the bad."}, {"time": 6630, "text": "Oh, you could say, you don't have to say bad idea."}, {"time": 6633, "text": "You say, maybe not now."}, {"time": 6635, "text": "Let's table that for later."}, {"time": 6637, "text": "Let's discuss it or say, that's a decent idea."}, {"time": 6640, "text": "But did you think about that idea this way?"}, {"time": 6642, "text": "Not just no or yes, but let's talk about why that might not be applicable in this case so that they can learn."}, {"time": 6648, "text": "So the next time they bring the next idea, they can modulate and understand to start seeing through the opinion based decision makers or the databases to bring it and bring better formatted arguments or ideas so that you have better chance of success the next time."}, {"time": 6663, "text": "You got to train through those moments."}, {"time": 6664, "text": "You got to teach, those are teaching moments."}, {"time": 6667, "text": "Teaching moments."}, {"time": 6668, "text": "I aspire to be that kind of person."}, {"time": 6670, "text": "I'll usually just say that idea is shit."}, {"time": 6674, "text": "That is the like, and then you, I remember that this brilliant person just gave that really shitty idea."}, {"time": 6683, "text": "So I remember to make sure the next time they give a good idea, I really compliment that good idea."}, {"time": 6687, "text": "But I personally, I mean, it's emotion, but I call out the really shitty ideas."}, {"time": 6694, "text": "But you should call it the really great ones."}, {"time": 6696, "text": "If you let the pendulum swing both ways, then everybody goes, he's balanced."}, {"time": 6700, "text": "It's always one way."}, {"time": 6702, "text": "Why bring any idea?"}, {"time": 6703, "text": "I'm all about the pendulum."}, {"time": 6706, "text": "You got to have both, the joy and the pain."}, {"time": 6711, "text": "Don't you give me pain all the time."}, {"time": 6713, "text": "So you mentioned the glass and the iPhone."}, {"time": 6715, "text": "So you wanted to, not just the iPod, not just Nest."}, {"time": 6719, "text": "You were one of the key figures in the creation of the iPhone."}, {"time": 6722, "text": "What's the interesting aspects?"}, {"time": 6723, "text": "What's the good, the bad, and the ugly of the origin story of the iPhone?"}, {"time": 6728, "text": "Again, this is a Netflix series that spans multiple seasons."}, {"time": 6733, "text": "Change my flight, please."}, {"time": 6734, "text": "Yeah, what was the, what interesting memories you have from the finding?"}, {"time": 6739, "text": "So the pain and the joy that was foundational to the iPod, all the CDs you had to lug around."}, {"time": 6753, "text": "What was the pain and the joy and the vision of the iPhone in your mind, in the mind of the team, in Steve's mind, and so on?"}, {"time": 6762, "text": "Well, you know, there's multiple pains."}, {"time": 6764, "text": "You have to also look, there's not just customer pain, but there's business pain, okay?"}, {"time": 6768, "text": "And it's about the, so Apple now is getting out of that place where it was in 2001."}, {"time": 6774, "text": "Now people are starting to pay attention."}, {"time": 6776, "text": "Apple's starting to get in the culture again."}, {"time": 6778, "text": "It's becoming relevant."}, {"time": 6780, "text": "Cash is starting to flow."}, {"time": 6781, "text": "iPod is 60% of that, of the revenue, total revenue of Apple doing an 85% market share."}, {"time": 6790, "text": "You're starting to get a wind at your back."}, {"time": 6791, "text": "You got confidence."}, {"time": 6793, "text": "Like Apple had been beaten down since probably the first time the Mac was, since the Mac, it was a beaten company ever since the Mac."}, {"time": 6801, "text": "So we're talking 15 years at that point, right?"}, {"time": 6805, "text": "This is the first time you're seeing like, and Steve would proudly came in front of us and said, today I can tell you all of the employees, we are now out of debt."}, {"time": 6816, "text": "We paid off our debt."}, {"time": 6818, "text": "It was a joyous moment for him, right?"}, {"time": 6822, "text": "And then ultimately for our team because no more debt, wonderful, right?"}, {"time": 6827, "text": "So now what you have is you have this successful thing changing the face of Apple and you hear these heavy stomping footsteps of the mobile phone industry."}, {"time": 6841, "text": "And it's the feature phones at that time."}, {"time": 6843, "text": "They're adding cameras."}, {"time": 6844, "text": "They're adding color displays."}, {"time": 6846, "text": "They're seeing the success of the iPod and going, that's just music, we have some storage."}, {"time": 6852, "text": "We can load music on our phones and we can do what the iPod does plus more."}, {"time": 6859, "text": "Boom, boom, boom, right?"}, {"time": 6862, "text": "And you're like, and how many hundreds of millions of them are being sold at that point?"}, {"time": 6867, "text": "It wasn't billions yet, but it was still, a hundred million, 200 million a year."}, {"time": 6871, "text": "iPod hadn't gotten there."}, {"time": 6872, "text": "It was for 20, 40, 50 million, something like that."}, {"time": 6876, "text": "So now you're like, okay, what are we gonna do about this Goliath who wants to take our lunch, right?"}, {"time": 6884, "text": "The schoolyard bully."}, {"time": 6886, "text": "And so there was one, let's partner with them."}, {"time": 6891, "text": "So iTunes music store was there."}, {"time": 6894, "text": "All of these phones are gonna need music so they can come to the iTunes music store and get that music for those phones because it wasn't just about the hardware player at that point."}, {"time": 6905, "text": "It was about the software that you need on the desktop and the content that you needed to download."}, {"time": 6910, "text": "So now Apple had multiple legs of the stool as Steve would always refer to it."}, {"time": 6914, "text": "So now the mobile phone industry, okay, we're gonna work with them."}, {"time": 6918, "text": "They are going to make an iPod shuffle basically inside of a phone, can have 99 songs total."}, {"time": 6927, "text": "And they're gonna come to our store and you're gonna, I was like, okay, great."}, {"time": 6931, "text": "It's all gonna be well and good."}, {"time": 6932, "text": "And that became the Motorola rocker project."}, {"time": 6935, "text": "It was Apple and Motorola getting together."}, {"time": 6938, "text": "There's gonna be software on this smartphone or not smartphone, but feature phone to hook to iTunes to get your music."}, {"time": 6945, "text": "It wasn't even downloadable over a cloud or anything because that wasn't available yet."}, {"time": 6949, "text": "There wasn't data networks yet."}, {"time": 6954, "text": "It was a disaster from the beginning."}, {"time": 6956, "text": "Two different cultures, two different types of leadership styles, not necessarily the most competent engineers on the other side."}, {"time": 6966, "text": "And it turned out to be an absolute horrible disaster."}, {"time": 6970, "text": "I watched the pains, cause luckily I didn't have to be part of it."}, {"time": 6972, "text": "I watched the pains on Jeff Robbins face each time we would meet."}, {"time": 6975, "text": "And he would be like, these guys are just like, really?"}, {"time": 6980, "text": "Do we have to do this, Steve?"}, {"time": 6981, "text": "And he's like, we're contractually obligated."}, {"time": 6984, "text": "And when it came out on stage and Steve showed it, it was maybe a one minute, Steve loves those extended, like drawn up."}, {"time": 6991, "text": "It might've been a one minute, two minute kind of thing."}, {"time": 6993, "text": "And he literally threw that phone out of his hand as fast as he could, right?"}, {"time": 6997, "text": "Cause it was horrible."}, {"time": 6998, "text": "So there was the pain of we're not gonna partner."}, {"time": 7001, "text": "So if we can't partner with these guys, we have to become one of them to actually compete, to save the thing that is bringing Apple from that 15 years of malaise, right?"}, {"time": 7014, "text": "So then from that, we were made a prototype of an iPod plus phone, a classic with it was an iPod, but it had a phone inside with all the music and all the other stuff."}, {"time": 7027, "text": "And you use your headset, wired headset to do the audio, right?"}, {"time": 7032, "text": "There was another project at the same time cause we were doing videos in the iTunes music store, iTunes video store for music videos and movies."}, {"time": 7044, "text": "And it would be a full screen iPod."}, {"time": 7046, "text": "So instead of the classic, the way you know it, but it would be full screen and it would have a virtual click wheel."}, {"time": 7054, "text": "You'd have a virtual, like single touch touchscreen that you could scroll, right?"}, {"time": 7058, "text": "Think of maybe an iPhone, like you knew it, right?"}, {"time": 7061, "text": "And then there was a third project going on, not in, those two were going on in my team, but the third project going on was the multi touchscreen technology to drive a Mac tablet."}, {"time": 7075, "text": "And so that Mac tablet, that touchscreen technology, there was just way too much you had to change on the software and everything to be able to use a tablet, right?"}, {"time": 7086, "text": "We see this all the time."}, {"time": 7087, "text": "Like people are like, there's not enough tablet apps today that are modified for tablet."}, {"time": 7090, "text": "They're just phone apps that are grown up, right?"}, {"time": 7092, "text": "So then they would just be Mac touch stuff."}, {"time": 7095, "text": "So you'd have to have a whole developer community."}, {"time": 7097, "text": "That probably wasn't the best place to take that technology first."}, {"time": 7101, "text": "So you take that technology, marry it with the full screen, that technology, marry it with the full screen iPod and the phone stuff we were working because the iPod phone with a rotary dial was just like a rotary phone."}, {"time": 7112, "text": "We couldn't make that interface work well for data input."}, {"time": 7117, "text": "You put those three together."}, {"time": 7118, "text": "And now is where those three things that then created the form or the technology and the form inside what would become the iPhone, married with a bunch of low level software from the iPod and manufacturing software and drivers and communication stuff, combined with a very reduced Frankenstein Mac OS."}, {"time": 7143, "text": "And I mean that in the best way."}, {"time": 7146, "text": "It means it wasn't Mac OS just changed a little."}, {"time": 7149, "text": "It was totally, things were hacked out and changed and new code was inserted."}, {"time": 7153, "text": "And it really was a whole set of things from all different places to make that first iPhone OS."}, {"time": 7160, "text": "And then there was another team working on the apps and then another team working on the design of how it looked overall between all that stuff."}, {"time": 7167, "text": "So all of those things came together to create what we know as the first generation iPhone."}, {"time": 7172, "text": "And those are all probably fascinating engineering challenges."}, {"time": 7177, "text": "And great teams like creating the Frankenstein OS."}, {"time": 7182, "text": "That's fascinating because you're simplifying and simplifying but then you're just pulling different stuff from, and you're basically inventing, I mean, they're probably not thinking of it that way, but a new era of computing, a new kind of computer."}, {"time": 7196, "text": "It really is Frankenstein."}, {"time": 7197, "text": "Right, and you didn't have to run Mac software."}, {"time": 7199, "text": "If you look at some of the other smartphones of the time, like Windows and stuff, they were like, we need to make sure it runs Excel and it runs Word or something like that in some reduced thing."}, {"time": 7209, "text": "This was like, no, no, no, no."}, {"time": 7211, "text": "This was born out of entertainment."}, {"time": 7212, "text": "So we didn't have to go and take all the same application, you know, all those other ones was about compatibility."}, {"time": 7219, "text": "This was about a whole new way of being."}, {"time": 7221, "text": "What did you think about the Steve Jobs presentation of the iPhone, the sort of, the first iPhone, you know."}, {"time": 7231, "text": "Phone, internet communicator, and the iPod in your pocket."}, {"time": 7234, "text": "Yeah, that you're going to sort of present, announcing three new products kind of thing and then saying that it's all in one."}, {"time": 7243, "text": "Just, this is a good example, one of the sort of historic presentations of a product."}, {"time": 7252, "text": "Clearly there's like some showmanship that works, some reason it works."}, {"time": 7256, "text": "It doesn't always work, it often doesn't work, but it did in this case, it often did for Steve."}, {"time": 7262, "text": "What, like, how did that feel?"}, {"time": 7266, "text": "What part of the actually the design process was that presentation?"}, {"time": 7274, "text": "In the early, because you said, should consider the why, the press release at the very beginning."}, {"time": 7279, "text": "Steve was doing that the entire time."}, {"time": 7281, "text": "He was working on that story from day one."}, {"time": 7284, "text": "He was pitching us this, this, this, and then this."}, {"time": 7287, "text": "And then he would look at our faces because you wouldn't, most people wouldn't, at least if you're working for him, wouldn't tell him what you really thought of what he was saying, but he would look at your faces."}, {"time": 7296, "text": "And then he would talk to a few real trusted confidence outside of the organization."}, {"time": 7304, "text": "And see what they thought, right?"}, {"time": 7305, "text": "And they could give him feedback on it and they could really challenge him, but he would also look at their faces and go, hmm."}, {"time": 7311, "text": "And so when you see that, hmm, then he would modulate it and change it slightly and change it."}, {"time": 7317, "text": "So he was working during all of that time on the story and the storytelling, right?"}, {"time": 7321, "text": "And the whys, while we're working on that and helping us refine it, just like the switch from plastic to glass, right?"}, {"time": 7328, "text": "All the time working on that."}, {"time": 7330, "text": "So when he comes out on stage, he does something that every marketer is told not to do."}, {"time": 7335, "text": "Say these three things are now combined in one."}, {"time": 7339, "text": "That is like the, they say that that is the laziest form of storytelling possible for marketing, right?"}, {"time": 7348, "text": "But it was the best one because it was all those pains."}, {"time": 7351, "text": "It was like, I want my iPod, but I want my communications and I want my internet browsing because I want it on the go so I can look up things because it was information."}, {"time": 7360, "text": "And when you were on the road, you had a laptop, you had an iPod and you had a phone that, and you had to carry all of these things with you at once."}, {"time": 7369, "text": "Now we're gonna solve that pain for you and put it all together."}, {"time": 7372, "text": "So he was just showing you the pain and beating that virus of doubt and going, it's now in this one magical thing."}, {"time": 7377, "text": "And he could come up and masterfully tell that story because he told it almost every day to all of these people inside very quietly."}, {"time": 7386, "text": "And then it was just, right?"}, {"time": 7389, "text": "It was like a Tony award winning play that had been worked on for 10 years."}, {"time": 7394, "text": "But also the human came through, the timing."}, {"time": 7397, "text": "It was all that, it was all of it."}, {"time": 7398, "text": "And of course he was dramatic at certain points and he would raise his voice and a wry smile or whatever it was."}, {"time": 7404, "text": "Right, that wry smile was magic."}, {"time": 7405, "text": "It was all those touches."}, {"time": 7406, "text": "He was an actor as well as a storyteller."}, {"time": 7409, "text": "But it was the truth, right?"}, {"time": 7412, "text": "The truth came through."}, {"time": 7413, "text": "It was a nonfiction story."}, {"time": 7416, "text": "And then he added those personal flourishes on top of it for dramatic effect."}, {"time": 7425, "text": "So there's a designer you mentioned, Johnny Ave. You both are brilliant designers, great human beings."}, {"time": 7435, "text": "There were some battles fought in the distant past between the two of you."}, {"time": 7441, "text": "Looking back, what is the positive characteristics of Johnny that made you a better person and designer having worked with him?"}, {"time": 7453, "text": "Watching the process that the design team that Johnny led."}, {"time": 7460, "text": "I don't know where, cause that was over years."}, {"time": 7462, "text": "I didn't see all of those things."}, {"time": 7463, "text": "But watching the design process of really, cause it was really a team that was about materials."}, {"time": 7469, "text": "It was about form."}, {"time": 7471, "text": "It was about colors."}, {"time": 7472, "text": "It was about these physical characteristics."}, {"time": 7476, "text": "When we talked about this earlier was design."}, {"time": 7478, "text": "What is design?"}, {"time": 7479, "text": "Design's everywhere, okay?"}, {"time": 7481, "text": "So what they were really focused on was form, how the feel was, how it looked, the aesthetics, the physical aesthetics."}, {"time": 7490, "text": "And watching, going through that process, I learned so much in that process about how to do colors, how to do materials, how to think deeply about curves, and shadows, and how it would look, not just in your hand, but how it would look in the photograph you were gonna take for marketing, right?"}, {"time": 7514, "text": "So how it would look, how you would feel, all of it."}, {"time": 7519, "text": "It was all of those physical things around that and watching the process to get there, that was enlightening for me, right?"}, {"time": 7531, "text": "It opened my mind to go, oh, okay."}, {"time": 7535, "text": "Just like there's a process for all these other things, it wasn't just magic and you say, ha, ha, ha, there it is."}, {"time": 7542, "text": "It was really a process of refinement, you know, of opening the funnel at the beginning and refining down over time to get to that final, the final and selecting and doing the selection."}, {"time": 7553, "text": "And certain types you could, certain times there were opinion based design details."}, {"time": 7558, "text": "But a lot of data, a lot of data driven designs of what can we deliver in volume?"}, {"time": 7565, "text": "What can we do different things?"}, {"time": 7566, "text": "So you always had these constraints that you had to work with under."}, {"time": 7569, "text": "And sometimes they, and the team, not just I, would say, we need this."}, {"time": 7574, "text": "And we're like, we can't deliver that."}, {"time": 7576, "text": "But maybe we were able to work together to find different design characteristics and different implementation characteristics that could get to that point without what they were describing."}, {"time": 7587, "text": "And instead of yes, yes, yes, no, no, no, let's find some other way to solve the problem together."}, {"time": 7594, "text": "Yeah, is, and I've seen this in several companies I've more closely interacted with, like Tesla is an example."}, {"time": 7603, "text": "Sometimes, you know, talking about curves, sometimes it's very painful on the engineering side to deliver a very specific kind of thing."}, {"time": 7615, "text": "And one question that comes up in my mind is like, well, how far should we go to try to deliver a tiny adjustment in a curve, in the curvature, or in like whatever the form factor is, or the color of the material, when the cost is like 10X to deliver, not financially, but just like in effort, like how many problems to have to solve."}, {"time": 7674, "text": "Right, exactly, but you have to understand again the why behind it."}, {"time": 7678, "text": "And at Nest, when we had limited resources, you know, putting a screwdriver in the box, a custom designed screwdriver in the box, was born out of those experiences I had at Apple, and seeing how you can create something that's emotional, it's part of marketing, and it's part of the product experience overall, even though it seems extraneous."}, {"time": 7700, "text": "I went back and made the design team, and the mechanical team change some curves on the Nest Protect, the smoke and CO detector we did at Nest, after they had already tooled it."}, {"time": 7712, "text": "And I said, they're saying these cost more, I said, it doesn't look right."}, {"time": 7715, "text": "There is a, but they're like, oh, well we had, I said, no, you're gonna go back, and you're gonna make that change, I told you we needed to do it, we had a better looking model, that is gonna get done, I know it's gonna be a terrible cost to you, but we already had this discussion, and that's the way it's gonna have to be, and I'm sorry, but it is what it is."}, {"time": 7736, "text": "And you know, because it's better for the customer, and it looks better in the pictures, and all the other stuff."}, {"time": 7740, "text": "And then we did it, and it was great, and everyone agreed it was great at the end, but it was pain to get there."}, {"time": 7747, "text": "Those are where, those little details are where the magic comes out, right?"}, {"time": 7751, "text": "And if you don't do, if you don't take those pains and put in the love, the customer's gonna feel, it's gonna, they're either gonna feel the pain, or they're gonna feel the love, if you put it in, right?"}, {"time": 7763, "text": "So it depends on how much time and effort you wanna put into something, and what really matters to you, and so how you communicate what you do."}, {"time": 7772, "text": "We're human beings after all, is there something you've learned from sort of the tensions that are natural, or that happen in teams when they're passionate, and they're trying to solve these problems?"}, {"time": 7785, "text": "Is that the way of life?"}, {"time": 7787, "text": "And there's the human drama."}, {"time": 7789, "text": "Is that just, is that always going, is that, it is what it is?"}, {"time": 7794, "text": "Is that make you better?"}, {"time": 7795, "text": "Actually, the drama, the tension between personalities, and all that kind of stuff."}, {"time": 7801, "text": "Look, a rollercoaster ride without ups and downs is no fun."}, {"time": 7805, "text": "It's the journey, it's the journey that brings, it brings out the best in everyone."}, {"time": 7856, "text": "Yet another brilliant idea that you brought to life is Nest, Nest thermostats, and the big umbrella of Nest."}, {"time": 7868, "text": "Again, as part of this Netflix series, season three, what was the most memorable, the most painful, the most insight leading challenge you had to overcome to bring Nest to life?"}, {"time": 7884, "text": "Well, the first thing for me was making someone care about their thermostat."}, {"time": 7897, "text": "No one considers it."}, {"time": 7899, "text": "They never had any customer choice."}, {"time": 7901, "text": "They didn't install it."}, {"time": 7903, "text": "They usually don't even use it, because it's so complicated, or what have you, they just, they bitch at it, they hide it in the corner, and then they just pay the bill, right, of whatever it is, right?"}, {"time": 7914, "text": "It's totally unloved, unconsidered, right?"}, {"time": 7918, "text": "So how do you wake up, like I said, the virus of doubt, how do you wake that up and get people going, remember every day when you go in and it's like, you're just frustrated, and then you get the bill and you pay the bill, so you have to do that."}, {"time": 7928, "text": "So that was one thing."}, {"time": 7930, "text": "I think the other big one was not delivering, all of it was hard, right?"}, {"time": 7934, "text": "It was constrained, we had only so much stuff, we were bootstrapped, we didn't have massive funding, we didn't get hundreds of millions of dollars, but we did it for the right reasons."}, {"time": 7942, "text": "But I think the other big part of it was not just building a disruptive product, because a lot of the people on the team had done that, we knew what we were doing, and that was, if we got the design right, we could deliver it with enough time."}, {"time": 7960, "text": "It was getting the disruptive go to market, in other words, how to take that product from the end of the production line and get it into the customer's hands, because there was no retail or customer choice in thermostats."}, {"time": 7974, "text": "No one even, it was never considered purchase."}, {"time": 7977, "text": "They never thought they had choice."}, {"time": 7980, "text": "Some guy, usually in suspenders and a butt crack, told them, looked around, looked at their house and said, this looks like somebody who's got, is well to do."}, {"time": 7989, "text": "This thermostat is now gonna cost you $350, thank you very much."}, {"time": 7994, "text": "And you're like, I'll take whatever you give me, right?"}, {"time": 7997, "text": "And then it goes into another house, it's worth $100, it was the same damn thing, right?"}, {"time": 8001, "text": "So there was no price transparency, there was no choice, you just got what you were given."}, {"time": 8006, "text": "So how do you go, and this was an entrenched industry, that's why there was no innovation in it, because it was doing just fine because every house needed them."}, {"time": 8017, "text": "All the installers were programmed by the product deliverers, by bonuses to say, you're gonna only carry our product, and if you sell this many, you're gonna get a free trip to Hawaii, right?"}, {"time": 8033, "text": "And for these guys who install, I get a free trip to Hawaii, that's dream for them, right?"}, {"time": 8037, "text": "So this whole channel was fully controlled by the product guys, and it was almost monopolistic in a way."}, {"time": 8044, "text": "So how do you go around that?"}, {"time": 8046, "text": "So creating a disruptive go to market channel, one was direct to consumer, right?"}, {"time": 8053, "text": "And all the marketing that was necessary to get that message across."}, {"time": 8057, "text": "Another one was getting the installation right."}, {"time": 8061, "text": "No one was self installing thermostats."}, {"time": 8064, "text": "So how do we get enough people who are early adopters to be able to self install them confidently?"}, {"time": 8070, "text": "So they didn't still have to call the guy to come and install it, because then he would say, this is a crap product."}, {"time": 8076, "text": "No, I got the most better product, right?"}, {"time": 8078, "text": "So you had to get rid of that friction."}, {"time": 8080, "text": "And then ultimately, how do you get the people who were not just early adopters, but people who needed to see it and touch it before they bought it?"}, {"time": 8087, "text": "How do you get that into retail when the large brands of the time of thermostats and Home Depot and Lowe's had contracts that they couldn't bring in any other brands?"}, {"time": 8098, "text": "They were owning the channel all the way to where there was any sort of slight customer choice."}, {"time": 8104, "text": "And it was really contractor choice more than it was in consumer choice."}, {"time": 8109, "text": "So all of that had to be innovated along with the product."}, {"time": 8113, "text": "And so to me, that was a huge challenge and something I had never done, most of us had never done."}, {"time": 8118, "text": "And we had to create, that was as much as a project as actually delivering the product itself."}, {"time": 8125, "text": "So it turned out to be a giant hit."}, {"time": 8128, "text": "And it was acquired by Google for $3.2 billion."}, {"time": 8133, "text": "$3.2 billion."}, {"time": 8136, "text": "As a founder and leader, just out of curiosity, in these cases of acquisition, is it always a good thing?"}, {"time": 8144, "text": "Is there any part of you and the team that considered saying no?"}, {"time": 8149, "text": "Oh, we considered saying no all the way along the process, right?"}, {"time": 8154, "text": "We'd all been in big companies before."}, {"time": 8158, "text": "We knew what it was like and the politics and all the other stuff and what I came to learn, especially from Phillips, because Phillips was a very, it was 375,000 people."}, {"time": 8168, "text": "It was a big, it was massive company, right?"}, {"time": 8171, "text": "And tons of politics."}, {"time": 8173, "text": "And I was like, do we wanna go back into that world?"}, {"time": 8175, "text": "Because I had so many negative experiences from that."}, {"time": 8179, "text": "But then going to Apple, which was not big, but it was big enough that it could have all these dynamics."}, {"time": 8184, "text": "But then when you saw a leader rise up and get rid of those dynamics or not, allow many of them to flourish, then you're like, oh, with the right leadership, this can be a beautiful marriage, right?"}, {"time": 8197, "text": "And so for four months, we were working together with them, with Google, to make sure that we had the right leadership and we were gonna be in the right environment that it felt right."}, {"time": 8207, "text": "So that happened."}, {"time": 8209, "text": "It absolutely happened."}, {"time": 8210, "text": "We worked on all the details."}, {"time": 8211, "text": "We didn't even talk about price."}, {"time": 8213, "text": "We were talking about how's the brand gonna work?"}, {"time": 8215, "text": "Who's the team gonna work with?"}, {"time": 8216, "text": "How are we gonna get IP?"}, {"time": 8218, "text": "How are we gonna do exchanges?"}, {"time": 8219, "text": "How are we gonna get budgets and all that stuff done?"}, {"time": 8221, "text": "So we worked through all of that before we actually sealed any kind of deal because they were already an investor in the company."}, {"time": 8225, "text": "So we already knew, they knew relatively where the end point was for the price."}, {"time": 8232, "text": "So working through all of those prerequisites, I knew that as a individual product company that was trying to create a platform, no investors were gonna invest in a platform that could take three, four years and many, many hundreds of millions of dollars to build without all kinds of new products at the same time."}, {"time": 8253, "text": "And products that we were having, which were successes, but they weren't even break even yet, right?"}, {"time": 8257, "text": "We were still developing them."}, {"time": 8259, "text": "So how are we gonna get more people to fund all of these things and this platform that I really wanna create?"}, {"time": 8266, "text": "Because my worry, and I had seen this many times in Silicon Valley, is these small startups have bravado and they said, I'm gonna take on the big guys, right?"}, {"time": 8274, "text": "With a platform."}, {"time": 8275, "text": "But when those platform guys show up and Apple says they're gonna get in the, at the time, nobody cared."}, {"time": 8281, "text": "They were curious, what's next?"}, {"time": 8284, "text": "But Apple wasn't in the market, Google wasn't in the market yet, Amazon wasn't there, Microsoft, Samsung, they were all just, that's curious, right?"}, {"time": 8296, "text": "And I had watched, if you said, I'm gonna go challenge them and I'm gonna build a platform, and then they all of a sudden one by one go, oh, well, we're building a platform now, we're building a platform."}, {"time": 8307, "text": "They flooded you to death, fear, uncertainty, doubt, and the developers run away and you can't make that platform."}, {"time": 8312, "text": "So I'm like, before the landscape gets changed on us, because we've tracked so much attention, they announced something, we need to change the landscape on them."}, {"time": 8322, "text": "Let's go to the best place where we can build out the platform, have the right leadership behind us to help us grow this thing into what the vision it should be."}, {"time": 8331, "text": "And that's what we believed we were doing with the Google acquisition."}, {"time": 8335, "text": "Is it possible to take on the platforms?"}, {"time": 8340, "text": "So you said there's a lot of startups with bravado and all that kind of stuff."}, {"time": 8344, "text": "It doesn't mean, James Joyce, when he was 20, he said, I'm gonna be the greatest writer of the 20th century before he wrote anything of value."}, {"time": 8355, "text": "One of them might be actually right."}, {"time": 8357, "text": "Yeah, in this modern world, when you, so first of all, people should definitely get your book built as just this giant number of advice on this exact question of how to build cool things, how to build a startup, how to all the different stages of that team and hiring."}, {"time": 8381, "text": "It's mostly human nature."}, {"time": 8383, "text": "It's not technical."}, {"time": 8384, "text": "It's mostly human nature behind it."}, {"time": 8386, "text": "And it turns out it's, turtles all the way down this human at the bottom."}, {"time": 8391, "text": "Yes, so is it possible to build startups that take on the big guys, whatever that is of the modern era?"}, {"time": 8401, "text": "So for now, it's these platforms of Apple, Google, Twitter, I don't even know, Meta I guess called now."}, {"time": 8409, "text": "Is it possible to take them on?"}, {"time": 8411, "text": "Absolutely, but you don't take them on on their same turf."}, {"time": 8415, "text": "You take them on on the turf they're gonna want to have in the future, right?"}, {"time": 8420, "text": "Spotify is a platform."}, {"time": 8421, "text": "It started as an application, is now a platform, right?"}, {"time": 8426, "text": "Think of WeChat."}, {"time": 8428, "text": "Think of all the super apps out there that are now wallets and delivery services and travel services and transportation services all within an app."}, {"time": 8439, "text": "They've innovated in a different level, in a different space that the platform companies weren't."}, {"time": 8446, "text": "Google was an app company."}, {"time": 8449, "text": "It was solving search."}, {"time": 8451, "text": "And then it became a platform company."}, {"time": 8452, "text": "Apple was solving personal computing."}, {"time": 8455, "text": "And then iPhone was solving internet browsing, all that stuff."}, {"time": 8461, "text": "And then it became a platform company when the app store was at it."}, {"time": 8464, "text": "If you look at it, there's no such thing as building a platform company."}, {"time": 8467, "text": "You build a great app first, and then you can expand it and have the right to become a platform."}, {"time": 8474, "text": "Your whole book is just a bunch of advice for young people."}, {"time": 8480, "text": "And older people."}, {"time": 8480, "text": "And old, well, everyone is young at heart."}, {"time": 8483, "text": "And if you're not, you should be."}, {"time": 8485, "text": "So what, in terms of picking a career, you have advice on this point."}, {"time": 8489, "text": "What advice would you give to a person on how to pick a career?"}, {"time": 8495, "text": "What is it you want to learn?"}, {"time": 8497, "text": "And who is it you want to learn from?"}, {"time": 8499, "text": "Just like you pick a university."}, {"time": 8502, "text": "You're like, I wanna go here for this expertise."}, {"time": 8504, "text": "I've heard about these programs, especially graduate, graduate studies, you go for a certain program with a certain set of people."}, {"time": 8512, "text": "Why don't you do that when it comes to a job?"}, {"time": 8516, "text": "You just don't go, or in a career, you just don't go and say, I just wanna go work at Google, or I just wanna work at Apple."}, {"time": 8522, "text": "You wanna go to a certain team with a certain set of people and work with them on something that you're really curious about and you wanna learn about."}, {"time": 8530, "text": "That's such, I just wanted to comment that, that's such a, it's a subtle but a brilliant framing of just ask the question, what do I want to learn?"}, {"time": 8542, "text": "And then see what career path is going to maximize that."}, {"time": 8551, "text": "It's the first question I ask anyone who interviews with me."}, {"time": 8555, "text": "When I say I'm gonna bring somebody on the team, first question is, what do you wanna learn?"}, {"time": 8559, "text": "I don't want the expert, like we talked about earlier, says, I'm the expert in this."}, {"time": 8563, "text": "You're gonna hire me as the expert."}, {"time": 8566, "text": "We're doing something new."}, {"time": 8567, "text": "You're not an expert, cause we're not an expert either."}, {"time": 8570, "text": "What is it you wanna learn?"}, {"time": 8573, "text": "And on the topic of learning, what is the best way to learn?"}, {"time": 8582, "text": "What, starting, you go into this new place, into this new world, into maybe V1, you said you're building V1."}, {"time": 8592, "text": "I mean, the whole world is late, is full of V1s or V0s waiting for the V1 to come along."}, {"time": 8600, "text": "Zero to one."}, {"time": 8602, "text": "What's the process of that look like?"}, {"time": 8605, "text": "What's the process of learning?"}, {"time": 8609, "text": "Well, let me put a framing and then we'll talk about that last piece."}, {"time": 8614, "text": "I have now looking back, especially writing this book, I have a version one of myself, a version two, a version three, a version four."}, {"time": 8623, "text": "I had a lot of opinions about myself and what I wanted to do."}, {"time": 8627, "text": "Sometimes those opinions for certain people, those opinions are formed and they get the data from their parents and they go do what their parents told them to do or their surroundings."}, {"time": 8637, "text": "My opinions was like, I wanna go and learn this."}, {"time": 8639, "text": "I'm curious about that."}, {"time": 8640, "text": "I made the zero to one move."}, {"time": 8642, "text": "And then over time by doing, I was refining those things and learning what I was really curious about and what I was really good about because I was getting data."}, {"time": 8651, "text": "And then I was like, then I had another set of opinions to create version two of me."}, {"time": 8656, "text": "And then I would go and do it."}, {"time": 8657, "text": "So I was learning by doing, starting with the opinion, you're not gonna get any facts."}, {"time": 8662, "text": "Most people are like, where do I make the most money for my position?"}, {"time": 8667, "text": "They're trying to start with data."}, {"time": 8670, "text": "Start with the why, what's your curiosity?"}, {"time": 8673, "text": "What do you wanna learn?"}, {"time": 8675, "text": "And then follow that."}, {"time": 8677, "text": "I took the lowest job on the totem pole at General Magic because I wanted to get in there to work with the right team."}, {"time": 8684, "text": "I didn't even know what they were doing, right?"}, {"time": 8687, "text": "But I thought that it felt right, right?"}, {"time": 8691, "text": "I was barely living above the poverty line working there, working 80 hours a week because it was so amazing to learn just like a college student, right?"}, {"time": 8699, "text": "That's what I was doing."}, {"time": 8700, "text": "And then I learned more from that and then changed those opinions into data."}, {"time": 8706, "text": "And then I found other opinions."}, {"time": 8707, "text": "So it's the same thing, but it was by doing, right?"}, {"time": 8711, "text": "The way you find out what you wanna do in life is by figuring out what you don't wanna do."}, {"time": 8716, "text": "And the only way you find that out is by doing a bunch of stuff."}, {"time": 8719, "text": "Doing a bunch of stuff and refining it."}, {"time": 8724, "text": "So in terms of the career path of leaping into the startup world and launching a startup, what does it take to successfully found a startup, to have a chance to succeed?"}, {"time": 8737, "text": "And maybe how do you decide to take that leap?"}, {"time": 8746, "text": "Is there sort of having founded, having been part of many V1s, many of some of the most successful V1s ever, what's it take to take that leap?"}, {"time": 8758, "text": "Maybe leave your job, cushy job at a company and do the startup."}, {"time": 8768, "text": "It takes belief in yourself."}, {"time": 8772, "text": "Belief that you can do it."}, {"time": 8773, "text": "Not, but hopefully with mirrors or mentors around you or coaches around you to make sure you know you're not crazy."}, {"time": 8781, "text": "It's a crazy smart idea, but you're not crazy and you're just working on something as like a lone mad man or woman."}, {"time": 8791, "text": "You have a great idea."}, {"time": 8792, "text": "And like I said, great ideas chase you."}, {"time": 8796, "text": "In this world, there are so many people who have more ideas than they have time to implement."}, {"time": 8801, "text": "I used to be like that."}, {"time": 8802, "text": "I would like, oh my God, if this idea, this idea, and you try to do all of them, but the best ideas are the ones that you can really focus on and you shut out all those other things and you bring them other ideas into the thing you're trying to do."}, {"time": 8814, "text": "So I try to run away from a great idea and then it stalks me."}, {"time": 8819, "text": "It hunts you down because you're like, ah, that's gonna have this problem."}, {"time": 8823, "text": "I'm gonna put it aside."}, {"time": 8825, "text": "And then all of a sudden, you know, a few days later, oh, I think I know how to solve that problem."}, {"time": 8830, "text": "Or I talk to somebody and you're just always kind of niggling around the edges of it."}, {"time": 8835, "text": "And then at some point it's like, it just becomes like this black hole that just sucks you in and you're like, I can't think about anything else but this."}, {"time": 8843, "text": "It's almost like a relationship in the world, right?"}, {"time": 8846, "text": "You know, when you have it with a, you find your partner."}, {"time": 8849, "text": "You know, you're like, mm, mm, wait, mm, something."}, {"time": 8853, "text": "And then you're trying to like, and then all of a sudden it just, it comes together, right?"}, {"time": 8856, "text": "It's kind of like that."}, {"time": 8857, "text": "Ultimately achieved focus."}, {"time": 8858, "text": "See, I'm different."}, {"time": 8859, "text": "I just dive right in."}, {"time": 8861, "text": "I used to do that too."}, {"time": 8862, "text": "I used to dive right in."}, {"time": 8864, "text": "But I learned that you'd need time."}, {"time": 8865, "text": "It's more effective to run away from it."}, {"time": 8867, "text": "Run away from it."}, {"time": 8868, "text": "And so it chases you because it makes you think harder about that story."}, {"time": 8872, "text": "This is not dating advice."}, {"time": 8873, "text": "We're talking about stardom."}, {"time": 8874, "text": "Yeah, yeah, yeah, yeah, yeah, yeah."}, {"time": 8877, "text": "But ultimately, so you have achieved a focus on it."}, {"time": 8883, "text": "But you also said to believe in yourself."}, {"time": 8885, "text": "So it's not necessarily even the idea."}, {"time": 8886, "text": "It's the human that believe in the human being."}, {"time": 8891, "text": "You have to believe in yourself and the idea that you have."}, {"time": 8895, "text": "Because if you don't have that belief, then you can't project that to other people to say, join the team."}, {"time": 8904, "text": "Let me ask you on, because you mentioned mentors and you've talked about having had incredible mentors in your life."}, {"time": 8910, "text": "You're also a mentor to a very large number of people."}, {"time": 8914, "text": "What does it take to find a mentor?"}, {"time": 8916, "text": "How do you find a great mentor?"}, {"time": 8920, "text": "Usually they also find you."}, {"time": 8922, "text": "Is it like with the ideas?"}, {"time": 8926, "text": "No, what happens is you're in the right, you have a community around you, okay?"}, {"time": 8931, "text": "And because you've been building a network, because you can't do it alone."}, {"time": 8935, "text": "So you have to create this network around you of relationships, not transactions, but relationships over time that you really cherish and people you talk to, okay?"}, {"time": 8944, "text": "And you share vulnerable or nascent ideas with or crazy opinions with, and then you argue them through."}, {"time": 8953, "text": "But you start to see resonate, and it's not about age."}, {"time": 8958, "text": "It's just about this connection, right?"}, {"time": 8960, "text": "I have mentors."}, {"time": 8961, "text": "Obviously when I was young, all my mentors were older."}, {"time": 8963, "text": "And as I get older, I have mentors who are younger than me or the same age, right?"}, {"time": 8968, "text": "They're not all just older, right?"}, {"time": 8970, "text": "And so it's about that connection."}, {"time": 8972, "text": "It's about being on that same wavelength, but they also, they can counterbalance you."}, {"time": 8979, "text": "They compliment you in some way."}, {"time": 8981, "text": "Like my best mentors had nothing to do with technology."}, {"time": 8983, "text": "They didn't know anything about technology, right?"}, {"time": 8986, "text": "The way we know it."}, {"time": 8987, "text": "They were all about human nature and they could reflect that and help me get more human focused and more empathetic because I was so detailed in the technology."}, {"time": 8996, "text": "I needed to see from other perspectives, but then they wanted to learn more about the technology, right?"}, {"time": 9001, "text": "Or they thought that this idea was so great that it should exist."}, {"time": 9004, "text": "Now let's work together on that."}, {"time": 9006, "text": "So it's really, they have to find you and you have to find them."}, {"time": 9010, "text": "And that's by sharing."}, {"time": 9011, "text": "You just don't go and look it up on the internet and say, who are the best mentors in the world?"}, {"time": 9016, "text": "It just doesn't work that way."}, {"time": 9018, "text": "So form a network of people and see where, I mean, it's like finding relationships, finding love, all that kind of friendship."}, {"time": 9027, "text": "Venture capitalists, money."}, {"time": 9029, "text": "Do VCs help or hurt a business in general?"}, {"time": 9033, "text": "So like in those early stages in the chase of developing a V1, just what's the constructive and destructive power of money in the development of a brilliant idea and the deployment of a brilliant idea?"}, {"time": 9047, "text": "I have seen brilliant venture capitalists."}, {"time": 9050, "text": "I have seen horrible ones."}, {"time": 9053, "text": "Ones that care about their LPs more than they care about the entrepreneurs."}, {"time": 9058, "text": "Of course, everyone's in it, at the end of the day, especially venture capital, they have to give a return to their limited partners, the people who invest in money that they have to shepherd that money and make sure it's watched over properly."}, {"time": 9103, "text": "Because you can get money everywhere."}, {"time": 9104, "text": "Maybe it's a little harder today, over the last month, but you can still find people with money who are on that, who wanna enable your mission and can be mentors, not always, not all of them, but some of them can be mentors, but they're on your side, then it's incredibly powerful because it's not just one plus one equals two, right?"}, {"time": 9126, "text": "It's something bigger than that because then they can bring their networks of people and their networks of companies and other people they worked with that might wanna join your mission, right?"}, {"time": 9137, "text": "That's the kind of venture capitalist and smart money that's out there, right?"}, {"time": 9142, "text": "But you have to build a relationship."}, {"time": 9143, "text": "People go, oh, look at that valuation."}, {"time": 9146, "text": "Oh, it's the brand name of the VC that's investing me."}, {"time": 9149, "text": "No, it boils down to who's that partner and how experienced are they?"}, {"time": 9154, "text": "Don't just give me the brand, give me the person because that's the person I'm gonna be interacting with."}, {"time": 9160, "text": "I have to, there's a million questions I wanna ask you, but we're on season five already."}, {"time": 9166, "text": "But let me ask you, it seems like out of all the brilliant things you write about, it seems like not an important question, but it's a fascinating one to me as lawyers."}, {"time": 9175, "text": "You write about this."}, {"time": 9176, "text": "So does the company need lawyers and why?"}, {"time": 9183, "text": "And what kind?"}, {"time": 9184, "text": "So you write about sort of the value of this game, I guess."}, {"time": 9187, "text": "Right, the legal game."}, {"time": 9189, "text": "It's... Why do we need lawyers?"}, {"time": 9194, "text": "You sound exasperated by lawyers."}, {"time": 9196, "text": "I don't have a good question, I guess."}, {"time": 9199, "text": "Well, because..."}, {"time": 9200, "text": "The why of lawyers is what you're asking."}, {"time": 9201, "text": "The why of lawyers, yes, exactly."}, {"time": 9203, "text": "Okay, the why of lawyers."}, {"time": 9206, "text": "You even do the question."}, {"time": 9209, "text": "We just have to put why in front of everything you ask and then we'll be there."}, {"time": 9213, "text": "Lawyers, why, why?"}, {"time": 9214, "text": "Even mafiosos had lawyers."}, {"time": 9217, "text": "Okay, you know, Tony Soprano, you know, Scarface, all of them had lawyers, right?"}, {"time": 9227, "text": "Because there are things in this world that you don't always consider in the government, in laws, in competitors, because you're so focused on what you're doing, they have to watch out for you, right?"}, {"time": 9243, "text": "Now, the best kind of lawyers are the ones who try to work with you to enable what you're doing and see gray areas."}, {"time": 9251, "text": "Law is not black or white, it's how it's interpreted, right?"}, {"time": 9255, "text": "And so they can help interpret things a certain way or help push on things a certain way to get change to happen or allow change to happen."}, {"time": 9262, "text": "Because if you have lawyers who are always, just like you were talking about PR people, if you have lawyers who are always saying no to everything, because their job is to really say no or maybe, they'll never say yes."}, {"time": 9272, "text": "And you also say their job is to say no and bill you by the hour."}, {"time": 9278, "text": "Depressing."}, {"time": 9281, "text": "If you don't wanna know, don't ask them, because you're gonna get a no, maybe a maybe."}, {"time": 9284, "text": "And you'll get charged for it."}, {"time": 9285, "text": "And you'll get charged for it anyways, right?"}, {"time": 9287, "text": "So to have a partner, to have them on your team, to help you see maybe some of the things you don't see, some consequences, they help to rein that in or change your language."}, {"time": 9300, "text": "Like, are you gonna get sued for this ad?"}, {"time": 9302, "text": "Just change this one word and it helps."}, {"time": 9306, "text": "So you need to have a partner."}, {"time": 9307, "text": "Most of the times, especially engineers or designers, they see lawyers as only stifling."}, {"time": 9313, "text": "Lawyers can actually, if you do it right and you have the right type, they can actually open up a whole new world for you because of the interpretation and how we go about doing things."}, {"time": 9323, "text": "And they help you not get bogged down in the pain of little mistakes that didn't mean anything."}, {"time": 9328, "text": "Exactly, you shot yourself in the foot and you didn't even know it."}, {"time": 9330, "text": "You didn't even know you were carrying the gun."}, {"time": 9333, "text": "Just to jump around, Charles Bukowski once wrote, \"'Find what you love and let it kill you.'\""}, {"time": 9340, "text": "So the question is about work life balance."}, {"time": 9344, "text": "That's like finding an idea and let it chase you."}, {"time": 9346, "text": "Yes, but a little more aggressive."}, {"time": 9350, "text": "So what does work life balance look like that maximizes success and or happiness?"}, {"time": 9359, "text": "Is there such a thing as work life balance?"}, {"time": 9362, "text": "Is, can you speak to this?"}, {"time": 9365, "text": "When your work is your life, and I mean that in the positive sense."}, {"time": 9370, "text": "When you're on a mission that really matters and you know that you can really affect, not just yourself, but other people's lives, and then that is very rewarding, right?"}, {"time": 9381, "text": "That's not work."}, {"time": 9383, "text": "That's, like I said, a mission, right?"}, {"time": 9385, "text": "You adopt that."}, {"time": 9387, "text": "But that said, you still need to have boundaries yourself."}, {"time": 9390, "text": "At General Magic, wonderful documentary, if no one's seen it, you gotta see that."}, {"time": 9395, "text": "I was physically and mentally unhealthy, socially unhealthy as well, because I put every waking minute into this thing, every ounce of me into it."}, {"time": 9405, "text": "And when it was a spectacular disaster, we were making the iPhone 15 years too early, the bottom fell out."}, {"time": 9414, "text": "I had nothing left."}, {"time": 9415, "text": "I had to get healthy socially, emotionally, physically after that, that trauma."}, {"time": 9423, "text": "I let everything go."}, {"time": 9424, "text": "I learned from that that you have to, even though you might put everything into your work, you need to find balance outside of it."}, {"time": 9431, "text": "Now that doesn't mean you're always, you know, it's three days a week working and four days a week or whatever it was."}, {"time": 9439, "text": "You're still working as hard as ever, but what you're doing is you're making sure when your thinking time is during work, that you're not ruminating at three in the morning."}, {"time": 9448, "text": "You use the tools that you have to put those ideas into databases or on pages or somewhere else so you can go back and look at them."}, {"time": 9456, "text": "So you're not always having to remember, because what happens is most people don't write this stuff down."}, {"time": 9460, "text": "So they just sit here and got to remember this, I got to remember this, I got to remember this."}, {"time": 9463, "text": "If you just put it into the tools and you can come back to it, you can come back fresh."}, {"time": 9468, "text": "A lot of the time is about ruminating about what I need to get done and remembering everything instead of doing the work."}, {"time": 9476, "text": "So if you just put it down on paper, you can actually escape it."}, {"time": 9480, "text": "Escape it for a time, to have peace for a time."}, {"time": 9483, "text": "You mentioned General Magic."}, {"time": 9488, "text": "Let me ask you the Russian question."}, {"time": 9491, "text": "The Russian question."}, {"time": 9493, "text": "What's been the darkest moments of your life?"}, {"time": 9500, "text": "Where are some of the darkest places you've got in your mind?"}, {"time": 9502, "text": "You talked about if you're doing these kinds of things with startups, you're gonna have to face a crisis."}, {"time": 9509, "text": "If you're doing it right, you're gonna face it."}, {"time": 9511, "text": "So for you personally, where were some of the tougher moments in your life?"}, {"time": 9517, "text": "Growing up, I went to 12 schools in 15 years."}, {"time": 9523, "text": "I was always the new kid."}, {"time": 9527, "text": "Put yourself in those shoes, right?"}, {"time": 9529, "text": "You picked on, what were you picked on?"}, {"time": 9531, "text": "Well, absolutely, but even more so, I was the geek with the computer."}, {"time": 9535, "text": "Remember the nerds in the 80s?"}, {"time": 9537, "text": "You probably don't know this, but believe me, we were made fun of."}, {"time": 9541, "text": "What were these computers?"}, {"time": 9542, "text": "What were these things?"}, {"time": 9543, "text": "You're off in a cold."}, {"time": 9544, "text": "They're all off partying or going, whatever it was, and I'm sitting there like, and they're like, this guy is just this alien, right?"}, {"time": 9552, "text": "Who's this new guy who just showed up and, and then you would ask the smart questions and you couldn't be the smartest in the, because then you get picked on too."}, {"time": 9562, "text": "And you're the new kid."}, {"time": 9563, "text": "So you're in this environment that's ever changing."}, {"time": 9566, "text": "You don't fit in and you are just asking questions because you think they're the right questions to answer, but then they like, you're making us look bad."}, {"time": 9574, "text": "Don't ask these smart questions because you're gonna make us do more work."}, {"time": 9577, "text": "So right there, it's pretty tough."}, {"time": 9580, "text": "And I'm moving cities, right?"}, {"time": 9581, "text": "And I didn't have the internet to stay connected to people."}, {"time": 9584, "text": "There was no internet."}, {"time": 9585, "text": "Phone calls were $2 a minute."}, {"time": 9587, "text": "So it was lonely too."}, {"time": 9589, "text": "It was lonely, right?"}, {"time": 9592, "text": "I was a latchkey kid, right?"}, {"time": 9594, "text": "I had my brother, but he was a skateboarder and he had a different social way of working."}, {"time": 9600, "text": "He loved to do that stuff and be outside."}, {"time": 9602, "text": "I loved the computer."}, {"time": 9603, "text": "So even in the computer, you were alone in the family."}, {"time": 9606, "text": "With the computer in the family, you were alone."}, {"time": 9609, "text": "I was absolutely alone."}, {"time": 9609, "text": "That was just me."}, {"time": 9610, "text": "But then, then you could find the other geeks, right?"}, {"time": 9615, "text": "But there were just a few of us and we made this little thing."}, {"time": 9618, "text": "But then when you moved away, you know, then I had to use a BBS and a bulletin board system and a dial up modem."}, {"time": 9624, "text": "And then I started hacking the phone system to get free codes on MCI and Sprint back in the day to get long distance, to get free codes to call my friends, the geeks on the other side, right?"}, {"time": 9637, "text": "Or to dial into a BBS cheaply that was in another part of the world."}, {"time": 9641, "text": "So this was this subculture and that was not accepted in any way."}, {"time": 9645, "text": "And not the heroes that you see today that are on the richest people in the world and everything."}, {"time": 9652, "text": "So that was the first set of trauma."}, {"time": 9654, "text": "And then the next one really was general magic."}, {"time": 9656, "text": "You know, the end of that, like I described before."}, {"time": 9659, "text": "And pulling yourself out and going just, cause I got so insular in that world of geeking out and building stuff that I just tore all the social ties, right?"}, {"time": 9671, "text": "Because it was just, it was a drug."}, {"time": 9672, "text": "I was hooked on that."}, {"time": 9673, "text": "I was a junkie."}, {"time": 9675, "text": "I had to get clean."}, {"time": 9677, "text": "Yeah, and that made you who you are."}, {"time": 9683, "text": "Tempered, tempered."}, {"time": 9688, "text": "So Steve Jobs is no longer with us."}, {"time": 9692, "text": "One day you also will no longer be with us."}, {"time": 9696, "text": "That's the thing about this life, it ends."}, {"time": 9701, "text": "So no matter how many incredible things you brought to this world, no matter how many inventions you built, you too shall perish."}, {"time": 9717, "text": "I am not afraid of my death."}, {"time": 9720, "text": "I am an atheist."}, {"time": 9724, "text": "And I think about the soul."}, {"time": 9726, "text": "Because I do, even though I'm an atheist, I think about the soul."}, {"time": 9729, "text": "And the soul is the thing that you instill in others when you go that lives on."}, {"time": 9736, "text": "It's not this thing that's magically in space."}, {"time": 9740, "text": "It's the thing that you've imparted onto people that you worked with and those relationships you've had."}, {"time": 9746, "text": "And that soul lives on in the stories that they tell, right?"}, {"time": 9751, "text": "And through Build, I'm hopeful that those stories stay relevant because they're human nature."}, {"time": 9756, "text": "They're not about who knows what the next iPhone thing is or the next iPod thing is."}, {"time": 9760, "text": "The stuff that I have been able, the privilege to make and work with people, those are all ephemeral."}, {"time": 9768, "text": "The iPod's gone now, right?"}, {"time": 9769, "text": "This week, it was announced iPod's dead after 21 years."}, {"time": 9776, "text": "It is those human connections."}, {"time": 9779, "text": "It's that growth that you've helped someone just like they helped me."}, {"time": 9782, "text": "Just like Bill Campbell or Steve Jobs is gone, but they made me be better."}, {"time": 9786, "text": "That's the soul that I believe in."}, {"time": 9789, "text": "That's fascinating that you say that."}, {"time": 9791, "text": "Yeah, so many of these products, I mean, to push back a little bit, so even though the iPod is an end of an era."}, {"time": 9799, "text": "Using it every day."}, {"time": 9802, "text": "I think that, I mean, the number of people that impacted is just, so I suppose the soul is carried by the people."}, {"time": 9813, "text": "Sometimes the products you create is the sort of the transport mechanism."}, {"time": 9816, "text": "It's the vessel."}]}]