[{"title": "Sebastian Thrun: Flying Cars, Autonomous Vehicles, and Education | Lex Fridman Podcast #59", "id": "ZPPAOakITeQ", "quotes": [{"time": 280, "text": "You've also said that one of the first programs, or the first few programs you've written was a, wait for it, TI57 calculator."}, {"time": 290, "text": "Maybe that's early 80s."}, {"time": 292, "text": "We don't want to date calculators or anything."}, {"time": 294, "text": "That's early 80s, correct."}, {"time": 296, "text": "So if you were to place yourself back into that time, into the mindset you were in, could you have predicted the evolution of computing, AI, the internet technology in the decades that followed?"}, {"time": 310, "text": "I was super fascinated by Silicon Valley, which I'd seen on television once and thought, my god, this is so cool."}, {"time": 316, "text": "They build like DRAMs there and CPUs."}, {"time": 319, "text": "How cool is that?"}, {"time": 320, "text": "And as a college student a few years later, I decided to really study intelligence and study human beings."}, {"time": 326, "text": "And found that even back then in the 80s and 90s, artificial intelligence is what fascinated me the most."}, {"time": 333, "text": "What's missing is that back in the day, the computers are really small."}, {"time": 338, "text": "The brains we could build were not anywhere bigger than a cockroach."}, {"time": 341, "text": "And cockroaches aren't very smart."}, {"time": 343, "text": "So we weren't at the scale yet where we are today."}, {"time": 346, "text": "Did you dream at that time to achieve the kind of scale we have today?"}, {"time": 351, "text": "Or did that seem possible?"}, {"time": 352, "text": "I always wanted to make robots smart."}, {"time": 354, "text": "And I felt it was super cool to build an artificial human."}, {"time": 357, "text": "And the best way to build an artificial human was to build a robot, because that's kind of the closest we could do."}, {"time": 363, "text": "Unfortunately, we aren't there yet."}, {"time": 364, "text": "The robots today are still very brittle."}, {"time": 367, "text": "But it's fascinating to study intelligence from a constructive perspective when you build something."}, {"time": 372, "text": "To understand you build, what do you think it takes to build an intelligent system, an intelligent robot?"}, {"time": 380, "text": "I think the biggest innovation that we've seen is machine learning."}, {"time": 383, "text": "And it's the idea that the computers can basically teach themselves."}, {"time": 388, "text": "Let's give an example."}, {"time": 389, "text": "I'd say everybody pretty much knows how to walk."}, {"time": 393, "text": "And we learn how to walk in the first year or two of our lives."}, {"time": 396, "text": "But no scientist has ever been able to write down the rules of human gait."}, {"time": 402, "text": "We have it in our brains somehow."}, {"time": 403, "text": "We can practice it."}, {"time": 406, "text": "But we can't articulate it."}, {"time": 407, "text": "We can't pass it on by language."}, {"time": 410, "text": "And that, to me, is kind of the deficiency of today's computer programming."}, {"time": 413, "text": "When you program a computer, they're so insanely dumb that you have to give them rules for every contingencies."}, {"time": 419, "text": "Very unlike the way people learn from data and experience, computers are being instructed."}, {"time": 425, "text": "And because it's so hard to get this instruction set right, we pay software engineers $200,000 a year."}, {"time": 431, "text": "Now, the most recent innovation, which has been in the make for 30, 40 years, is an idea that computers can find their own rules."}, {"time": 438, "text": "So they can learn from falling down and getting up the same way children can learn from falling down and getting up."}, {"time": 443, "text": "And that revolution has led to a capability that's completely unmatched."}, {"time": 448, "text": "Today's computers can watch experts do their jobs, whether you're a doctor or a lawyer, pick up the regularities, learn those rules, and then become as good as the best experts."}, {"time": 459, "text": "So the dream of in the 80s of expert systems, for example, had at its core the idea that humans could boil down their expertise on a sheet of paper, so to sort of reduce, sort of be able to explain to machines how to do something explicitly."}, {"time": 475, "text": "So do you think, what's the use of human expertise into this whole picture?"}, {"time": 480, "text": "Do you think most of the intelligence will come from machines learning from experience without human expertise input?"}, {"time": 486, "text": "So the question for me is much more how do you express expertise?"}, {"time": 490, "text": "You can express expertise by writing a book."}, {"time": 492, "text": "You can express expertise by showing someone what you're doing."}, {"time": 496, "text": "You can express expertise by applying it by many different ways."}, {"time": 500, "text": "And I think the expert systems was our best attempt in AI to capture expertise and rules."}, {"time": 505, "text": "But someone sat down and said, here are the rules of human gait."}, {"time": 508, "text": "Here's when you put your big toe forward and your heel backwards and you always stop stumbling."}, {"time": 514, "text": "And as we now know, the set of rules, the set of language that we can command is incredibly limited."}, {"time": 521, "text": "The majority of the human brain doesn't deal with language."}, {"time": 523, "text": "It deals with subconscious, numerical, perceptual things that we don't even self aware of."}, {"time": 531, "text": "Now, when an AI system watches an expert do their job and practice their job, it can pick up things that people can't even put into writing, into books or rules."}, {"time": 543, "text": "And that's where the real power is."}, {"time": 544, "text": "We now have AI systems that, for example, look over the shoulders of highly paid human doctors like dermatologists or radiologists, and they can somehow pick up those skills that no one can express in words."}, {"time": 558, "text": "So you were a key person in launching three revolutions, online education, autonomous vehicles, and flying cars or VTOLs."}, {"time": 568, "text": "So high level, and I apologize for all the philosophical questions."}, {"time": 574, "text": "There's no apology necessary."}, {"time": 577, "text": "How do you choose what problems to try and solve?"}, {"time": 580, "text": "What drives you to make those solutions a reality?"}, {"time": 583, "text": "I have two desires in life."}, {"time": 584, "text": "I want to literally make the lives of others better."}, {"time": 588, "text": "Or as we often say, maybe jokingly, make the world a better place."}, {"time": 592, "text": "I actually believe in this."}, {"time": 594, "text": "It's as funny as it sounds."}, {"time": 597, "text": "And second, I want to learn."}, {"time": 599, "text": "I want to get new skills."}, {"time": 600, "text": "I don't want to be in a job I'm good at, because if I'm in a job that I'm good at, the chances for me to learn something interesting is actually minimized."}, {"time": 606, "text": "So I want to be in a job I'm bad at."}, {"time": 609, "text": "That's really important to me."}, {"time": 610, "text": "So in a bill, for example, what people often call flying cars, these are electrical, vertical, takeoff, and landing vehicles."}, {"time": 617, "text": "I'm just no expert in any of this."}, {"time": 619, "text": "And it's so much fun to learn on the job what it actually means to build something like this."}, {"time": 624, "text": "Now, I'd say the stuff that I've done lately after I finished my professorship at Stanford, they really focused on what has the maximum impact on society."}, {"time": 635, "text": "Transportation is something that has transformed the 21st or 20th century more than any other invention, in my opinion, even more than communication."}, {"time": 642, "text": "And cities are different."}, {"time": 643, "text": "Workers are different."}, {"time": 645, "text": "Women's rights are different because of transportation."}, {"time": 647, "text": "And yet, we still have a very suboptimal transportation solution where we kill 1.2 or so million people every year in traffic."}, {"time": 657, "text": "It's like the leading cause of death for young people in many countries, where we are extremely inefficient resource wise."}, {"time": 663, "text": "Just go to your average neighborhood city and look at the number of parked cars."}, {"time": 668, "text": "That's a travesty, in my opinion."}, {"time": 670, "text": "Or where we spend endless hours in traffic jams."}, {"time": 673, "text": "And very, very simple innovations, like a self driving car or what people call a flying car, could completely change this."}, {"time": 680, "text": "And it's there."}, {"time": 681, "text": "I mean, the technology is basically there."}, {"time": 683, "text": "You have to close your eyes not to see it."}, {"time": 686, "text": "So lingering on autonomous vehicles, a fascinating space, some incredible work you've done throughout your career there."}, {"time": 693, "text": "So let's start with DARPA, I think, the DARPA challenge, through the desert and then urban to the streets."}, {"time": 702, "text": "I think that inspired an entire generation of roboticists and obviously sprung this whole excitement about this particular kind of four wheeled robots we called autonomous cars, self driving cars."}, {"time": 715, "text": "So you led the development of Stanley, the autonomous car that won the race to the desert, the DARPA challenge in 2005."}, {"time": 723, "text": "And Junior, the car that finished second in the DARPA urban challenge, also did incredibly well in 2007, I think."}, {"time": 734, "text": "What are some painful, inspiring, or enlightening experiences from that time that stand out to you?"}, {"time": 740, "text": "Oh my god."}, {"time": 742, "text": "Painful were all these incredibly complicated, stupid bugs that had to be found."}, {"time": 750, "text": "We had a phase where Stanley, our car that eventually won the DARPA grand challenge, would every 30 miles just commit suicide."}, {"time": 759, "text": "And we didn't know why."}, {"time": 760, "text": "And it ended up to be that in the sinking of two computer clocks, occasionally a clock went backwards and that negative time elapsed, screwed up the entire internal logic."}, {"time": 771, "text": "But it took ages to find this."}, {"time": 774, "text": "There were bugs like that."}, {"time": 776, "text": "I'd say enlightening is the Stanford team immediately focused on machine learning and on software, whereas everybody else seemed to focus on building better hardware."}, {"time": 785, "text": "Our analysis had been a human being with an existing rental car can perfectly drive the course but why do I have to build a better rental car?"}, {"time": 792, "text": "I just should replace the human being."}, {"time": 795, "text": "And the human being, to me, was a conjunction of three steps."}, {"time": 798, "text": "We had sensors, eyes and ears, mostly eyes."}, {"time": 802, "text": "We had brains in the middle."}, {"time": 803, "text": "And then we had actuators, our hands and our feet."}, {"time": 806, "text": "Now, the actuators are easy to build."}, {"time": 808, "text": "The sensors are actually also easy to build."}, {"time": 809, "text": "What was missing was the brain."}, {"time": 810, "text": "So we had to build a human brain."}, {"time": 812, "text": "And nothing clearer than to me that the human brain is a learning machine."}, {"time": 817, "text": "So why not just train our robot?"}, {"time": 818, "text": "So we would build massive machine learning into our machine."}, {"time": 822, "text": "And with that, we were able to not just learn from human drivers."}, {"time": 825, "text": "We had the entire speed control of the vehicle was copied from human driving."}, {"time": 829, "text": "But also have the robot learn from experience where it made a mistake and recover from it and learn from it."}, {"time": 835, "text": "You mentioned the pain point of software and clocks."}, {"time": 840, "text": "Synchronization seems to be a problem that continues with robotics."}, {"time": 846, "text": "It's a tricky one with drones and so on."}, {"time": 849, "text": "What does it take to build a thing, a system with so many constraints?"}, {"time": 856, "text": "You have a deadline, no time."}, {"time": 860, "text": "You're unsure about anything really."}, {"time": 862, "text": "It's the first time that people really even exploring."}, {"time": 864, "text": "It's not even sure that anybody can finish when we're talking about the race to the desert the year before nobody finish."}, {"time": 870, "text": "What does it take to scramble and finish a product that actually, a system that actually works?"}, {"time": 875, "text": "We were very lucky."}, {"time": 876, "text": "We were a really small team."}, {"time": 878, "text": "The core of the team were four people."}, {"time": 880, "text": "It was four because five couldn't comfortably sit inside a car, but four could."}, {"time": 885, "text": "And I, as a team leader, my job was to get pizza for everybody and wash the car and stuff like this and repair the radiator when it broke and debug the system."}, {"time": 895, "text": "And we were very open minded."}, {"time": 896, "text": "We had no egos involved."}, {"time": 898, "text": "We just wanted to see how far we can get."}, {"time": 900, "text": "What we did really, really well was time management."}, {"time": 903, "text": "We were done with everything a month before the race."}, {"time": 906, "text": "And we froze the entire software a month before the race."}, {"time": 908, "text": "And it turned out, looking at other teams, every other team complained if they had just one more week, they would have won."}, {"time": 915, "text": "And we decided we're not going to fall into that mistake."}, {"time": 918, "text": "We're going to be early."}, {"time": 919, "text": "And we had an entire month to shake the system."}, {"time": 922, "text": "And we actually found two or three minor bugs in the last month that we had to fix."}, {"time": 927, "text": "And we were completely prepared when the race occurred."}, {"time": 930, "text": "Okay, so first of all, that's such an incredibly rare achievement in terms of being able to be done on time or ahead of time."}, {"time": 939, "text": "What do you, how do you do that in your future work?"}, {"time": 943, "text": "What advice do you have in general?"}, {"time": 944, "text": "Because it seems to be so rare, especially in highly innovative projects like this."}, {"time": 949, "text": "People work till the last second."}, {"time": 950, "text": "Well, the nice thing about the DARPA Grand Challenge is that the problem was incredibly well defined."}, {"time": 955, "text": "We were able for a while to drive the old DARPA Grand Challenge course, which had been used the year before."}, {"time": 960, "text": "And then at some reason we were kicked out of the region."}, {"time": 964, "text": "So we had to go to a different desert, the Snorran Desert, and we were able to drive desert trails just of the same type."}, {"time": 970, "text": "So there was never any debate about like, what is actually the problem?"}, {"time": 973, "text": "We didn't sit down and say, hey, should we build a car or a plane?"}, {"time": 976, "text": "We had to build a car."}, {"time": 978, "text": "That made it very, very easy."}, {"time": 980, "text": "Then I studied my own life and life of others."}, {"time": 983, "text": "And we realized that the typical mistake that people make is that there's this kind of crazy bug left that they haven't found yet."}, {"time": 992, "text": "And it's just, they regret it."}, {"time": 994, "text": "And that bug would have been trivial to fix."}, {"time": 996, "text": "They just haven't fixed it yet."}, {"time": 997, "text": "They didn't want to fall into that trap."}, {"time": 999, "text": "So I built a testing team."}, {"time": 1001, "text": "We had a testing team that built a testing booklet of 160 pages of tests we had to go through just to make sure we shake out the system appropriately."}, {"time": 1009, "text": "And the testing team was with us all the time and dictated to us today, we do railroad crossings."}, {"time": 1015, "text": "Tomorrow we do, we practice the start of the event."}, {"time": 1018, "text": "And in all of these, we thought, oh my God, it's long solved trivial."}, {"time": 1022, "text": "And then we tested it out."}, {"time": 1023, "text": "Oh my God, it doesn't do a railroad crossing."}, {"time": 1025, "text": "Oh my God, it mistakes the rails for metal barriers."}, {"time": 1029, "text": "We have to fix this."}, {"time": 1031, "text": "So it was really a continuous focus on improving the weakest part of the system."}, {"time": 1036, "text": "And as long as you focus on improving the weakest part of the system, you eventually build a really great system."}, {"time": 1043, "text": "Let me just pause on that, to me as an engineer, it's just super exciting that you were thinking like that, especially at that stage as brilliant, that testing was such a core part of it."}, {"time": 1053, "text": "It may be to linger on the point of leadership."}, {"time": 1056, "text": "I think it's one of the first times you were really a leader and you've led many very successful teams since then."}, {"time": 1066, "text": "What does it take to be a good leader?"}, {"time": 1068, "text": "I would say most of all, I just take credit."}, {"time": 1071, "text": "I put the work of others, right?"}, {"time": 1075, "text": "That's very convenient turns out because I can't do all these things myself."}, {"time": 1080, "text": "I'm an engineer at heart."}, {"time": 1081, "text": "So I care about engineering."}, {"time": 1083, "text": "So I don't know what the chicken and the egg is, but as a kid, I loved computers because you could tell them to do something and they actually did it."}, {"time": 1090, "text": "It was very cool."}, {"time": 1091, "text": "And you could like in the middle of the night, wake up at one in the morning and switch on your computer."}, {"time": 1095, "text": "And what he told you to yesterday, it would still do."}, {"time": 1098, "text": "That was really cool."}, {"time": 1099, "text": "Unfortunately, that didn't quite work with people."}, {"time": 1101, "text": "So you go to people and tell them what to do and they don't do it."}, {"time": 1104, "text": "And they hate you for it, or you do it today and then you go a day later and they stop doing it."}, {"time": 1109, "text": "So you have to..."}, {"time": 1110, "text": "So then the question really became, how can you put yourself in the brain of people as opposed to computers?"}, {"time": 1115, "text": "And in terms of computers, it's super dumb."}, {"time": 1117, "text": "That's so dumb."}, {"time": 1118, "text": "If people were as dumb as computers, I wouldn't want to work with them."}, {"time": 1121, "text": "But people are smart and people are emotional and people have pride and people have aspirations."}, {"time": 1125, "text": "So how can I connect to that?"}, {"time": 1129, "text": "And that's the thing that most of our leadership just fails because many, many engineers turn manager believe they can treat their team just the same way it can treat your computer."}, {"time": 1139, "text": "And it just doesn't work this way."}, {"time": 1140, "text": "It's just really bad."}, {"time": 1142, "text": "So how can I connect to people?"}, {"time": 1145, "text": "And it turns out as a college professor, the wonderful thing you do all the time is to empower other people."}, {"time": 1151, "text": "Like your job is to make your students look great."}, {"time": 1154, "text": "That's all you do."}, {"time": 1155, "text": "You're the best coach."}, {"time": 1156, "text": "And it turns out if you do a fantastic job with making your students look great, they actually love you and their parents love you."}, {"time": 1162, "text": "And they give you all the credit for stuff you don't deserve."}, {"time": 1165, "text": "All my students were smarter than me."}, {"time": 1167, "text": "All the great stuff invented at Stanford was their stuff, not my stuff."}, {"time": 1170, "text": "And they give me credit and say, oh, Sebastian."}, {"time": 1172, "text": "We're just making them feel good about themselves."}, {"time": 1175, "text": "So the question really is, can you take a team of people and what does it take to make them to connect to what they actually want in life and turn this into productive action?"}, {"time": 1185, "text": "It turns out every human being that I know has incredibly good intentions."}, {"time": 1190, "text": "I've really rarely met a person with bad intentions."}, {"time": 1194, "text": "I believe every person wants to contribute."}, {"time": 1195, "text": "I think every person I've met wants to help others."}, {"time": 1199, "text": "It's amazing how much of an urge we have not to just help ourselves, but to help others."}, {"time": 1204, "text": "So how can we empower people and give them the right framework that they can accomplish this?"}, {"time": 1210, "text": "In moments when it works, it's magical."}, {"time": 1212, "text": "Because you'd see the confluence of people being able to make the world a better place and deriving enormous confidence and pride out of this."}, {"time": 1222, "text": "And that's when my environment works the best."}, {"time": 1227, "text": "These are moments where I can disappear for a month and come back and things still work."}, {"time": 1231, "text": "It's very hard to accomplish."}, {"time": 1232, "text": "But when it works, it's amazing."}, {"time": 1235, "text": "So I agree with you very much."}, {"time": 1237, "text": "It's not often heard that most people in the world have good intentions."}, {"time": 1243, "text": "At the core, their intentions are good and they're good people."}, {"time": 1247, "text": "That's a beautiful message, it's not often heard."}, {"time": 1250, "text": "We make this mistake, and this is a friend of mine, Alex Werder, talking to us, that we judge ourselves by our intentions and others by their actions."}, {"time": 1260, "text": "And I think that the biggest skill, I mean, here in Silicon Valley, we follow engineers who have very little empathy and are kind of befuddled by why it doesn't work for them."}, {"time": 1269, "text": "The biggest skill, I think, that people should acquire is to put themselves into the position of the other and listen, and listen to what the other has to say."}, {"time": 1280, "text": "And they'd be shocked how similar they are to themselves."}, {"time": 1283, "text": "And they might even be shocked how their own actions don't reflect their intentions."}, {"time": 1288, "text": "I often have conversations with engineers where I say, look, hey, I love you, you're doing a great job."}, {"time": 1293, "text": "And by the way, what you just did has the following effect."}, {"time": 1297, "text": "Are you aware of that?"}, {"time": 1298, "text": "And then people would say, oh my God, not I wasn't, because my intention was that."}, {"time": 1303, "text": "And I say, yeah, I trust your intention."}, {"time": 1305, "text": "You're a good human being."}, {"time": 1306, "text": "But just to help you in the future, if you keep expressing it that way, then people will just hate you."}, {"time": 1313, "text": "And I've had many instances where people say, oh my God, thank you for telling me this, because it wasn't my intention to look like an idiot."}, {"time": 1319, "text": "It wasn't my intention to help other people."}, {"time": 1320, "text": "I just didn't know how to do it."}, {"time": 1322, "text": "Very simple, by the way."}, {"time": 1324, "text": "There's a book, Dale Carnegie, 1936, how to make friends and how to influence others."}, {"time": 1330, "text": "Has the entire Bible, you just read it and you're done and you apply it every day."}, {"time": 1333, "text": "And I wish I was good enough to apply it every day."}, {"time": 1336, "text": "But it's just simple things, right?"}, {"time": 1338, "text": "Like be positive, remember people's name, smile, and eventually have empathy."}, {"time": 1344, "text": "Really think that the person that you hate and you think is an idiot, is actually just like yourself."}, {"time": 1350, "text": "It's a person who's struggling, who means well, and who might need help, and guess what, you need help."}, {"time": 1356, "text": "I've recently spoken with Stephen Schwarzman."}, {"time": 1359, "text": "I'm not sure if you know who that is, but."}, {"time": 1362, "text": "So, and he said."}, {"time": 1364, "text": "It's on my list."}, {"time": 1365, "text": "On the list."}, {"time": 1367, "text": "But he said, sort of to expand on what you're saying, that one of the biggest things you can do is hear people when they tell you what their problem is and then help them with that problem."}, {"time": 1382, "text": "He says, it's surprising how few people actually listen to what troubles others."}, {"time": 1389, "text": "And because it's right there in front of you and you can benefit the world the most."}, {"time": 1395, "text": "And in fact, yourself and everybody around you by just hearing the problems and solving them."}, {"time": 1400, "text": "I mean, that's my little history of engineering."}, {"time": 1403, "text": "That is, while I was engineering with computers, I didn't care at all what the computer's problems were."}, {"time": 1412, "text": "I just told them what to do and to do it."}, {"time": 1414, "text": "And it just doesn't work this way with people."}, {"time": 1417, "text": "It doesn't work with me."}, {"time": 1418, "text": "If you come to me and say, do A, I do the opposite."}, {"time": 1423, "text": "But let's return to the comfortable world of engineering."}, {"time": 1427, "text": "And can you tell me in broad strokes in how you see it?"}, {"time": 1432, "text": "Because you're the core of starting it, the core of driving it, the technical evolution of autonomous vehicles from the first DARPA Grand Challenge to the incredible success we see with the program you started with Google self driving car and Waymo and the entire industry that sprung up of different kinds of approaches, debates and so on."}, {"time": 1451, "text": "Well, the idea of self driving car goes back to the 80s."}, {"time": 1454, "text": "There was a team in Germany and another team at Carnegie Mellon that did some very pioneering work."}, {"time": 1458, "text": "But back in the day, I'd say the computers were so deficient that even the best professors and engineers in the world basically stood no chance."}, {"time": 1468, "text": "It then folded into a phase where the US government spent at least half a billion dollars that I could count on research projects."}, {"time": 1476, "text": "But the way the procurement works, a successful stack of paper describing lots of stuff that no one's ever gonna read was a successful product of a research project."}, {"time": 1487, "text": "So we trained our researchers to produce lots of paper."}, {"time": 1492, "text": "That all changed with the DARPA Grand Challenge."}, {"time": 1494, "text": "And I really gotta credit the ingenious people at DARPA and the US government and Congress that took a complete new funding model where they said, let's not fund effort, let's fund outcomes."}, {"time": 1505, "text": "And it sounds very trivial, but there was no tax code that allowed the use of congressional tax money for a price."}, {"time": 1513, "text": "It was all effort based."}, {"time": 1515, "text": "So if you put in a hundred hours in, you could charge a hundred hours."}, {"time": 1517, "text": "If you put in a thousand hours in, you could build a thousand hours."}, {"time": 1520, "text": "By changing the focus instead of making the price, we don't pay you for development, we pay for the accomplishment."}, {"time": 1526, "text": "They drew in, they automatically drew out all these contractors who are used to the drug of getting money per hour."}, {"time": 1533, "text": "And they drew in a whole bunch of new people."}, {"time": 1535, "text": "And these people are mostly crazy people."}, {"time": 1537, "text": "They were people who had a car and a computer and they wanted to make a million bucks."}, {"time": 1542, "text": "The million bucks was their visual price money, it was then doubled."}, {"time": 1545, "text": "And they felt if I put my computer in my car and program it, I can be rich."}, {"time": 1550, "text": "And that was so awesome."}, {"time": 1552, "text": "Like half the teams, there was a team that was surfer dudes and they had like two surfboards on their vehicle and brought like these fashion girls, super cute girls, like twin sisters."}, {"time": 1563, "text": "And you could tell these guys were not your common beltway bandit who gets all these big multimillion and billion dollar countries from the US government."}, {"time": 1573, "text": "And there was a great reset."}, {"time": 1576, "text": "Universities moved in."}, {"time": 1578, "text": "I was very fortunate at Stanford that I just received tenure so I couldn't get fired no matter what I do, otherwise I wouldn't have done it."}, {"time": 1585, "text": "And I had enough money to finance this thing and I was able to attract a lot of money from third parties."}, {"time": 1591, "text": "And even car companies moved in."}, {"time": 1592, "text": "They kind of moved in very quietly because they were super scared to be embarrassed that their car would flip over."}, {"time": 1598, "text": "But Ford was there and Volkswagen was there and a few others and GM was there."}, {"time": 1603, "text": "So it kind of reset the entire landscape of people."}, {"time": 1606, "text": "And if you look at who's a big name in self driving cars today, these were mostly people who participated in those challenges."}, {"time": 1613, "text": "Okay, that's incredible."}, {"time": 1614, "text": "Can you just comment quickly on your sense of lessons learned from that kind of funding model and the research that's going on in academia in terms of producing papers, is there something to be learned and scaled up bigger, having these kinds of grand challenges that could improve outcomes?"}, {"time": 1634, "text": "So I'm a big believer in focusing on kind of an end to end system."}, {"time": 1639, "text": "I'm a really big believer in systems building."}, {"time": 1641, "text": "I've always built systems in my academic career, even though I do a lot of math and abstract stuff, but it's all derived from the idea of let's solve a real problem."}, {"time": 1649, "text": "And it's very hard for me to be an academic and say, let me solve a component of a problem."}, {"time": 1655, "text": "Like with someone there's fields like nonmonetary logic or AI planning systems where people believe that a certain style of problem solving is the ultimate end objective."}, {"time": 1667, "text": "And I would always turn it around and say, hey, what problem would my grandmother care about that doesn't understand computer technology and doesn't wanna understand?"}, {"time": 1676, "text": "And how could I make her love what I do?"}, {"time": 1678, "text": "Because only then do I have an impact on the world."}, {"time": 1681, "text": "I can easily impress my colleagues."}, {"time": 1682, "text": "That is much easier, but impressing my grandmother is very, very hard."}, {"time": 1687, "text": "So I would always thought if I can build a self driving car and my grandmother can use it even after she loses her driving privileges or children can use it, or we save maybe a million lives a year, that would be very impressive."}, {"time": 1702, "text": "And then there's so many problems like these, like there's a problem with curing cancer, or whatever it is, live twice as long."}, {"time": 1707, "text": "Once a problem is defined, of course I can't solve it in its entirety."}, {"time": 1711, "text": "Like it takes sometimes tens of thousands of people to find a solution."}, {"time": 1715, "text": "There's no way you can fund an army of 10,000 at Stanford."}, {"time": 1719, "text": "So you gotta build a prototype."}, {"time": 1721, "text": "Let's build a meaningful prototype."}, {"time": 1722, "text": "And the DARPA Grand Challenge was beautiful because it told me what this prototype had to do."}, {"time": 1726, "text": "I didn't have to think about what it had to do, I just had to read the rules."}, {"time": 1728, "text": "And that was really beautiful."}, {"time": 1731, "text": "And it's most beautiful, you think what academia could aspire to is to build a prototype that's the systems level, that solves or gives you an inkling that this problem could be solved with this prototype."}, {"time": 1743, "text": "First of all, I wanna emphasize what academia really is."}, {"time": 1746, "text": "And I think people misunderstand it."}, {"time": 1748, "text": "First and foremost, academia is a way to educate young people."}, {"time": 1753, "text": "First and foremost, a professor is an educator."}, {"time": 1755, "text": "No matter where you are at, a small suburban college, or whether you are a Harvard or Stanford professor, that's not the way most people think of themselves in academia because we have this kind of competition going on for citations and publication."}, {"time": 1771, "text": "That's a measurable thing, but that is secondary to the primary purpose of educating people to think."}, {"time": 1777, "text": "Now, in terms of research, most of the great science, the great research comes out of universities."}, {"time": 1785, "text": "You can trace almost everything back, including Google, to universities."}, {"time": 1788, "text": "So there's nothing really fundamentally broken here."}, {"time": 1792, "text": "It's a good system."}, {"time": 1793, "text": "And I think America has the finest university system on the planet."}, {"time": 1797, "text": "We can talk about reach and how to reach people outside the system."}, {"time": 1801, "text": "It's a different topic, but the system itself is a good system."}, {"time": 1804, "text": "If I had one wish, I would say it'd be really great if there was more debate about what the great big problems are in society and focus on those."}, {"time": 1818, "text": "And most of them are interdisciplinary."}, {"time": 1821, "text": "Unfortunately, it's very easy to fall into an interdisciplinary viewpoint where your problem is dictated by what your closest colleagues believe the problem is."}, {"time": 1833, "text": "It's very hard to break out and say, well, there's an entire new field of problems."}, {"time": 1837, "text": "So to give an example, prior to me working on self driving cars, I was a roboticist and a machine learning expert."}, {"time": 1844, "text": "And I wrote books on robotics, something called probabilistic robotics."}, {"time": 1848, "text": "It's a very methods driven kind of viewpoint of the world."}, {"time": 1851, "text": "I built robots that acted in museums as tour guides, that let children around."}, {"time": 1855, "text": "It is something that at the time was moderately challenging."}, {"time": 1860, "text": "When I started working on cars, several colleagues told me, Sebastian, you're destroying your career because in our field of robotics, cars are looked like as a gimmick and they're not expressive enough."}, {"time": 1871, "text": "They can only push the throttle and the brakes."}, {"time": 1875, "text": "There's no dexterity."}, {"time": 1876, "text": "There's no complexity."}, {"time": 1878, "text": "It's just too simple."}, {"time": 1879, "text": "And no one came to me and said, wow, if you solve that problem, you can save a million lives, right?"}, {"time": 1885, "text": "Among all robotic problems that I've seen in my life, I would say the self driving car, transportation, is the one that has the most hope for society."}, {"time": 1892, "text": "So how come the robotics community wasn't all over the place?"}, {"time": 1895, "text": "And it was because we focused on methods and solutions and not on problems."}, {"time": 1899, "text": "Like if you go around today and ask your grandmother, what bugs you?"}, {"time": 1903, "text": "What really makes you upset?"}, {"time": 1905, "text": "I challenge any academic to do this and then realize how far your research is probably away from that today."}, {"time": 1914, "text": "At the very least, that's a good thing for academics to deliberate on."}, {"time": 1919, "text": "The other thing that's really nice in Silicon Valley is, Silicon Valley is full of smart people outside academia."}, {"time": 1924, "text": "So there's the Larry Pages and Mark Zuckerbergs in the world who are anywhere smarter, smarter than the best academics I've met in my life."}, {"time": 1931, "text": "And what they do is they are at a different level."}, {"time": 1935, "text": "They build the systems, they build the customer facing systems, they build things that people can use without technical education."}, {"time": 1943, "text": "And they are inspired by research."}, {"time": 1945, "text": "They're inspired by scientists."}, {"time": 1947, "text": "They hire the best PhDs from the best universities for a reason."}, {"time": 1951, "text": "So I think this kind of vertical integration between the real product, the real impact and the real thought, the real ideas, that's actually working surprisingly well in Silicon Valley."}, {"time": 1962, "text": "It did not work as well in other places in this nation."}, {"time": 1964, "text": "So when I worked at Carnegie Mellon, we had the world's finest computer science university, but there wasn't those people in Pittsburgh that would be able to take these very fine computer science ideas and turn them into massive, impactful products."}, {"time": 1980, "text": "That symbiosis seemed to exist pretty much only in Silicon Valley and maybe a bit in Boston and Austin."}, {"time": 1986, "text": "Yeah, with Stanford, that's really interesting."}, {"time": 1991, "text": "So if we look a little bit further on from the DARPA Grand Challenge and the launch of the Google self driving car, what do you see as the state, the challenges of autonomous vehicles as they are now is actually achieving that huge scale and having a huge impact on society?"}, {"time": 2011, "text": "I'm extremely proud of what has been accomplished."}, {"time": 2015, "text": "And again, I'm taking a lot of credit for the work of others."}, {"time": 2018, "text": "And I'm actually very optimistic."}, {"time": 2020, "text": "And people have been kind of worrying, is it too fast?"}, {"time": 2022, "text": "Is it too slow?"}, {"time": 2023, "text": "Why is it not there yet?"}, {"time": 2023, "text": "And so on."}, {"time": 2025, "text": "It is actually quite an interesting, hard problem."}, {"time": 2028, "text": "And in that a self driving car, to build one that manages 90% of the problems encountered in everyday driving is easy."}, {"time": 2037, "text": "We can literally do this over a weekend."}, {"time": 2039, "text": "To do 99% might take a month."}, {"time": 2042, "text": "Then there's 1% left."}, {"time": 2043, "text": "So 1% would mean that you still have a fatal accident every week, very unacceptable."}, {"time": 2048, "text": "So now you work on this 1% and the 99% of that, the remaining 1% is actually still relatively easy, but now you're down to like a hundredth of 1%."}, {"time": 2058, "text": "And it's still completely unacceptable in terms of safety."}, {"time": 2061, "text": "So the variety of things you encounter are just enormous."}, {"time": 2064, "text": "And that gives me enormous respect for human being that we're able to deal with the couch on the highway, or the deer in the headlights, or the blown tire that we've never been trained for."}, {"time": 2074, "text": "And all of a sudden have to handle it in an emergency situation and often do very, very successfully."}, {"time": 2078, "text": "It's amazing from that perspective, how safe driving actually is given how many millions of miles we drive every year in this country."}, {"time": 2087, "text": "We are now at a point where I believe the technology is there and I've seen it."}, {"time": 2091, "text": "I've seen it in Waymo, I've seen it in Aptiv, I've seen it in Cruise and in a number of companies and in Voyage where vehicles now driving around and basically flawlessly are able to drive people around in limited scenarios."}, {"time": 2106, "text": "In fact, you can go to Vegas today and order a Summon and Lift."}, {"time": 2109, "text": "And if you get the right setting of your app, you'll be picked up by a driverless car."}, {"time": 2115, "text": "Now there's still safety drivers in there, but that's a fantastic way to kind of learn what the limits are of technology today."}, {"time": 2122, "text": "And there's still some glitches, but the glitches have become very, very rare."}, {"time": 2126, "text": "I think the next step is gonna be to down cost it, to harden it, the entrapment, the sensors are not quite an automotive grade standard yet."}, {"time": 2136, "text": "And then to really build the business models, to really kind of go somewhere and make the business case."}, {"time": 2140, "text": "And the business case is hard work."}, {"time": 2142, "text": "It's not just, oh my God, we have this capability, people are just gonna buy it."}, {"time": 2145, "text": "You have to make it affordable."}, {"time": 2146, "text": "You have to find the social acceptance of people."}, {"time": 2152, "text": "None of the teams yet has been able to or gutsy enough to drive around without a person inside the car."}, {"time": 2159, "text": "And that's the next magical hurdle."}, {"time": 2161, "text": "We'll be able to send these vehicles around completely empty in traffic."}, {"time": 2165, "text": "And I think, I mean, I wait every day, wait for the news that Waymo has just done this."}, {"time": 2171, "text": "So, interesting you mentioned gutsy."}, {"time": 2175, "text": "Let me ask some maybe unanswerable question, maybe edgy questions."}, {"time": 2181, "text": "But in terms of how much risk is required, some guts in terms of leadership style, it would be good to contrast approaches."}, {"time": 2192, "text": "And I don't think anyone knows what's right."}, {"time": 2194, "text": "But if we compare Tesla and Waymo, for example, Elon Musk and the Waymo team, there's slight differences in approach."}, {"time": 2205, "text": "So on the Elon side, there's more, I don't know what the right word to use, but aggression in terms of innovation."}, {"time": 2213, "text": "And on Waymo side, there's more sort of cautious, safety focused approach to the problem."}, {"time": 2223, "text": "What do you think it takes?"}, {"time": 2226, "text": "What leadership at which moment is right?"}, {"time": 2229, "text": "Which approach is right?"}, {"time": 2231, "text": "Look, I don't sit in either of those teams."}, {"time": 2233, "text": "So I'm unable to even verify like somebody says correct."}, {"time": 2238, "text": "In the end of the day, every innovator in that space will face a fundamental dilemma."}, {"time": 2243, "text": "And I would say you could put aerospace titans into the same bucket, which is you have to balance public safety with your drive to innovate."}, {"time": 2254, "text": "And this country in particular in the States has a hundred plus year history of doing this very successfully."}, {"time": 2260, "text": "Air travel is what a hundred times a safe per mile than ground travel, than cars."}, {"time": 2266, "text": "And there's a reason for it because people have found ways to be very methodological about ensuring public safety while still being able to make progress on important aspects, for example, like air and noise and fuel consumption."}, {"time": 2283, "text": "So I think that those practices are proven and they actually work."}, {"time": 2287, "text": "We live in a world safer than ever before."}, {"time": 2289, "text": "And yes, there will always be the provision that something goes wrong."}, {"time": 2292, "text": "There's always the possibility that someone makes a mistake or there's an unexpected failure."}, {"time": 2297, "text": "We can never guarantee to a hundred percent absolute safety other than just not doing it."}, {"time": 2303, "text": "But I think I'm very proud of the history of the United States."}, {"time": 2307, "text": "I mean, we've dealt with much more dangerous technology like nuclear energy and kept that safe too."}, {"time": 2313, "text": "We have nuclear weapons and we keep those safe."}, {"time": 2316, "text": "So we have methods and procedures that really balance these two things very, very successfully."}, {"time": 2322, "text": "You've mentioned a lot of great autonomous vehicle companies that are taking sort of the level four, level five, they jump in full autonomy with a safety driver and take that kind of approach and also through simulation and so on."}, {"time": 2335, "text": "There's also the approach that Tesla Autopilot is doing, which is kind of incrementally taking a level two vehicle and using machine learning and learning from the driving of human beings and trying to creep up, trying to incrementally improve the system until it's able to achieve level four autonomy."}, {"time": 2355, "text": "So perfect autonomy in certain kind of geographical regions."}, {"time": 2359, "text": "What are your thoughts on these contrasting approaches?"}, {"time": 2363, "text": "Well, so first of all, I'm a very proud Tesla owner and I literally use the Autopilot every day and it literally has kept me safe."}, {"time": 2370, "text": "It is a beautiful technology specifically for highway driving when I'm slightly tired because then it turns me into a much safer driver."}, {"time": 2382, "text": "And I'm 100% confident that's the case."}, {"time": 2386, "text": "In terms of the right approach, I think the biggest change I've seen since I went to Waymo team is this thing called deep learning."}, {"time": 2394, "text": "I think deep learning was not a hot topic when I started Waymo or Google self driving cars."}, {"time": 2399, "text": "It was there, in fact, we started Google Brain at the same time in Google X."}, {"time": 2402, "text": "So I invested in deep learning, but people didn't talk about it, it wasn't a hot topic."}, {"time": 2407, "text": "And now it is, there's a shift of emphasis from a more geometric perspective where you use geometric sensors that give you a full 3D view when you do a geometric reasoning about, oh, this box over here might be a car towards a more human like, oh, let's just learn about it."}, {"time": 2424, "text": "This looks like the thing I've seen 10,000 times before."}, {"time": 2426, "text": "So maybe it's the same thing, machine learning perspective."}, {"time": 2430, "text": "And that has really put, I think, all these approaches on steroids."}, {"time": 2436, "text": "At Udacity, we teach a course in self driving cars."}, {"time": 2438, "text": "In fact, I think we've graduated over 20,000 or so people on self driving car skills."}, {"time": 2445, "text": "So every self driving car team in the world now uses our engineers."}, {"time": 2449, "text": "And in this course, the very first homework assignment is to do lane finding on images."}, {"time": 2454, "text": "And lane finding images for layman, what this means is you put a camera into your car or you open your eyes and you would know where the lane is."}, {"time": 2462, "text": "So you can stay inside the lane with your car."}, {"time": 2465, "text": "Humans can do this super easily."}, {"time": 2466, "text": "You just look and you know where the lane is, just intuitively."}, {"time": 2470, "text": "For machines, for a long time, it was super hard because people would write these kind of crazy rules."}, {"time": 2474, "text": "If there's like wine lane markers and here's what white really means, this is not quite white enough."}, {"time": 2479, "text": "So let's, oh, it's not white."}, {"time": 2480, "text": "Or maybe the sun is shining."}, {"time": 2481, "text": "So when the sun shines and this is white and this is a straight line, I mean, it's not quite a straight line because the road is curved."}, {"time": 2487, "text": "And do we know that there's really six feet between lane markings or not or 12 feet, whatever it is."}, {"time": 2494, "text": "And now what the students are doing, they would take machine learning."}, {"time": 2497, "text": "So instead of like writing these crazy rules for the lane marker, they'll say, hey, let's take an hour of driving and label it and tell the vehicle, this is actually the lane by hand."}, {"time": 2505, "text": "And then these are examples and have the machine find its own rules, what lane markings are."}, {"time": 2511, "text": "And within 24 hours, now every student that's never done any programming before in this space can write a perfect lane finder as good as the best commercial lane finders."}, {"time": 2520, "text": "And that's completely amazing to me."}, {"time": 2522, "text": "We've seen progress using machine learning that completely dwarfs anything that I saw 10 years ago."}, {"time": 2530, "text": "Yeah, and just as a side note, the self driving car nanodegree, the fact that you launched that many years ago now, maybe four years ago, three years ago is incredible that that's a great example of system level thinking sort of just taking an entire course that teaches you how to solve the entire problem."}, {"time": 2549, "text": "I definitely recommend people."}, {"time": 2551, "text": "It's become super popular and it's become actually incredibly high quality really with Mercedes and various other companies in that space."}, {"time": 2558, "text": "And we find that engineers from Tesla and Waymo are taking it today."}, {"time": 2563, "text": "The insight was that two things, one is existing universities will be very slow to move because they're departmentalized and there's no department for self driving cars."}, {"time": 2572, "text": "So between Mac E and double E and computer science, getting those folks together into one room is really, really hard."}, {"time": 2579, "text": "And every professor listening here will know, they'll probably agree to that."}, {"time": 2582, "text": "And secondly, even if all the great universities just did this, which none so far has developed a curriculum in this field, it is just a few thousand students that can partake because all the great universities are super selective."}, {"time": 2596, "text": "So how about people in India?"}, {"time": 2598, "text": "How about people in China or in the Middle East or Indonesia or Africa?"}, {"time": 2603, "text": "Why should those be excluded from the skill of building self driving cars?"}, {"time": 2607, "text": "Are they any dumber than we are?"}, {"time": 2608, "text": "Are we any less privileged?"}, {"time": 2610, "text": "And the answer is we should just give everybody the skill to build a self driving car."}, {"time": 2615, "text": "Because if we do this, then we have like a thousand self driving car startups."}, {"time": 2620, "text": "And if 10% succeed, that's like a hundred, that means hundred countries now will have self driving cars and be safer."}, {"time": 2626, "text": "It's kind of interesting to imagine impossible to quantify, but the number, the, you know, over a period of several decades, the impact that has like a single course, like a ripple effect of society."}, {"time": 2640, "text": "If you, I just recently talked to Andrew who was creator of Cosmos show."}, {"time": 2646, "text": "It's interesting to think about how many scientists that show launched."}, {"time": 2650, "text": "And so it's really, in terms of impact, I can't imagine a better course than the self driving car course."}, {"time": 2658, "text": "That's, you know, there's other more specific disciplines like deep learning and so on that Udacity is also teaching, but self driving cars, it's really, really interesting course."}, {"time": 2666, "text": "And then it came at the right moment."}, {"time": 2668, "text": "It came at a time when there were a bunch of Acqui hires."}, {"time": 2671, "text": "Acqui hire is a acquisition of a company, not for its technology or its products or business, but for its people."}, {"time": 2678, "text": "So Acqui hire means maybe that a company of 70 people, they have no product yet, but they're super smart people and they pay a certain amount of money."}, {"time": 2684, "text": "So I took Acqui hires like GM Cruise and Uber and others, and did the math and said, hey, how many people are there and how much money was paid?"}, {"time": 2693, "text": "And as a lower bound, I estimated the value of a self driving car engineer in these acquisitions to be at least $10 million, right?"}, {"time": 2702, "text": "So think about this, you get yourself a skill and you team up and build a company and your worth now is $10 million."}, {"time": 2709, "text": "I mean, that's kind of cool."}, {"time": 2710, "text": "I mean, what other thing could you do in life to be worth $10 million within a year?"}, {"time": 2715, "text": "Yeah, amazing."}, {"time": 2717, "text": "But to come back for a moment on to deep learning and its application in autonomous vehicles, what are your thoughts on Elon Musk's statement, provocative statement, perhaps that light air is a crutch."}, {"time": 2731, "text": "So this geometric way of thinking about the world may be holding us back if what we should instead be doing in this robotic space, in this particular space of autonomous vehicles is using camera as a primary sensor and using computer vision and machine learning as the primary way to... Look, I have two comments."}, {"time": 2750, "text": "I think first of all, we all know that people can drive cars without lighters in their heads because we only have eyes and we mostly just use eyes for driving."}, {"time": 2762, "text": "Maybe we use some other perception about our bodies, accelerations, occasionally our ears, certainly not our noses."}, {"time": 2770, "text": "So the existence proof is there, that eyes must be sufficient."}, {"time": 2775, "text": "In fact, we could even drive a car if someone put a camera out and then gave us the camera image with no latency, we would be able to drive a car that way the same way."}, {"time": 2786, "text": "So a camera is also sufficient."}, {"time": 2788, "text": "Secondly, I really love the idea that in the Western world, we have many, many different people trying different hypotheses."}, {"time": 2795, "text": "It's almost like an anthill, like if an anthill tries to forge for food, you can sit there as two ants and agree what the perfect path is and then every single ant marches for the most likely location of food is, or you can even just spread out."}, {"time": 2807, "text": "And I promise you the spread out solution will be better because if the discussing philosophical, intellectual ants get it wrong and they're all moving the wrong direction, they're going to waste a day and then they're going to discuss again for another week."}, {"time": 2820, "text": "Whereas if all these ants go in a random direction, someone's going to succeed and they're going to come back and claim victory and get the Nobel prize or whatever the ant equivalent is."}, {"time": 2828, "text": "And then they all march in the same direction."}, {"time": 2830, "text": "And that's great about society."}, {"time": 2831, "text": "That's great about the Western society."}, {"time": 2833, "text": "We're not plan based, we're not central based."}, {"time": 2835, "text": "We don't have a Soviet Union style central government that tells us where to forge."}, {"time": 2840, "text": "We just forge."}, {"time": 2841, "text": "We started in C Corp. We get investor money, go out and try it out."}, {"time": 2845, "text": "And who knows who's going to win."}, {"time": 2850, "text": "In your, when you look at the longterm vision of autonomous vehicles, do you see machine learning as fundamentally being able to solve most of the problems?"}, {"time": 2859, "text": "So learning from experience."}, {"time": 2862, "text": "I'd say we should be very clear about what machine learning is and is not."}, {"time": 2866, "text": "And I think there's a lot of confusion."}, {"time": 2868, "text": "What it is today is a technology that can go through large databases of repetitive patterns and find those patterns."}, {"time": 2880, "text": "So in example, we did a study at Stanford two years ago where we applied machine learning to detecting skin cancer in images."}, {"time": 2887, "text": "And we harvested or built a data set of 129,000 skin photo shots that were all had been biopsied for what the actual situation was."}, {"time": 2899, "text": "And those included melanomas and carcinomas, also included rashes and other skin conditions, lesions."}, {"time": 2907, "text": "And then we had a network find those patterns."}, {"time": 2910, "text": "And it was by and large able to then detect skin cancer with an iPhone as accurately as the best board certified Stanford level dermatologist."}, {"time": 2921, "text": "We proved that."}, {"time": 2922, "text": "Now this thing was great in this one thing and finding skin cancer, but it couldn't drive a car."}, {"time": 2929, "text": "So the difference to human intelligence is we do all these many, many things and we can often learn from a very small data set of experiences."}, {"time": 2938, "text": "Whereas machines still need very large data sets and things that will be very repetitive."}, {"time": 2943, "text": "Now that's still super impactful because almost everything we do is repetitive."}, {"time": 2946, "text": "So that's gonna really transform human labor but it's not this almighty general intelligence."}, {"time": 2953, "text": "We're really far away from a system that will exhibit general intelligence."}, {"time": 2958, "text": "To that end, I actually commiserate the naming a little bit because artificial intelligence, if you believe Hollywood is immediately mixed into the idea of human suppression and machine superiority."}, {"time": 2970, "text": "I don't think that we're gonna see this in my lifetime."}, {"time": 2972, "text": "I don't think human suppression is a good idea."}, {"time": 2976, "text": "I don't see it coming."}, {"time": 2977, "text": "I don't see the technology being there."}, {"time": 2979, "text": "What I see instead is a very pointed focused pattern recognition technology that's able to extract patterns from large data sets."}, {"time": 2988, "text": "And in doing so, it can be super impactful."}, {"time": 2991, "text": "Super impactful."}, {"time": 2993, "text": "Let's take the impact of artificial intelligence on human work."}, {"time": 2997, "text": "We all know that it takes something like 10,000 hours to become an expert."}, {"time": 3001, "text": "If you're gonna be a doctor or a lawyer or even a really good driver, it takes a certain amount of time to become experts."}, {"time": 3008, "text": "Machines now are able and have been shown to observe people become experts and observe experts and then extract those rules from experts in some interesting way."}, {"time": 3018, "text": "They could go from law to sales to driving cars to diagnosing cancer."}, {"time": 3028, "text": "And then giving that capability to people who are completely new in their job."}, {"time": 3032, "text": "We now can, and that's been done."}, {"time": 3034, "text": "It's been done commercially in many, many instantiations."}, {"time": 3037, "text": "So that means we can use machine learning to make people expert on the very first day of their work."}, {"time": 3044, "text": "Like think about the impact."}, {"time": 3045, "text": "If your doctor is still in their first 10,000 hours, you have a doctor who is not quite an expert yet."}, {"time": 3053, "text": "Who would not want a doctor who is the world's best expert?"}, {"time": 3056, "text": "And now we can leverage machines to really eradicate the error in decision making, error and lack of expertise for human doctors."}, {"time": 3066, "text": "That could save your life."}, {"time": 3068, "text": "If we can link on that for a little bit, in which way do you hope machines in the medical field could help assist doctors?"}, {"time": 3076, "text": "You mentioned this sort of accelerating the learning curve or people, if they start a job or in the first 10,000 hours can be assisted by machines."}, {"time": 3087, "text": "How do you envision that assistance looking?"}, {"time": 3089, "text": "So we built this app for an iPhone that can detect and classify and diagnose skin cancer."}, {"time": 3096, "text": "And we proved two years ago that it does pretty much as good or better than the best human doctors."}, {"time": 3102, "text": "So let me tell you a story."}, {"time": 3103, "text": "So there's a friend of mine, let's call him Ben."}, {"time": 3105, "text": "Ben is a very famous venture capitalist."}, {"time": 3107, "text": "He goes to his doctor and the doctor looks at a mole and says, hey, that mole is probably harmless."}, {"time": 3115, "text": "And for some very funny reason, he pulls out that phone with our app."}, {"time": 3120, "text": "He's a collaborator in our study."}, {"time": 3122, "text": "And the app says, no, no, no, no, this is a melanoma."}, {"time": 3126, "text": "And for background, melanomas are, and skin cancer is the most common cancer in this country."}, {"time": 3132, "text": "Melanomas can go from stage zero to stage four within less than a year."}, {"time": 3138, "text": "Stage zero means you can basically cut it out yourself with a kitchen knife and be safe."}, {"time": 3143, "text": "And stage four means your chances of living five more years in less than 20%."}, {"time": 3148, "text": "So it's a very serious, serious, serious condition."}, {"time": 3151, "text": "So this doctor who took out the iPhone, looked at the iPhone and was a little bit puzzled."}, {"time": 3157, "text": "He said, I mean, but just to be safe, let's cut it out and biopsy it."}, {"time": 3161, "text": "That's the technical term for let's get an in depth diagnostics that is more than just looking at it."}, {"time": 3167, "text": "And it came back as cancerous, as a melanoma."}, {"time": 3170, "text": "And it was then removed."}, {"time": 3172, "text": "And my friend, Ben, I was hiking with him and we were talking about AI."}, {"time": 3176, "text": "And I told him I do this work on skin cancer."}, {"time": 3178, "text": "And he said, oh, funny."}, {"time": 3180, "text": "My doctor just had an iPhone that found my cancer."}, {"time": 3185, "text": "So I was like completely intrigued."}, {"time": 3186, "text": "I didn't even know about this."}, {"time": 3188, "text": "So here's a person, I mean, this is a real human life, right?"}, {"time": 3191, "text": "Like who doesn't know somebody who has been affected by cancer."}, {"time": 3194, "text": "Cancer is cause of death number two."}, {"time": 3196, "text": "Cancer is this kind of disease that is mean in the following way."}, {"time": 3201, "text": "Most cancers can actually be cured relatively easily if we catch them early."}, {"time": 3205, "text": "And the reason why we don't tend to catch them early is because they have no symptoms."}, {"time": 3210, "text": "Like your very first symptom of a gallbladder cancer or a pancreas cancer might be a headache."}, {"time": 3217, "text": "And when you finally go to your doctor because of these headaches or your back pain and you're being imaged, it's usually stage four plus."}, {"time": 3225, "text": "And that's the time when the occurring chances might be dropped to a single digit percentage."}, {"time": 3230, "text": "So if we could leverage AI to inspect your body on a regular basis without even a doctor in the room, maybe when you take a shower or what have you, I know this sounds creepy, but then we might be able to save millions and millions of lives."}, {"time": 3246, "text": "You've mentioned there's a concern that people have about near term impacts of AI in terms of job loss."}, {"time": 3252, "text": "So you've mentioned being able to assist doctors, being able to assist people in their jobs."}, {"time": 3257, "text": "Do you have a worry of people losing their jobs or the economy being affected by the improvements in AI?"}, {"time": 3265, "text": "Yeah, anybody concerned about job losses, please come to Gdacity.com."}, {"time": 3270, "text": "We teach contemporary tech skills and we have a kind of implicit job promise."}, {"time": 3276, "text": "We often, when we measure, we spend way over 50% of our graders in new jobs and they're very satisfied about it."}, {"time": 3283, "text": "And it costs almost nothing, costs like 1,500 max or something like that."}, {"time": 3287, "text": "And so there's a cool new program that you agree with the U.S. government, guaranteeing that you will help us give scholarships that educate people in this kind of situation."}, {"time": 3297, "text": "Yeah, we're working with the U.S. government on the idea of basically rebuilding the American dream."}, {"time": 3303, "text": "So Gdacity has just dedicated 100,000 scholarships for citizens of America for various levels of courses that eventually will get you a job."}, {"time": 3315, "text": "And those courses are all somewhat related to the tech sector because the tech sector is kind of the hottest sector right now."}, {"time": 3322, "text": "And they range from interlevel digital marketing to very advanced self diving car engineering."}, {"time": 3328, "text": "And we're doing this with the White House because we think it's bipartisan."}, {"time": 3330, "text": "It's an issue that if you wanna really make America great, being able to be a part of the solution and live the American dream requires us to be proactive about our education and our skillset."}, {"time": 3345, "text": "It's just the way it is today."}, {"time": 3347, "text": "And it's always been this way."}, {"time": 3348, "text": "And we always had this American dream to send our kids to college."}, {"time": 3351, "text": "And now the American dream has to be to send ourselves to college."}, {"time": 3354, "text": "We can do this very, very, very efficiently and very, very, we can squeeze in in the evenings and things to online."}, {"time": 3361, "text": "So at all ages."}, {"time": 3363, "text": "All ages."}, {"time": 3363, "text": "So our learners go from age 11 to age 80."}, {"time": 3368, "text": "I just traveled Germany and the guy in the train compartment next to me was one of my students."}, {"time": 3377, "text": "It's like, wow, that's amazing."}, {"time": 3379, "text": "Think about impact."}, {"time": 3381, "text": "We've become the educator of choice for now, I believe officially six countries or five countries."}, {"time": 3386, "text": "Most in the Middle East, like Saudi Arabia and in Egypt."}, {"time": 3390, "text": "In Egypt, we just had a cohort graduate where we had 1100 high school students that went through programming skills, proficient at the level of a computer science undergrad."}, {"time": 3402, "text": "And we had a 95% graduation rate, even though everything's online, it's kind of tough, but we kind of trying to figure out how to make this effective."}, {"time": 3410, "text": "The vision is very, very simple."}, {"time": 3412, "text": "The vision is education ought to be a basic human right."}, {"time": 3418, "text": "It cannot be locked up behind ivory tower walls only for the rich people, for the parents who might be bribe themselves into the system."}, {"time": 3426, "text": "And only for young people and only for people from the right demographics and the right geography and possibly even the right race."}, {"time": 3434, "text": "It has to be opened up to everybody."}, {"time": 3435, "text": "If we are truthful to the human mission, if we are truthful to our values, we're gonna open up education to everybody in the world."}, {"time": 3443, "text": "So Udacity's pledge of 100,000 scholarships, I think is the biggest pledge of scholarships ever in terms of numbers."}, {"time": 3450, "text": "And we're working, as I said, with the White House and with very accomplished CEOs like Tim Cook from Apple and others to really bring education to everywhere in the world."}, {"time": 3460, "text": "Not to ask you to pick the favorite of your children, but at this point."}, {"time": 3465, "text": "Oh, that's Jasper."}, {"time": 3466, "text": "I only have one that I know of."}, {"time": 3472, "text": "In this particular moment, what nano degree, what set of courses are you most excited about at Udacity or is that too impossible to pick?"}, {"time": 3482, "text": "I've been super excited about something we haven't launched yet in the building, which is when we talk to our partner companies, we have now a very strong footing in the enterprise world."}, {"time": 3492, "text": "And also to our students, we've kind of always focused on these hard skills, like the programming skills or math skills or building skills or design skills."}, {"time": 3502, "text": "And a very common ask is soft skills."}, {"time": 3505, "text": "Like how do you behave in your work?"}, {"time": 3506, "text": "How do you develop empathy?"}, {"time": 3508, "text": "How do you work on a team?"}, {"time": 3510, "text": "What are the very basics of management?"}, {"time": 3512, "text": "How do you do time management?"}, {"time": 3513, "text": "How do you advance your career in the context of a broader community?"}, {"time": 3519, "text": "And that's something that we haven't done very well at Udacity and I would say most universities are doing very poorly as well because we are so obsessed with individual test scores and pays a little attention to teamwork in education."}, {"time": 3532, "text": "So that's something I see us moving into as a company because I'm excited about this."}, {"time": 3536, "text": "And I think, look, we can teach people tech skills and they're gonna be great."}, {"time": 3540, "text": "But if you teach people empathy, that's gonna have the same impact."}, {"time": 3544, "text": "Maybe harder than self driving cars, but."}, {"time": 3548, "text": "I think the rules are really simple."}, {"time": 3551, "text": "You just have to, you have to want to engage."}, {"time": 3554, "text": "It's, we literally went in school and in K through 12, we teach kids like get the highest math score."}, {"time": 3560, "text": "And if you are a rational human being, you might evolve from this education say, having the best math score and the best English scores make me the best leader."}, {"time": 3569, "text": "And it turns out not to be that case."}, {"time": 3571, "text": "It's actually really wrong because making the, first of all, in terms of math scores, I think it's perfectly fine to hire somebody with great math skills."}, {"time": 3578, "text": "You don't have to do it yourself."}, {"time": 3580, "text": "You can hire someone with good empathy for you."}, {"time": 3582, "text": "That's much harder, but you can always hire someone with great math skills."}, {"time": 3586, "text": "But we live in an affluent world where we constantly deal with other people."}, {"time": 3591, "text": "And that's a beauty."}, {"time": 3591, "text": "It's not a nuisance."}, {"time": 3592, "text": "It's a beauty."}, {"time": 3593, "text": "So if we somehow develop that muscle that we can do that well and empower others in the workplace, I think we're gonna be super successful."}, {"time": 3602, "text": "And I know many fellow robot assistant computer scientists that I will insist to take this course."}, {"time": 3609, "text": "Not to be named here."}, {"time": 3612, "text": "Not to be named."}, {"time": 3613, "text": "Many, many years ago, 1903, the Wright brothers flew in Kitty Hawk for the first time."}, {"time": 3622, "text": "And you've launched a company of the same name, Kitty Hawk, with the dream of building flying cars, eVTOLs."}, {"time": 3632, "text": "So at the big picture, what are the big challenges of making this thing that actually have inspired generations of people about what the future looks like?"}, {"time": 3641, "text": "What does it take?"}, {"time": 3642, "text": "What are the biggest challenges?"}, {"time": 3643, "text": "So flying cars has always been a dream."}, {"time": 3647, "text": "Every boy, every girl wants to fly."}, {"time": 3649, "text": "Let's be honest."}, {"time": 3651, "text": "And let's go back in our history of your dreaming of flying."}, {"time": 3653, "text": "I think honestly, my single most remembered childhood dream has been a dream where I was sitting on a pillow and I could fly."}, {"time": 3660, "text": "I was like five years old."}, {"time": 3662, "text": "I remember like maybe three dreams of my childhood, but that's the one I remember most vividly."}, {"time": 3667, "text": "And then Peter Thiel famously said, they promised us flying cars and they gave us 140 characters pointing as Twitter at the time, limited message size to 140 characters."}, {"time": 3678, "text": "So if you're coming back now to really go for these super impactful stuff like flying cars and to be precise, they're not really cars."}, {"time": 3685, "text": "They don't have wheels."}, {"time": 3687, "text": "They're actually much closer to a helicopter than anything else."}, {"time": 3689, "text": "They take off vertically and they fly horizontally, but they have important differences."}, {"time": 3694, "text": "One difference is that they are much quieter."}, {"time": 3697, "text": "We just released a vehicle called Project Heaviside that can fly over you as low as a helicopter and you basically can't hear."}, {"time": 3705, "text": "It's like 38 decibels."}, {"time": 3706, "text": "It's like, if you were inside the library, you might be able to hear it, but anywhere outdoors, your ambient noise is higher."}, {"time": 3713, "text": "Secondly, they're much more affordable."}, {"time": 3717, "text": "They're much more affordable than helicopters."}, {"time": 3718, "text": "And the reason is helicopters are expensive for many reasons."}, {"time": 3724, "text": "There's lots of single point of figures in a helicopter."}, {"time": 3726, "text": "There's a bolt between the blades that's caused Jesus bolt."}, {"time": 3730, "text": "And the reason why it's called Jesus bolt is that if this bolt breaks, you will die."}, {"time": 3736, "text": "There is no second solution in helicopter flight."}, {"time": 3739, "text": "Whereas we have these distributed mechanism."}, {"time": 3741, "text": "When you go from gasoline to electric, you can now have many, many, many small motors as opposed to one big motor."}, {"time": 3747, "text": "And that means if you lose one of those motors, not a big deal."}, {"time": 3749, "text": "Heaviside, if it loses a motor, has eight of those."}, {"time": 3752, "text": "If it loses one of those eight motors, so it's seven left, it can take off just like before and land just like before."}, {"time": 3760, "text": "We are now also moving into a technology that doesn't require a commercial pilot because in some level, flight is actually easier than ground transportation like in self driving cars."}, {"time": 3771, "text": "The world is full of like children and bicycles and other cars and mailboxes and curbs and shrubs and what have you."}, {"time": 3778, "text": "All these things you have to avoid."}, {"time": 3780, "text": "When you go above the buildings and tree lines, there's nothing there."}, {"time": 3784, "text": "I mean, you can do the test right now, look outside and count the number of things you see flying."}, {"time": 3789, "text": "I'd be shocked if you could see more than two things."}, {"time": 3791, "text": "It's probably just zero."}, {"time": 3793, "text": "In the Bay Area, the most I've ever seen was six."}, {"time": 3796, "text": "And maybe it's 15 or 20, but not 10,000."}, {"time": 3800, "text": "So the sky is very ample and very empty and very free."}, {"time": 3804, "text": "So the vision is, can we build a socially acceptable mass transit solution for daily transportation that is affordable?"}, {"time": 3814, "text": "And we have an existence proof."}, {"time": 3816, "text": "Heaviside can fly 100 miles in range with still 30% electric reserves."}, {"time": 3823, "text": "It can fly up to like 180 miles an hour."}, {"time": 3826, "text": "We know that that solution at scale would make your ground transportation 10 times as fast as a car based on use census or statistics data, which means you would take your 300 hours of daily, of yearly commute down to 30 hours and give you 270 hours back."}, {"time": 3845, "text": "Who wouldn't want, I mean, who doesn't hate traffic?"}, {"time": 3847, "text": "Like I hate, give me the person that doesn't hate traffic."}, {"time": 3850, "text": "I hate traffic."}, {"time": 3851, "text": "Every time I'm in traffic, I hate it."}, {"time": 3853, "text": "And if we could free the world from traffic, we have technology."}, {"time": 3858, "text": "We can free the world from traffic."}, {"time": 3860, "text": "We have the technology."}, {"time": 3862, "text": "We have an existence proof."}, {"time": 3863, "text": "It's not a technological problem anymore."}, {"time": 3865, "text": "Do you think there is a future where tens of thousands, maybe hundreds of thousands of both delivery drones and flying cars of this kind, EV talls fill the sky?"}, {"time": 3879, "text": "I absolutely believe this."}, {"time": 3880, "text": "And there's obviously the societal acceptance is a major question."}, {"time": 3885, "text": "And of course, safety is."}, {"time": 3886, "text": "I believe in safety, we're gonna exceed ground transportation safety as has happened for aviation already, commercial aviation."}, {"time": 3894, "text": "And in terms of acceptance, I think one of the key things is noise."}, {"time": 3898, "text": "That's why we are focusing relentlessly on noise and we build perhaps the quietest electric vehicle ever built."}, {"time": 3907, "text": "The nice thing about the sky is it's three dimensional."}, {"time": 3909, "text": "So any mathematician will immediately recognize the difference between 1D of like a regular highway to 3D of a sky."}, {"time": 3917, "text": "But to make it clear for the layman, say you wanna make 100 vertical lanes of highway 101 in San Francisco, because you believe building 100 vertical lanes is the right solution."}, {"time": 3928, "text": "Imagine how much it would cost to stack 100 vertical lanes physically onto 101."}, {"time": 3933, "text": "That would be prohibitive."}, {"time": 3934, "text": "That would be consuming the world's GDP for an entire year just for one highway."}, {"time": 3939, "text": "It's amazingly expensive."}, {"time": 3941, "text": "In the sky, it would just be a recompilation of a piece of software because all these lanes are virtual."}, {"time": 3946, "text": "That means any vehicle that is in conflict with another vehicle would just go to different altitudes and then the conflict is gone."}, {"time": 3953, "text": "And if you don't believe this, that's exactly how commercial aviation works."}, {"time": 3958, "text": "When you fly from New York to San Francisco, another plane flies from San Francisco to New York, they are different altitudes."}, {"time": 3965, "text": "So they don't hit each other."}, {"time": 3966, "text": "It's a solved problem for the jet space and it will be a solved problem for the urban space."}, {"time": 3972, "text": "There's companies like Google Wing and Amazon working on very innovative solutions."}, {"time": 3977, "text": "How do we have space management?"}, {"time": 3978, "text": "They use exactly the same principles as we use today to route today's jets."}, {"time": 3983, "text": "There's nothing hard about this."}, {"time": 3985, "text": "Do you envision autonomy being a key part of it so that the flying vehicles are either semi autonomous semi autonomous or fully autonomous?"}, {"time": 3996, "text": "100% autonomous."}, {"time": 3997, "text": "You don't want idiots like me flying in the sky, I promise you."}, {"time": 4001, "text": "And if you have 10,000, watch the movie, The Fifth Element to get a feel for what will happen if it's not autonomous."}, {"time": 4009, "text": "And a centralized, that's a really interesting idea of a centralized sort of management system for lanes and so on."}, {"time": 4016, "text": "So actually just being able to have similar as we have in the current commercial aviation, but scale it up to much, much more vehicles."}, {"time": 4025, "text": "That's a really interesting optimization problem."}, {"time": 4027, "text": "It is very mathematically, very, very straightforward."}, {"time": 4031, "text": "Like the gap we leave between jets is gargantuous."}, {"time": 4033, "text": "And part of the reason is there isn't that many jets."}, {"time": 4036, "text": "So it just feels like a good solution."}, {"time": 4038, "text": "Today, when you get vectored by air traffic control, someone talks to you, right?"}, {"time": 4043, "text": "So any ATC controller might have up to maybe 20 planes on the same frequency."}, {"time": 4048, "text": "And then they talk to you, you have to talk back."}, {"time": 4050, "text": "And it feels right because there isn't more than 20 planes around anyhow, so you can talk to everybody."}, {"time": 4054, "text": "But if there's 20,000 things around, you can't talk to everybody anymore."}, {"time": 4057, "text": "So we have to do something that's called digital, like text messaging."}, {"time": 4061, "text": "Like we do have solutions."}, {"time": 4063, "text": "Like we have what, four or five billion smartphones in the world now, right?"}, {"time": 4066, "text": "And they're all connected."}, {"time": 4067, "text": "And somehow we solve the scale problem for smartphones."}, {"time": 4070, "text": "We know where they all are."}, {"time": 4071, "text": "They can talk to somebody and they're very reliable."}, {"time": 4074, "text": "They're amazingly reliable."}, {"time": 4076, "text": "We could use the same system, the same scale for air traffic control."}, {"time": 4081, "text": "So instead of me as a pilot talking to a human being and in the middle of the conversation receiving a new frequency, like how ancient is that?"}, {"time": 4089, "text": "We could digitize this stuff and digitally transmit the right flight coordinates."}, {"time": 4095, "text": "And that solution will automatically scale to 10,000 vehicles."}, {"time": 4100, "text": "We talked about empathy a little bit."}, {"time": 4102, "text": "Do you think we will one day build an AI system that a human being can love and that loves that human back, like in the movie, Her?"}, {"time": 4111, "text": "Look, I'm a pragmatist."}, {"time": 4113, "text": "For me, AI is a tool."}, {"time": 4115, "text": "It's like a shovel."}, {"time": 4116, "text": "And the ethics of using the shovel are always with us, the people."}, {"time": 4121, "text": "And it has to be this way."}, {"time": 4124, "text": "In terms of emotions, I would hate to come into my kitchen and see that my refrigerator spoiled all my food, then have it explained to me that it fell in love with the dishwasher and it wasn't as nice as the dishwasher."}, {"time": 4139, "text": "So as a result, it neglected me."}, {"time": 4142, "text": "That would just be a bad experience and it would be a bad product."}, {"time": 4147, "text": "I would probably not recommend this refrigerator to my friends."}, {"time": 4151, "text": "And that's where I draw the line."}, {"time": 4152, "text": "I think to me, technology has to be reliable and has to be predictable."}, {"time": 4157, "text": "I want my car to work."}, {"time": 4159, "text": "I don't want to fall in love with my car."}, {"time": 4162, "text": "I just want it to work."}, {"time": 4164, "text": "I want it to compliment me, not to replace me."}, {"time": 4167, "text": "I have very unique human properties and I want the machines to make me, turn me into a superhuman."}, {"time": 4175, "text": "Like I'm already a superhuman today, thanks to the machines that surround me."}, {"time": 4179, "text": "And I give you examples."}, {"time": 4180, "text": "I can run across the Atlantic at near the speed of sound at 36,000 feet today."}, {"time": 4188, "text": "That's kind of amazing."}, {"time": 4189, "text": "I can, my voice now carries me all the way to Australia using a smartphone today."}, {"time": 4196, "text": "And it's not the speed of sound, which would take hours."}, {"time": 4200, "text": "It's the speed of light."}, {"time": 4201, "text": "My voice travels at the speed of light."}, {"time": 4204, "text": "That makes me superhuman."}, {"time": 4206, "text": "I would even argue my flushing toilet makes me superhuman."}, {"time": 4210, "text": "Just think of the time before flushing toilets."}, {"time": 4213, "text": "And maybe you have a very old person in your family that you can ask about this or take a trip to rural India to experience it."}, {"time": 4223, "text": "It makes me superhuman."}, {"time": 4225, "text": "So to me, what technology does, it compliments me."}, {"time": 4228, "text": "It makes me stronger."}, {"time": 4230, "text": "Therefore, words like love and compassion have very little interest in this for machines."}, {"time": 4238, "text": "I have interest in people."}, {"time": 4240, "text": "You don't think, first of all, beautifully put, beautifully argued, but do you think love has use in our tools?"}, {"time": 4249, "text": "Compassion."}, {"time": 4250, "text": "I think love is a beautiful human concept."}, {"time": 4253, "text": "And if you think of what love really is, love is a means to convey safety, to convey trust."}, {"time": 4263, "text": "I think trust has a huge need in technology as well, not just people."}, {"time": 4269, "text": "We want to trust our technology the same way, in a similar way we trust people."}, {"time": 4275, "text": "In human interaction, standards have emerged and feelings, emotions have emerged, maybe genetically, maybe biologically, that are able to convey sense of trust, sense of safety, sense of passion, of love, of dedication that makes the human fabric."}, {"time": 4290, "text": "And I'm a big slacker for love."}, {"time": 4293, "text": "I want to be loved."}, {"time": 4294, "text": "I want to be trusted."}, {"time": 4295, "text": "I want to be admired."}, {"time": 4296, "text": "All these wonderful things."}, {"time": 4298, "text": "And because all of us, we have this beautiful system, I wouldn't just blindly copy this to the machines."}, {"time": 4306, "text": "When you look at, say, transportation, you could have observed that up to the end of the 19th century, almost all transportation used any number of legs, from one leg to two legs to a thousand legs."}, {"time": 4321, "text": "And you could have concluded that is the right way to move about the environment."}, {"time": 4326, "text": "We've been made the exception of birds who use flapping wings."}, {"time": 4328, "text": "In fact, there are many people in aviation that flap wings to their arms and jump from cliffs."}, {"time": 4333, "text": "Most of them didn't survive."}, {"time": 4336, "text": "Then the interesting thing is that the technology solutions are very different."}, {"time": 4341, "text": "Like in technology, it's really easy to build a wheel."}, {"time": 4343, "text": "In biology, it's super hard to build a wheel."}, {"time": 4345, "text": "There's very few perpetually rotating things in biology and they usually run cells and things."}, {"time": 4354, "text": "In engineering, we can build wheels."}, {"time": 4357, "text": "And those wheels gave rise to cars."}, {"time": 4361, "text": "Similar wheels gave rise to aviation."}, {"time": 4364, "text": "Like there's no thing that flies that wouldn't have something that rotates, like a jet engine or helicopter blades."}, {"time": 4372, "text": "So the solutions have used very different physical laws than nature, and that's great."}, {"time": 4378, "text": "So for me to be too much focused on, oh, this is how nature does it, let's just replicate it."}, {"time": 4383, "text": "If you really believed that the solution to the agricultural evolution was a humanoid robot, you would still be waiting today."}, {"time": 4390, "text": "Again, beautifully put."}, {"time": 4392, "text": "You said that you don't take yourself too seriously."}, {"time": 4395, "text": "Did I say that?"}, {"time": 4398, "text": "You want me to say that?"}, {"time": 4400, "text": "You're not taking me seriously."}, {"time": 4400, "text": "I'm not, that's right."}, {"time": 4402, "text": "Good, you're right, I don't wanna."}, {"time": 4404, "text": "I just made that up."}, {"time": 4405, "text": "But you have a humor and a lightness about life that I think is beautiful and inspiring to a lot of people."}, {"time": 4413, "text": "Where does that come from?"}, {"time": 4415, "text": "The smile, the humor, the lightness amidst all the chaos of the hard work that you're in, where does that come from?"}, {"time": 4423, "text": "I just love my life."}, {"time": 4424, "text": "I love the people around me."}]}]