[{"title": "Michael Kearns: Algorithmic Fairness, Privacy & Ethics | Lex Fridman Podcast #50", "id": "AzdxbzHtjgs", "quotes": [{"time": 441, "text": "And it will have to revisit, I think, things that have been thought about by, you know, many generations of scholars before us."}, {"time": 449, "text": "So it's very early days for fairness, I think."}, {"time": 452, "text": "TK So before we get into the details of differential privacy, and on the fairness side, let me linger on the philosophy a bit."}, {"time": 459, "text": "Do you think most people are fundamentally good?"}, {"time": 463, "text": "Or do most of us have both the capacity for good and evil within us?"}, {"time": 468, "text": "SB I mean, I'm an optimist."}, {"time": 470, "text": "I tend to think that most people are good and want to do right."}, {"time": 475, "text": "And that deviations from that are, you know, kind of usually due to circumstance, not due to people being bad at heart."}, {"time": 482, "text": "TK With people with power, are people at the heads of governments, people at the heads of companies, people at the heads of, maybe, so financial power markets, do you think the distribution there is also, most people are good and have good intent?"}, {"time": 501, "text": "SB Yeah, I do."}, {"time": 502, "text": "I mean, my statement wasn't qualified to people not in positions of power."}, {"time": 508, "text": "I mean, I think what happens in a lot of the, you know, the cliche about absolute power corrupts absolutely."}, {"time": 545, "text": "But when you're in that world, it doesn't feel unusual at all."}, {"time": 549, "text": "And I think this is true of a lot of, you know, professional cultures, for instance."}, {"time": 555, "text": "And, you know, so then your maybe slippery slope is too strong of a word."}, {"time": 559, "text": "But, you know, you're in some world where you're mainly around other people with the same kind of viewpoints and training and worldview as you."}, {"time": 567, "text": "And I think that's more of a source of, of, you know, kind of abuses of power than sort of, you know, there being good people and evil people, and that somehow the evil people are the ones that somehow rise to power."}, {"time": 583, "text": "Oh, that's really interesting."}, {"time": 584, "text": "So it's the, within the social norms constructed by that particular group of people, you're all trying to do good."}, {"time": 592, "text": "But because as a group, you might be, you might drift into something that for the broader population, it does not align with the values of society."}, {"time": 600, "text": "That kind of, that's the word."}, {"time": 601, "text": "Yeah, I mean, or not that you drift, but even the things that don't make sense to the outside world don't seem unusual to you."}, {"time": 611, "text": "So it's not sort of like a good or a bad thing, but, you know, like, so for instance, you know, on, in the world of finance, right?"}, {"time": 618, "text": "There's a lot of complicated types of activity that if you are not immersed in that world, you cannot see why the purpose of that, you know, that activity exists at all."}, {"time": 627, "text": "It just seems like, you know, completely useless and people just like, you know, pushing money around."}, {"time": 633, "text": "And when you're in that world, right, you're, and you learn more, your view does become more nuanced, right?"}, {"time": 639, "text": "You realize, okay, there is actually a function to this activity."}, {"time": 643, "text": "And in some cases, you would conclude that actually, if magically we could eradicate this activity tomorrow, it would come back because it actually is like serving some useful purpose."}, {"time": 654, "text": "It's just a useful purpose that's very difficult for outsiders to see."}, {"time": 659, "text": "And so I think, you know, lots of professional work environments or cultures, as I might put it, kind of have these social norms that, you know, don't make sense to the outside world."}, {"time": 670, "text": "Academia is the same, right?"}, {"time": 671, "text": "I mean, lots of people look at academia and say, you know, what the hell are all of you people doing?"}, {"time": 676, "text": "Why are you paid so much in some cases at taxpayer expenses to do, you know, to publish papers that nobody reads?"}, {"time": 684, "text": "You know, but when you're in that world, you come to see the value for it."}, {"time": 687, "text": "And, but even though you might not be able to explain it to, you know, the person in the street."}, {"time": 693, "text": "And in the case of the financial sector, tools like credit might not make sense to people."}, {"time": 699, "text": "Like, it's a good example of something that does seem to pop up and be useful or just the power of markets and just in general capitalism."}, {"time": 707, "text": "In finance, I think the primary example I would give is leverage, right?"}, {"time": 711, "text": "So being allowed to borrow, to sort of use ten times as much money as you've actually borrowed, right?"}, {"time": 718, "text": "So that's an example of something that before I had any experience in financial markets, I might have looked at and said, well, what is the purpose of that?"}, {"time": 725, "text": "That just seems very dangerous and it is dangerous and it has proven dangerous."}, {"time": 759, "text": "Now, of course, when that happens, we've seen what happens, you know, not too long ago."}, {"time": 765, "text": "But, you know, but the idea that it serves no useful economic purpose under any circumstances is definitely not true."}, {"time": 774, "text": "We'll return to the other side of the coast, Silicon Valley, and the problems there as we talk about privacy, as we talk about fairness."}, {"time": 785, "text": "At the high level, and I'll ask some sort of basic questions with the hope to get at the fundamental nature of reality."}, {"time": 792, "text": "But from a very high level, what is an ethical algorithm?"}, {"time": 798, "text": "So I can say that an algorithm has a running time of using big O notation n log n. I can say that a machine learning algorithm classified cat versus dog with 97 percent accuracy."}, {"time": 811, "text": "Do you think there will one day be a way to measure sort of in the same compelling way as the big O notation of this algorithm is 97 percent ethical?"}, {"time": 824, "text": "First of all, let me riff for a second on your specific n log n example."}, {"time": 828, "text": "So because early in the book when we're just kind of trying to describe algorithms period, we say like, okay, you know, what's an example of an algorithm or an algorithmic problem?"}, {"time": 838, "text": "First of all, like it's sorting, right?"}, {"time": 840, "text": "You have a bunch of index cards with numbers on them and you want to sort them."}, {"time": 843, "text": "And we describe, you know, an algorithm that sweeps all the way through, finds the smallest number, puts it at the front, then sweeps through again, finds the second smallest number."}, {"time": 852, "text": "So we make the point that this is an algorithm and it's also a bad algorithm in the sense that, you know, it's quadratic rather than n log n, which we know is kind of optimal for sorting."}, {"time": 863, "text": "And we make the point that sort of like, you know, so even within the confines of a very precisely specified problem, there, you know, there might be many, many different algorithms for the same problem with different properties."}, {"time": 877, "text": "Like some might be faster in terms of running time, some might use less memory, some might have, you know, better distributed implementations."}, {"time": 886, "text": "And so the point is that already we're used to, you know, in computer science thinking about trade offs between different types of quantities and resources and there being, you know, better and worse algorithms."}, {"time": 900, "text": "And our book is about that part of algorithmic ethics that we know how to kind of put on that same kind of quantitative footing right now."}, {"time": 913, "text": "So, you know, just to say something that our book is not about, our book is not about kind of broad, fuzzy notions of fairness."}, {"time": 922, "text": "It's about very specific notions of fairness."}, {"time": 925, "text": "There's more than one of them."}, {"time": 928, "text": "There are tensions between them, right?"}, {"time": 930, "text": "But if you pick one of them, you can do something akin to saying that this algorithm is 97% ethical."}, {"time": 939, "text": "You can say, for instance, the, you know, for this lending model, the false rejection rate on black people and white people is within 3%, right?"}, {"time": 951, "text": "So we might call that a 97% ethical algorithm and a 100% ethical algorithm would mean that that difference is 0%."}, {"time": 959, "text": "In that case, fairness is specified when two groups, however, they're defined are given to you."}, {"time": 967, "text": "So the, and then you can sort of mathematically start describing the algorithm."}, {"time": 971, "text": "But nevertheless, the part where the two groups are given to you, I mean, unlike running time, you know, we don't in computer science talk about how fast an algorithm feels like when it runs."}, {"time": 989, "text": "We measure it and ethical starts getting into feelings."}, {"time": 993, "text": "So, for example, an algorithm runs, you know, if it runs in the background, it doesn't disturb the performance of my system."}, {"time": 1000, "text": "It'll feel nice."}, {"time": 1001, "text": "I'll be okay with it."}, {"time": 1002, "text": "But if it overloads the system, it'll feel unpleasant."}, {"time": 1005, "text": "So in that same way, ethics, there's a feeling of how socially acceptable it is."}, {"time": 1010, "text": "How does it represent the moral standards of our society today?"}, {"time": 1015, "text": "So in that sense, and sorry to linger on that first of high, low philosophical questions."}, {"time": 1020, "text": "Do you have a sense we'll be able to measure how ethical an algorithm is?"}, {"time": 1025, "text": "First of all, I didn't, certainly didn't mean to give the impression that you can kind of measure, you know, memory speed trade offs, you know, and that there's a complete mapping from that onto kind of fairness, for instance, or ethics and accuracy, for example."}, {"time": 1042, "text": "In the type of fairness definitions that are largely the objects of study today and starting to be deployed, you as the user of the definitions, you need to make some hard decisions before you even get to the point of designing fair algorithms."}, {"time": 1060, "text": "One of them, for instance, is deciding who it is that you're worried about protecting, who you're worried about being harmed by, for instance, some notion of discrimination or unfairness."}, {"time": 1072, "text": "And then you need to also decide what constitutes harm."}, {"time": 1075, "text": "So, for instance, in a lending application, maybe you decide that, you know, falsely rejecting a creditworthy individual, you know, sort of a false negative, is the real harm and that false positives, i.e."}, {"time": 1088, "text": "people that are not creditworthy or are not gonna repay your loan, that get a loan, you might think of them as lucky."}, {"time": 1097, "text": "And so that's not a harm, although it's not clear that if you don't have the means to repay a loan, that being given a loan is not also a harm."}, {"time": 1106, "text": "So, you know, the literature is sort of so far quite limited in that you sort of need to say, who do you want to protect and what would constitute harm to that group?"}, {"time": 1117, "text": "And when you ask questions like, will algorithms feel ethical?"}, {"time": 1122, "text": "One way in which they won't, under the definitions that I'm describing, is if, you know, if you are an individual who is falsely denied a loan, incorrectly denied a loan, all of these definitions basically say like, well, you know, your compensation is the knowledge that we are also falsely denying loans to other people, you know, in other groups at the same rate that we're doing it to you."}, {"time": 1145, "text": "And, you know, and so there is actually this interesting even technical tension in the field right now between these sort of group notions of fairness and notions of fairness that might actually feel like real fairness to individuals, right?"}, {"time": 1162, "text": "They might really feel like their particular interests are being protected or thought about by the algorithm rather than just, you know, the groups that they happen to be members of."}, {"time": 1173, "text": "Is there parallels to the big O notation of worst case analysis?"}, {"time": 1177, "text": "So, is it important to looking at the worst violation of fairness for an individual?"}, {"time": 1185, "text": "Is it important to minimize that one individual?"}, {"time": 1188, "text": "So like worst case analysis, is that something you think about or?"}, {"time": 1192, "text": "I mean, I think we're not even at the point where we can sensibly think about that."}, {"time": 1196, "text": "So first of all, you know, we're talking here both about fairness applied at the group level, which is a relatively weak thing, but it's better than nothing."}, {"time": 1208, "text": "And also the more ambitious thing of trying to give some individual promises, but even that doesn't incorporate, I think something that you're hinting at here is what I might call subjective fairness, right?"}, {"time": 1220, "text": "So a lot of the definitions, I mean, all of the definitions in the algorithmic fairness literature are what I would kind of call received wisdom definitions."}, {"time": 1228, "text": "It's sort of, you know, somebody like me sits around and things like, okay, you know, I think here's a technical definition of fairness that I think people should want or that they should, you know, think of as some notion of fairness, maybe not the only one, maybe not the best one, maybe not the last one."}, {"time": 1244, "text": "But we really actually don't know from a subjective standpoint, like what people really think is fair."}, {"time": 1284, "text": "And to my knowledge, there's not a large literature in which ordinary people are asked about, you know, they have sort of notions of their subjective fairness elicited from them."}, {"time": 1298, "text": "It's mainly, you know, kind of scholars who think about fairness kind of making up their own definitions."}, {"time": 1304, "text": "And I think this needs to change actually for many social norms, not just for fairness, right?"}, {"time": 1310, "text": "So there's a lot of discussion these days in the AI community about interpretable AI or understandable AI."}, {"time": 1318, "text": "And as far as I can tell, everybody agrees that deep learning or at least the outputs of deep learning are not very understandable, and people might agree that sparse linear models with integer coefficients are more understandable."}, {"time": 1335, "text": "But nobody's really asked people."}, {"time": 1337, "text": "You know, there's very little literature on, you know, sort of showing people models and asking them, do they understand what the model is doing?"}, {"time": 1345, "text": "And I think that in all these topics, as these fields mature, we need to start doing more behavioral work."}, {"time": 1354, "text": "Yeah, which is one of my deep passions is psychology."}, {"time": 1358, "text": "And I always thought computer scientists will be the best future psychologists in a sense that data is, especially in this modern world, the data is a really powerful way to understand and study human behavior."}, {"time": 1373, "text": "And you've explored that with your game theory side of work as well."}, {"time": 1376, "text": "Yeah, I'd like to think that what you say is true about computer scientists and psychology from my own limited wandering into human subject experiments."}, {"time": 1387, "text": "We have a great deal to learn, not just computer science, but AI and machine learning more specifically, I kind of think of as imperialist research communities in that, you know, kind of like physicists in an earlier generation, computer scientists kind of don't think of any scientific topic that's off limits to them."}, {"time": 1405, "text": "They will like freely wander into areas that others have been thinking about for decades or longer."}, {"time": 1411, "text": "And, you know, we usually tend to embarrass ourselves in those efforts for some amount of time."}, {"time": 1418, "text": "Like, you know, I think reinforcement learning is a good example, right?"}, {"time": 1421, "text": "So a lot of the early work in reinforcement learning, I have complete sympathy for the control theorists that looked at this and said like, okay, you are reinventing stuff that we've known since like the forties, right?"}, {"time": 1435, "text": "But, you know, in my view, eventually this sort of, you know, computer scientists have made significant contributions to that field, even though we kind of embarrassed ourselves for the first decade."}, {"time": 1447, "text": "So I think if computer scientists are gonna start engaging in kind of psychology, human subjects type of research, we should expect to be embarrassing ourselves for a good 10 years or so, and then hope that it turns out as well as, you know, some other areas that we've waded into."}, {"time": 1465, "text": "So you kind of mentioned this, just to linger on the idea of an ethical algorithm, of idea of groups, sort of group thinking and individual thinking."}, {"time": 1473, "text": "And we're struggling that."}, {"time": 1475, "text": "One of the amazing things about algorithms and your book and just this field of study is it gets us to ask, like forcing machines, converting these ideas into algorithms is forcing us to ask questions of ourselves as a human civilization."}, {"time": 1490, "text": "So there's a lot of people now in public discourse doing sort of group thinking, thinking like there's particular sets of groups that we don't wanna discriminate against and so on."}, {"time": 1502, "text": "And then there is individuals, sort of in the individual life stories, the struggles they went through and so on."}, {"time": 1510, "text": "Now, like in philosophy, it's easier to do group thinking because you don't, it's very hard to think about individuals."}, {"time": 1517, "text": "There's so much variability, but with data, you can start to actually say, you know what group thinking is too crude."}, {"time": 1526, "text": "You're actually doing more discrimination by thinking in terms of groups and individuals."}, {"time": 1530, "text": "Can you linger on that kind of idea of group versus individual and ethics?"}, {"time": 1536, "text": "And is it good to continue thinking in terms of groups in algorithms?"}, {"time": 1541, "text": "So let me start by answering a very good high level question with a slightly narrow technical response, which is these group definitions of fairness, like here's a few groups, like different racial groups, maybe gender groups, maybe age, what have you."}, {"time": 1559, "text": "And let's make sure that for none of these groups, do we have a false negative rate, which is much higher than any other one of these groups."}, {"time": 1569, "text": "Okay, so these are kind of classic group aggregate notions of fairness."}, {"time": 1573, "text": "And you know, but at the end of the day, an individual you can think of as a combination of all of their attributes, right?"}, {"time": 1579, "text": "They're a member of a racial group, they have a gender, they have an age, and many other demographic properties that are not biological, but that are still very strong determinants of outcome and personality and the like."}, {"time": 1596, "text": "So one, I think, useful spectrum is to sort of think about that array between the group and the specific individual, and to realize that in some ways, asking for fairness at the individual level is to sort of ask for group fairness simultaneously for all possible combinations of groups."}, {"time": 1652, "text": "So the optimization, actually, that's a fascinating way to put it."}, {"time": 1655, "text": "So you're just optimizing, the one way to achieve the optimizing fairness for individuals is just to add more and more definitions of groups that each individual belongs to."}, {"time": 1667, "text": "So, you know, at the end of the day, we could think of all of ourselves as groups of size one because eventually there's some attribute that separates you from me and everybody else in the world, okay?"}, {"time": 1677, "text": "And so it is possible to put, you know, these incredibly coarse ways of thinking about fairness and these very, very individualistic specific ways on a common scale."}, {"time": 1689, "text": "And you know, one of the things we've worked on from a research perspective is, you know, so we sort of know how to, you know, in relative terms, we know how to provide fairness guarantees at the core system of the scale."}, {"time": 1702, "text": "We don't know how to provide kind of sensible, tractable, realistic fairness guarantees at the individual level, but maybe we could start creeping towards that by dealing with more refined subgroups."}, {"time": 1715, "text": "I mean, we gave a name to this phenomenon where, you know, you protect, you enforce some definition of fairness for a bunch of marginal attributes or features, but then you find yourself discriminating against a combination of them."}, {"time": 1729, "text": "We call that fairness gerrymandering because like political gerrymandering, you know, you're giving some guarantee at the aggregate level, but when you kind of look in a more granular way at what's going on, you realize that you're achieving that aggregate guarantee by sort of favoring some groups and discriminating against other ones."}, {"time": 1750, "text": "And so there are, you know, it's early days, but there are algorithmic approaches that let you start creeping towards that, you know, individual end of the spectrum."}, {"time": 1762, "text": "Does there need to be human input in the form of weighing the value of the importance of each kind of group?"}, {"time": 1773, "text": "So for example, is it like, so gender, say crudely speaking, male and female, and then different races, are we as humans supposed to put value on saying gender is 0.6 and race is 0.4 in terms of in the big optimization of achieving fairness?"}, {"time": 1799, "text": "Is that kind of what humans are supposed to do here?"}, {"time": 1801, "text": "I mean, of course, you know, I don't need to tell you that, of course, technically one could incorporate such weights if you wanted to into a definition of fairness."}, {"time": 1810, "text": "You know, fairness is an interesting topic in that having worked in the book being about both fairness, privacy, and many other social norms, fairness, of course, is a much, much more loaded topic."}, {"time": 1827, "text": "So privacy, I mean, people want privacy, people don't like violations of privacy, violations of privacy cause damage, angst, and bad publicity for the companies that are victims of them."}, {"time": 1840, "text": "But sort of everybody agrees more data privacy would be better than less data privacy."}, {"time": 1848, "text": "And you don't have these, somehow the discussions of fairness don't become politicized along other dimensions like race and about gender and, you know, whether we, and, you know, you quickly find yourselves kind of revisiting topics that have been kind of unresolved forever, like affirmative action, right?"}, {"time": 1872, "text": "Sort of, you know, like, why are you protecting, and some people will say, why are you protecting this particular racial group?"}, {"time": 1880, "text": "And others will say, well, we need to do that as a matter of retribution."}, {"time": 1886, "text": "Other people will say, it's a matter of economic opportunity."}, {"time": 1890, "text": "And I don't know which of, you know, whether any of these are the right answers, but you sort of, fairness is sort of special in that as soon as you start talking about it, you inevitably have to participate in debates about fair to whom, at what expense to who else."}, {"time": 1907, "text": "I mean, even in criminal justice, right, you know, where people talk about fairness in criminal sentencing or, you know, predicting failures to appear or making parole decisions or the like, they will, you know, they'll point out that, well, these definitions of fairness are all about fairness for the criminals."}, {"time": 1933, "text": "And what about fairness for the victims, right?"}, {"time": 1936, "text": "So when I basically say something like, well, the false incarceration rate for black people and white people needs to be roughly the same, you know, there's no mention of potential victims of criminals in such a fairness definition."}, {"time": 1953, "text": "And that's the realm of public discourse."}, {"time": 1954, "text": "I should actually recommend, I just listened to people listening, Intelligence Squares debates, US edition just had a debate."}, {"time": 1965, "text": "They have this structure where you have old Oxford style or whatever they're called, debates, you know, it's two versus two and they talked about affirmative action and it was incredibly interesting that there's really good points on every side of this issue, which is fascinating to listen to."}, {"time": 1984, "text": "Yeah, yeah, I agree."}, {"time": 1985, "text": "And so it's interesting to be a researcher trying to do, for the most part, technical algorithmic work, but Aaron and I both quickly learned you cannot do that and then go out and talk about it and expect people to take it seriously if you're unwilling to engage in these broader debates that are entirely extra algorithmic, right?"}, {"time": 2008, "text": "They're not about, you know, algorithms and making algorithms better."}, {"time": 2011, "text": "They're sort of, you know, as you said, sort of like, what should society be protecting in the first place?"}, {"time": 2016, "text": "When you discuss the fairness, an algorithm that achieves fairness, whether in the constraints and the objective function, there's an immediate kind of analysis you can perform, which is saying, if you care about fairness in gender, this is the amount that you have to pay for it in terms of the performance of the system."}, {"time": 2039, "text": "Like do you, is there a role for statements like that in a table, in a paper, or do you want to really not touch that?"}, {"time": 2046, "text": "No, no, we want to touch that and we do touch it."}, {"time": 2049, "text": "So I mean, just again, to make sure I'm not promising your viewers more than we know how to provide, but if you pick a definition of fairness, like I'm worried about gender discrimination and you pick a notion of harm, like false rejection for a loan, for example, and you give me a model, I can definitely, first of all, go audit that model."}, {"time": 2070, "text": "It's easy for me to go, you know, from data to kind of say like, okay, your false rejection rate on women is this much higher than it is on men, okay?"}, {"time": 2081, "text": "But once you also put the fairness into your objective function, I mean, I think the table that you're talking about is what we would call the Pareto curve, right?"}, {"time": 2091, "text": "You can literally trace out, and we give examples of such plots on real data sets in the book, you have two axes."}, {"time": 2099, "text": "On the X axis is your error, on the Y axis is unfairness by whatever, you know, if it's like the disparity between false rejection rates between two groups."}, {"time": 2112, "text": "And you know, your algorithm now has a knob that basically says, how strongly do I want to enforce fairness?"}, {"time": 2119, "text": "And the less unfair, you know, if the two axes are error and unfairness, we'd like to be at zero, zero."}, {"time": 2126, "text": "We'd like zero error and zero unfairness simultaneously."}, {"time": 2131, "text": "Anybody who works in machine learning knows that you're generally not going to get to zero error period without any fairness constraint whatsoever."}, {"time": 2138, "text": "So that's not going to happen."}, {"time": 2141, "text": "But in general, you know, you'll get this, you'll get some kind of convex curve that specifies the numerical trade off you face."}, {"time": 2149, "text": "You know, if I want to go from 17% error down to 16% error, what will be the increase in unfairness that I experienced as a result of that?"}, {"time": 2162, "text": "And so this curve kind of specifies the, you know, kind of undominated models."}, {"time": 2169, "text": "Models that are off that curve are, you know, can be strictly improved in one or both dimensions."}, {"time": 2174, "text": "You can, you know, either make the error better or the unfairness better or both."}, {"time": 2178, "text": "And I think our view is that not only are these objects, these Pareto curves, you know, with efficient frontiers as you might call them, not only are they valuable scientific objects, I actually think that they in the near term might need to be the interface between researchers working in the field and stakeholders in given problems."}, {"time": 2206, "text": "So you know, you could really imagine telling a criminal jurisdiction, look, if you're concerned about racial fairness, but you're also concerned about accuracy."}, {"time": 2218, "text": "You want to, you know, you want to release on parole people that are not going to recommit a violent crime and you don't want to release the ones who are."}, {"time": 2228, "text": "So you know, that's accuracy."}, {"time": 2230, "text": "But if you also care about those, you know, the mistakes you make not being disproportionately on one racial group or another, you can show this curve."}, {"time": 2239, "text": "I'm hoping that in the near future, it'll be possible to explain these curves to non technical people that are the ones that have to make the decision, where do we want to be on this curve?"}, {"time": 2250, "text": "Like, what are the relative merits or value of having lower error versus lower unfairness?"}, {"time": 2258, "text": "You know, that's not something computer scientists should be deciding for society, right?"}, {"time": 2263, "text": "That, you know, the people in the field, so to speak, the policymakers, the regulators, that's who should be making these decisions."}, {"time": 2271, "text": "But I think and hope that they can be made to understand that these trade offs generally exist and that you need to pick a point and like, and ignoring the trade off, you know, you're implicitly picking a point anyway, right?"}, {"time": 2286, "text": "You just don't know it and you're not admitting it."}, {"time": 2289, "text": "Just to linger on the point of trade offs, I think that's a really important thing to sort of think about."}, {"time": 2295, "text": "So you think when we start to optimize for fairness, there's almost always in most system going to be trade offs."}, {"time": 2305, "text": "Can you like, what's the trade off between just to clarify, there have been some sort of technical terms thrown around, but sort of a perfectly fair world."}, {"time": 2320, "text": "Why will somebody be upset about that?"}, {"time": 2323, "text": "The specific trade off I talked about just in order to make things very concrete was between numerical error and some numerical measure of unfairness."}, {"time": 2333, "text": "What is numerical error in the case of... Just like say predictive error, like, you know, the probability or frequency with which you release somebody on parole who then goes on to recommit a violent crime or keep incarcerated somebody who would not have recommitted a violent crime."}, {"time": 2350, "text": "So in the case of awarding somebody parole or giving somebody parole or letting them out on parole, you don't want them to recommit a crime."}, {"time": 2361, "text": "So it's your system failed in prediction if they happen to do a crime."}, {"time": 2366, "text": "Okay, so that's one axis."}, {"time": 2370, "text": "And what's the fairness axis?"}, {"time": 2371, "text": "So then the fairness axis might be the difference between racial groups in the kind of false positive predictions, namely people that I kept incarcerated predicting that they would recommit a violent crime when in fact they wouldn't have."}, {"time": 2392, "text": "And the unfairness of that, just to linger it and allow me to in eloquently to try to sort of describe why that's unfair, why unfairness is there."}, {"time": 2406, "text": "The unfairness you want to get rid of is that in the judge's mind, the bias of having being brought up to society, the slight racial bias, the racism that exists in the society, you want to remove that from the system."}, {"time": 2421, "text": "Another way that's been debated is sort of equality of opportunity versus equality of outcome."}, {"time": 2430, "text": "And there's a weird dance there that's really difficult to get right."}, {"time": 2435, "text": "And we don't, affirmative action is exploring that space."}, {"time": 2441, "text": "And then this also quickly bleeds into questions like, well, maybe if one group really does recommit crimes at a higher rate, the reason for that is that at some earlier point in the pipeline or earlier in their lives, they didn't receive the same resources that the other group did."}, {"time": 2462, "text": "And so there's always in kind of fairness discussions, the possibility that the real injustice came earlier, right?"}, {"time": 2471, "text": "Earlier in this individual's life, earlier in this group's history, et cetera, et cetera."}, {"time": 2476, "text": "And so a lot of the fairness discussion is almost, the goal is for it to be a corrective mechanism to account for the injustice earlier in life."}, {"time": 2485, "text": "By some definitions of fairness or some theories of fairness, yeah."}, {"time": 2489, "text": "Others would say like, look, it's not to correct that injustice, it's just to kind of level the playing field right now and not falsely incarcerate more people of one group than another group."}, {"time": 2501, "text": "But I mean, I think just it might be helpful just to demystify a little bit about the many ways in which bias or unfairness can come into algorithms, especially in the machine learning era, right?"}, {"time": 2515, "text": "I think many of your viewers have probably heard these examples before, but let's say I'm building a face recognition system, right?"}, {"time": 2524, "text": "And so I'm kind of gathering lots of images of faces and trying to train the system to recognize new faces of those individuals from training on a training set of those faces of individuals."}, {"time": 2573, "text": "Now, there's a bunch of ways you could think about addressing this."}, {"time": 2577, "text": "One is to deliberately put into the objective of the algorithm not to optimize the error at the expense of this discrimination, and then you're kind of back in the land of these kind of two dimensional numerical trade offs."}, {"time": 2593, "text": "A valid counter argument is to say like, well, no, you don't have to, there's no, you know, the notion of the tension between error and accuracy here is a false one."}, {"time": 2602, "text": "You could instead just go out and get much more data on these other groups that are in the minority and, you know, equalize your data set, or you could train a separate model on those subgroups and, you know, have multiple models."}, {"time": 2618, "text": "The point I think we would, you know, we tried to make in the book is that those things have cost too, right?"}, {"time": 2625, "text": "Going out and gathering more data on groups that are relatively rare compared to your plurality or more majority group that, you know, it may not cost you in the accuracy of the model, but it's going to cost, you know, it's going to cost the company developing this model more money to develop that, and it also costs more money to build separate predictive models and to implement and deploy them."}, {"time": 2647, "text": "So even if you can find a way to avoid the tension between error and accuracy in training a model, you might push the cost somewhere else, like money, like development time, research time and the like."}, {"time": 2662, "text": "There are fundamentally difficult philosophical questions, in fairness, and we live in a very divisive political climate, outraged culture."}, {"time": 2674, "text": "There is alt right folks on 4chan, trolls."}, {"time": 2678, "text": "There is social justice warriors on Twitter."}, {"time": 2683, "text": "There's very divisive, outraged folks on all sides of every kind of system."}, {"time": 2689, "text": "How do you, how do we as engineers build ethical algorithms in such divisive culture?"}, {"time": 2697, "text": "Do you think they could be disjoint?"}, {"time": 2699, "text": "The human has to inject your values, and then you can optimize over those values."}, {"time": 2704, "text": "But in our times, when you start actually applying these systems, things get a little bit challenging for the public discourse."}, {"time": 2713, "text": "How do you think we can proceed?"}, {"time": 2714, "text": "Yeah, I mean, for the most part in the book, a point that we try to take some pains to make is that we don't view ourselves or people like us as being in the position of deciding for society what the right social norms are, what the right definitions of fairness are."}, {"time": 2734, "text": "Our main point is to just show that if society or the relevant stakeholders in a particular domain can come to agreement on those sorts of things, there's a way of encoding that into algorithms in many cases, not in all cases."}, {"time": 2750, "text": "One other misconception that hopefully we definitely dispel is sometimes people read the title of the book and I think not unnaturally fear that what we're suggesting is that the algorithms themselves should decide what those social norms are and develop their own notions of fairness and privacy or ethics, and we're definitely not suggesting that."}, {"time": 2770, "text": "The title of the book is Ethical Algorithm, by the way, and I didn't think of that interpretation of the title."}, {"time": 2776, "text": "I mean, especially these days where people are concerned about the robots becoming our overlords, the idea that the robots would also sort of develop their own social norms is just one step away from that."}, {"time": 2815, "text": "But they had to make, so if we look at people at the heads of companies and so on, they had to make those decisions, right?"}, {"time": 2822, "text": "There has to be decisions, so there's two options, either you kind of put your head in the sand and don't think about these things and just let the algorithm do what it does, or you make decisions about what you value, you know, of injecting moral values into the algorithm."}, {"time": 2840, "text": "Look, I never mean to be an apologist for the tech industry, but I think it's a little bit too far to sort of say that explicit decisions were made about these things."}, {"time": 2851, "text": "So let's, for instance, take social media platforms, right?"}, {"time": 2854, "text": "So like many inventions in technology and computer science, a lot of these platforms that we now use regularly kind of started as curiosities, right?"}, {"time": 2865, "text": "I remember when things like Facebook came out and its predecessors like Friendster, which nobody even remembers now, people really wonder, like, why would anybody want to spend time doing that?"}, {"time": 2876, "text": "I mean, even the web when it first came out, when it wasn't populated with much content and it was largely kind of hobbyists building their own kind of ramshackle websites, a lot of people looked at this and said, well, what is the purpose of this thing?"}, {"time": 2889, "text": "Why is this interesting?"}, {"time": 2891, "text": "Who would want to do this?"}, {"time": 2892, "text": "And so even things like Facebook and Twitter, yes, technical decisions were made by engineers, by scientists, by executives in the design of those platforms, but, you know, I don't think 10 years ago anyone anticipated that those platforms, for instance, might kind of acquire undue, you know, influence on political discourse or on the outcomes of elections."}, {"time": 2922, "text": "And I think the scrutiny that these companies are getting now is entirely appropriate, but I think it's a little too harsh to kind of look at history and sort of say like, oh, you should have been able to anticipate that this would happen with your platform."}, {"time": 2936, "text": "And in this sort of gaming chapter of the book, one of the points we're making is that, you know, these platforms, right, they don't operate in isolation."}, {"time": 2945, "text": "So unlike the other topics we're discussing, like fairness and privacy, like those are really cases where algorithms can operate on your data and make decisions about you and you're not even aware of it, okay?"}, {"time": 2956, "text": "Things like Facebook and Twitter, these are, you know, these are systems, right?"}, {"time": 2960, "text": "These are social systems and their evolution, even their technical evolution because machine learning is involved, is driven in no small part by the behavior of the users themselves and how the users decide to adopt them and how to use them."}, {"time": 2975, "text": "And so, you know, I'm kind of like who really knew that, you know, until we saw it happen, who knew that these things might be able to influence the outcome of elections?"}, {"time": 2988, "text": "Who knew that, you know, they might polarize political discourse because of the ability to, you know, decide who you interact with on the platform and also with the platform naturally using machine learning to optimize for your own interest that they would further isolate us from each other and, you know, like feed us all basically just the stuff that we already agreed with."}, {"time": 3012, "text": "So I think, you know, we've come to that outcome, I think, largely, but I think it's something that we all learned together, including the companies as these things happen."}, {"time": 3024, "text": "You asked like, well, are there algorithmic remedies to these kinds of things?"}, {"time": 3029, "text": "And again, these are big problems that are not going to be solved with, you know, somebody going in and changing a few lines of code somewhere in a social media platform."}, {"time": 3040, "text": "But I do think in many ways, there are definitely ways of making things better."}, {"time": 3044, "text": "I mean, like an obvious recommendation that we make at some point in the book is like, look, you know, to the extent that we think that machine learning applied for personalization purposes in things like newsfeed, you know, or other platforms has led to polarization and intolerance of opposing viewpoints."}, {"time": 3067, "text": "As you know, right, these algorithms have models, right, and they kind of place people in some kind of metric space, and they place content in that space, and they sort of know the extent to which I have an affinity for a particular type of content."}, {"time": 3082, "text": "And by the same token, they also probably have that same model probably gives you a good idea of the stuff I'm likely to violently disagree with or be offended by, okay?"}, {"time": 3092, "text": "So you know, in this case, there really is some knob you could tune that says like, instead of showing people only what they like and what they want, let's show them some stuff that we think that they don't like, or that's a little bit further away."}, {"time": 3106, "text": "And you could even imagine users being able to control this, you know, just like everybody gets a slider, and that slider says like, you know, how much stuff do you want to see that's kind of, you know, you might disagree with, or is at least further from your interest."}, {"time": 3122, "text": "It's almost like an exploration button."}, {"time": 3125, "text": "So just get your intuition."}, {"time": 3128, "text": "Do you think engagement, so like you staying on the platform, you're staying engaged."}, {"time": 3135, "text": "Do you think fairness, ideas of fairness won't emerge?"}, {"time": 3139, "text": "Like how bad is it to just optimize for engagement?"}, {"time": 3143, "text": "Do you think we'll run into big trouble if we're just optimizing for how much you love the platform?"}, {"time": 3149, "text": "Well, I mean, optimizing for engagement kind of got us where we are."}, {"time": 3154, "text": "So do you, one, have faith that it's possible to do better?"}, {"time": 3159, "text": "And two, if it is, how do we do better?"}, {"time": 3164, "text": "I mean, it's definitely possible to do different, right?"}, {"time": 3167, "text": "And again, you know, it's not as if I think that doing something different than optimizing for engagement won't cost these companies in real ways, including revenue and profitability potentially."}, {"time": 3178, "text": "In the short term at least."}, {"time": 3181, "text": "In the short term."}, {"time": 3183, "text": "And again, you know, if I worked at these companies, I'm sure that it would have seemed like the most natural thing in the world also to want to optimize engagement, right?"}, {"time": 3192, "text": "And that's good for users in some sense."}, {"time": 3194, "text": "You want them to be, you know, vested in the platform and enjoying it and finding it useful, interesting, and or productive."}, {"time": 3201, "text": "But you know, my point is, is that the idea that there is, that it's sort of out of their hands as you said, or that there's nothing to do about it, never say never, but that strikes me as implausible as a machine learning person, right?"}, {"time": 3214, "text": "I mean, these companies are driven by machine learning and this optimization of engagement is essentially driven by machine learning, right?"}, {"time": 3222, "text": "It's driven by not just machine learning, but you know, very, very large scale A, B experimentation where you kind of tweak some element of the user interface or tweak some component of an algorithm or tweak some component or feature of your click through prediction model."}, {"time": 3241, "text": "And my point is, is that anytime you know how to optimize for something, you, you know, by def, almost by definition, that solution tells you how not to optimize for it or to do something different."}, {"time": 3253, "text": "Engagement can be measured."}, {"time": 3256, "text": "So sort of optimizing for sort of minimizing divisiveness or maximizing intellectual growth over the lifetime of a human being are very difficult to measure."}, {"time": 3271, "text": "And I'm not claiming that doing something different will immediately make it apparent that this is a good thing for society and in particular, I mean, I think one way of thinking about where we are on some of these social media platforms is that, you know, it kind of feels a bit like we're in a bad equilibrium, right?"}, {"time": 3290, "text": "That these systems are helping us all kind of optimize something myopically and selfishly for ourselves and of course, from an individual standpoint at any given moment, like why would I want to see things in my newsfeed that I found irrelevant, offensive or, you know, or the like, okay?"}, {"time": 3309, "text": "But you know, maybe by all of us, you know, having these platforms myopically optimized in our interests, we have reached a collective outcome as a society that we're unhappy with in different ways."}, {"time": 3321, "text": "Let's say with respect to things like, you know, political discourse and tolerance of opposing viewpoints."}, {"time": 3328, "text": "And if Mark Zuckerberg gave you a call and said, I'm thinking of taking a sabbatical, could you run Facebook for me for six months?"}, {"time": 3337, "text": "What would you, how?"}, {"time": 3339, "text": "I think no thanks would be my first response, but there are many aspects of being the head of the entire company that are kind of entirely exogenous to many of the things that we're discussing here."}, {"time": 3353, "text": "And so I don't really think I would need to be CEO of Facebook to kind of implement the, you know, more limited set of solutions that I might imagine."}, {"time": 3362, "text": "But I think one concrete thing they could do is they could experiment with letting people who chose to, to see more stuff in their newsfeed that is not entirely kind of chosen to optimize for their particular interests, beliefs, et cetera."}, {"time": 3382, "text": "So the, the kind of thing, so I could speak to YouTube, but I think Facebook probably does something similar is they're quite effective at automatically finding what sorts of groups you belong to, not based on race or gender or so on, but based on the kind of stuff you enjoy watching in the case of YouTube."}, {"time": 3403, "text": "Sort of, it's a, it's a difficult thing for Facebook or YouTube to then say, well, you know what?"}, {"time": 3411, "text": "We're going to show you something from a very different cluster."}, {"time": 3414, "text": "Even though we believe algorithmically, you're unlikely to enjoy that thing sort of that's a weird jump to make."}, {"time": 3422, "text": "There has to be a human, like at the very top of that system that says, well, that will be longterm healthy for you."}, {"time": 3429, "text": "That's more than an algorithmic decision."}, {"time": 3431, "text": "Or that same person could say that'll be longterm healthy for the platform or for the platform's influence on society outside of the platform, right?"}, {"time": 3442, "text": "And it, you know, it's easy for me to sit here and say these things, but conceptually I do not think that these are kind of totally or should, they shouldn't be kind of completely alien ideas, right?"}, {"time": 3485, "text": "The focus in your book and algorithmic fairness research today in general is on machine learning, like we said, is data, but, and just even the entire AI field right now is captivated with machine learning, with deep learning."}, {"time": 3499, "text": "Do you think ideas in symbolic AI or totally other kinds of approaches are interesting, useful in the space, have some promising ideas in terms of fairness?"}, {"time": 3511, "text": "I haven't thought about that question specifically in the context of fairness."}, {"time": 3515, "text": "I definitely would agree with that statement in the large, right?"}, {"time": 3519, "text": "I mean, I am, you know, one of many machine learning researchers who do believe that the great successes that have been shown in machine learning recently are great successes, but they're on a pretty narrow set of tasks."}, {"time": 3533, "text": "I mean, I don't, I don't think we're kind of notably closer to general artificial intelligence now than we were when I started my career."}, {"time": 3543, "text": "I mean, there's been progress and I do think that we are kind of as a community, maybe looking a bit where the light is, but the light is shining pretty bright there right now and we're finding a lot of stuff."}, {"time": 3553, "text": "So I don't want to like argue with the progress that's been made in areas like deep learning, for example."}, {"time": 3559, "text": "This touches another sort of related thing that you mentioned and that people might misinterpret from the title of your book, ethical algorithm."}, {"time": 3567, "text": "Is it possible for the algorithm to automate some of those decisions?"}, {"time": 3571, "text": "Sort of a higher level decisions of what kind of, like what, what should be fair, what should be fair."}, {"time": 3578, "text": "The more you know about a field, the more aware you are of its limitations."}, {"time": 3583, "text": "And so I'm a, I'm pretty leery of sort of trying, you know, there's, there's so much we don't all, we already don't know in fairness, even when we're the ones picking the fairness definitions and, you know, comparing alternatives and thinking about the tensions between different definitions that the idea of kind of letting the algorithm start exploring as well."}, {"time": 3605, "text": "I definitely think, you know, this is a much narrower statement."}, {"time": 3608, "text": "I definitely think that kind of algorithmic auditing for different types of unfairness, right?"}, {"time": 3613, "text": "So like in this gerrymandering example where I might want to prevent not just discrimination against very broad categories, but against combinations of broad categories."}, {"time": 3623, "text": "You know, you quickly get to a point where there's a lot of, a lot of categories."}, {"time": 3627, "text": "There's a lot of combinations of end features and, you know, you can use algorithmic techniques to sort of try to find the subgroups on which you're discriminating the most and try to fix that."}, {"time": 3639, "text": "That's actually kind of the form of one of the algorithms we developed for this fairness gerrymandering problem."}, {"time": 3644, "text": "But I'm, I'm, you know, partly because of our technological, you know, our sort of our scientific ignorance on these topics right now."}, {"time": 3653, "text": "And also partly just because these topics are so loaded emotionally for people that I just don't see the value."}, {"time": 3660, "text": "I mean, again, never say never, but I just don't think we're at a moment where it's a great time for computer scientists to be rolling out the idea like, hey, you know, you know, not only have we kind of figured fairness out, but, you know, we think the algorithm should start deciding what's fair or giving input on that decision."}, {"time": 3676, "text": "I just don't, it's like the cost benefit analysis to the field of kind of going there right now just doesn't seem worth it to me."}, {"time": 3684, "text": "That said, I should say that I think computer scientists should be more philosophically, like should enrich their thinking about these kinds of things."}, {"time": 3692, "text": "I think it's been too often used as an excuse for roboticists working on autonomous vehicles, for example, to not think about the human factor or psychology or safety in the same way like computer science design algorithms that have been sort of using it as an excuse."}, {"time": 3707, "text": "And I think it's time for basically everybody to become a computer scientist."}, {"time": 3711, "text": "I was about to agree with everything you said except that last point."}, {"time": 3714, "text": "I think that the other way of looking at it is that I think computer scientists, you know, and many of us are, but we need to weigh it out into the world more, right?"}, {"time": 3726, "text": "I mean, just the influence that computer science and therefore computer scientists have had on society at large just like has exponentially magnified in the last 10 or 20 years or so."}, {"time": 3741, "text": "And you know, before when we were just tinkering around amongst ourselves and it didn't matter that much, there was no need for sort of computer scientists to be citizens of the world more broadly."}, {"time": 3753, "text": "And I think those days need to be over very, very fast."}, {"time": 3756, "text": "And I'm not saying everybody needs to do it, but to me, like the right way of doing it is to not to sort of think that everybody else is going to become a computer scientist."}, {"time": 3764, "text": "But you know, I think people are becoming more sophisticated about computer science, even lay people."}, {"time": 3770, "text": "You know, I think one of the reasons we decided to write this book is we thought 10 years ago I wouldn't have tried this just because I just didn't think that sort of people's awareness of algorithms and machine learning, you know, the general population would have been high."}, {"time": 3787, "text": "I mean, you would have had to first, you know, write one of the many books kind of just explicating that topic to a lay audience first."}, {"time": 3794, "text": "Now I think we're at the point where like lots of people without any technical training at all know enough about algorithms and machine learning that you can start getting to these nuances of things like ethical algorithms."}, {"time": 3806, "text": "I think we agree that there needs to be much more mixing, but I think a lot of the onus of that mixing needs to be on the computer science community."}, {"time": 3844, "text": "And therefore literature, like library sciences, like, so you were speaking, I think, I think it holds true what you're saying for the next few years."}, {"time": 3854, "text": "But long term, if you're interested to me, if you're interested in philosophy, you should learn a program, because then you can scrape data and study what people are thinking about on Twitter, and then start making philosophical conclusions about the meaning of life."}, {"time": 3873, "text": "I just feel like the access to data, the digitization of whatever problem you're trying to solve, will fundamentally change what it means to be a computer scientist."}, {"time": 3884, "text": "I mean, a computer scientist in 20, 30 years will go back to being Donald Knuth style theoretical computer science, and everybody would be doing basically, exploring the kinds of ideas that you explore in your book."}, {"time": 3897, "text": "It won't be a computer science major."}, {"time": 3898, "text": "Yeah, I mean, I don't think I disagree enough, but I think that that trend of more and more people in more and more disciplines adopting ideas from computer science, learning how to code, I think that that trend seems firmly underway."}, {"time": 3914, "text": "I mean, you know, like an interesting digressive question along these lines is maybe in 50 years, there won't be computer science departments anymore, because the field will just sort of be ambient in all of the different disciplines."}, {"time": 3930, "text": "And people will look back and having a computer science department will look like having an electricity department or something that's like, you know, everybody uses this, it's just out there."}, {"time": 3940, "text": "I mean, I do think there will always be that kind of Knuth style core to it, but it's not an implausible path that we kind of get to the point where the academic discipline of computer science becomes somewhat marginalized because of its very success in kind of infiltrating all of science and society and the humanities, etcetera."}, {"time": 3960, "text": "What is differential privacy, or more broadly, algorithmic privacy?"}, {"time": 3967, "text": "Algorithmic privacy more broadly is just the study or the notion of privacy definitions or norms being encoded inside of algorithms."}, {"time": 3979, "text": "And so, you know, I think we count among this body of work just, you know, the literature and practice of things like data anonymization, which we kind of at the beginning of our discussion of privacy say like, okay, this is sort of a notion of algorithmic privacy."}, {"time": 3998, "text": "It kind of tells you, you know, something to go do with data, but, you know, our view is that it's, and I think this is now, you know, quite widespread, that it's, you know, despite the fact that those notions of anonymization kind of redacting and coarsening are the most widely adopted technical solutions for data privacy, they are like deeply fundamentally flawed."}, {"time": 4025, "text": "And so, you know, to your first question, what is differential privacy?"}, {"time": 4031, "text": "Differential privacy seems to be a much, much better notion of privacy that kind of avoids a lot of the weaknesses of anonymization notions while still letting us do useful stuff with data."}, {"time": 4045, "text": "What is anonymization of data?"}, {"time": 4047, "text": "So by anonymization, I'm, you know, kind of referring to techniques like I have a database."}, {"time": 4054, "text": "The rows of that database are, let's say, individual people's medical records, okay?"}, {"time": 4060, "text": "And I want to let people use that data."}, {"time": 4063, "text": "Maybe I want to let researchers access that data to build predictive models for some disease, but I'm worried that that will leak, you know, sensitive information about specific people's medical records."}, {"time": 4077, "text": "So anonymization broadly refers to the set of techniques where I say like, okay, I'm first going to like, I'm going to delete the column with people's names."}, {"time": 4086, "text": "I'm going to not put, you know, so that would be like a redaction, right?"}, {"time": 4089, "text": "I'm just redacting that information."}, {"time": 4092, "text": "I am going to take ages and I'm not going to like say your exact age."}, {"time": 4097, "text": "I'm going to say whether you're, you know, zero to 10, 10 to 20, 20 to 30, I might put the first three digits of your zip code, but not the last two, et cetera, et cetera."}, {"time": 4107, "text": "And so the idea is that through some series of operations like this on the data, I anonymize it."}, {"time": 4112, "text": "You know, another term of art that's used is removing personally identifiable information."}, {"time": 4118, "text": "And you know, this is basically the most common way of providing data privacy, but that it's in a way that still lets people access the, some variant form of the data."}, {"time": 4130, "text": "So at a slightly broader picture, as you talk about what does anonymization mean when you have multiple database, like with a Netflix prize, when you can start combining stuff together."}, {"time": 4142, "text": "So this is exactly the problem with these notions, right?"}, {"time": 4145, "text": "Is that notions of a anonymization, removing personally identifiable information, the kind of fundamental conceptual flaw is that, you know, these definitions kind of pretend as if the data set in question is the only data set that exists in the world or that ever will exist in the future."}, {"time": 4163, "text": "And of course, things like the Netflix prize and many, many other examples since the Netflix prize, I think that was one of the earliest ones though, you know, you can reidentify people that were, you know, that were anonymized in the data set by taking that anonymized data set and combining it with other allegedly anonymized data sets and maybe publicly available information about you."}, {"time": 4184, "text": "You know, for people who don't know the Netflix prize was, was being publicly released this data."}, {"time": 4190, "text": "So the names from those rows were removed, but what was released is the preference or the ratings of what movies you like and you don't like."}, {"time": 4198, "text": "And from that combined with other things, I think forum posts and so on, you can start to figure out I guess it was specifically the internet movie database where, where lots of Netflix users publicly rate their movie, you know, their movie preferences."}, {"time": 4215, "text": "And so the anonymized data and Netflix, when it's just this phenomenon, I think that we've all come to realize in the last decade or so is that just knowing a few apparently irrelevant innocuous things about you can often act as a fingerprint."}, {"time": 4233, "text": "Like if I know, you know, what, what rating you gave to these 10 movies and the date on which you entered these movies, this is almost like a fingerprint for you in the sea of all Netflix users."}, {"time": 4244, "text": "There were just another paper on this in science or nature of about a month ago that, you know, kind of 18 attributes."}, {"time": 4287, "text": "So we live in this era where, you know, even the apparently irrelevant data that we offer about ourselves on public platforms and forums often unbeknownst to us, more or less acts as signature or, you know, fingerprint."}, {"time": 4302, "text": "And that if you can kind of, you know, do a join between that kind of data and allegedly anonymized data, you have real trouble."}, {"time": 4310, "text": "So is there hope for any kind of privacy in a world where a few likes can identify you?"}, {"time": 4318, "text": "So there is differential privacy, right?"}, {"time": 4320, "text": "What is differential privacy?"}, {"time": 4321, "text": "Yeah, so differential privacy basically is a kind of alternate, much stronger notion of privacy than these anonymization ideas."}, {"time": 4330, "text": "And, you know, it's a technical definition, but like the spirit of it is we compare two alternate worlds, okay?"}, {"time": 4340, "text": "So let's suppose I'm a researcher and I want to do, you know, there's a database of medical records and one of them is yours, and I want to use that database of medical records to build a predictive model for some disease."}, {"time": 4353, "text": "So based on people's symptoms and test results and the like, I want to, you know, build a probably model predicting the probability that people have disease."}, {"time": 4362, "text": "So, you know, this is the type of scientific research that we would like to be allowed to continue."}, {"time": 4368, "text": "And in differential privacy, you ask a very particular counterfactual question."}, {"time": 4373, "text": "We basically compare two alternatives."}, {"time": 4377, "text": "One is when I do this, I build this model on the database of medical records, including your medical record."}, {"time": 4387, "text": "And the other one is where I do the same exercise with the same database with just your medical record removed."}, {"time": 4396, "text": "So basically, you know, it's two databases, one with N records in it and one with N minus one records in it."}, {"time": 4403, "text": "The N minus one records are the same, and the only one that's missing in the second case is your medical record."}, {"time": 4410, "text": "So differential privacy basically says that any harms that might come to you from the analysis in which your data was included are essentially nearly identical to the harms that would have come to you if the same analysis had been done without your medical record included."}, {"time": 4433, "text": "So in other words, this doesn't say that bad things cannot happen to you as a result of data analysis."}, {"time": 4439, "text": "It just says that these bad things were going to happen to you already, even if your data wasn't included."}, {"time": 4446, "text": "And to give a very concrete example, right, you know, like we discussed at some length, the study that, you know, in the 50s that was done that established the link between smoking and lung cancer."}, {"time": 4459, "text": "And we make the point that, like, well, if your data was used in that analysis and, you know, the world kind of knew that you were a smoker because, you know, there was no stigma associated with smoking before those findings, real harm might have come to you as a result of that study that your data was included in."}, {"time": 4477, "text": "In particular, your insurer now might have a higher posterior belief that you might have lung cancer and raise your premium."}, {"time": 4484, "text": "So you've suffered economic damage."}, {"time": 4487, "text": "But the point is, is that if the same analysis has been done with all the other N minus one medical records and just yours missing, the outcome would have been the same."}, {"time": 4498, "text": "Or your data wasn't idiosyncratically crucial to establishing the link between smoking and lung cancer because the link between smoking and lung cancer is like a fact about the world that can be discovered with any sufficiently large database of medical records."}, {"time": 4514, "text": "But that's a very low value of harm."}, {"time": 4518, "text": "So that's showing that very little harm is done."}, {"time": 4521, "text": "But how what is the mechanism of differential privacy?"}, {"time": 4524, "text": "So that's the kind of beautiful statement of it."}, {"time": 4527, "text": "It's the mechanism by which privacy is preserved."}, {"time": 4531, "text": "So it's basically by adding noise to computations, right?"}, {"time": 4534, "text": "So the basic idea is that every differentially private algorithm, first of all, or every good differentially private algorithm, every useful one, is a probabilistic algorithm."}, {"time": 4545, "text": "So it doesn't, on a given input, if you gave the algorithm the same input multiple times, it would give different outputs each time from some distribution."}, {"time": 4555, "text": "And the way you achieve differential privacy algorithmically is by kind of carefully and tastefully adding noise to a computation in the right places."}, {"time": 4565, "text": "And to give a very concrete example, if I wanna compute the average of a set of numbers, the non private way of doing that is to take those numbers and average them and release like a numerically precise value for the average."}, {"time": 4581, "text": "In differential privacy, you wouldn't do that."}, {"time": 4584, "text": "You would first compute that average to numerical precisions, and then you'd add some noise to it, right?"}, {"time": 4590, "text": "You'd add some kind of zero mean, Gaussian or exponential noise to it so that the actual value you output is not the exact mean, but it'll be close to the mean, but it'll be close..."}, {"time": 4604, "text": "The noise that you add will sort of prove that nobody can kind of reverse engineer any particular value that went into the average."}, {"time": 4613, "text": "So noise is a savior."}, {"time": 4616, "text": "How many algorithms can be aided by adding noise?"}, {"time": 4621, "text": "Yeah, so I'm a relatively recent member of the differential privacy community."}, {"time": 4627, "text": "My co author, Aaron Roth is really one of the founders of the field and has done a great deal of work and I've learned a tremendous amount working with him on it."}, {"time": 4635, "text": "It's a pretty grown up field already."}, {"time": 4637, "text": "Yeah, but now it's pretty mature."}, {"time": 4638, "text": "But I must admit, the first time I saw the definition of differential privacy, my reaction was like, wow, that is a clever definition and it's really making very strong promises."}, {"time": 4648, "text": "And I first saw the definition in much earlier days and my first reaction was like, well, my worry about this definition would be that it's a great definition of privacy, but that it'll be so restrictive that we won't really be able to use it."}, {"time": 4663, "text": "We won't be able to compute many things in a differentially private way."}, {"time": 4667, "text": "So that's one of the great successes of the field, I think, is in showing that the opposite is true and that most things that we know how to compute, absent any privacy considerations, can be computed in a differentially private way."}, {"time": 4682, "text": "So for example, pretty much all of statistics and machine learning can be done differentially privately."}, {"time": 4689, "text": "So pick your favorite machine learning algorithm, back propagation and neural networks, cart for decision trees, support vector machines, boosting, you name it, as well as classic hypothesis testing and the like in statistics."}, {"time": 4704, "text": "None of those algorithms are differentially private in their original form."}, {"time": 4709, "text": "All of them have modifications that add noise to the computation in different places in different ways that achieve differential privacy."}, {"time": 4719, "text": "So this really means that to the extent that we've become a scientific community very dependent on the use of machine learning and statistical modeling and data analysis, we really do have a path to provide privacy guarantees to those methods and so we can still enjoy the benefits of the data science era while providing rather robust privacy guarantees to individuals."}, {"time": 4750, "text": "So perhaps a slightly crazy question, but if we take the ideas of differential privacy and take it to the nature of truth that's being explored currently."}, {"time": 4760, "text": "So what's your most favorite and least favorite food?"}, {"time": 4765, "text": "I'm not a real foodie, so I'm a big fan of spaghetti."}, {"time": 4769, "text": "Spaghetti?"}, {"time": 4771, "text": "What do you really don't like?"}, {"time": 4775, "text": "I really don't like cauliflower."}, {"time": 4777, "text": "Wow, I love cauliflower."}, {"time": 4780, "text": "Is there one way to protect your preference for spaghetti by having an information campaign bloggers and so on of bots saying that you like cauliflower?"}, {"time": 4791, "text": "So like this kind of the same kind of noise ideas, I mean if you think of in our politics today there's this idea of Russia hacking our elections."}, {"time": 4801, "text": "What's meant there I believe is bots spreading different kinds of information."}, {"time": 4807, "text": "Is that a kind of privacy or is that too much of a stretch?"}, {"time": 4810, "text": "No it's not a stretch."}, {"time": 4812, "text": "I've not seen those ideas, you know, that is not a technique that to my knowledge will provide differential privacy, but to give an example like one very specific example about what you're discussing is there was a very interesting project at NYU I think led by Helen Nissenbaum there in which they basically built a browser plugin that tried to essentially obfuscate your Google searches."}, {"time": 4871, "text": "So you know it's like a weed and chaff thing so you know out of every thousand queries let's say that Google was receiving from your browser one of them was one that you put in but the other 999 were not okay so it's the same kind of idea kind of you know privacy by obfuscation."}, {"time": 4889, "text": "So I think that's an interesting idea, doesn't give you differential privacy."}, {"time": 4952, "text": "So where do you think we'll land in this algorithm driven society in terms of privacy?"}, {"time": 4956, "text": "So sort of China like Kai Fuli describes you know it's collecting a lot of data on its citizens but in the best form it's actually able to provide a lot of sort of protect human rights and provide a lot of amazing services and it's worst forms that can violate those human rights and limit services."}, {"time": 4981, "text": "So where do you think we'll land because algorithms are powerful when they use data."}, {"time": 4988, "text": "So as a society do you think we'll give over more data?"}, {"time": 4992, "text": "Is it possible to protect the privacy of that data?"}, {"time": 4996, "text": "So I'm optimistic about the possibility of you know balancing the desire for individual privacy and individual control of privacy with kind of societally and commercially beneficial uses of data not unrelated to differential privacy or suggestions that say like well individuals should have control of their data."}, {"time": 5020, "text": "They should be able to limit the uses of that data."}, {"time": 5023, "text": "They should even you know there's you know fledgling discussions going on in research circles about allowing people selective use of their data and being compensated for it."}, {"time": 5034, "text": "And then you get to sort of very interesting economic questions like pricing right."}, {"time": 5039, "text": "And one interesting idea is that maybe differential privacy would also you know be a conceptual framework in which you could talk about the relative value of different people's data like you know to demystify this a little bit."}, {"time": 5052, "text": "If I'm trying to build a predictive model for some rare disease and I'm trying to use machine learning to do it, it's easy to get negative examples because the disease is rare right."}, {"time": 5063, "text": "But I really want to have lots of people with the disease in my data set okay."}, {"time": 5070, "text": "And so somehow those people's data with respect to this application is much more valuable to me than just like the background population."}, {"time": 5077, "text": "And so maybe they should be compensated more for it."}, {"time": 5083, "text": "And so you know I think these are kind of very, very fledgling conceptual questions that maybe we'll have kind of technical thought on them sometime in the coming years."}, {"time": 5094, "text": "But I do think we'll you know to kind of get more directly answer your question."}, {"time": 5096, "text": "I think I'm optimistic at this point from what I've seen that we will land at some you know better compromise than we're at right now where again you know privacy guarantees are few far between and weak and users have very, very little control."}, {"time": 5115, "text": "And I'm optimistic that we'll land in something that you know provides better privacy overall and more individual control of data and privacy."}, {"time": 5122, "text": "But you know I think to get there it's again just like fairness it's not going to be enough to propose algorithmic solutions."}, {"time": 5129, "text": "There's going to have to be a whole kind of regulatory legal process that prods companies and other parties to kind of adopt solutions."}, {"time": 5138, "text": "And I think you've mentioned the word control a lot and I think giving people control that's something that people don't quite have in a lot of these algorithms and that's a really interesting idea of giving them control."}, {"time": 5150, "text": "Some of that is actually literally an interface design question sort of just enabling because I think it's good for everybody to give users control."}, {"time": 5160, "text": "It's almost not a trade off except that you have to hire people that are good at interface design."}, {"time": 5168, "text": "I mean the other thing that has to be said right is that you know it's a cliche but you know we as the users of many systems platforms and apps you know we are the product."}, {"time": 5181, "text": "We are not the customer."}, {"time": 5183, "text": "The customer are advertisers and our data is the product."}, {"time": 5187, "text": "So it's one thing to kind of suggest more individual control of data and privacy and uses but this you know if this happens in sufficient degree it will upend the entire economic model that has supported the internet to date."}, {"time": 5204, "text": "And so some other economic model will have to be you know we'll have to replace it."}, {"time": 5210, "text": "So the idea of markets you mentioned by exposing the economic model to the people they will then become a market."}, {"time": 5217, "text": "They could be participants in it."}, {"time": 5220, "text": "And you know this isn't you know this is not a weird idea right because there are markets for data already."}, {"time": 5225, "text": "It's just that consumers are not participants and there's like you know there's sort of you know publishers and content providers on one side that have inventory and then their advertisers on the others and you know you know Google and Facebook are running you know they're pretty much their entire revenue stream is by running two sided markets between those parties right."}, {"time": 5247, "text": "And so it's not a crazy idea that there would be like a three sided market or that you know that on one side of the market or the other we would have proxies representing our interest."}, {"time": 5257, "text": "It's not you know it's not a crazy idea but it would it's not a crazy technical idea but it would have pretty extreme economic consequences."}, {"time": 5269, "text": "Speaking of markets a lot of fascinating aspects of this world arise not from individual human beings but from the interaction of human beings."}, {"time": 5279, "text": "You've done a lot of work in game theory."}, {"time": 5282, "text": "First can you say what is game theory and how does it help us model and study?"}, {"time": 5287, "text": "Yeah game theory of course let us give credit where it's due."}, {"time": 5291, "text": "You know it comes from the economist first and foremost but as I've mentioned before like you know computer scientists never hesitate to wander into other people's turf and so there is now this 20 year old field called algorithmic game theory."}, {"time": 5306, "text": "But you know game theory first and foremost is a mathematical framework for reasoning about collective outcomes in systems of interacting individuals."}, {"time": 5320, "text": "You know so you need at least two people to get started in game theory and many people are probably familiar with Prisoner's Dilemma as kind of a classic example of game theory and a classic example where everybody looking out for their own individual interests leads to a collective outcome that's kind of worse for everybody than what might be possible if they cooperated for example."}, {"time": 5345, "text": "But cooperation is not an equilibrium in Prisoner's Dilemma."}, {"time": 5379, "text": "So what to you is the most beautiful idea that you've encountered in game theory?"}, {"time": 5387, "text": "There's a lot of them."}, {"time": 5388, "text": "I'm a big fan of the field."}, {"time": 5390, "text": "I mean you know I mean technical answers to that of course would include Nash's work just establishing that you know there is a competitive equilibrium under very very general circumstances which in many ways kind of put the field on a firm conceptual footing because if you don't have equilibrium it's kind of hard to ever reason about what might happen since you know there's just no stability."}, {"time": 5416, "text": "So just the idea that stability can emerge when there's multiple."}, {"time": 5420, "text": "Not that it will necessarily emerge just that it's possible right."}, {"time": 5423, "text": "Like the existence of equilibrium doesn't mean that sort of natural iterative behavior will necessarily lead to it."}, {"time": 5430, "text": "In the real world."}, {"time": 5481, "text": "So you kind of mentioned acting greedily can somehow end up pretty good for everybody."}, {"time": 5490, "text": "Or pretty bad."}, {"time": 5493, "text": "It will end up stable."}, {"time": 5496, "text": "And and you know stability or equilibrium by itself is neither is not necessarily either a good thing or a bad thing."}, {"time": 5503, "text": "So what's the connection between machine learning and the ideas."}, {"time": 5505, "text": "Well I think we kind of talked about these ideas already in kind of a non technical way which is maybe the more interesting way of understanding them first which is you know we have many systems platforms and apps these days that work really hard to use our data and the data of everybody else on the platform to selfishly optimize on behalf of each user."}, {"time": 5533, "text": "So you know let me let me give I think the cleanest example which is just driving apps navigation apps like you know Google Maps and Waze where you know miraculously compared to when I was growing up at least you know the objective would be the same when you wanted to drive from point A to point B spend the least time driving not necessarily minimize the distance but minimize the time."}, {"time": 5556, "text": "And when I was growing up like the only resources you had to do that were like maps in the car which literally just told you what roads were available and then you might have like half hourly traffic reports just about the major freeways but not about side roads."}, {"time": 5571, "text": "So you were pretty much on your own."}, {"time": 5574, "text": "And now we've got these apps you pull it out and you say I want to go from point A to point B and in response kind of to what everybody else is doing if you like what all the other players in this game are doing right now here's the you know the route that minimizes your driving time."}]}]