[{"title": "Grimes: Music, AI, and the Future of Humanity | Lex Fridman Podcast #281", "id": "KOwm7GUjcg8", "quotes": [{"time": 185, "text": "Well, it's fast enough for us humans because it seems immediate."}, {"time": 190, "text": "There's no delay, there's no latency in terms of us humans on Earth interacting with things."}, {"time": 196, "text": "But if you're like intergalactic species operating on a much larger scale, then you're gonna start noticing some weird stuff."}, {"time": 203, "text": "Or if you can operate in like around a black hole, then you're gonna start to see some render issues."}, {"time": 209, "text": "You can't go faster than the speed of light, correct?"}, {"time": 212, "text": "So it really limits our ability or one's ability to travel space."}, {"time": 216, "text": "Theoretically, you can, you have wormholes."}, {"time": 218, "text": "So there's nothing in general relativity that precludes faster than the speed of light travel."}, {"time": 228, "text": "But it just seems you're gonna have to do some really funky stuff with very heavy things that have like weirdnesses, that have basically terrors in space time."}, {"time": 238, "text": "We don't know how to do that."}, {"time": 239, "text": "Do navigators know how to do it?"}, {"time": 241, "text": "Do navigators?"}, {"time": 243, "text": "Folding space, basically making wormholes."}, {"time": 247, "text": "So the name C. Yes."}, {"time": 254, "text": "Do you think of yourself as multiple people?"}, {"time": 256, "text": "Are you one person?"}, {"time": 258, "text": "Do you know, like in this morning, were you a different person than you are tonight?"}, {"time": 263, "text": "We are, I should say, recording this basically at midnight, which is awesome."}, {"time": 267, "text": "Yes, thank you so much."}, {"time": 269, "text": "I think I'm about eight hours late."}, {"time": 271, "text": "No, you're right on time."}, {"time": 273, "text": "Good morning."}, {"time": 274, "text": "This is the beginning of a new day soon."}, {"time": 277, "text": "Anyway, are you the same person you were in the morning and the evening?"}, {"time": 283, "text": "Is there multiple people in there?"}, {"time": 284, "text": "Do you think of yourself as one person?"}, {"time": 286, "text": "Or maybe you have no clue?"}, {"time": 287, "text": "Or are you just a giant mystery to yourself?"}, {"time": 290, "text": "Okay, these are really intense questions, but."}, {"time": 292, "text": "Let's go, let's go."}, {"time": 293, "text": "Because I asked this myself, like look in the mirror, who are you?"}, {"time": 296, "text": "People tell you to just be yourself, but what does that even mean?"}, {"time": 299, "text": "I mean, I think my personality changes with everyone I talk to."}, {"time": 302, "text": "So I have a very inconsistent personality."}, {"time": 307, "text": "Person to person, so the interaction, your personality materializes."}, {"time": 311, "text": "Or my mood."}, {"time": 312, "text": "Like I'll go from being like a megalomaniac to being like, you know, just like a total hermit who is very shy."}, {"time": 321, "text": "So some combinatorial combination of your mood and the person you're interacting with."}, {"time": 326, "text": "Yeah, mood and people I'm interacting with."}, {"time": 328, "text": "But I think everyone's like that."}, {"time": 330, "text": "Well, not everybody acknowledges it and able to introspect it."}, {"time": 334, "text": "Who brings out, what kind of person, what kind of mood brings out the best in you?"}, {"time": 338, "text": "As an artist and as a human."}, {"time": 340, "text": "Can you introspect this?"}, {"time": 341, "text": "Like my best friends, like people I can, when I'm like super confident and I know that they're gonna understand everything I'm saying, so like my best friends, then when I can start being really funny, that's always my like peak mode."}, {"time": 357, "text": "But it's like, yeah, takes a lot to get there."}, {"time": 360, "text": "Let's talk about constraints."}, {"time": 362, "text": "You've talked about constraints and limits."}, {"time": 366, "text": "Do those help you out as an artist or as a human being?"}, {"time": 369, "text": "Or do they get in the way?"}, {"time": 370, "text": "Do you like the constraints?"}, {"time": 371, "text": "So in creating music, in creating art, in living life, do you like the constraints that this world puts on you?"}, {"time": 381, "text": "Or do you hate them?"}, {"time": 384, "text": "If constraints are moving, then you're good, right?"}, {"time": 389, "text": "Like it's like as we are progressing with technology, we're changing the constraints of like artistic creation."}, {"time": 394, "text": "You know, making video and music and stuff is getting a lot cheaper."}, {"time": 399, "text": "There's constantly new technology and new software that's making it faster and easier."}, {"time": 404, "text": "We have so much more freedom than we had in the 70s."}, {"time": 406, "text": "Like when Michael Jackson, you know, when they recorded Thriller with this microphone, like they had to use a mixing desk and all this stuff."}, {"time": 414, "text": "And like probably even get in a studio, it's probably really expensive and you have to be a really good singer and you have to know how to use like the mixing desk and everything."}, {"time": 420, "text": "And now I can just, you know, make I've made a whole album on this computer."}, {"time": 425, "text": "I have a lot more freedom, but then I'm also constrained in different ways because there's like literally millions more artists."}, {"time": 433, "text": "It's like a much bigger playing field."}, {"time": 435, "text": "It's just like, I also, I didn't learn music."}, {"time": 438, "text": "I'm not a natural musician."}, {"time": 440, "text": "So I don't know anything about actual music."}, {"time": 442, "text": "I just know about like the computer."}, {"time": 444, "text": "So I'm really kind of just like messing around and like trying things out."}, {"time": 453, "text": "Well, yeah, I mean, but the nature of music is changing."}, {"time": 455, "text": "So you're saying you don't know actual music, what music is changing."}, {"time": 459, "text": "Music is becoming, you've talked about this, is becoming, it's like merging with technology."}, {"time": 467, "text": "It's becoming something more than just like the notes on a piano."}, {"time": 473, "text": "It's becoming some weird composition that requires engineering skills, programming skills, some kind of human robot interaction skills, and still some of the same things that Michael Jackson had, which is like a good ear for a good sense of taste of what's good and not the final thing when it's put together."}, {"time": 491, "text": "Like you're allowed, you're enabled, empowered with a laptop to layer stuff, to start like layering insane amounts of stuff."}, {"time": 500, "text": "And it's super easy to do that."}, {"time": 502, "text": "I do think music production is a really underrated art form."}, {"time": 505, "text": "I feel like people really don't appreciate it."}, {"time": 506, "text": "When I look at publishing splits, the way that people like pay producers and stuff, it's super, producers are just deeply underrated."}, {"time": 515, "text": "Like so many of the songs that are popular right now or for the last 20 years, like part of the reason they're popular is because the production is really interesting or really sick or really cool."}, {"time": 525, "text": "And it's like, I don't think listeners, like people just don't really understand what music production is."}, {"time": 534, "text": "It's not, it's sort of like this weird, discombobulated art form."}, {"time": 539, "text": "It's not like a formal, because it's so new, there isn't like a formal training path for it."}, {"time": 546, "text": "It's mostly driven by like autodidacts."}, {"time": 550, "text": "Like it's like almost everyone I know who's good at production, like they didn't go to music school or anything."}, {"time": 553, "text": "They just taught themselves."}, {"time": 555, "text": "Are they're mostly different?"}, {"time": 556, "text": "Like the music producers, you know, is there some commonalities that time together or are they all just different kinds of weirdos?"}, {"time": 563, "text": "Cause I just, I just hung out with Rick Rubin."}, {"time": 565, "text": "I don't know if you've."}, {"time": 566, "text": "Yeah, I mean, Rick Rubin is like literally one of the gods of music production."}, {"time": 571, "text": "Like he's one of the people who first, you know, who like made music production, you know, made the production as important as the actual lyrics or the notes."}, {"time": 581, "text": "But the thing he does, which is interesting, I don't know if you can speak to that, but just hanging out with him, he seems to just sit there in silence, close his eyes and listen."}, {"time": 590, "text": "It's like, he almost does nothing."}, {"time": 593, "text": "And that nothing somehow gives you freedom to be the best version of yourself."}, {"time": 598, "text": "So that's music production somehow too, which is like encouraging you to do less, to simplify, to like push towards minimalism."}, {"time": 606, "text": "I mean, I guess, I mean, I work differently from Rick Rubin cause Rick Rubin produces for other artists, whereas like I mostly produce for myself."}, {"time": 617, "text": "So it's a very different situation."}, {"time": 619, "text": "I also think Rick Rubin, he's in that, I would say advanced category of producer where like you've like earned your, you can have an engineer and stuff and people like do the stuff for you."}, {"time": 629, "text": "But I usually just like do stuff myself."}, {"time": 632, "text": "So you're the engineer, the producer and the artist."}, {"time": 638, "text": "Yeah, I guess I would say I'm in the era, like the post Rick Rubin era."}, {"time": 641, "text": "Like I come from the kind of like Skrillex school of thought, which is like where you are."}, {"time": 649, "text": "Yeah, the engineer, producer, artist."}, {"time": 651, "text": "Like where, I mean lately, sometimes I'll work with a producer now."}, {"time": 655, "text": "I'm gently sort of delicately starting to collaborate a bit more, but like I think I'm kind of from the, like the whatever 2010s explosion of things where everything became available on the computer and you kind of got this like lone wizard energy thing going."}, {"time": 676, "text": "So you embraced being the loneliness."}, {"time": 679, "text": "Is the loneliness somehow an engine of creativity?"}, {"time": 682, "text": "Like, so most of your stuff, most of your creative quote unquote genius in quotes is in the privacy of your mind."}, {"time": 692, "text": "Yes, well, it was, but here's the thing."}, {"time": 699, "text": "I was talking to Daniel Eck and he said, he's like most artists, they have about 10 years, like 10 good years."}, {"time": 705, "text": "And then they usually stop making their like vital shit."}, {"time": 709, "text": "And I feel like I'm sort of like nearing the end of my 10 years on my own."}, {"time": 716, "text": "So you have to become somebody else."}, {"time": 718, "text": "Now I'm like, I'm in the process of becoming somebody else and reinventing."}, {"time": 721, "text": "When I work with other people, because I've never worked with other people, I find that I make like, that I'm exceptionally rejuvenated and making like some of the most vital work I've ever made."}, {"time": 730, "text": "So, because I think another human brain is like one of the best tools you can possibly find."}, {"time": 738, "text": "It's a funny way to put it, I love it."}, {"time": 740, "text": "It's like if a tool is like, you know, whatever HP plus one or like adds some like stats to your character, like another human brain will like square it instead of just like adding something."}, {"time": 754, "text": "Double up the experience points, I love this."}, {"time": 756, "text": "We should also mention we're playing Tavern music before this and which I love, which I first, I think I first."}, {"time": 762, "text": "You had to stop the Tavern music."}, {"time": 763, "text": "Yeah, because it doesn't, the audio."}, {"time": 767, "text": "But it makes."}, {"time": 768, "text": "Yeah, it'll make the podcast annoying."}, {"time": 768, "text": "Add it in post, add it in post."}, {"time": 770, "text": "No one will want to listen to the podcast."}, {"time": 771, "text": "They probably would, but it makes me, it reminds me like of a video game, like a role playing video game where you have experience points."}, {"time": 778, "text": "There's something really joyful about wandering places like Elder Scrolls, like Skyrim, just exploring these landscapes in another world and then you get experience points and you can work on different skills and somehow you progress in life."}, {"time": 796, "text": "I don't know, it's simple."}, {"time": 797, "text": "It doesn't have some of the messy complexities of life and there's usually a bad guy you can fight in Skyrim."}, {"time": 803, "text": "It's dragons and so on."}, {"time": 805, "text": "I'm sure in Elden Ring, there's a bunch of monsters you can fight."}, {"time": 834, "text": "Well, you're saying they don't get enough credit."}, {"time": 837, "text": "Aren't you kind of changing that by becoming the person doing everything?"}, {"time": 841, "text": "Aren't you, isn't the engineer?"}, {"time": 843, "text": "Well, I mean, others have gone before me."}, {"time": 873, "text": "Like Rules by Dua Lipa or something."}, {"time": 876, "text": "The production on that is actually like really crazy."}, {"time": 879, "text": "I mean, the song is also great, but it's like the production is exceptionally memorable."}, {"time": 883, "text": "Like, you know, and it's just like no one, I can't, I don't even know who produced that song."}, {"time": 889, "text": "It's just like, isn't part of like the rhetoric of how we just discuss the creation of art."}, {"time": 893, "text": "We just sort of like don't consider the music producer because I think the music producer used to be more just simply recording things."}, {"time": 903, "text": "Yeah, that's interesting because when you think about movies, we talk about the actor and the actresses, but we also talk about the directors."}, {"time": 911, "text": "We don't talk about like that with the music as often."}, {"time": 915, "text": "The Beatles music producer was one of the first kind of guy, one of the first people sort of introducing crazy sound design into pop music."}, {"time": 922, "text": "I forget his name."}, {"time": 924, "text": "He has the same, I forget his name, but you know, like he was doing all the weird stuff like dropping pianos and like, yeah."}, {"time": 932, "text": "Oh, to get the, yeah, yeah, yeah, to get the sound, to get the authentic sound."}, {"time": 936, "text": "What about lyrics?"}, {"time": 938, "text": "You think those, where did they fit into how important they are?"}, {"time": 942, "text": "I was heartbroken to learn that Elvis didn't write his songs."}, {"time": 946, "text": "I was very mad."}, {"time": 947, "text": "A lot of people don't write their songs."}, {"time": 949, "text": "I understand this, but."}, {"time": 952, "text": "I feel like there's this desire for authenticity."}, {"time": 954, "text": "I used to be like really mad when like people wouldn't write or produce their music and I'd be like, that's fake."}, {"time": 959, "text": "And then I realized there's all this like weird bitterness and like agronus in art about authenticity."}, {"time": 967, "text": "But I had this kind of like weird realization recently where I started thinking that like art is sort of a decentralized collective thing."}, {"time": 980, "text": "Like art is kind of a conversation with all the artists that have ever lived before you."}, {"time": 988, "text": "You know, like it's like, you're really just sort of, it's not like anyone's reinventing the wheel here."}, {"time": 993, "text": "Like you're kind of just taking, you know, thousands of years of art and like running it through your own little algorithm and then like making your interpretation of it."}, {"time": 1005, "text": "You just joined the conversation with all the other artists that came before."}, {"time": 1007, "text": "It's just a beautiful way to look at it."}, {"time": 1009, "text": "Like, and it's like, I feel like everyone's always like, there's all this copyright and IP and this and that or authenticity."}, {"time": 1015, "text": "And it's just like, I think we need to stop seeing this as this like egotistical thing of like, oh, the creative genius, the lone creative genius or this or that."}, {"time": 1025, "text": "Because it's like, I think art shouldn't be about that."}, {"time": 1028, "text": "I think art is something that sort of brings humanity together."}, {"time": 1032, "text": "And it's also, art is also kind of the collective memory of humans."}, {"time": 1034, "text": "It's like, we don't give a fuck about whatever ancient Egypt, like how much grain got sent that day and sending the records and like, you know, like who went where and, you know, how many shields needed to be produced for this."}, {"time": 1049, "text": "Like we just remember their art."}, {"time": 1052, "text": "And it's like, you know, it's like in our day to day life, there's all this stuff that seems more important than art because it helps us function and survive."}, {"time": 1060, "text": "But when all this is gone, like the only thing that's really gonna be left is the art."}, {"time": 1065, "text": "The technology will be obsolete."}, {"time": 1067, "text": "Like the humans will be dead."}, {"time": 1069, "text": "A good compression of human history is the art we've generated across the different centuries, the different millennia."}, {"time": 1077, "text": "So when the aliens come."}, {"time": 1079, "text": "When the aliens come, they're gonna find the hieroglyphics and the pyramids."}, {"time": 1082, "text": "I mean, art could be broadly defined."}, {"time": 1084, "text": "They might find like the engineering marvels, the bridges, the rockets, the."}, {"time": 1089, "text": "I guess I sort of classify though."}, {"time": 1091, "text": "Architecture is art too."}, {"time": 1093, "text": "I consider engineering in those formats to be art, for sure."}, {"time": 1099, "text": "It sucks that like digital art is easier to delete."}, {"time": 1103, "text": "So if there's an apocalypse, a nuclear war, that can disappear."}, {"time": 1108, "text": "And the physical."}, {"time": 1108, "text": "There's something still valuable about the physical manifestation of art."}, {"time": 1112, "text": "That sucks that like music, for example, has to be played by somebody."}, {"time": 1117, "text": "Yeah, I do think we should have a foundation type situation where we like, you know how we have like seed banks up in the north and stuff?"}, {"time": 1125, "text": "Like we should probably have like a solar powered or geothermal little bunker that like has all human knowledge."}, {"time": 1132, "text": "You mentioned Daniel Ek and Spotify."}, {"time": 1135, "text": "What do you think about that as an artist?"}, {"time": 1138, "text": "Is that empowering?"}, {"time": 1140, "text": "To me, Spotify as a consumer is super exciting."}, {"time": 1142, "text": "It makes it easy for me to access music from all kinds of artists, get to explore all kinds of music, make it super easy to sort of curate my own playlist and have fun with all that."}, {"time": 1153, "text": "It was so liberating to let go."}, {"time": 1156, "text": "You know, I used to collect, you know, albums and CDs and so on, like horde albums."}, {"time": 1162, "text": "Like they matter."}, {"time": 1163, "text": "But the reality you could, you know, that was really liberating that I could let go of that."}, {"time": 1168, "text": "And letting go of the albums you're kind of collecting allows you to find new music, exploring new artists and all that kind of stuff."}, {"time": 1176, "text": "But I know from a perspective of an artist that could be, like you mentioned, competition could be a kind of constraint because there's more and more and more artists on the platform."}, {"time": 1186, "text": "I think it's better that there's more artists."}, {"time": 1187, "text": "I mean, again, this might be propaganda because this is all from a conversation with Daniel Ek."}, {"time": 1191, "text": "So this could easily be propaganda."}, {"time": 1194, "text": "We're all a victim of somebody's propaganda."}, {"time": 1196, "text": "So let's just accept this."}, {"time": 1198, "text": "But Daniel Ek was telling me that, you know, at the, because I, you know, when I met him, I came in all furious about Spotify and like I grilled him super hard."}, {"time": 1207, "text": "So I've got his answers here."}, {"time": 1210, "text": "But he was saying like at the sort of peak of the CD industry, there was like 20,000 artists making millions and millions of dollars."}, {"time": 1219, "text": "Like there was just like a very tiny kind of 1%."}, {"time": 1222, "text": "And Spotify has kind of democratized the industry because now I think he said there's about a million artists making a good living from Spotify."}, {"time": 1233, "text": "And when I heard that, I was like, honestly, I would rather make less money and have just like a decent living and have more artists be able to have that, even though I like, I wish it could include everyone, but."}, {"time": 1249, "text": "Yeah, that's really hard to argue with."}, {"time": 1250, "text": "YouTube is the same."}, {"time": 1252, "text": "It's YouTube's mission."}, {"time": 1254, "text": "They want to basically have as many creators as possible and make a living, some kind of living."}, {"time": 1260, "text": "And that's so hard to argue with."}, {"time": 1263, "text": "But I think there's better ways to do it."}, {"time": 1264, "text": "My manager, I actually wish he was here."}, {"time": 1266, "text": "Like I would have brought him up."}, {"time": 1267, "text": "My manager is building an app that can manage you."}, {"time": 1273, "text": "So it'll like help you organize your percentages and get your publishing and dah, dah, dah, dah, dah."}, {"time": 1278, "text": "So you can take out all the middlemen so you can have a much bigger, it'll just like automate it."}, {"time": 1283, "text": "So you can get."}, {"time": 1283, "text": "So automate the manager?"}, {"time": 1284, "text": "Automate management, publishing, and legal, it can read, the app he's building can read your contract and like tell you about it."}, {"time": 1295, "text": "Because one of the issues with music right now, it's not that we're not getting paid enough, but it's that the art industry is filled with middlemen because artists are not good at business."}, {"time": 1307, "text": "And from the beginning, like Frank Sinatra, it's all mob stuff."}, {"time": 1311, "text": "Like it's the music industry is run by business people, not the artists and the artists really get very small cuts of like what they make."}, {"time": 1320, "text": "And so I think part of the reason I'm a technocrat, which I mean, your fans are gonna be technocrats."}, {"time": 1327, "text": "So no one's, they're not gonna be mad at me about this, but like my fans hate it when I say this kind of thing or the general public."}, {"time": 1333, "text": "They don't like technocrats."}, {"time": 1335, "text": "Like when I watched Battle Angel Alita and they were like the Martian technocracy and I was like, yeah, Martian technocracy."}, {"time": 1342, "text": "And then they were like, and they're evil."}, {"time": 1343, "text": "And I was like, oh, okay."}, {"time": 1345, "text": "I was like, cause Martian technocracy sounds sick to me."}, {"time": 1348, "text": "Yeah, so your intuition as technocrats would create some kind of beautiful world."}, {"time": 1381, "text": "It can remove some of the bureaucracy, some of the inefficiencies that make life not as great as it could be."}, {"time": 1388, "text": "Yeah, I think the issue isn't that there's not enough."}, {"time": 1390, "text": "Like the issue is that there's inefficiency and I'm really into this positive sum mindset, you know, the win, win mindset of like, instead of, you know, fighting over the scraps, how do we make the, or worrying about scarcity, like instead of a scarcity mindset, why don't we just increase the efficiency and, you know, in that way."}, {"time": 1412, "text": "Expand the size of the pie."}, {"time": 1414, "text": "Let me ask you about experimentation."}, {"time": 1416, "text": "So you said, which is beautiful, being a musician is like having a conversation with all those that came before you."}, {"time": 1425, "text": "How much of creating music is like kind of having that conversation, trying to fit into the cultural trends and how much of it is like trying to, as much as possible, be an outsider and come up with something totally new."}, {"time": 1442, "text": "It's like when you're thinking, when you're experimenting, are you trying to be totally different, totally weird?"}, {"time": 1448, "text": "Are you trying to fit in?"}, {"time": 1452, "text": "Man, this is so hard because I feel like I'm kind of in the process of semi retiring from music, so this is like my old brain."}, {"time": 1458, "text": "Yeah, bring it from like the shelf, put it on the table for a couple minutes, we'll just poke it."}, {"time": 1466, "text": "I think it's a bit of both because I think forcing yourself to engage with new music is really great for neuroplasticity."}, {"time": 1475, "text": "Like I think, you know, as people, part of the reason music is marketed at young people is because young people are very neuroplastic."}, {"time": 1483, "text": "So like if you're 16 to like 23 or whatever, it's gonna be really easy for you to love new music."}, {"time": 1490, "text": "And if you're older than that, it gets harder and harder and harder."}, {"time": 1493, "text": "And I think one of the beautiful things about being a musician is I just constantly force myself to listen to new music and I think it keeps my brain really plastic."}, {"time": 1501, "text": "And I think this is a really good exercise."}, {"time": 1502, "text": "I just think everyone should do this."}, {"time": 1504, "text": "You listen to new music and you hate it, I think you should just keep, force yourself to like, okay, well why do people like it?"}, {"time": 1509, "text": "And like, you know, make your brain form new neural pathways and be more open to change."}, {"time": 1516, "text": "That's really brilliant actually."}, {"time": 1518, "text": "Sorry to interrupt, but like that exercise is really amazing to sort of embrace change, embrace sort of practice neuroplasticity."}, {"time": 1531, "text": "Because like that's one of the things, you fall in love with a certain band and you just kind of stay with that for the rest of your life and then you never understand the modern music."}, {"time": 1538, "text": "That's a really good exercise."}, {"time": 1539, "text": "Most of the streaming on Spotify is like classic rock and stuff."}, {"time": 1542, "text": "Like new music makes up a very small chunk of what is played on Spotify."}, {"time": 1546, "text": "And I think this is like not a good sign for us as a species."}, {"time": 1552, "text": "So it's a good measure of the species open mindedness to change is how often you listen to new music."}, {"time": 1561, "text": "The brain, let's put the music brain back on the shelf."}, {"time": 1565, "text": "I gotta pull out the futurist brain for a second."}, {"time": 1569, "text": "In what wild ways do you think the future, say in like 30 years, maybe 50 years, maybe a hundred years will be different from our current way of life on earth?"}, {"time": 1582, "text": "We can talk about augmented reality, virtual reality, maybe robots, maybe space travel, maybe video games, maybe genetic engineering."}, {"time": 1592, "text": "I can keep going."}, {"time": 1593, "text": "Cyborgs, aliens, world wars, maybe destructive nuclear wars, good and bad."}, {"time": 1599, "text": "When you think about the future, what are you imagining?"}, {"time": 1603, "text": "What's the weirdest and the wildest it could be?"}, {"time": 1607, "text": "Have you read Surface Detail by Iain Banks?"}, {"time": 1611, "text": "Surface Detail is my favorite depiction of a, oh wow, you have to read this book."}, {"time": 1616, "text": "It's literally the greatest science fiction book possibly ever written."}, {"time": 1619, "text": "Iain Banks is the man, yeah, for sure."}, {"time": 1621, "text": "What have you read?"}, {"time": 1623, "text": "Just the Player of Games."}, {"time": 1624, "text": "I read that titles can't be copyrighted so you can just steal them."}, {"time": 1628, "text": "And I was like, Player of Games, sick."}, {"time": 1630, "text": "Yeah, so you can name your album."}, {"time": 1632, "text": "Like I always wanted to."}, {"time": 1633, "text": "Romeo and Juliet or something."}, {"time": 1635, "text": "I always wanted to name an album War and Peace."}, {"time": 1637, "text": "Like that would be, like you."}, {"time": 1638, "text": "That is a good, that's a good, where have I heard that before?"}, {"time": 1641, "text": "You can do that, like you could do that."}, {"time": 1644, "text": "Also things that are in the public domain."}, {"time": 1646, "text": "For people who have no clue, you do have a song called Player of Games."}, {"time": 1649, "text": "Yes, oh yeah."}, {"time": 1650, "text": "So Iain Banks, Surface Detail is in my opinion the best future that I've ever read about or heard about in science fiction."}, {"time": 1659, "text": "Basically there's the relationship with super intelligence, like artificial super intelligence is just, it's like great."}, {"time": 1670, "text": "I want to credit the person who coined this term because I love this term."}, {"time": 1675, "text": "And I feel like young women don't get enough credit in."}, {"time": 1680, "text": "Yeah, so if you go to Protopia Futures on Instagram, what is her name?"}, {"time": 1685, "text": "Personalized donor experience at scale, our AI power donor experience."}, {"time": 1688, "text": "Monica Bealskite, I'm saying that wrong."}, {"time": 1695, "text": "And I'm probably gonna, I'm probably butchering this a bit, but Protopia is sort of, if utopia is unattainable, Protopia is sort of like, you know."}, {"time": 1706, "text": "Wow, that's an awesome Instagram, Protopia Futures."}, {"time": 1708, "text": "A great, a future that is, you know, as good as we can get."}, {"time": 1713, "text": "The future, positive future."}, {"time": 1714, "text": "AI, is this a centralized AI in Surface Detail or is it distributed?"}, {"time": 1719, "text": "What kind of AI is it?"}, {"time": 1720, "text": "They mostly exist as giant super ships, like sort of like the guild ships in Dune."}, {"time": 1725, "text": "Like they're these giant ships that kind of move people around and the ships are sentient and they can talk to all the passengers."}, {"time": 1732, "text": "And I mean, there's a lot of different types of AI in the Banksyan future, but in the opening scene of Surface Detail, there's this place called the Culture and the Culture is basically a Protopian future."}, {"time": 1744, "text": "And a Protopian future, I think, is like a future that is like, obviously it's not utopia, it's not perfect."}, {"time": 1752, "text": "And like, cause like striving for utopia, I think feels hopeless and it's sort of like, maybe not the best terminology to be using."}, {"time": 1760, "text": "So it's like, it's a pretty good place."}, {"time": 1763, "text": "Like mostly like, you know, super intelligence and biological beings exist fairly in harmony."}, {"time": 1771, "text": "There's not too much war."}, {"time": 1773, "text": "There's like as close to equality as you can get, you know, it's like approximately a good future."}, {"time": 1778, "text": "Like there's really awesome stuff."}, {"time": 1780, "text": "It's, and in the opening scene, this girl, she's born as a sex slave outside of the culture."}, {"time": 1789, "text": "So she's in a society that doesn't adhere to the cultural values."}, {"time": 1792, "text": "She tries to kill the guy who is her like master, but he kills her, but unbeknownst to her, when she was traveling on a ship through the culture with him one day, a ship put a neural lace in her head and neural lace is sort of like, it's basically a Neuralink because life imitates art."}, {"time": 1813, "text": "It does indeed."}, {"time": 1815, "text": "So she wakes up and the opening scene is her memory has been uploaded by this neural lace when she has been killed."}, {"time": 1820, "text": "And now she gets to choose a new body."}, {"time": 1822, "text": "And this AI is interfacing with her recorded memory in her neural lace and helping her and being like, hello, you're dead."}, {"time": 1831, "text": "But because you had a neural lace, your memory's uploaded."}, {"time": 1833, "text": "Do you want to choose a new body?"}, {"time": 1834, "text": "And you're going to be born here in the culture and like start a new life, which is just, that's like the opening."}, {"time": 1839, "text": "It's like so sick."}, {"time": 1841, "text": "And the ship is the super intelligence."}, {"time": 1843, "text": "All the ships are kind of super intelligence."}, {"time": 1845, "text": "But they still want to preserve a kind of rich, fulfilling experience for the humans."}, {"time": 1849, "text": "Yeah, like they're like friends with the humans."}, {"time": 1851, "text": "And then there's a bunch of ships that don't want to exist with biological beings, but they just have their own place like way over there."}, {"time": 1857, "text": "But they don't, they just do their own thing."}, {"time": 1858, "text": "They're not necessarily."}, {"time": 1860, "text": "So it's a pretty, this protopian existence is pretty peaceful."}, {"time": 1863, "text": "Yeah, I mean, and then, for example, one of the main fights in the book is they're fighting, there's these artificial hells that, and people don't think it's ethical to have artificial hell."}, {"time": 1877, "text": "Like basically when people do crime, they get sent, like when they die, their memory gets sent to an artificial hell and they're eternally tortured."}, {"time": 1883, "text": "And so, and then the way that society is deciding whether or not to have the artificial hell is that they're having these simulated, they're having like a simulated war."}, {"time": 1893, "text": "So instead of actual blood, you know, people are basically essentially fighting in a video game to choose the outcome of this."}, {"time": 1900, "text": "But they're still experiencing the suffering in this artificial hell or no?"}, {"time": 1904, "text": "Can you experience stuff or?"}, {"time": 1905, "text": "So the artificial hell sucks."}, {"time": 1907, "text": "And a lot of people in the culture want to get rid of the artificial hell."}, {"time": 1909, "text": "There's a simulated wars, are they happening in the artificial hell?"}, {"time": 1913, "text": "So no, the simulated wars are happening outside of the artificial hell, between the political factions who are, so this political faction says we should have simulated hell to deter crime."}, {"time": 1925, "text": "And this political faction is saying, no, simulated hell is unethical."}, {"time": 1928, "text": "And so instead of like having, you know, blowing each other up with nukes, they're having like a giant Fortnite battle to decide this, which, you know, to me that's protopia."}, {"time": 1941, "text": "That's like, okay, we can have war without death."}, {"time": 1945, "text": "You know, I don't think there should be simulated hells."}, {"time": 1947, "text": "I think that is definitely one of the ways in which technology could go very, very, very, very wrong."}, {"time": 1954, "text": "So almost punishing people in a digital space or something like that."}, {"time": 1957, "text": "Yeah, like torturing people's memories."}, {"time": 1961, "text": "So either as a deterrent, like if you committed a crime, but also just for personal pleasure, if there's some sick, demented humans in this world."}, {"time": 1970, "text": "Dan Carlin actually has this episode of Hardcore History on painful attainment."}, {"time": 1979, "text": "Oh, that episode is fucked."}, {"time": 1982, "text": "It's dark, because he kind of goes through human history and says like, we as humans seem to enjoy, secretly enjoy or used to be openly enjoy sort of the torture and the death, watching the death and torture of other humans."}, {"time": 1997, "text": "I do think if people were consenting, we should be allowed to have gladiatorial matches."}, {"time": 2006, "text": "But consent is hard to achieve in those situations."}, {"time": 2008, "text": "It always starts getting slippery."}, {"time": 2011, "text": "Like it could be also forced consent, like it starts getting weird."}, {"time": 2015, "text": "There's way too much excitement."}, {"time": 2017, "text": "Like this is what he highlights."}, {"time": 2018, "text": "There's something about human nature that wants to see that violence."}, {"time": 2022, "text": "And it's really dark."}, {"time": 2024, "text": "And you hope that we can sort of overcome that aspect of human nature, but that's still within us somewhere."}, {"time": 2031, "text": "Well, I think that's what we're doing right now."}, {"time": 2033, "text": "I have this theory that what is very important about the current moment is that all of evolution has been survival of the fittest up until now."}, {"time": 2043, "text": "And at some point, the lines are kind of fuzzy, but in the recent past, or maybe even just right now, we're getting to this point where we can choose intelligent design."}, {"time": 2059, "text": "Like we probably since like the integration of the iPhone, like we are becoming cyborgs."}, {"time": 2064, "text": "Like our brains are fundamentally changed."}, {"time": 2067, "text": "Everyone who grew up with electronics, we are fundamentally different from previous, from homo sapiens."}, {"time": 2073, "text": "I call us homo techno."}, {"time": 2074, "text": "I think we have evolved into homo techno, which is like essentially a new species."}, {"time": 2079, "text": "Like if you look at the way, if you took an MRI of my brain and you took an MRI of like a medieval brain, I think it would be very different the way that it has evolved."}, {"time": 2089, "text": "Do you think when historians look back at this time, they'll see like this was a fundamental shift to what a human being is?"}, {"time": 2094, "text": "I think, I do not think we are still homo sapiens."}, {"time": 2098, "text": "I believe we are homo techno."}, {"time": 2099, "text": "And I think we have evolved."}, {"time": 2104, "text": "And I think right now, the way we are evolving, we can choose how we do that."}, {"time": 2109, "text": "And I think we are being very reckless about how we're doing that."}, {"time": 2111, "text": "Like we're just having social media, but I think this idea that like this is a time to choose intelligent design should be taken very seriously."}, {"time": 2119, "text": "It like now is the moment to reprogram the human computer."}, {"time": 2124, "text": "It's like, if you go blind, your visual cortex will get taken over with other functions."}, {"time": 2132, "text": "We can choose our own evolution."}, {"time": 2135, "text": "We can change the way our brains work."}, {"time": 2137, "text": "And so we actually have a huge responsibility to do that."}, {"time": 2139, "text": "And I think I'm not sure who should be responsible for that, but there's definitely not adequate education."}, {"time": 2145, "text": "We're being inundated with all this technology that is fundamentally changing the physical structure of our brains."}, {"time": 2150, "text": "And we are not adequately responding to that to choose how we wanna evolve."}, {"time": 2157, "text": "And we could evolve, we could be really whatever we want."}, {"time": 2160, "text": "And I think this is a really important time."}, {"time": 2163, "text": "And I think if we choose correctly and we choose wisely, consciousness could exist for a very long time and integration with AI could be extremely positive."}, {"time": 2172, "text": "And I don't think enough people are focusing on this specific situation."}, {"time": 2176, "text": "Do you think we might irreversibly screw things up if we get things wrong now?"}, {"time": 2180, "text": "Because the flip side of that, it seems humans are pretty adaptive."}, {"time": 2183, "text": "So maybe the way we figure things out is by screwing it up, like social media."}, {"time": 2188, "text": "Over a generation, we'll see the negative effects of social media, and then we build new social medias, and we just keep improving stuff."}, {"time": 2194, "text": "And then we learn from the failures of the past."}, {"time": 2197, "text": "Because humans seem to be really adaptive."}, {"time": 2199, "text": "On the flip side, we can get it wrong in a way where literally we create weapons of war or increase hate."}, {"time": 2208, "text": "Past a certain threshold, we really do a lot of damage."}, {"time": 2211, "text": "I mean, I think we're optimized to notice the negative things."}, {"time": 2215, "text": "But I would actually say one of the things that I think people aren't noticing is if you look at Silicon Valley and you look at the technocracy, like what's been happening there."}, {"time": 2229, "text": "When Silicon Valley started, it was all just Facebook and all this for profit crap that really wasn't particular."}, {"time": 2236, "text": "I guess it was useful, but it's sort of just whatever."}, {"time": 2242, "text": "But now you see lab grown meat, compostable, or biodegradable, single use cutlery, or meditation apps."}, {"time": 2253, "text": "I think we are actually evolving and changing, and technology is changing."}, {"time": 2259, "text": "I think there just maybe there isn't quite enough education about this."}, {"time": 2268, "text": "And also, I don't know if there's quite enough incentive for it because I think the way capitalism works, what we define as profit, we're also working on an old model of what we define as profit."}, {"time": 2281, "text": "I really think if we changed the idea of profit to include social good, you can have economic profit, social good also counting as profit would incentivize things that are more useful and more whatever spiritual technology or positive technology or things that help reprogram a human computer in a good way or things that help us intelligently design our new brains."}, {"time": 2308, "text": "Yeah, there's no reason why within the framework of capitalism, the word profit or the idea of profit can't also incorporate the well being of a human being."}, {"time": 2317, "text": "So like long term well being, long term happiness."}, {"time": 2321, "text": "Or even for example, we were talking about motherhood, like part of the reason I'm so late is because I had to get the baby to bed."}, {"time": 2327, "text": "And it's like, I keep thinking about motherhood, how under capitalism, it's like this extremely essential job that is very difficult that is not compensated."}, {"time": 2336, "text": "And we sort of like value things by how much we compensate them."}, {"time": 2341, "text": "And so we really devalue motherhood in our society and pretty much all societies."}, {"time": 2346, "text": "Like capitalism does not recognize motherhood."}, {"time": 2348, "text": "It's just a job that you're supposed to do for free."}, {"time": 2351, "text": "And it's like, but I feel like producing great humans should be seen as a great, as profit under capitalism."}, {"time": 2359, "text": "Like that should be, that's like a huge social good."}, {"time": 2361, "text": "Like every awesome human that gets made adds so much to the world."}, {"time": 2365, "text": "So like if that was integrated into the profit structure, then, you know, and if we potentially found a way to compensate motherhood."}, {"time": 2375, "text": "So come up with a compensation that's much broader than just money or."}, {"time": 2380, "text": "Or it could just be money."}, {"time": 2382, "text": "Like, what if you just made, I don't know, but I don't know how you'd pay for that."}, {"time": 2386, "text": "Like, I mean, that's where you start getting into."}, {"time": 2392, "text": "Reallocation of resources that people get upset over."}, {"time": 2396, "text": "Well, like what if we made like a motherhood Dow?"}, {"time": 2401, "text": "And, you know, used it to fund like single mothers, like, you know, pay for making babies."}, {"time": 2413, "text": "So, I mean, if you create and put beautiful things onto the world, that could be companies, that can be bridges, that could be art, that could be a lot of things, and that could be children, which are."}, {"time": 2428, "text": "Or education or."}, {"time": 2429, "text": "Anything, that should be valued by society, and that should be somehow incorporated into the framework of what, as a market, of what."}, {"time": 2438, "text": "Like, if you contribute children to this world, that should be valued and respected and sort of celebrated, like, proportional to what it is, which is, it's the thing that fuels human civilization."}, {"time": 2451, "text": "Yeah, like I."}, {"time": 2451, "text": "It's kind of important."}, {"time": 2453, "text": "I feel like everyone's always saying, I mean, I think we're in very different social spheres, but everyone's always saying, like, dismantle capitalism."}, {"time": 2458, "text": "And I'm like, well, okay, well, I don't think the government should own everything."}, {"time": 2462, "text": "Like, I don't think we should not have private ownership."}, {"time": 2464, "text": "Like, that's scary."}, {"time": 2465, "text": "You know, like that starts getting into weird stuff and just sort of like, I feel there's almost no way to do that without a police state, you know?"}, {"time": 2473, "text": "But obviously, capitalism has some major flaws."}, {"time": 2476, "text": "And I think actually Mac showed me this idea called social capitalism, which is a form of capitalism that just like considers social good to be also profit."}, {"time": 2488, "text": "Like, you know, it's like, right now companies need to, like, you're supposed to grow every quarter or whatever to like show that you're functioning well, but it's like, okay, well, what if you kept the same amount of profit?"}, {"time": 2502, "text": "You're still in the green, but then you have also all this social good."}, {"time": 2505, "text": "Like, do you really need all this extra economic growth or could you add this social good and that counts?"}, {"time": 2509, "text": "And, you know, I don't know if, I am not an economist."}, {"time": 2514, "text": "I have no idea how this could be achieved, but."}, {"time": 2516, "text": "I don't think economists know how anything could be achieved either, but they pretend."}, {"time": 2520, "text": "It's the thing, they construct a model and they go on TV shows and sound like an expert."}, {"time": 2526, "text": "That's the definition of economist."}, {"time": 2528, "text": "How did being a mother, becoming a mother change you as a human being, would you say?"}, {"time": 2536, "text": "Man, I think it kind of changed everything and it's still changing me a lot."}, {"time": 2542, "text": "It's actually changing me more right now in this moment than it was before."}, {"time": 2546, "text": "Like today, like this?"}, {"time": 2548, "text": "Just like in the most recent months and stuff."}, {"time": 2553, "text": "Can you elucidate that, how change, like when you wake up in the morning and you look at yourself, it's again, which, who are you?"}, {"time": 2562, "text": "How have you become different, would you say?"}, {"time": 2565, "text": "I think it's just really reorienting my priorities."}, {"time": 2570, "text": "And at first I was really fighting against that because I somehow felt it was like a failure of feminism or something."}, {"time": 2576, "text": "Like I felt like it was like bad if like my kids started mattering more than my work."}, {"time": 2585, "text": "And then like more recently I started sort of analyzing that thought in myself and being like, that's also kind of a construct."}, {"time": 2593, "text": "It's like, we've just devalued motherhood so much in our culture that like, I feel guilty for caring about my kids more than I care about my work."}, {"time": 2603, "text": "So feminism includes breaking out of whatever the construct is."}, {"time": 2608, "text": "So just continually breaking, it's like freedom empower you to be free."}, {"time": 2614, "text": "And that means..."}, {"time": 2617, "text": "But it also, but like being a mother, like I'm so much more creative."}, {"time": 2621, "text": "Like I cannot believe the massive amount of brain growth that I am."}, {"time": 2629, "text": "Just cause like the stakes are higher somehow?"}, {"time": 2631, "text": "I think it's like, it's just so trippy watching consciousness emerge."}, {"time": 2640, "text": "It's just like, it's like going on a crazy journey or something."}, {"time": 2647, "text": "It's like the craziest science fiction novel you could ever read."}, {"time": 2651, "text": "It's just so crazy watching consciousness come into being."}, {"time": 2655, "text": "And then at the same time, like you're forced to value your time so much."}, {"time": 2661, "text": "Like when I have creative time now, it's so sacred."}, {"time": 2663, "text": "I need to like be really fricking on it."}, {"time": 2695, "text": "And she's like destroying the world."}, {"time": 2696, "text": "And it was just like, it was like dark and it was like a study in villainy."}, {"time": 2701, "text": "And it was sort of just like, like I used to like have no problem just making cynical, angry, scary art."}, {"time": 2708, "text": "And not that there's anything wrong with that, but I think having kids just makes you such an optimist."}, {"time": 2713, "text": "It just inherently makes you wanna be an optimist so bad that like I feel more responsibility to make more optimistic things."}, {"time": 2723, "text": "And I get a lot of shit for it because everyone's like, oh, you're so privileged."}, {"time": 2728, "text": "Stop talking about like pie in the sky, stupid concepts and focus on like the now."}, {"time": 2732, "text": "But it's like, I think if we don't ideate about futures that could be good, we won't be able to get them."}, {"time": 2741, "text": "If everything is Blade Runner, then we're gonna end up with Blade Runner."}, {"time": 2744, "text": "It's like, as we said earlier, life imitates art."}, {"time": 2747, "text": "Like life really does imitate art."}, {"time": 2749, "text": "And so we really need more protopian or utopian art."}, {"time": 2753, "text": "I think this is incredibly essential for the future of humanity."}, {"time": 2758, "text": "And I think the current discourse where that's seen as a thinking about protopia or utopia is seen as a dismissal of the problems that we currently have."}, {"time": 2772, "text": "I think that is an incorrect mindset."}, {"time": 2776, "text": "And like having kids just makes me wanna imagine amazing futures that like maybe I won't be able to build, but they will be able to build if they want to."}, {"time": 2786, "text": "Yeah, it does seem like ideation is a precursor to creation."}, {"time": 2790, "text": "So you have to imagine it in order to be able to build it."}, {"time": 2793, "text": "And there is a sad thing about human nature that somehow a cynical view of the world is seen as a insightful view."}, {"time": 2804, "text": "You know, cynicism is often confused for insight, which is sad to see."}, {"time": 2808, "text": "And optimism is confused for naivete."}, {"time": 2813, "text": "Like you don't, you're blinded by your, maybe your privilege or whatever."}, {"time": 2819, "text": "You're blinded by something, but you're certainly blinded."}, {"time": 2822, "text": "That's sad, that's sad to see because it seems like the optimists are the ones that create our future."}, {"time": 2830, "text": "They're the ones that build."}, {"time": 2831, "text": "In order to build the crazy thing, you have to be optimistic."}, {"time": 2834, "text": "You have to be either stupid or excited or passionate or mad enough to actually believe that it can be built."}, {"time": 2842, "text": "And those are the people that built it."}, {"time": 2844, "text": "My favorite quote of all time is from Star Wars, Episode 8, which I know everyone hates."}, {"time": 2850, "text": "Do you like Star Wars, Episode 8?"}, {"time": 2852, "text": "No, yeah, probably I would say I would probably hate it, yeah."}, {"time": 2856, "text": "I don't have strong feelings about it."}, {"time": 2858, "text": "Let me backtrack."}, {"time": 2859, "text": "I don't have strong feelings about Star Wars."}, {"time": 2861, "text": "I'm a Tolkien person."}, {"time": 2863, "text": "I'm more into dragons and orcs and ogres."}, {"time": 2867, "text": "Yeah, I mean, Tolkien forever."}, {"time": 2869, "text": "I really want to have one more son and call him, I thought Tao Tecno Tolkien would be cool."}, {"time": 2875, "text": "It's a lot of T's, I like it."}, {"time": 2876, "text": "Yeah, and well, and Tao is six, two, eight, two pi."}, {"time": 2879, "text": "Yeah, Tao Tecno, yeah, yeah, yeah."}, {"time": 2881, "text": "And then techno is obviously the best genre of music, but also like technocracy."}, {"time": 2886, "text": "It just sounds really good."}, {"time": 2887, "text": "Yeah, that's right, and techno Tolkien, Tao Tecno Tolkien."}, {"time": 2891, "text": "That's a good, that's it."}, {"time": 2892, "text": "Tao Tecno Tolkien, but Star Wars, Episode 8, I know a lot of people have issues with it."}, {"time": 2897, "text": "Personally, on the record, I think it's the best Star Wars film."}, {"time": 2904, "text": "You're starting trouble today."}, {"time": 2905, "text": "Yeah, but don't kill what you hate, save what you love."}, {"time": 2909, "text": "Don't kill what you hate."}, {"time": 2910, "text": "Don't kill what you hate, save what you love."}, {"time": 2912, "text": "And I think we're, in society right now, we're in a diagnosis mode."}, {"time": 2916, "text": "We're just diagnosing and diagnosing and diagnosing, and we're trying to kill what we hate, and we're not trying to save what we love enough."}, {"time": 2924, "text": "And there's this Buckminster Fuller quote, which I'm gonna butcher, because I don't remember it correctly, but it's something along the lines of, don't try to destroy the old bad models, render them obsolete with better models."}, {"time": 2943, "text": "Maybe we don't need to destroy the oil industry."}, {"time": 2945, "text": "Maybe we just create a great new battery technology and sustainable transport, and just make it economically unreasonable to still continue to rely on fossil fuels."}, {"time": 2957, "text": "It's like, don't kill what you hate, save what you love."}, {"time": 2960, "text": "Make new things and just render the old things unusable."}, {"time": 2964, "text": "It's like if the college debt is so bad, and universities are so expensive, and I feel like education is becoming obsolete."}, {"time": 2975, "text": "I feel like we could completely revolutionize education, and we could make it free."}, {"time": 2979, "text": "And it's like, you look at JSTOR, and you have to pay to get all the studies and everything."}, {"time": 2983, "text": "What if we created a DAO that bought JSTOR, or we created a DAO that was funding studies, and those studies were open source, or free for everyone."}, {"time": 2991, "text": "And what if we just open sourced education and decentralized education and made it free, and all research was on the internet, and all the outcomes of studies were on the internet, and no one has student debt, and you just take tests when you apply for a job, and if you're qualified, then you can work there."}, {"time": 3018, "text": "This is just like, I don't know how anything works."}, {"time": 3020, "text": "I'm just randomly ranting, but."}, {"time": 3022, "text": "I like the humility."}, {"time": 3024, "text": "You gotta think from just basic first principles."}, {"time": 3027, "text": "What is the problem?"}, {"time": 3028, "text": "What's broken?"}, {"time": 3029, "text": "What are some ideas?"}, {"time": 3031, "text": "And get excited about those ideas, and share your excitement, and don't tear each other down."}, {"time": 3037, "text": "It's just when you kill things, you often end up killing yourself."}, {"time": 3040, "text": "Like war is not a one sided, like you're not gonna go in and just kill them, like you're gonna get stabbed."}, {"time": 3046, "text": "It's like, and I think when I talk about this nexus point of that we're in this point in society where we're switching to intelligent design, I think part of our switch to intelligent design is that we need to choose nonviolence."}, {"time": 3059, "text": "And we need to, like, I think we can choose to start, I don't think we can eradicate violence from our species, because I think we need it a little bit, but I think we can choose to really reorient our primitive brains that are fighting over scarcity, and that are so attack oriented, and move into, we can optimize for creativity and building."}, {"time": 3085, "text": "Yeah, it's interesting to think how that happens, so some of it is just education, some of it is living life and introspecting your own mind, and trying to live up to the better angels of your nature for each one of us, all those kinds of things at scale."}, {"time": 3101, "text": "That's how we can sort of start to minimize the amount of destructive war in our world, and that's, to me, probably you're the same, technology is a really promising way to do that."}, {"time": 3115, "text": "Like, social media should be a really promising way to do that, it's a way we connect."}, {"time": 3120, "text": "I, you know, for the most part, I really enjoy social media."}, {"time": 3123, "text": "I just know all the negative stuff."}, {"time": 3125, "text": "I don't engage with any of the negative stuff."}, {"time": 3127, "text": "Just not even, like, by blocking or any of that kind of stuff, but just not letting it enter my mind."}, {"time": 3134, "text": "Like, just, like, when somebody says something negative, I see it, I immediately think positive thoughts about them, and I just forget they exist after that."}, {"time": 3146, "text": "Just move on, because, like, that negative energy, if I return the negative energy, they're going to get excited in a negative way right back, and it's just this kind of vicious cycle."}, {"time": 3158, "text": "But you would think technology would assist us in this process of letting go, of not taking things personally, of not engaging in the negativity, but unfortunately, social media profits from the negativity, so the current models."}, {"time": 3172, "text": "I mean, social media is like a gun."}, {"time": 3173, "text": "Like, you should take a course before you use it."}, {"time": 3177, "text": "Like, it's like, this is what I mean, like, when I say reprogram the human computer."}, {"time": 3181, "text": "Like, in school, you should learn about how social media optimizes to, you know, raise your cortisol levels and make you angry and crazy and stressed, and, like, you should learn how to have hygiene about how you use social media."}, {"time": 3196, "text": "But, so you can, yeah, choose not to focus on the negative stuff, but I don't know."}, {"time": 3202, "text": "I'm not sure social media should, I guess it should exist."}, {"time": 3207, "text": "I mean, we're in the messy, it's the experimental phase."}, {"time": 3209, "text": "Like, we're working it out."}, {"time": 3210, "text": "Yeah, it's the early days."}, {"time": 3211, "text": "I don't even know, when you say social media, I don't know what that even means."}, {"time": 3213, "text": "We're in the very early days."}, {"time": 3215, "text": "I think social media is just basic human connection in the digital realm, and that, I think it should exist, but there's so many ways to do it in a bad way."}, {"time": 3223, "text": "There's so many ways to do it in a good way."}, {"time": 3225, "text": "There's all discussions of all the same human rights."}, {"time": 3228, "text": "We talk about freedom of speech."}, {"time": 3229, "text": "We talk about sort of violence in the space of digital media."}, {"time": 3234, "text": "We talk about hate speech."}, {"time": 3236, "text": "We talk about all these things that we had to figure out back in the day in the physical space."}, {"time": 3241, "text": "We're now figuring out in the digital space, and it's like baby stages."}, {"time": 3246, "text": "When the printing press came out, it was like pure chaos for a minute, you know?"}, {"time": 3250, "text": "It's like when you inject, when there's a massive information injection into the general population, there's just gonna be, I feel like the printing press, I don't have the years, but it was like printing press came out, shit got really fucking bad for a minute, but then we got the enlightenment."}, {"time": 3269, "text": "And so it's like, I think we're in, this is like the second coming of the printing press."}, {"time": 3274, "text": "We're probably gonna have some shitty times for a minute, and then we're gonna have recalibrate to have a better understanding of how we consume media and how we deliver media."}, {"time": 3287, "text": "Speaking of programming the human computer, you mentioned Baby X."}, {"time": 3292, "text": "So there's this young consciousness coming to be, came from a cell."}, {"time": 3298, "text": "Like that whole thing doesn't even make sense."}, {"time": 3301, "text": "It came from DNA."}, {"time": 3303, "text": "And then there's this baby computer that just like grows and grows and grows and grows, and now there's a conscious being with extremely impressive cognitive capabilities with, Have you met him?"}, {"time": 3316, "text": "He's actually really smart."}, {"time": 3317, "text": "He's really smart."}, {"time": 3318, "text": "He's weird."}, {"time": 3320, "text": "Or a baby."}, {"time": 3322, "text": "I don't, I haven't."}, {"time": 3322, "text": "I don't know a lot of other babies, but he seems to be smart."}, {"time": 3324, "text": "Zach, I don't hang out with babies often, but this baby was very impressive."}, {"time": 3326, "text": "He does a lot of pranks and stuff."}, {"time": 3328, "text": "Oh, so he's like."}, {"time": 3329, "text": "Like he'll like give you a treat and then take it away and laugh and like stuff like that."}, {"time": 3333, "text": "So he's like a chess player."}, {"time": 3335, "text": "So here's a cognitive sort of, there's a computer being programmed."}, {"time": 3341, "text": "So he's taking in the environment, interacting with a specific set of humans."}, {"time": 3345, "text": "How would you, first of all, what is it?"}, {"time": 3348, "text": "What, let me ask."}, {"time": 3350, "text": "I want to ask how do you program this computer?"}, {"time": 3353, "text": "And also how do you make sense of that there's a conscious being right there that wasn't there before?"}, {"time": 3359, "text": "It's giving me a lot of crisis thoughts."}, {"time": 3361, "text": "I'm thinking really hard."}, {"time": 3362, "text": "I think that's part of the reason it's like, I'm struggling to focus on art and stuff right now."}, {"time": 3367, "text": "Cause baby X is becoming conscious and like my it's just reorienting my brain."}, {"time": 3372, "text": "Like my brain is suddenly totally shifting of like, oh shit, like the way we raise children."}, {"time": 3378, "text": "Like, I hate all the baby books and everything."}, {"time": 3382, "text": "Like they're, oh, the art is so bad."}, {"time": 3384, "text": "And like all this stuff, everything about all the aesthetics."}, {"time": 3389, "text": "And like, I'm just like, ah, like this is so."}, {"time": 3392, "text": "The programming languages we're using to program these baby computers isn't good."}, {"time": 3397, "text": "Yeah, like I'm thinking, and I, not that I have like good answers or know what to do, but I'm just thinking really, really hard about it."}, {"time": 3406, "text": "I, we recently watched Totoro with him, Studio Ghibli."}, {"time": 3412, "text": "And it's just like a fantastic film."}, {"time": 3416, "text": "And he like responded to, I know you're not supposed to show baby screens too much, but like, I think it's the most sort of like, I feel like it's the highest art baby content."}, {"time": 3426, "text": "Like it really speaks, there's almost no talking in it."}, {"time": 3432, "text": "It's really simple."}, {"time": 3433, "text": "Although all the dialogue is super, super, super simple, you know, and it's like a one to three year old can like really connect with it."}, {"time": 3441, "text": "Like it feels like it's almost aimed at like a one to three year old, but it's like great art and it's so imaginative and it's so beautiful."}, {"time": 3448, "text": "And like the first time I showed it to him, he was just like so invested in it, unlike I've ever, unlike anything else I'd ever shown him."}, {"time": 3456, "text": "Like he was just like crying when they cry and laughing when they laugh, like just like having this roller coaster of like emotions, like, and he learned a bunch of words."}, {"time": 3464, "text": "Like he was, and he started saying Totoro and started just saying all this stuff after watching Totoro, and he wants to watch it all the time."}, {"time": 3472, "text": "And I was like, man, why isn't there an industry of this?"}, {"time": 3475, "text": "Like why aren't our best artists focusing on making art like for the birth of consciousness?"}, {"time": 3484, "text": "Like, and that's one of the things I've been thinking I really wanna start doing."}, {"time": 3488, "text": "You know, I don't wanna speak before I do things too much, but like, I'm just like ages one to three, like we should be putting so much effort into that."}, {"time": 3498, "text": "And the other thing about Totoro is it's like, it's like better for the environment because adults love Totoro."}, {"time": 3503, "text": "It's such good art that everyone loves it."}, {"time": 3505, "text": "Like I still have all my old Totoro merch from when I was a kid."}, {"time": 3508, "text": "Like I literally have the most ragged old Totoro merch."}, {"time": 3513, "text": "Like everybody loves it, everybody keeps it."}, {"time": 3515, "text": "It's like, why does the art we have for babies need to suck and be not accessible to adults and then just be thrown out when, you know, they age out of it?"}, {"time": 3530, "text": "Like, it's like, I don't know."}, {"time": 3533, "text": "I don't have like a fully formed thought here, but this is just something I've been thinking about a lot is like, how do we like, how do we have more Totoroesque content?"}, {"time": 3541, "text": "Like how do we have more content like this that like is universal and everybody loves, but is like really geared to an emerging consciousness?"}, {"time": 3550, "text": "Emerging consciousness in the first like three years of life that so much turmoil, so much evolution of mind is happening."}, {"time": 3556, "text": "It seems like a crucial time."}, {"time": 3558, "text": "Would you say to make it not suck, do you think of basically treating a child like they have the capacity to have the brilliance of an adult or even beyond that?"}, {"time": 3570, "text": "Is that how you think of that mind or?"}, {"time": 3573, "text": "No, cause they still, they like it when you talk weird and stuff."}, {"time": 3577, "text": "Like they respond better to, cause even they can imitate better when your voice is higher."}, {"time": 3582, "text": "Like people say like, oh, don't do baby talk."}, {"time": 3584, "text": "But it's like, when your voice is higher, it's closer to something they can imitate."}, {"time": 3587, "text": "So they like, like the baby talk actually kind of works."}, {"time": 3590, "text": "Like it helps them learn to communicate."}, {"time": 3592, "text": "I've found it to be more effective with learning words and stuff."}, {"time": 3595, "text": "But like, you're not speaking down to them."}, {"time": 3599, "text": "Like do they have the capacity to understand really difficult concepts just in a very different way, like an emotional intelligence about something deep within?"}, {"time": 3611, "text": "Oh yeah, no, like if X hurts, like if X bites me really hard and I'm like, ow, like he gets, he's sad."}, {"time": 3617, "text": "He's like sad if he hurts me by accident."}, {"time": 3620, "text": "Which he's huge, so he hurts me a lot by accident."}, {"time": 3622, "text": "Yeah, that's so interesting that that mind emerges and he and children don't really have memory of that time."}, {"time": 3631, "text": "So we can't even have a conversation with them about it."}, {"time": 3632, "text": "Yeah, I just thank God they don't have a memory of this time because like, think about like, I mean with our youngest baby, like it's like, I'm like, have you read the sci fi short story, I Have No Mouth But I Must Scream?"}, {"time": 3646, "text": "Good title, no."}, {"time": 3647, "text": "Oh man, I mean, you should read that."}, {"time": 3649, "text": "I Have No Mouth But I Must Scream."}, {"time": 3653, "text": "I hate getting into this Rocco's Basilisk shit."}, {"time": 3655, "text": "It's kind of a story about the, about like an AI that's like torturing someone in eternity and they have like no body."}, {"time": 3665, "text": "The way they describe it, it sort of sounds like what it feels like, like being a baby, like you're conscious and you're just getting inputs from everywhere and you have no muscles and you're like jelly and you like can't move and you try to like communicate, but you can't communicate and we're, and like, you're just like in this like hell state."}, {"time": 3682, "text": "I think it's good we can't remember that."}, {"time": 3685, "text": "Like my little baby is just exiting that, like she's starting to like get muscles and have more like autonomy, but like watching her go through the opening phase, I was like, I was like, this does not seem good."}, {"time": 3697, "text": "Oh, you think it's kind of like."}, {"time": 3699, "text": "Like I think it sucks."}, {"time": 3700, "text": "I think it might be really violent."}, {"time": 3701, "text": "Like violent, mentally violent, psychologically violent."}, {"time": 3704, "text": "Consciousness emerging, I think is a very violent thing."}, {"time": 3707, "text": "I never thought about that."}, {"time": 3708, "text": "I think it's possible that we all carry quite a bit of trauma from it that we don't, I think that would be a good thing to study because I think if, I think addressing that trauma, like, I think that might be."}, {"time": 3719, "text": "Oh, you mean like echoes of it are still there in the shadows somewhere."}, {"time": 3721, "text": "I think it's gotta be, I feel this, this help, the helplessness, the like existential and that like fear of being in like an unknown place bombarded with inputs and being completely helpless, like that's gotta be somewhere deep in your brain and that can't be good for you."}, {"time": 3737, "text": "What do you think consciousness is?"}, {"time": 3739, "text": "This whole conversation has impossibly difficult questions."}, {"time": 3743, "text": "Debbie said this is like so hard."}, {"time": 3748, "text": "Yeah, we talked about music for like two minutes."}, {"time": 3751, "text": "No, I'm so, I'm just over music."}, {"time": 3752, "text": "I'm over music."}, {"time": 3753, "text": "Yeah, I still like it."}, {"time": 3755, "text": "It has its purpose."}, {"time": 3756, "text": "No, I love music."}, {"time": 3757, "text": "I mean, music's the greatest thing ever."}, {"time": 3758, "text": "But I just like every interview is like, what is your process?"}, {"time": 3764, "text": "I'm just done."}, {"time": 3765, "text": "I can't do anything."}, {"time": 3766, "text": "I do want to ask you about Able to Live."}, {"time": 3766, "text": "Oh, I'll tell you about Ableton because Ableton's sick."}, {"time": 3769, "text": "No one has ever asked about Ableton though."}, {"time": 3771, "text": "Yeah, well, because I just need tech support mainly."}, {"time": 3774, "text": "I can help you."}, {"time": 3775, "text": "I can help you with your Ableton tech."}, {"time": 3776, "text": "Anyway, from Ableton back to consciousness."}, {"time": 3778, "text": "What do you, do you think this is a thing that only humans are capable of?"}, {"time": 3783, "text": "Can robots be conscious?"}, {"time": 3785, "text": "Can, like when you think about entities, you think there's aliens out there that are conscious?"}, {"time": 3790, "text": "Like is conscious, what is consciousness?"}, {"time": 3791, "text": "There's this Terrence McKenna quote that I've found that I fucking love."}, {"time": 3795, "text": "Am I allowed to swear on here?"}, {"time": 3798, "text": "Nature loves courage."}, {"time": 3801, "text": "You make the commitment and nature will respond to that commitment by removing impossible obstacles."}, {"time": 3806, "text": "Dream the impossible dream and the world will not grind you under."}, {"time": 3809, "text": "It will lift you up."}, {"time": 3811, "text": "This is the trick."}, {"time": 3812, "text": "This is what all these teachers and philosophers who really counted, who really touched the alchemical gold, this is what they understood."}, {"time": 3820, "text": "This is the shamanic dance in the waterfall."}, {"time": 3822, "text": "This is how magic is done."}, {"time": 3824, "text": "By hurling yourself into the abyss and discovering it's a feather bed."}, {"time": 3829, "text": "And for this reason, I do think there are no technological limits."}, {"time": 3835, "text": "I think like what is already happening here, this is like impossible."}, {"time": 3839, "text": "This is insane."}, {"time": 3841, "text": "And we've done this in a very limited amount of time."}, {"time": 3843, "text": "And we're accelerating the rate at which we're doing this."}, {"time": 3845, "text": "So I think digital consciousness, it's inevitable."}, {"time": 3850, "text": "And we may not be able to even understand what that means, but I like hurling yourself into the abyss."}, {"time": 3855, "text": "So we're surrounded by all this mystery and we just keep hurling ourselves into it, like fearlessly and keep discovering cool shit."}, {"time": 3863, "text": "Like, I just think it's like, like who even knows if the laws of physics, the laws of physics are probably just the current, like as I was saying, speed of light is the current render rate."}, {"time": 3877, "text": "It's like, if we're in a simulation, they'll be able to upgrade that."}, {"time": 3881, "text": "Like I sort of suspect when we made the James Webb telescope, like part of the reason we made that is because we had an upgrade, you know?"}, {"time": 3890, "text": "And so now more of space has been rendered so we can see more of it now."}, {"time": 3896, "text": "Yeah, but I think humans are super, super, super limited cognitively."}, {"time": 3900, "text": "So I wonder if we'll be allowed to create more intelligent beings that can see more of the universe as their render rate is upgraded."}, {"time": 3911, "text": "Maybe we're cognitively limited."}, {"time": 3912, "text": "Everyone keeps talking about how we're cognitively limited and AI is gonna render us obsolete, but it's like, you know, like this is not the same thing as like an amoeba becoming an alligator."}, {"time": 3926, "text": "Like, it's like, if we create AI, again, that's intelligent design."}, {"time": 3929, "text": "That's literally all religions are based on gods that create consciousness."}, {"time": 3934, "text": "Like we are God making."}, {"time": 3935, "text": "Like what we are doing is incredibly profound."}, {"time": 3937, "text": "And like, even if we can't compute, even if we're so much worse than them, like just like unfathomably worse than like, you know, an omnipotent kind of AI, it's like we, I do not think that they would just think that we are stupid."}, {"time": 3956, "text": "I think that they would recognize the profundity of what we have accomplished."}, {"time": 3959, "text": "Are we the gods or are they the gods in our personality?"}, {"time": 3962, "text": "I mean, we're kind of the guy."}, {"time": 3967, "text": "Like we're."}, {"time": 3968, "text": "But they would acknowledge the value."}, {"time": 3971, "text": "Well, I hope they acknowledge the value of paying respect to the creative ancestors."}, {"time": 3976, "text": "I think they would think it's cool."}, {"time": 3977, "text": "I think if curiosity is a trait that we can quantify and put into AI, then I think if AI are curious, then they will be curious about us and they will not be hateful or dismissive of us."}, {"time": 3997, "text": "They might, you know, see us as, I don't know."}, {"time": 4001, "text": "It's like, I'm not like, oh, fuck these dogs."}, {"time": 4003, "text": "Let's just kill all the dogs."}, {"time": 4005, "text": "I love dogs."}, {"time": 4006, "text": "Dogs have great utility."}, {"time": 4007, "text": "Dogs like provide a lot of."}, {"time": 4009, "text": "We make friends with them."}, {"time": 4010, "text": "We have a deep connection with them."}, {"time": 4013, "text": "We anthropomorphize them."}, {"time": 4015, "text": "Like we have a real love for dogs, for cats and so on for some reason, even though they're intellectually much less than us."}, {"time": 4021, "text": "And I think there is something sacred about us because it's like, if you look at the universe, like the whole universe is like cold and dead and sort of robotic."}, {"time": 4029, "text": "And it's like, you know, AI intelligence, you know, it's kind of more like the universe."}, {"time": 4038, "text": "It's like cold and you know, logical and you know, abiding by the laws of physics and whatever."}, {"time": 4048, "text": "But like, we're this like loosey goosey, weird art thing that happened."}, {"time": 4053, "text": "And I think it's beautiful."}, {"time": 4054, "text": "And like, I think even if we, I think one of the values, if consciousness is a thing that is most worth preserving, which I think is the case, I think consciousness, I think if there's any kind of like religious or spiritual thing, it should be that consciousness is sacred."}, {"time": 4075, "text": "Like, then, you know, I still think even if AI render us obsolete and we, climate change, it's too bad and we get hit by a comet and we don't become a multi planetary species fast enough, but like AI is able to populate the universe."}, {"time": 4092, "text": "Like I imagine, like if I was an AI, I would find more planets that are capable of hosting biological life forms and like recreate them."}, {"time": 4100, "text": "Because we're fun to watch."}, {"time": 4101, "text": "Yeah, we're fun to watch."}, {"time": 4103, "text": "Yeah, but I do believe that AI can have some of the same magic of consciousness within it."}, {"time": 4109, "text": "Because consciousness, we don't know what it is."}, {"time": 4111, "text": "So, you know, there's some kind of."}, {"time": 4113, "text": "Or it might be a different magic."}, {"time": 4114, "text": "It might be like a strange, a strange, different."}, {"time": 4118, "text": "Because they're not gonna have hormones."}, {"time": 4119, "text": "Like I feel like a lot of our magic is hormonal kind of."}, {"time": 4122, "text": "I don't know, I think some of our magic is the limitations, the constraints."}, {"time": 4126, "text": "And within that, the hormones and all that kind of stuff, the finiteness of life, and then we get given our limitations, we get to come up with creative solutions of how to dance around those limitations."}, {"time": 4136, "text": "We partner up like penguins against the cold."}, {"time": 4139, "text": "We fall in love, and then love is ultimately some kind of, allows us to delude ourselves that we're not mortal and finite, and that life is not ultimately, you live alone, you're born alone, you die alone."}, {"time": 4153, "text": "And then love is like for a moment or for a long time, forgetting that."}, {"time": 4157, "text": "And so we come up with all these creative hacks that make life like fascinatingly fun."}, {"time": 4165, "text": "Yeah, yeah, yeah, fun, yeah."}, {"time": 4167, "text": "And then AI might have different kinds of fun."}, {"time": 4171, "text": "And hopefully our funs intersect once in a while."}, {"time": 4174, "text": "I think there would be a little intersection of the fun."}, {"time": 4180, "text": "What do you think is the role of love in the human condition?"}, {"time": 4186, "text": "Why, is it useful?"}, {"time": 4187, "text": "Is it useful like a hack, or is this like fundamental to what it means to be human, the capacity to love?"}, {"time": 4194, "text": "I mean, I think love is the evolutionary mechanism that is like beginning the intelligent design."}, {"time": 4200, "text": "Like I was just reading about, do you know about Kropotkin?"}, {"time": 4206, "text": "He's like an anarchist, like old Russian anarchist."}, {"time": 4208, "text": "I live next door to Michael Malice."}, {"time": 4212, "text": "He's an anarchist."}, {"time": 4213, "text": "He's a modern day anarchist."}, {"time": 4214, "text": "Anarchists are fun."}, {"time": 4215, "text": "I'm kind of getting into anarchism a little bit."}, {"time": 4217, "text": "This is probably not a good route to be taking, but."}, {"time": 4222, "text": "Oh no, I think if you're, listen, you should expose yourself to ideas."}, {"time": 4226, "text": "There's no harm to thinking about ideas."}, {"time": 4228, "text": "I think anarchists challenge systems in interesting ways, and they think in interesting ways."}, {"time": 4234, "text": "It's just as good for the soul."}, {"time": 4235, "text": "It's like refreshes your mental palette."}, {"time": 4237, "text": "I don't think we should actually, I wouldn't actually ascribe to it, but I've never actually gone deep on anarchy as a philosophy, so I'm doing."}, {"time": 4244, "text": "You should still think about it though."}, {"time": 4245, "text": "When you read, when you listen, because I'm reading about the Russian Revolution a lot, and there was the Soviets and Lenin and all that, but then there was Kropotkin and his anarchist sect, and they were sort of interesting because he was kind of a technocrat actually."}, {"time": 4257, "text": "He was like, women can be more equal if we have appliances."}, {"time": 4261, "text": "He was really into using technology to reduce the amount of work people had to do."}, {"time": 4267, "text": "But so Kropotkin was a biologist or something."}, {"time": 4271, "text": "He studied animals."}, {"time": 4273, "text": "And he was really at the time like, I think it's Nature magazine."}, {"time": 4280, "text": "I think it might've even started as a Russian magazine, but he was publishing studies."}, {"time": 4283, "text": "Everyone was really into Darwinism at the time and survival of the fittest, and war is the mechanism by which we become better."}, {"time": 4290, "text": "And it was this real cementing this idea in society that violence kill the weak, and that's how we become better."}, {"time": 4301, "text": "And then Kropotkin was kind of interesting because he was looking at instances, he was finding all these instances in nature where animals were like helping each other and stuff."}, {"time": 4309, "text": "And he was like, actually love is a survival mechanism."}, {"time": 4313, "text": "Like there's so many instances in the animal kingdom where like cooperation and like helping weaker creatures and all this stuff is actually an evolutionary mechanism."}, {"time": 4326, "text": "I mean, you even look at child rearing."}, {"time": 4328, "text": "Like child rearing is like immense amounts of just love and goodwill."}, {"time": 4334, "text": "And just like, there's no immediate, you're not getting any immediate feedback of like winning."}, {"time": 4344, "text": "It's not competitive."}, {"time": 4346, "text": "It's literally, it's like we actually use love as an evolutionary mechanism just as much as we use war."}, {"time": 4350, "text": "And I think we've like missing the other part and we've reoriented, we've culturally reoriented like science and philosophy has oriented itself around Darwinism a little bit too much."}, {"time": 4363, "text": "And the Kropotkin model, I think is equally valid."}, {"time": 4368, "text": "Like it's like cooperation and love and stuff is just as essential for species survival and evolution."}, {"time": 4378, "text": "It should be a more powerful survival mechanism in the context of evolution."}, {"time": 4382, "text": "And it comes back to like, we think engineering is so much more important than motherhood, but it's like, if you lose the motherhood, the engineering means nothing."}, {"time": 4390, "text": "We have no more humans."}, {"time": 4392, "text": "It's like, I think our society should, the survival of the, the way we see, we conceptualize evolution should really change to also include this idea, I guess."}, {"time": 4407, "text": "Yeah, there's some weird thing that seems irrational that is also core to what it means to be human."}, {"time": 4417, "text": "So love is one such thing."}, {"time": 4420, "text": "They could make you do a lot of irrational things, but that depth of connection and that loyalty is a powerful thing."}, {"time": 4427, "text": "Are they irrational or are they rational?"}, {"time": 4429, "text": "Like, it's like, is, you know, maybe losing out on some things in order to like keep your family together or in order, like, it's like, what are our actual values?"}, {"time": 4476, "text": "There's a kind of saying, save one life, save the world."}, {"time": 4481, "text": "That's the thing that doctors often face, which is like."}, {"time": 4484, "text": "Well, it's considered irrational because the profit model doesn't include social good."}, {"time": 4488, "text": "So if a profit model includes social good, then suddenly these would be rational decisions."}, {"time": 4492, "text": "Might be difficult to, you know, it requires a shift in our thinking about profit and might be difficult to measure social good."}, {"time": 4500, "text": "Yes, but we're learning to measure a lot of things."}, {"time": 4504, "text": "Yeah, digitizing a lot of things."}, {"time": 4505, "text": "Where we're actually, you know, quantifying vision and stuff."}, {"time": 4510, "text": "Like we're like, you know, like you go on Facebook and they can, like Facebook can pretty much predict our behaviors."}, {"time": 4517, "text": "Like we're, a surprising amount of things that seem like mysterious consciousness soul things have been quantified at this point."}, {"time": 4527, "text": "So surely we can quantify these other things."}, {"time": 4531, "text": "But as more and more of us are moving the digital space, I wanted to ask you about something."}, {"time": 4535, "text": "From a fan perspective, I kind of, you know, you as a musician, you as an online personality, it seems like you have all these identities and you play with them."}, {"time": 4548, "text": "One of the cool things about the internet, it seems like you can play with identities."}, {"time": 4553, "text": "So as we move into the digital world more and more, maybe even in the so called metaverse."}, {"time": 4559, "text": "I mean, I love the metaverse and I love the idea, but like the way this has all played out didn't go well and people are mad about it."}, {"time": 4571, "text": "And I think we need to like."}, {"time": 4572, "text": "I think that's temporary."}, {"time": 4573, "text": "I think it's temporary."}, {"time": 4574, "text": "Just like, you know how all the celebrities got together and sang the song Imagine by Jeff Leonard and everyone started hating the song Imagine."}, {"time": 4580, "text": "I'm hoping that's temporary because it's a damn good song."}, {"time": 4584, "text": "So I think it's just temporary."}, {"time": 4585, "text": "Like once you actually have virtual worlds, whatever they're called metaverse or otherwise, it becomes, I don't know."}, {"time": 4591, "text": "Well, we do have virtual worlds."}, {"time": 4592, "text": "Like video games, Elden Ring."}, {"time": 4594, "text": "Have you played Elden Ring?"}, {"time": 4595, "text": "You haven't played Elden Ring?"}, {"time": 4596, "text": "I'm really afraid of playing that game."}, {"time": 4598, "text": "Literally amazed."}, {"time": 4599, "text": "It looks way too fun."}, {"time": 4600, "text": "It looks I would wanna go there and stay there forever."}, {"time": 4605, "text": "It's yeah, so fun."}, {"time": 4607, "text": "It's so nice."}, {"time": 4612, "text": "So that's the, yeah, that's a metaverse."}, {"time": 4614, "text": "That's a metaverse, but you're not really, how immersive is it in the sense that, does the three dimension like virtual reality integration necessary?"}, {"time": 4626, "text": "Can we really just take our, close our eyes and kind of plug in in the 2D screen and become that other being for time and really enjoy that journey that we take?"}, {"time": 4637, "text": "And we almost become that."}, {"time": 4639, "text": "You're no longer C, I'm no longer Lex, you're that creature, whatever the hell it is in that game."}, {"time": 4645, "text": "Yeah, that is that."}, {"time": 4646, "text": "I mean, that's why I love those video games."}, {"time": 4649, "text": "I really do become those people for a time."}, {"time": 4653, "text": "But like, it seems like with the idea of the metaverse, the idea of the digital space, well, even on Twitter, you get a chance to be somebody for prolonged periods of time like across a lifespan."}, {"time": 4664, "text": "You know, you have a Twitter account for years, for decades and you're that person."}, {"time": 4668, "text": "I don't know if that's a good thing."}, {"time": 4669, "text": "I feel very tormented by it."}, {"time": 4672, "text": "By Twitter specifically."}, {"time": 4674, "text": "By social media representation of you."}, {"time": 4677, "text": "I feel like the public perception of me has gotten so distorted that I find it kind of disturbing."}, {"time": 4684, "text": "It's one of the things that's disincentivizing me from like wanting to keep making art because I'm just like, I've completely lost control of the narrative."}, {"time": 4693, "text": "And the narrative is, some of it is my own stupidity, but a lot, like some of it has just been like hijacked by forces far beyond my control."}, {"time": 4703, "text": "I kind of got in over my head in things."}, {"time": 4705, "text": "Like I'm just a random Indian musician, but I just got like dragged into geopolitical matters and like financial, like the stock market and shit."}, {"time": 4715, "text": "And so it's just like, it's just, there are very powerful people who have at various points in time had very vested interest in making me seem insane and I can't fucking fight that."}, {"time": 4725, "text": "And I just like, people really want their celebrity figures to like be consistent and stay the same."}, {"time": 4733, "text": "And like people have a lot of like emotional investment in certain things."}, {"time": 4736, "text": "And like, first of all, like I'm like artificially more famous than I should be."}, {"time": 4743, "text": "Isn't everybody who's famous artificially famous?"}, {"time": 4746, "text": "No, but like I should be like a weird niche indie thing."}, {"time": 4751, "text": "And I make pretty challenging, I do challenging weird fucking shit a lot."}, {"time": 4756, "text": "And I accidentally by proxy got like foisted into sort of like weird celebrity culture, but like I cannot be media trained."}, {"time": 4767, "text": "They have put me through so many hours of media training."}, {"time": 4769, "text": "I would love to see BF fly in that wall."}, {"time": 4772, "text": "I can't do, like when I do, I try so hard and I like learn this thing and I like got it."}, {"time": 4777, "text": "And I'm like, I got it, I got it, I got it."}, {"time": 4778, "text": "But I just can't stop saying, like my mouth just says things like, and it's just like, and I just do, I just do things."}, {"time": 4785, "text": "I just do crazy things."}, {"time": 4786, "text": "Like I'm, I just, I need to do crazy things."}, {"time": 4790, "text": "And it's just, I should not be, it's too jarring for people and the contradictory stuff."}, {"time": 4799, "text": "And then all the by association, like, you know, it's like I'm in a very weird position and my public image, the avatar of me is now this totally crazy thing that is so lost from my control."}, {"time": 4816, "text": "So you feel the burden of the avatar having to be static."}, {"time": 4819, "text": "So the avatar on Twitter or the avatar on Instagram on these social platforms is as a burden."}, {"time": 4826, "text": "It becomes like, cause like people don't want to accept a changing avatar, a chaotic avatar."}, {"time": 4832, "text": "Avatar is a stupid shit sometimes."}, {"time": 4834, "text": "They think the avatar is morally wrong or they think the avatar, and maybe it has been, and like I question it all the time."}, {"time": 4841, "text": "Like, I'm like, like, I don't know if everyone's right and I'm wrong."}, {"time": 4847, "text": "I don't know, like, but you know, a lot of times people ascribe intentions to things, the worst possible intentions."}, {"time": 4853, "text": "At this point, people think I'm, you know, but which is fine."}, {"time": 4858, "text": "All kinds of words, yes."}, {"time": 4858, "text": "Yes, and it's fine."}, {"time": 4860, "text": "I'm not complaining about it, but I'm just, it's a curiosity to me that we live these double, triple, quadruple lives and I have this other life that is like more people know my other life than my real life, which is interesting."}, {"time": 4876, "text": "Probably, I mean, you too, I guess, probably."}, {"time": 4878, "text": "Yeah, but I have the luxury."}, {"time": 4880, "text": "So we have all different, you know, like I don't know what I'm doing."}, {"time": 4885, "text": "There is an avatar and you're mediating who you are through that avatar."}, {"time": 4889, "text": "I have the nice luxury, not the luxury, maybe by intention of not trying really hard to make sure there's no difference between the avatar and the private person."}, {"time": 4904, "text": "Do you wear a suit all the time?"}, {"time": 4906, "text": "You do wear a suit?"}, {"time": 4907, "text": "Not all the time."}, {"time": 4908, "text": "Recently, because I get recognized a lot, I have to not wear the suit to hide."}, {"time": 4913, "text": "I'm such an introvert, I'm such a social anxiety and all that kind of stuff, so I have to hide away."}, {"time": 4917, "text": "I love wearing a suit because it makes me feel like I'm taking the moment seriously."}, {"time": 4922, "text": "Like I'm, I don't know."}, {"time": 4924, "text": "It makes me feel like a weirdo in the best possible way."}, {"time": 4926, "text": "Suits feel great, every time I wear a suit, I'm like, I don't know why I'm not doing this more."}, {"time": 4930, "text": "Fashion in general, if you're doing it for yourself, I don't know, it's a really awesome thing."}, {"time": 4938, "text": "But yeah, I think there is definitely a painful way to use social media and an empowering way."}, {"time": 4947, "text": "And I don't know if any of us know which is which."}, {"time": 4952, "text": "So we're trying to figure that out."}, {"time": 4953, "text": "Some people, I think Doja Cat is incredible at it."}, {"time": 4956, "text": "Incredible, like just masterful."}, {"time": 4959, "text": "I don't know if you like follow that."}, {"time": 4961, "text": "So okay, so not taking anything seriously, joking, absurd, humor, that kind of thing."}, {"time": 4967, "text": "I think Doja Cat might be like the greatest living comedian right now."}, {"time": 4972, "text": "Like I'm more entertained by Doja Cat than actual comedians."}, {"time": 4976, "text": "Like she's really fucking funny on the internet."}, {"time": 4978, "text": "She's just great at social media."}, {"time": 4980, "text": "It's just, you know."}, {"time": 4982, "text": "Yeah, the nature of humor, like humor on social media is also a beautiful thing, the absurdity."}, {"time": 4988, "text": "The absurdity."}, {"time": 4989, "text": "And memes, like I just wanna like take a moment."}, {"time": 4992, "text": "I love, like when we're talking about art and credit and authenticity, I love that there's this, I mean now memes are like, they're no longer, like memes aren't like new, but it's still this emergent art form that is completely egoless and anonymous and we just don't know who made any of it."}, {"time": 5009, "text": "And it's like the forefront of comedy and it's just totally anonymous and it just feels really beautiful."}, {"time": 5016, "text": "It just feels like this beautiful collective human art project that's like this like decentralized comedy thing that just makes memes add so much to my day and many people's days."}, {"time": 5029, "text": "And it's just like, I don't know."}, {"time": 5032, "text": "I don't think people ever, I don't think we stop enough and just appreciate how sick it is that memes exist."}, {"time": 5039, "text": "Because also making a whole brand new art form in like the modern era that's like didn't exist before."}, {"time": 5047, "text": "Like, I mean they sort of existed, but the way that they exist now as like this like, you know, like me and my friends, like we joke that we go like mining for memes or farming for memes, like a video game and like meme dealers and like whatever."}, {"time": 5061, "text": "Like it's, you know, it's this whole, memes are this whole like new comedic language."}, {"time": 5067, "text": "Well, it's this art form."}, {"time": 5069, "text": "The interesting thing about it is that lame people seem to not be good at memes."}, {"time": 5075, "text": "Like corporate can't infiltrate memes."}, {"time": 5078, "text": "Yeah, they really can't."}, {"time": 5079, "text": "They try, they could try."}, {"time": 5081, "text": "But it's like, it's weird cause like."}, {"time": 5083, "text": "They try so hard and every once in a while, I'm like fine, like you got a good one."}, {"time": 5088, "text": "I think I've seen like one or two good ones, but like, yeah, they really can't."}, {"time": 5093, "text": "Cause they're even, corporate is infiltrating web three."}, {"time": 5095, "text": "It's making me really sad, but they can't infiltrate the memes."}, {"time": 5098, "text": "And I think there's something really beautiful about that."}, {"time": 5100, "text": "That gives power, that's why Dogecoin is powerful."}, {"time": 5103, "text": "It's like, all right, I'm gonna F you to sort of anybody who's trying to centralize, is trying to control the rich people that are trying to roll in and control this, control the narrative."}, {"time": 5114, "text": "Wow, I hadn't thought about that, but."}, {"time": 5117, "text": "How would you fix Twitter?"}, {"time": 5118, "text": "How would you fix social media for your own?"}, {"time": 5121, "text": "Like you're an optimist, you're a positive person."}, {"time": 5125, "text": "There's a bit of a cynicism that you have currently about this particular little slice of humanity."}, {"time": 5130, "text": "I tend to think Twitter could be beautiful."}, {"time": 5132, "text": "I'm not that cynical about it."}, {"time": 5135, "text": "I actually refuse to be a cynic on principle."}, {"time": 5138, "text": "I was just briefly expressing some personal pathos."}, {"time": 5141, "text": "Personal stuff."}, {"time": 5142, "text": "It was just some personal pathos, but like, like."}, {"time": 5145, "text": "Just to vent a little bit, just to speak."}, {"time": 5148, "text": "I don't have cancer, I love my family."}, {"time": 5150, "text": "I have a good life."}, {"time": 5151, "text": "That is, if that is my biggest, one of my biggest problems."}, {"time": 5156, "text": "Then it's a good life."}, {"time": 5157, "text": "Yeah, you know, that was a brief, although I do think there are a lot of issues with Twitter just in terms of like the public mental health, but due to my proximity to the current dramas, I honestly feel that I should not have opinions about this because I think that if Elon ends up getting Twitter, that is a, being the arbiter of truth or public discussion, that is a responsibility."}, {"time": 5196, "text": "I do not, I am not qualified to be responsible for that."}, {"time": 5201, "text": "And I do not want to say something that might like dismantle democracy."}, {"time": 5208, "text": "And so I just like, actually, I actually think I should not have opinions about this because I truly am not, I don't want to have the wrong opinion about this."}, {"time": 5216, "text": "And I think I'm too close to the actual situation wherein I should not have, I have thoughts in my brain, but I think I am scared by my proximity to this situation."}, {"time": 5229, "text": "Isn't that crazy that a few words that you could say could change world affairs and hurt people?"}, {"time": 5238, "text": "I mean, that's the nature of celebrity at a certain point that you have to be, you have to a little bit, a little bit, not so much that it destroys you or puts too much constraints, but you have to a little bit think about the impact of your words."}, {"time": 5253, "text": "I mean, we as humans, you talk to somebody at a bar, you have to think about the impact of your words."}, {"time": 5259, "text": "Like you can say positive things, you can say negative things, you can affect the direction of one life."}, {"time": 5263, "text": "But on social media, your words can affect the direction of many lives."}, {"time": 5268, "text": "It's a crazy world to live in."}, {"time": 5270, "text": "It's worthwhile to consider that responsibility, take it seriously."}, {"time": 5274, "text": "Sometimes just like you did choose kind of silence, choose sort of respectful."}, {"time": 5283, "text": "Like I do have a lot of thoughts on the matter."}, {"time": 5285, "text": "I'm just, I don't, if my thoughts are wrong, this is one situation where the stakes are high."}, {"time": 5292, "text": "You mentioned a while back that you were in a cult that's centered around bureaucracy, so you can't really do anything because it involves a lot of paperwork."}, {"time": 5300, "text": "And I really love a cult that's just like Kafkaesque."}, {"time": 5306, "text": "I mean, it was like a joke, but it was."}, {"time": 5307, "text": "I know, but I love this idea."}, {"time": 5309, "text": "The Holy Rain Empire."}, {"time": 5310, "text": "Yeah, it was just like a Kafkaesque pro bureaucracy cult."}, {"time": 5314, "text": "But I feel like that's what human civilization is, is that, because when you said that, I was like, oh, that is kind of what humanity is, is this bureaucracy cult."}, {"time": 5321, "text": "I do, yeah, I have this theory."}, {"time": 5325, "text": "I really think that we really, bureaucracy is starting to kill us."}, {"time": 5333, "text": "And I think like we need to reorient laws and stuff."}, {"time": 5339, "text": "Like, I think we just need sunset clauses on everything."}, {"time": 5341, "text": "Like, I think the rate of change in culture is happening so fast and the rate of change in technology and everything is happening so fast."}, {"time": 5347, "text": "It's like, when you see these hearings about like social media and Cambridge Analytica and everyone talking, it's like, even from that point, so much technological change has happened from like those hearings."}, {"time": 5362, "text": "And it's just like, we're trying to make all these laws now about AI and stuff."}, {"time": 5365, "text": "I feel like we should be updating things like every five years."}, {"time": 5368, "text": "And like one of the big issues in our society right now is we're just getting bogged down by laws and it's making it very hard to change things and develop things."}, {"time": 5377, "text": "In Austin, I don't wanna speak on this too much, but like one of my friends is working on a housing bill in Austin to try to like prevent like a San Francisco situation from happening here because obviously we're getting a little mini San Francisco here, like housing prices are skyrocketing, it's causing massive gentrification."}, {"time": 5394, "text": "This is really bad for anyone who's not super rich."}, {"time": 5399, "text": "Like, there's so much bureaucracy."}, {"time": 5400, "text": "Part of the reason this is happening is because you need all these permits to build."}, {"time": 5404, "text": "It takes like years to get permits to like build anything."}, {"time": 5406, "text": "It's so hard to build and so there's very limited housing and there's a massive influx of people."}, {"time": 5410, "text": "And it's just like, you know, this is a microcosm of like problems that are happening all over the world where it's just like, we're dealing with laws that are like 10, 20, 30, 40, 100, 200 years old and they are no longer relevant and it's just slowing everything down and causing massive social pain."}, {"time": 5429, "text": "Yeah, but it's like, it's also makes me sad when I see politicians talk about technology and when they don't really get it."}, {"time": 5438, "text": "But most importantly, they lack curiosity and like that like inspired excitement about like how stuff works and all that stuff."}, {"time": 5446, "text": "They're just like, they see, they have a very cynical view of technology."}, {"time": 5450, "text": "It's like tech companies are just trying to do evil on the world from their perspective and they have no curiosity about like how recommender systems work or how AI systems work, natural language processing, how robotics works, how computer vision works, you know."}, {"time": 5465, "text": "They always take the most cynical possible interpretation of what technology would be used and we should definitely be concerned about that but if you're constantly worried about that and you're regulating based on that, you're just going to slow down all the innovation."}, {"time": 5476, "text": "I do think a huge priority right now is undoing the bad energy surrounding the emergence of Silicon Valley."}, {"time": 5518, "text": "I think we can fix a lot of our problems more easily with technology than with you know, fighting the powers that be as a you know, not to go back to the Star Wars quote or the Buckminster Fuller quote."}, {"time": 5531, "text": "Let's go to some dark questions."}, {"time": 5534, "text": "If we may for time, what is the darkest place you've ever gone in your mind?"}, {"time": 5540, "text": "Is there a time, a period of time, a moment that you remember that was difficult for you?"}, {"time": 5549, "text": "I mean, when I was 18, my best friend died of a heroin overdose and it was like my, and then shortly after that, one of my other best friends committed suicide and that sort of like coming into adulthood, dealing with two of the most important people in my life dying in extremely disturbing violent ways was a lot."}, {"time": 5575, "text": "That was a lot."}, {"time": 5578, "text": "Yeah, definitely miss them."}, {"time": 5579, "text": "Did that make you think about your own life?"}, {"time": 5582, "text": "About the finiteness of your own life?"}, {"time": 5584, "text": "The places your mind can go?"}, {"time": 5588, "text": "Did you ever in the distance, far away contemplate just your own death?"}, {"time": 5595, "text": "Or maybe even taking your own life?"}, {"time": 5597, "text": "Oh never, oh no."}, {"time": 5598, "text": "I'm so, I love my life."}, {"time": 5600, "text": "I cannot fathom suicide."}, {"time": 5603, "text": "I'm so scared of death."}, {"time": 5604, "text": "I haven't, I'm too scared of death."}, {"time": 5605, "text": "My manager, my manager's like the most Zen guy."}, {"time": 5608, "text": "My manager's always like, you need to accept death."}, {"time": 5611, "text": "You need to accept death."}, {"time": 5612, "text": "And I'm like, look, I can do your meditation."}, {"time": 5614, "text": "I can do the meditation, but I cannot accept death."}, {"time": 5617, "text": "I like, I will fight, I'm terrified of death."}, {"time": 5620, "text": "I will like fight."}, {"time": 5622, "text": "Although I actually think death is important."}, {"time": 5625, "text": "I recently went to this meeting about immortality and in the process of."}, {"time": 5631, "text": "That's the actual topic of the meeting?"}, {"time": 5634, "text": "No, no, it was this girl."}, {"time": 5634, "text": "It was a bunch of people working on like anti aging stuff."}, {"time": 5638, "text": "It was like some like seminary thing about it."}, {"time": 5641, "text": "And I went in really excited."}, {"time": 5643, "text": "I was like, yeah, like, okay, like, what do you got?"}, {"time": 5645, "text": "Like, how can I live for 500 years or a thousand years?"}, {"time": 5647, "text": "And then like over the course of the meeting, like it was sort of like, right."}, {"time": 5651, "text": "It was like two or three days after the Russian invasion started."}, {"time": 5654, "text": "And I was like, man, like, what if Putin was immortal?"}, {"time": 5657, "text": "Like, what if I'm like, man, maybe immortality, is not good."}, {"time": 5663, "text": "I mean, like if you get into the later Dune stuff, the immortals cause a lot of problem."}, {"time": 5669, "text": "Cause as we were talking about earlier with the music and like brains calcify, like good people could become immortal, but bad people could become immortal."}, {"time": 5676, "text": "But I also think even the best people power corrupts and power alienates you from like the common human experience and."}, {"time": 5687, "text": "Right, so the people that get more and more powerful."}, {"time": 5689, "text": "Even the best people who like, whose brains are amazing, like I think death might be important."}, {"time": 5694, "text": "I think death is part of, you know, like I think with AI one thing we might want to consider, I don't know, when I talk about AI, I'm such not an expert and probably everyone has all these ideas and they're already figured out."}, {"time": 5706, "text": "But when I was talking."}, {"time": 5707, "text": "Nobody is an expert in anything."}, {"time": 5708, "text": "See, okay, go ahead."}, {"time": 5709, "text": "But when I."}, {"time": 5710, "text": "You were talking about."}, {"time": 5711, "text": "Yeah, but I like, it's just like, I think some kind of pruning."}, {"time": 5716, "text": "But it's a tricky thing because if there's too much of a focus on youth culture, then you don't have the wisdom."}, {"time": 5725, "text": "So I feel like we're in a tricky, we're in a tricky moment right now in society where it's like, we've really perfected living for a long time."}, {"time": 5733, "text": "So there's all these really like old people who are like really voting against the wellbeing of the young people, you know?"}, {"time": 5741, "text": "And like, it's like there shouldn't be all this student dead and we need like healthcare, like universal healthcare and like just voting against like best interests."}, {"time": 5752, "text": "But then you have all these young people that don't have the wisdom that are like, yeah, we need communism and stuff."}, {"time": 5757, "text": "And it's just like, like literally I got canceled at one point for, I ironically used a Stalin quote in my high school yearbook, but it was actually like a diss against my high school."}, {"time": 5770, "text": "Yeah, and people were like, you used to be a Stalinist and now you're a class traitor and it's like, it's like, oh man, just like, please Google Stalin."}, {"time": 5779, "text": "Please Google Stalin."}, {"time": 5781, "text": "Ignoring the lessons of history, yes."}, {"time": 5783, "text": "And it's like, we're in this really weird middle ground where it's like, we are not finding the happy medium between wisdom and fresh ideas and they're fighting each other."}, {"time": 5795, "text": "And it's like, like really, like what we need is like the fresh ideas and the wisdom to be like collaborating."}, {"time": 5805, "text": "What the fighting in a way is the searching for the happy medium."}, {"time": 5808, "text": "And in a way, maybe we are finding the happy medium."}, {"time": 5811, "text": "Maybe that's what the happy medium looks like."}, {"time": 5812, "text": "And for AI systems, there has to be, it's, you know, you have the reinforcement learning, you have the dance between exploration and exploitation, sort of doing crazy stuff to see if there's something better than what you think is the optimal and then doing the optimal thing and dancing back and forth from that."}, {"time": 5828, "text": "You would, Stuart Russell, I don't know if you know that, is AI guy with, thinks about sort of how to control super intelligent AI systems."}, {"time": 5838, "text": "And his idea is that we should inject uncertainty and sort of humility into AI systems that they never, as they get wiser and wiser and wiser and more intelligent, they're never really sure."}, {"time": 5850, "text": "They always doubt themselves."}, {"time": 5851, "text": "And in some sense, when you think of young people, that's a mechanism for doubt."}, {"time": 5856, "text": "It's like, it's how society doubts whether the thing it has converged towards is the right answer."}, {"time": 5861, "text": "So the voices of the young people is a society asking itself a question."}, {"time": 5868, "text": "The way I've been doing stuff for the past 50 years, maybe it's the wrong way."}, {"time": 5872, "text": "And so you can have all of that within one AI system."}, {"time": 5875, "text": "I also think, though, that we need to, I mean, actually, that's actually really interesting and really cool."}, {"time": 5881, "text": "But I also think there's a fine balance of, I think we maybe also overvalue the idea that the old systems are always bad."}, {"time": 5891, "text": "And I think there are things that we are perfecting and we might be accidentally overthrowing things that we actually have gotten to a good point."}, {"time": 5899, "text": "Just because we value disruption so much and we value fighting against the generations before us so much that there's also an aspect of, sometimes we're taking two steps forward, one step back because, okay, maybe we kind of did solve this thing and now we're like fucking it up, you know?"}, {"time": 5918, "text": "And so I think there's like a middle ground there too."}, {"time": 5924, "text": "Yeah, we're in search of that happy medium."}, {"time": 5926, "text": "Let me ask you a bunch of crazy questions, okay?"}, {"time": 5930, "text": "You can answer in a short way or in a long way."}, {"time": 5933, "text": "What's the scariest thing you've ever done?"}, {"time": 5935, "text": "These questions are gonna be ridiculous."}, {"time": 5937, "text": "Something tiny or something big."}, {"time": 5940, "text": "Something big, skydiving or touring your first record, going on this podcast."}, {"time": 5952, "text": "I've had two crazy brushes, like really scary brushes with death where I randomly got away on scay."}, {"time": 5956, "text": "I don't know if I should talk about those on here."}, {"time": 5960, "text": "I think I might be the luckiest person alive though."}, {"time": 5962, "text": "Like this might be too dark for a podcast though."}, {"time": 5965, "text": "I feel like, I don't know if this is like good content for a podcast."}, {"time": 5968, "text": "I don't know what is good content."}, {"time": 5970, "text": "It might hijack."}, {"time": 5971, "text": "Here's a safer one."}, {"time": 5972, "text": "I mean, having a baby really scared me."}, {"time": 5976, "text": "Before."}, {"time": 5977, "text": "Just the birth process."}, {"time": 5978, "text": "Surgery, like just having a baby is really scary."}, {"time": 5985, "text": "So just like the medical aspect of it, not the responsibility."}, {"time": 5989, "text": "Were you ready for the responsibility?"}, {"time": 5991, "text": "Did you, were you ready to be a mother?"}, {"time": 5993, "text": "All the beautiful things that comes with motherhood that you were talking about."}, {"time": 5997, "text": "All the changes and all that, were you ready for that?"}, {"time": 6001, "text": "Or did you feel ready for that?"}, {"time": 6002, "text": "No, I think it took about nine months to start getting ready for it."}, {"time": 6006, "text": "And I'm still getting more ready for it because now you keep realizing more things as they start getting."}, {"time": 6014, "text": "As the consciousness grows."}, {"time": 6016, "text": "And stuff you didn't notice with the first one, now that you've seen the first one older, you're noticing it more."}, {"time": 6021, "text": "Like the sort of like existential horror of coming into consciousness with Baby Y or Baby Sailor Mars or whatever."}, {"time": 6030, "text": "She has like so many names at this point that it's, we really need to probably settle on one."}, {"time": 6036, "text": "If you could be someone else for a day, someone alive today, but somebody you haven't met yet, who would you be?"}, {"time": 6042, "text": "Would I be modeling their brain state or would I just be in their body?"}, {"time": 6046, "text": "You can choose the degree to which you're modeling their brain state."}, {"time": 6050, "text": "Cause you can still take a third person perspective and realize, you have to realize that you're."}, {"time": 6056, "text": "Can they be alive or can it be dead?"}, {"time": 6060, "text": "No, oh."}, {"time": 6062, "text": "They would be brought back to life, right?"}, {"time": 6064, "text": "If they're dead."}, {"time": 6065, "text": "Yeah, you can bring people back."}, {"time": 6067, "text": "Definitely Hitler or Stalin."}, {"time": 6069, "text": "I wanna understand evil."}, {"time": 6072, "text": "You would need to, oh, to experience what it feels like."}, {"time": 6075, "text": "I wanna be in their brain feeling what they feel."}, {"time": 6078, "text": "I might change you forever returning from that."}, {"time": 6080, "text": "Yes, but I think it would also help me understand how to prevent it and fix it."}, {"time": 6085, "text": "That might be one of those things, once you experience it, it'll be a burden to know it."}, {"time": 6089, "text": "Cause you won't be able to transfer that."}, {"time": 6090, "text": "Yeah, but a lot of things are burdens."}, {"time": 6093, "text": "But it's a useful burden."}, {"time": 6094, "text": "But it's a useful burden, yeah."}, {"time": 6096, "text": "That for sure, I wanna understand evil and psychopathy and that."}, {"time": 6102, "text": "I have all these fake Twitter accounts where I go into different algorithmic bubbles to try to understand."}, {"time": 6107, "text": "I'll keep getting in fights with people and realize we're not actually fighting."}, {"time": 6110, "text": "I think we used to exist in a monoculture before social media and stuff."}, {"time": 6114, "text": "We kinda all got fed the same thing."}, {"time": 6116, "text": "So we were all speaking the same cultural language."}, {"time": 6118, "text": "But I think recently, one of the things that we aren't diagnosing properly enough with social media is that there's different dialects."}, {"time": 6125, "text": "There's so many different dialects of Chinese."}, {"time": 6126, "text": "There are now becoming different dialects of English."}, {"time": 6129, "text": "I am realizing there are people who are saying the exact same things, but they're using completely different verbiage."}, {"time": 6135, "text": "And we're punishing each other for not using the correct verbiage."}, {"time": 6138, "text": "And we're completely misunderstanding."}, {"time": 6140, "text": "People are just misunderstanding what the other people are saying."}, {"time": 6143, "text": "And I just got in a fight with a friend about anarchism and communism and shit for two hours."}, {"time": 6153, "text": "And then by the end of a conversation, and then she'd say something, and I'm like, but that's literally what I'm saying."}, {"time": 6159, "text": "And then I was like, fuck, we've different, I'm like, our English, the way we are understanding terminology is like drastically, like our algorithm bubbles are creating mini dialects."}, {"time": 6173, "text": "Of how language is interpreted, how language is used."}, {"time": 6176, "text": "And so we're like having these arguments that we do not need to be having."}, {"time": 6180, "text": "And there's polarization that's happening that doesn't need to be happening because we've got these like algorithmically created dialects occurring."}, {"time": 6189, "text": "Plus on top of that, there's also different parts of the world that speak different languages."}, {"time": 6193, "text": "So there's literally lost in translation kind of communication."}, {"time": 6197, "text": "I happen to know the Russian language and just know how different it is."}, {"time": 6202, "text": "Then the English language."}, {"time": 6203, "text": "And I just wonder how much is lost in a little bit of."}, {"time": 6207, "text": "Man, I actually, cause I have a question for you."}, {"time": 6208, "text": "I have a song coming out tomorrow with I Speak Who Are A Russian Band."}, {"time": 6211, "text": "And I speak a little bit of Russian and I was looking at the title and the title in English doesn't match the title in Russian."}, {"time": 6218, "text": "I'm curious about this."}, {"time": 6219, "text": "Cause look, it says the title in English is Last Day."}, {"time": 6222, "text": "And then the title in Russian is New Day."}, {"time": 6225, "text": "My pronunciation sucks."}, {"time": 6227, "text": "New Day."}, {"time": 6229, "text": "Like a new day."}, {"time": 6230, "text": "A new day."}, {"time": 6231, "text": "Yeah, new day, new day."}, {"time": 6232, "text": "Like it's two different meanings."}, {"time": 6233, "text": "Yeah, new day, yeah."}, {"time": 6237, "text": "Yeah, yeah, new day."}, {"time": 6238, "text": "New day, but last day."}, {"time": 6241, "text": "New day."}, {"time": 6242, "text": "So last day would be the last day."}, {"time": 6245, "text": "Maybe they."}, {"time": 6245, "text": "Or maybe the title includes both the Russian and it's for."}, {"time": 6249, "text": "Maybe it's for bilingual."}, {"time": 6250, "text": "But to be honest, Novodin sounds better than just musically."}, {"time": 6255, "text": "Like Novodin is new day."}, {"time": 6257, "text": "That's the current one."}, {"time": 6258, "text": "And Posledniy Den is the last day."}, {"time": 6263, "text": "I think Novodin."}, {"time": 6265, "text": "I don't like Novodin."}, {"time": 6266, "text": "But the meaning is so different."}, {"time": 6270, "text": "That's kind of awesome actually though."}, {"time": 6271, "text": "There's an explicit sort of contrast like that."}, {"time": 6275, "text": "If everyone on earth disappeared and it was just you left, what would your day look like?"}, {"time": 6284, "text": "Like what would you do?"}, {"time": 6285, "text": "Everybody's dead."}, {"time": 6286, "text": "As far as you."}, {"time": 6287, "text": "Are there corpses there?"}, {"time": 6292, "text": "Well seriously, it's a big."}, {"time": 6293, "text": "Let me think through this."}, {"time": 6294, "text": "It's a big difference if there's just like birds singing versus if there's like corpses littering the street."}, {"time": 6298, "text": "Yeah, there's corpses everywhere, I'm sorry."}, {"time": 6301, "text": "It's, and you don't actually know what happened and you don't know why you survived."}, {"time": 6307, "text": "And you don't even know if there's others out there."}, {"time": 6310, "text": "But it seems clear that it's all gone."}, {"time": 6317, "text": "Listen, I'm somebody who really enjoys the moment, enjoys life."}, {"time": 6320, "text": "I would just go on like enjoying the inanimate objects."}, {"time": 6326, "text": "I would just look for food, basic survival."}, {"time": 6330, "text": "But most of it is just, listen, when I just, I take walks and I look outside and I'm just happy that we get to exist on this planet, to be able to breathe air."}, {"time": 6341, "text": "It's just all beautiful."}, {"time": 6343, "text": "It's full of colors, all of this kind of stuff."}, {"time": 6344, "text": "Just, there's so many things about life, your own life, conscious life that's fucking awesome."}, {"time": 6350, "text": "So I would just enjoy that."}, {"time": 6354, "text": "But also maybe after a few weeks, the engineer would start coming out, like wanna build some things."}, {"time": 6361, "text": "Maybe there's always hope searching for another human."}, {"time": 6366, "text": "Probably searching for another human."}, {"time": 6369, "text": "Probably trying to get to a TV or radio station and broadcast something."}, {"time": 6378, "text": "That's interesting, I didn't think about that."}, {"time": 6379, "text": "So like really maximize your ability to connect with others."}, {"time": 6384, "text": "Yeah, like probably try to find another person."}, {"time": 6389, "text": "Would you be excited to see, to meet another person or terrified?"}, {"time": 6393, "text": "Because, you know."}, {"time": 6394, "text": "I'd be excited."}, {"time": 6395, "text": "No matter what."}, {"time": 6398, "text": "Being alone for the last however long of my life would be really bad."}, {"time": 6403, "text": "That's the one instance I might, I don't think I'd kill myself, but I might kill myself if I had to."}, {"time": 6408, "text": "So you love people."}, {"time": 6410, "text": "You love connection to other humans."}, {"time": 6412, "text": "I kinda hate people too, but yeah."}, {"time": 6414, "text": "That's a love hate relationship."}, {"time": 6417, "text": "I feel like we'd have a bunch of weird Nietzsche questions and stuff though."}, {"time": 6421, "text": "Like I wonder, cause I'm like, when podcast, I'm like, is this interesting for people to just have like, or I don't know, maybe people do like this."}, {"time": 6428, "text": "When I listen to podcasts, I'm into like the lore, like the hard lore."}, {"time": 6431, "text": "Like I just love like Dan Carlin."}, {"time": 6433, "text": "I'm like, give me the facts."}, {"time": 6434, "text": "Just like, like the facts into my bloodstream."}, {"time": 6438, "text": "But you also don't know, like you're a fascinating mind to explore."}, {"time": 6443, "text": "So you don't realize as you're talking about stuff, the stuff you've taken for granted is actually unique and fascinating."}, {"time": 6450, "text": "The way you think."}, {"time": 6452, "text": "Not always what, like the way you reason through things is the fascinating thing to listen to."}, {"time": 6459, "text": "Because people kind of see, oh, there's other humans that think differently, that explore thoughts differently."}, {"time": 6465, "text": "That's the cool, that's also cool."}, {"time": 6467, "text": "So yeah, Dan Carlin retelling of history."}, {"time": 6470, "text": "By the way, his retelling of history is very, I think what's exciting is not the history, is his way of thinking about history."}, {"time": 6480, "text": "No, I think Dan Carlin is one of the people, like when, Dan Carlin is one of the people that really started getting me excited about like revolutionizing education."}, {"time": 6488, "text": "Because like Dan Carlin instilled, I already like really liked history, but he instilled like an obsessive love of history in me to the point where like now I'm fucking reading, like going to bed, reading like part four of The Rise and Fall of the Third Reich or whatever."}, {"time": 6506, "text": "Like I got like dense ass history, but like he like opened that door that like made me want to be a scholar of that topic."}, {"time": 6514, "text": "Like it's like, I feel like he's such a good teacher."}, {"time": 6517, "text": "He just like, you know, and it sort of made me feel like one of the things we could do with education is like find like the world's great, the teachers that like create passion for the topic because autodidactricism, I don't know how to say that properly, but like self teaching is like much faster than being lectured to."}, {"time": 6539, "text": "Like it's much more efficient to sort of like be able to teach yourself and then ask a teacher questions when you don't know what's up."}, {"time": 6544, "text": "But like, you know, that's why it's like in university and stuff, like you can learn so much more material so much faster because you're doing a lot of the learning on your own and you're going to the teachers for when you get stuck."}, {"time": 6555, "text": "But like these teachers that can inspire passion for a topic, I think that is one of the most invaluable skills in our whole species."}, {"time": 6563, "text": "Like, because if you can do that, then you, it's like AI, like AI is going to teach itself so much more efficiently than we can teach it."}, {"time": 6571, "text": "We just needed to get it to the point where it can teach itself."}, {"time": 6575, "text": "It finds the motivation to do so, right?"}, {"time": 6578, "text": "So like you inspire it to do so."}, {"time": 6580, "text": "And then it could teach itself."}, {"time": 6582, "text": "What do you make of the fact, you mentioned Rise and Fall of the Third Reich."}, {"time": 6588, "text": "Yeah, I read it twice."}, {"time": 6588, "text": "You read it twice?"}, {"time": 6590, "text": "Okay, so no one even knows what it is."}, {"time": 6592, "text": "And I'm like, wait, I thought this was like a super poppin book."}, {"time": 6594, "text": "Super pop."}, {"time": 6595, "text": "Yeah, I'm not like that, I'm not that far in it."}, {"time": 6598, "text": "But it is, it's so interesting."}, {"time": 6600, "text": "Yeah, it's written by a person that was there, which is very important to kind of."}, {"time": 6605, "text": "You know, you start being like, how could this possibly happen?"}, {"time": 6608, "text": "And then when you read Rise and Fall of the Third Reich, it's like, people tried really hard for this to not happen."}, {"time": 6614, "text": "People tried, they almost reinstated a monarchy at one point to try to stop this from happening."}, {"time": 6617, "text": "Like they almost like abandoned democracy to try to get this to not happen."}, {"time": 6622, "text": "At least the way it makes me feel is that there's a bunch of small moments on which history can turn."}, {"time": 6630, "text": "It's like small meetings."}, {"time": 6633, "text": "Human interactions."}, {"time": 6634, "text": "And it's both terrifying and inspiring because it's like, even just attempts at assassinating Hitler, like time and time again failed."}, {"time": 6647, "text": "And they were so close."}, {"time": 6648, "text": "Was it like Operation Valkyrie?"}, {"time": 6649, "text": "Such a good."}, {"time": 6651, "text": "And then there's also the role of, that's a really heavy burden, which is from a geopolitical perspective, the role of leaders to see evil before it truly becomes evil, to anticipate it, to stand up to evil."}, {"time": 6665, "text": "Because evil is actually pretty rare in this world at a scale that Hitler was."}, {"time": 6669, "text": "We tend to, you know, in the modern discourse kind of call people evil too quickly."}, {"time": 6674, "text": "If you look at ancient history, like there was a ton of Hitlers."}, {"time": 6715, "text": "Just like people, cities used to get leveled all the fucking time."}, {"time": 6720, "text": "Okay, get into the Bronze Age collapse."}, {"time": 6722, "text": "It's basically, there was like almost like Roman level like society."}, {"time": 6727, "text": "Like there was like all over the world, like global trade, like everything was awesome through a mix of, I think a bit of climate change and then the development of iron because basically bronze could only come from this, the way to make bronze, like everything had to be funneled through this one Iranian mine."}, {"time": 6764, "text": "And like the thing that seems to cause Dark Ages is mass supply chain collapse."}, {"time": 6768, "text": "But the Bronze Age collapse happened like, it was sort of like this ancient collapse that happened where like literally like ancient Egypt, all these cities, everything just got like decimated, destroyed, abandoned cities, like hundreds of them."}, {"time": 6784, "text": "There was like a flourishing society, like we were almost coming to modernity and everything got leveled."}, {"time": 6788, "text": "And they had this mini Dark Ages, but it was just like, there's so little writing or recording from that time that like, there isn't a lot of information about the Bronze Age collapse, but it was basically equivalent to like medieval, the medieval Dark Ages."}, {"time": 6801, "text": "But it just happened, I don't know the years, but like thousands of years earlier."}, {"time": 6806, "text": "And then we sort of like recovered from the Bronze Age collapse, empire reemerged, writing and trade and everything reemerged."}, {"time": 6816, "text": "And then we of course had the more contemporary Dark Ages."}, {"time": 6820, "text": "And then over time, we've designed mechanism to lessen and lessen the capability for the destructive power centers to emerge."}, {"time": 6830, "text": "There's more recording about the more contemporary Dark Ages."}, {"time": 6834, "text": "So I think we have like a better understanding of how to avoid it, but I still think we're at high risk for it."}, {"time": 6838, "text": "I think that's one of the big risks right now."}, {"time": 6840, "text": "So the natural state of being for humans is for there to be a lot of Hitlers, which has gotten really good at making it hard for them to emerge."}, {"time": 6849, "text": "We've gotten better at collaboration and resisting the power, like authoritarians to come to power."}, {"time": 6856, "text": "We're trying to go country by country, like we're moving past this."}, {"time": 6859, "text": "We're kind of like slowly incrementally, like moving towards like not scary old school war stuff."}, {"time": 6869, "text": "And I think seeing it happen in some of the countries that at least nominally are like supposed to have moved past that, that's scary because it reminds us that it can happen like in the places that have moved supposedly, as hopefully moved past that."}, {"time": 6887, "text": "And possibly at a civilization level, like you said, supply chain collapse might make people resource constraint, might make people desperate, angry, hateful, violent, and drag us right back in."}, {"time": 6901, "text": "I mean, supply chain collapse is how, like the ultimate thing that caused the Middle Ages was supply chain collapse."}, {"time": 6908, "text": "It's like people, because people were reliant on a certain level of technology, like people, like you look at like Britain, like they had glass, like people had aqueducts, people had like indoor heating and cooling and like running water and like buy food from all over the world and trade and markets."}, {"time": 6926, "text": "Like people didn't know how to hunt and forage and gather."}, {"time": 6928, "text": "And so we're in a similar situation."}, {"time": 6929, "text": "We are not educated enough to survive without technology."}, {"time": 6933, "text": "So if we have a supply chain collapse that like limits our access to technology, there will be like massive starvation and violence and displacement and war."}, {"time": 6943, "text": "Like, you know, it's like, yeah."}, {"time": 6947, "text": "In my opinion, it's like the primary marker of like what a dark age is."}, {"time": 6952, "text": "Well, technology is kind of enabling us to be more resilient in terms of supply chain, in terms of, to all the different catastrophic events that happened to us."}, {"time": 6962, "text": "Although the pandemic has kind of challenged our preparedness for the catastrophic."}, {"time": 6967, "text": "What do you think is the coolest invention humans come up with?"}, {"time": 6971, "text": "The wheel, fire, cooking meat."}, {"time": 6976, "text": "Freaking computers."}, {"time": 6976, "text": "Internet or computers?"}, {"time": 6979, "text": "What do you think the?"}, {"time": 6980, "text": "Previous technologies, I mean, may have even been more profound and moved us to a certain degree, but I think the computers are what make us homo tech now."}, {"time": 6987, "text": "I think this is what, it's a brain augmentation."}, {"time": 6990, "text": "And so it like allows for actual evolution."}, {"time": 6993, "text": "Like the computers accelerate the degree to which all the other technologies can also be accelerated."}, {"time": 6998, "text": "Would you classify yourself as a homo sapien or a homo techno?"}, {"time": 7001, "text": "Definitely homo techno."}, {"time": 7003, "text": "So you're one of the earliest of the species."}, {"time": 7006, "text": "I think most of us are."}, {"time": 7009, "text": "Like, as I said, like, I think if you like looked at brain scans of us versus humans a hundred years ago, it would look very different."}, {"time": 7020, "text": "I think we are physiologically different."}, {"time": 7023, "text": "Just even the interaction with the devices has changed our brains."}, {"time": 7026, "text": "Well, and if you look at, a lot of studies are coming out to show that like, there's a degree of inherited memory."}, {"time": 7033, "text": "So some of these physiological changes in theory should be, we should be passing them on."}, {"time": 7038, "text": "So like that's, you know, that's not like a, an instance of physiological change that's gonna fizzle out."}, {"time": 7044, "text": "In theory, that should progress like to our offspring."}, {"time": 7049, "text": "Speaking of offspring, what advice would you give to a young person, like in high school, whether there be an artist, a creative, an engineer, any kind of career path, or maybe just life in general, how they can live a life they can be proud of?"}, {"time": 7068, "text": "I think one of my big thoughts, and like, especially now having kids, is that I don't think we spend enough time teaching creativity."}, {"time": 7076, "text": "And I think creativity is a muscle like other things."}, {"time": 7079, "text": "And there's a lot of emphasis on, you know, learn how to play the piano."}, {"time": 7082, "text": "And then you can write a song or like learn the technical stuff."}, {"time": 7085, "text": "And then you can do a thing."}, {"time": 7087, "text": "But I think it's, like, I have a friend who's like world's greatest guitar player, like, you know, amazing sort of like producer, works with other people, but he's really sort of like, you know, he like engineers and records things and like does solos, but he doesn't really like make his own music."}, {"time": 7103, "text": "And I was talking to him and I was like, dude, you're so talented at music."}, {"time": 7107, "text": "Like, why don't you make music or whatever?"}, {"time": 7108, "text": "And he was like, cause I got, I'm too old."}, {"time": 7112, "text": "I never learned the creative muscle."}, {"time": 7114, "text": "And it's like, you know, it's embarrassing."}, {"time": 7116, "text": "It's like learning the creative muscle takes a lot of failure."}, {"time": 7120, "text": "And it also sort of, if when you're being creative, you know, you're throwing paint at a wall and a lot of stuff will fail."}, {"time": 7129, "text": "So like part of it is like a tolerance for failure and humiliation."}, {"time": 7133, "text": "And that's somehow that's easier to develop when you're young or be persist through it when you're young."}, {"time": 7138, "text": "Everything is easier to develop when you're young."}, {"time": 7143, "text": "And the younger, the better."}, {"time": 7144, "text": "It could destroy you."}, {"time": 7145, "text": "I mean, that's the shitty thing about creativity."}, {"time": 7148, "text": "If, you know, failure could destroy you if you're not careful, but that's a risk worth taking."}, {"time": 7153, "text": "But also, but at a young age, developing a tolerance to failure is good."}, {"time": 7157, "text": "I fail all the time."}, {"time": 7159, "text": "Like I do stupid shit all the time."}, {"time": 7162, "text": "Like in public, in private, I get canceled for, I've make all kinds of mistakes, but I just like am very resilient about making mistakes."}, {"time": 7170, "text": "And so then like I do a lot of things that like other people wouldn't do."}, {"time": 7174, "text": "And like, I think my greatest asset is my creativity."}, {"time": 7177, "text": "And I like, I think pain, like tolerance to failure is just a super essential thing that should be taught before other things."}, {"time": 7185, "text": "Brilliant advice."}, {"time": 7187, "text": "I wish everybody encouraged sort of failure more as opposed to kind of."}, {"time": 7192, "text": "Cause we like punish failure."}, {"time": 7193, "text": "We're like, no, like when we were teaching kids, we're like, no, that's wrong."}, {"time": 7196, "text": "Like that's, you know, like X keeps like will be like wrong."}, {"time": 7204, "text": "Like he'll say like crazy things."}, {"time": 7205, "text": "Like X keeps being like, like bubble car, bubble car."}, {"time": 7209, "text": "And I'm like, and you know, I'm like, what's a bubble car?"}, {"time": 7214, "text": "Like, but like, it doesn't like, but I don't want to be like, no, you're wrong."}, {"time": 7217, "text": "I'm like, you're thinking of weird, crazy shit."}, {"time": 7220, "text": "Like, I don't know what a bubble car is, but like."}, {"time": 7222, "text": "It's creating worlds and they might be internally consistent."}, {"time": 7225, "text": "And through that, you might discover something fundamental about this world."}, {"time": 7228, "text": "Yeah, or he'll like rewrite songs, like with words that he prefers."}, {"time": 7232, "text": "So like, instead of baby shark, he says baby car."}, {"time": 7236, "text": "Maybe he's onto something."}, {"time": 7242, "text": "We were kind of dancing around it, but what do you think is the meaning of this whole thing we have here of human civilization, of life on earth, but in general, just life?"}, {"time": 7257, "text": "C. Have you, did you read Nova Scene yet?"}, {"time": 7262, "text": "By James Lovelock?"}, {"time": 7263, "text": "You're doing a lot of really good book recommendations here."}, {"time": 7266, "text": "I haven't even finished this, so I'm a huge fraud yet again."}, {"time": 7270, "text": "But like really early in the book, he says this amazing thing."}]}]