[{"title": "Harry Cliff: Particle Physics and the Large Hadron Collider | Lex Fridman Podcast #92", "id": "8A-5gIW0-eI", "quotes": [{"time": 307, "text": "So these are fields like the magnetic field around a magnet that exists everywhere in space."}, {"time": 312, "text": "They're always there."}, {"time": 313, "text": "In fact, actually, it's funny that we're in the Royal Institution, because this is where the idea of the field was effectively invented by Michael Faraday doing experiments with magnets and coils of wire."}, {"time": 323, "text": "So he noticed that, you know, it was a very famous experiment that he did where he got a magnet and put on top of it a piece of paper and then sprinkled iron filings."}, {"time": 332, "text": "And he found the iron filings arranged themselves into these kind of loops, which was actually mapping out the invisible influence of this magnetic field, which is a thing, you know, we've all experienced, we've all felt, held a magnet or two poles of magnet and pushed them together and felt this thing, this force pushing back."}, {"time": 348, "text": "So these are real physical objects."}, {"time": 351, "text": "And the way we think of particles in modern physics is that they are essentially little vibrations, little ripples in these otherwise invisible fields that are everywhere."}, {"time": 361, "text": "They fill the whole universe."}, {"time": 363, "text": "You know, I don't, I apologize perhaps for the ridiculous question."}, {"time": 367, "text": "Are you comfortable with the idea of the fundamental nature of our reality being fields?"}, {"time": 374, "text": "Because to me, particles, you know, a bunch of different building blocks makes more sense sort of intellectually, sort of visually, like it seems to, I seem to be able to visualize that kind of idea easier."}, {"time": 388, "text": "Are you comfortable psychologically with the idea that the basic building block is not a block, but a field?"}, {"time": 395, "text": "I think it's, I think it's quite a magical idea."}, {"time": 398, "text": "I find it quite appealing."}, {"time": 399, "text": "And it's, well, it comes from a misunderstanding of what particles are."}, {"time": 403, "text": "So like when you, when we do science at school and we draw a picture of an atom, you draw like, you know, a nucleus with some protons and neutrons, these little spheres in the middle, and then you have some electrons that are like little flies flying around the atom."}, {"time": 414, "text": "And that is a completely misleading picture of what an atom is like."}, {"time": 417, "text": "It's nothing like that."}, {"time": 418, "text": "The electron is not like a little planet orbiting the atom."}, {"time": 421, "text": "It's this spread out, wibbly wobbly wave like thing."}, {"time": 425, "text": "And we know we've known that since, you know, the early 20th century, thanks to quantum mechanics."}, {"time": 430, "text": "So when we, we, we carry on using this word particle because sometimes when we do experiments, particles do behave like they're little marbles or little bullets, you know."}, {"time": 439, "text": "So in the LHC, when we collide particles together, you'll get, you know, you'll get like hundreds of particles all flying out through the detector and they all take a trajectory and you can see from the detector where they've gone and they look like they're little bullets."}, {"time": 451, "text": "So they behave that way, you know, a lot of the time."}, {"time": 455, "text": "When you really study them carefully, you'll see that they are not little spheres."}, {"time": 460, "text": "They are these ethereal disturbances in these underlying fields."}, {"time": 464, "text": "So this is really how we think nature is, which is surprising, but also I think kind of magic."}, {"time": 471, "text": "So, you know, we are, our bodies are basically made up of like little knots of energy in these invisible objects that are all around us."}, {"time": 480, "text": "And what is the story of the vacuum when it comes to LHC?"}, {"time": 487, "text": "So why did you mention the word vacuum?"}, {"time": 489, "text": "Okay, so if we just, if we go back to like the physics, we do know."}, {"time": 493, "text": "So atoms are made of electrons, which were discovered a hundred or so years ago."}, {"time": 498, "text": "And then in the nucleus of the atom, you have two other types of particles."}, {"time": 501, "text": "There's an up, something called an up quark and a down quark."}, {"time": 504, "text": "And those three particles make up every atom in the universe."}, {"time": 507, "text": "So we think of these as ripples in fields."}, {"time": 510, "text": "So there is something called the electron field and every electron in the universe is a ripple moving about in this electron field."}, {"time": 519, "text": "So the electron field is all around us, we can't see it, but every electron in our body is a little ripple in this thing that's there all the time."}, {"time": 525, "text": "And the quark fields are the same."}, {"time": 526, "text": "So there's an up quark field and an up quark is a little ripple in the up quark field."}, {"time": 530, "text": "And the down quark is a little ripple in something else called the down quark field."}, {"time": 533, "text": "So these fields are always there."}, {"time": 535, "text": "Now there are potentially, we know about a certain number of fields in what we call the standard model of particle physics."}, {"time": 541, "text": "And the most recent one we discovered was the Higgs field."}, {"time": 544, "text": "And the way we discovered the Higgs field was to make a little ripple in it."}, {"time": 548, "text": "So what the LHC did, it fired two protons into each other, very, very hard with enough energy that you could create a disturbance in this Higgs field."}, {"time": 558, "text": "And that's what shows up as what we call the Higgs boson."}, {"time": 560, "text": "So this particle that everyone was going on about eight or so years ago is proof really, the particle in itself is, I mean, it's interesting, but the thing that's really interesting is the field."}, {"time": 570, "text": "Because it's the Higgs field that we believe is the reason that electrons and quarks have mass."}, {"time": 578, "text": "And it's that invisible field that's always there that gives mass to the particles."}, {"time": 582, "text": "The Higgs boson is just our way of checking it's there basically."}, {"time": 586, "text": "And so the Large Hadron Collider, in order to get that ripple in the Higgs field, it requires a huge amount of energy."}, {"time": 594, "text": "Yeah, I suppose."}, {"time": 595, "text": "And so that's why you need this huge, that's why size matters here."}, {"time": 598, "text": "So maybe there's a million questions here, but let's backtrack."}, {"time": 602, "text": "Why does size matter in the context of a particle collider?"}, {"time": 609, "text": "So why does bigger allow you for higher energy collisions?"}, {"time": 615, "text": "Right, so the reason, well, it's kind of simple really, which is that there are two types of particle accelerator that you can build."}, {"time": 621, "text": "One is circular, which is like the LHC, the other is a great long line."}, {"time": 625, "text": "So the advantage of a circular machine is that you can send particles around a ring and you can give them a kick every time they go around."}, {"time": 632, "text": "So imagine you have a, there's actually a bit of the LHC, that's about only 30 meters long, where you have a bunch of metal boxes, which have oscillating 2 million volt electric fields inside them, which are timed so that when a proton goes through one of these boxes, the field it sees as it approaches is attractive."}, {"time": 648, "text": "And then as it leaves the box, it flips and becomes repulsive and the proton gets attracted and kicked out the other side, so it gets a bit faster."}, {"time": 655, "text": "So you send it, and then you send it back round again."}, {"time": 657, "text": "And it's incredible, like the timing of that, the synchronization, wait, really?"}, {"time": 662, "text": "I think there's going to be a multiplicative effect on the questions I have."}, {"time": 666, "text": "Is, okay, let me just take that attention for a second."}, {"time": 672, "text": "The orchestration of that, is that fundamentally a hardware problem or a software problem?"}, {"time": 677, "text": "Like what, how do you get that?"}, {"time": 680, "text": "I mean, I should first of all say, I'm not an engineer."}, {"time": 682, "text": "So the guys, I did not build the LHC, so they're people much, much better at this stuff than I."}, {"time": 686, "text": "For sure, but maybe."}, {"time": 690, "text": "But from your sort of intuition, from the echoes of what you understand, what you heard of how it's designed, what's your sense?"}, {"time": 700, "text": "What's the engineering aspects of it?"}, {"time": 703, "text": "The acceleration bit is not challenging."}, {"time": 705, "text": "Okay, I mean, okay, there's always challenges with everything, but basically you have these, the beams that go around the LHC, the beams of particles are divided into little bunches."}, {"time": 715, "text": "So they're called, they're a bit like swarms of bees, if you like, and there are around, I think it's something of the order 2000 bunches spaced around the ring."}, {"time": 725, "text": "And they, if you're at a given point on the ring, counting bunches, you get 40 million bunches passing you every second."}, {"time": 731, "text": "So they come in like cars going past on a very fast motorway."}, {"time": 736, "text": "So you need to have, if you're an electric field that you're using to accelerate the particles, that needs to be timed so that as a bunch of protons arrives, it's got the right sign to attract them and then flips at the right moment."}, {"time": 747, "text": "But I think the voltage in those boxes oscillates at hundreds of megahertz."}, {"time": 751, "text": "So the beams are like 40 megahertz, but it's oscillating much more quickly than the beam."}, {"time": 755, "text": "So I think it's difficult engineering, but in principle, it's not a really serious challenge."}, {"time": 761, "text": "The bigger problem."}, {"time": 762, "text": "There's probably engineers like screaming at you right now."}, {"time": 764, "text": "Probably, but I mean, okay."}, {"time": 766, "text": "So in terms of coming back to this thing, why is it so big?"}, {"time": 768, "text": "Well, the reason is you wanna get the particles through that accelerating element over and over again."}, {"time": 774, "text": "So you wanna bring them back round."}, {"time": 775, "text": "So that's why it's round."}, {"time": 776, "text": "The question is why couldn't you make it smaller?"}, {"time": 778, "text": "Well, the basic answer is that these particles are going unbelievably quickly."}, {"time": 783, "text": "So they travel at 99.9999991% of the speed of light in the LHC."}, {"time": 791, "text": "And if you think about, say, driving your car around a corner at high speed, if you go fast, you need a lot of friction in the tires to make sure you don't slide off the road."}, {"time": 801, "text": "So the limiting factor is how powerful a magnet can you make because what we do is magnets are used to bend the particles around the ring."}, {"time": 810, "text": "And essentially the LHC, when it was designed, was designed with the most powerful magnets that could conceivably be built at the time."}, {"time": 817, "text": "And so that's your kind of limiting factor."}, {"time": 820, "text": "So if you wanted to make the machine smaller, that means a tighter bend, you need to have a more powerful magnet."}, {"time": 824, "text": "So it's this toss up between how strong are your magnets versus how big a tunnel can you afford."}, {"time": 829, "text": "The bigger the tunnel, the weaker the magnets can be."}, {"time": 831, "text": "The smaller the tunnel, the stronger they've gotta be."}, {"time": 834, "text": "Okay, so maybe can we backtrack to the Standard Model and say what kind of particles there are, period, and maybe the history of kind of assembling that the Standard Model of physics and then how that leads up to the hopes and dreams and the accomplishments of the Large Hadron Collider."}, {"time": 852, "text": "Yeah, sure, okay."}, {"time": 854, "text": "So all of 20th century physics in like five minutes."}, {"time": 857, "text": "Okay, so, okay, the story really begins properly."}, {"time": 861, "text": "End of the 19th century, the basic view of matter is that matter is made of atoms and the atoms are indestructible, immutable little spheres like the things we were talking about that don't really exist."}, {"time": 872, "text": "And there's one atom for every chemical element."}, {"time": 875, "text": "So there's an atom for hydrogen, for helium, for carbon, for iron, et cetera, and they're all different."}, {"time": 879, "text": "Then in 1897, experiments done at the Cavendish Laboratory in Cambridge, which is where I'm still, where I'm based, showed that there are actually smaller particles inside the atom, which eventually became known as electrons."}, {"time": 891, "text": "So these are these negatively charged things that go around the outside."}, {"time": 894, "text": "A few years later, Ernest Rutherford, very famous nuclear physicist, one of the pioneers of nuclear physics shows that the atom has a tiny nugget in the center, which we call the nucleus, which is a positively charged object."}, {"time": 905, "text": "So then by like 1910, 11, we have this model of the atom that we learn in school, which is you've got a nucleus, electrons go around it."}, {"time": 913, "text": "Fast forward a few years, the nucleus, people start doing experiments with radioactivity where they use alpha particles that are spat out of radioactive elements as bullets, and they fire them at other atoms."}, {"time": 926, "text": "And by banging things into each other, they see that they can knock bits out of the nucleus."}, {"time": 931, "text": "So these things come out called protons, first of all, which are positively charged particles about 2000 times heavier than the electron."}, {"time": 938, "text": "And then 10 years later, more or less, a neutral particle is discovered called the neutron."}, {"time": 943, "text": "So those are the three basic building blocks of atoms."}, {"time": 947, "text": "You have protons and neutrons in the nucleus that are stuck together by something called the strong force, the strong nuclear force, and you have electrons in orbit around that, held in by the electromagnetic force, which is one of the forces of nature."}, {"time": 960, "text": "That's sort of where we get to by like 1932, more or less."}, {"time": 964, "text": "Then what happens is physics is nice and neat."}, {"time": 967, "text": "In 1932, everything looks great, got three particles and all the atoms are made of, that's fine."}, {"time": 971, "text": "But then cloud chamber experiments."}, {"time": 973, "text": "These are devices that can be used to, the first device is capable of imaging subatomic particles so you can see their tracks."}, {"time": 979, "text": "And they're used to study cosmic rays, particles that come from outer space and bang into the atmosphere."}, {"time": 985, "text": "And in these experiments, people start to see a whole load of new particles."}, {"time": 989, "text": "So they discover for one thing antimatter, which is the sort of a mirror image of the particles."}, {"time": 994, "text": "So we discovered that there's also, as well as a negatively charged electron, there's something called a positron, which is a positively charged version of the electron."}, {"time": 1000, "text": "And there's an antiproton, which is negatively charged."}, {"time": 1003, "text": "And then a whole load of other weird particles start to get discovered."}, {"time": 1006, "text": "And no one really knows what they are."}, {"time": 1008, "text": "This is known as the zoo of particles."}, {"time": 1010, "text": "Are these discoveries from the first theoretical discoveries or are they discoveries in an experiment?"}, {"time": 1018, "text": "So like, yeah, what's the process of discovery for these early sets of particles?"}, {"time": 1023, "text": "It's a mixture."}, {"time": 1024, "text": "The early stuff around the atom is really experimentally driven."}, {"time": 1027, "text": "It's not based on some theory."}, {"time": 1029, "text": "It's exploration in the lab using equipment."}, {"time": 1031, "text": "So it's really people just figuring out, getting hands on with the phenomena, figuring out what these things are."}, {"time": 1036, "text": "And the theory comes a bit later."}, {"time": 1037, "text": "That's not always the case."}, {"time": 1038, "text": "So in the discovery of the anti electron, the positron, that was predicted from quantum mechanics and relativity by a very clever theoretical physicist called Paul Dirac, who was probably the second brightest physicist of the 20th century, apart from Einstein, but isn't anywhere near as well known."}, {"time": 1056, "text": "So he predicted the existence of the anti electron from basically a combination of the theories of quantum mechanics and relativity."}, {"time": 1063, "text": "And it was discovered about a year after he made the prediction."}, {"time": 1066, "text": "What happens when an electron meets a positron?"}, {"time": 1069, "text": "They annihilate each other."}, {"time": 1070, "text": "So when you bring a particle and its antiparticle together, they react, well, they don't react, they just wipe each other out and they turn, their mass is turned into energy, usually in the form of photons, so you get light produced."}, {"time": 1083, "text": "So when you have that kind of situation, why does the universe exist at all if there's matter in any matter?"}, {"time": 1090, "text": "Oh God, now we're getting into the really big questions."}, {"time": 1092, "text": "So, do you wanna go there now?"}, {"time": 1095, "text": "Let's, maybe let's go there later."}, {"time": 1099, "text": "Cause that, I mean, that is a very big question."}, {"time": 1100, "text": "Yeah, let's take it slow with the standard model."}, {"time": 1103, "text": "So, okay, so there's matter and antimatter in the 30s."}, {"time": 1108, "text": "So what else?"}, {"time": 1109, "text": "So matter and antimatter, and then a load of new particles start turning up in these cosmic ray experiments, first of all."}, {"time": 1116, "text": "And they don't seem to be particles that make up atoms."}, {"time": 1120, "text": "They're something else."}, {"time": 1121, "text": "They all mostly interact with a strong nuclear force."}, {"time": 1124, "text": "So they're a bit like protons and neutrons."}, {"time": 1126, "text": "And by, in the 1960s in America, particularly, but also in Europe and Russia, scientists started to build particle accelerators."}, {"time": 1134, "text": "So these are the forerunners of the LHC."}, {"time": 1135, "text": "So big ring shaped machines that were, you know, hundreds of meters long, which in those days was enormous."}, {"time": 1140, "text": "You never, you know, most physics up until that point had been done in labs, in universities, you know, with small bits of kit."}, {"time": 1146, "text": "So this is a big change."}, {"time": 1147, "text": "And when these accelerators are built, they start to find they can produce even more of these particles."}, {"time": 1152, "text": "So I don't know the exact numbers, but by around 1960, there are of order a hundred of these things that have been discovered."}, {"time": 1160, "text": "And physicists are kind of tearing their hair out because physics is all about simplification."}, {"time": 1165, "text": "And suddenly what was simple has become messy and complicated and everyone sort of wants to understand what's going on."}, {"time": 1171, "text": "As a quick kind of aside and probably really dumb question, but how is it possible to take something like a, like a photon or electron and be able to control it enough, like to be able to do a controlled experiment where you collide it against something else?"}, {"time": 1192, "text": "Is that, is that, that seems like an exceptionally difficult engineering challenge because you mentioned vacuum too."}, {"time": 1199, "text": "So you basically want to remove every other distraction and really focus on this collision."}, {"time": 1204, "text": "How difficult of an engineering challenge is that?"}, {"time": 1206, "text": "Just to get a sense."}, {"time": 1207, "text": "And it is very hard."}, {"time": 1209, "text": "I mean, in the early days, particularly when the first accelerators are being built in like 1932, Ernest Lawrence builds the first, what we call a cyclotron, which is like a little accelerator, this big or so."}, {"time": 1221, "text": "There's another one."}, {"time": 1222, "text": "Is it really that big?"}, {"time": 1223, "text": "There's a tiny little thing."}, {"time": 1225, "text": "So most of the first accelerators were what we call fixed target experiments."}, {"time": 1231, "text": "So you had a ring, you accelerate particles around the ring and then you fire them out the side into some target."}, {"time": 1237, "text": "So that makes the kind of, the colliding bit is relatively straightforward because you just fire it, whatever it is you want to fire it at."}, {"time": 1243, "text": "The hard bit is the steering the beams with the magnetic fields, getting, you know, strong enough electric fields to accelerate them, all that kind of stuff."}, {"time": 1250, "text": "The first colliders where you have two beams colliding head on, that comes later."}, {"time": 1256, "text": "And I don't think it's done until maybe the 1980s."}, {"time": 1261, "text": "I'm not entirely sure, but it's a much harder problem."}, {"time": 1266, "text": "Cause you have to like perfectly get them to hit each other."}, {"time": 1269, "text": "I mean, we're talking about, I mean, what scale it takes, what's the, I mean, the temporal thing is a giant mess, but the spatially, like the size is tiny."}, {"time": 1283, "text": "Well, to give you a sense of the LHC beams, the cross sectional diameter is I think around a dozen or so microns."}, {"time": 1292, "text": "So, you know, 10 millionths of a meter."}, {"time": 1297, "text": "And a beam, sorry, just to clarify, a beam contains how many, is it the bunches that you mentioned?"}, {"time": 1303, "text": "Is it multiple particles or is it just one particle?"}, {"time": 1305, "text": "The bunches contains say a hundred billion protons each."}, {"time": 1308, "text": "So a bunch is, it's not really bunch shaped."}, {"time": 1311, "text": "They're actually quite long."}, {"time": 1311, "text": "They're like 30 centimeters long, but thinner than a human hair."}, {"time": 1314, "text": "So like very, very narrow, long sort of objects."}, {"time": 1318, "text": "Those are the things."}, {"time": 1319, "text": "So what happens in the LHC is you steer the beams so that they cross in the middle of the detector."}, {"time": 1326, "text": "So they basically have these swarms of protons that are flying through each other."}, {"time": 1330, "text": "And most of the, you have to have a hundred billion coming one way, a hundred billion another way, maybe 10 of them will hit each other."}, {"time": 1337, "text": "So this, okay, that makes a lot more sense."}, {"time": 1339, "text": "So that's nice."}, {"time": 1340, "text": "But you're trying to use sort of, it's like probabilistically, you're not."}, {"time": 1344, "text": "You can't make a single particle collide with a single other particle."}, {"time": 1346, "text": "That's not an efficient way to do it."}, {"time": 1348, "text": "You'd be waiting a very long time to get anything."}, {"time": 1350, "text": "So you're basically, right."}, {"time": 1354, "text": "You're relying on probability to be that some fraction of them are gonna collide."}, {"time": 1358, "text": "And then you know which, because it's a swarm of the same kind of particle."}, {"time": 1364, "text": "So it doesn't matter which ones hit each other exactly."}, {"time": 1366, "text": "I mean, that's not to say it's not hard."}, {"time": 1368, "text": "You've got to, one of the challenges to make the collisions work is you have to squash these beams to very, very, basically the narrower they are the better cause the higher chances of them colliding."}, {"time": 1378, "text": "If you think about two flocks of birds flying through each other, the birds are all far apart in the flocks."}, {"time": 1383, "text": "There's not much chance that they'll collide."}, {"time": 1384, "text": "If they're all flying densely together, then they're much more likely to collide with each other."}, {"time": 1388, "text": "So that's the sort of problem."}, {"time": 1390, "text": "And it's tuning those magnetic fields, getting the magnetic fields powerful enough that you squash the beams and focus them so that you get enough collisions."}, {"time": 1396, "text": "That's super cool."}, {"time": 1397, "text": "Do you know how much software is involved here?"}, {"time": 1400, "text": "I mean, it's sort of, I come from the software world and it's fascinating."}, {"time": 1404, "text": "This seems like software is buggy and messy."}, {"time": 1408, "text": "And so like, you almost don't want to rely on software too much."}, {"time": 1411, "text": "Like if you do, it has to be like low level, like Fortran style programming."}, {"time": 1416, "text": "Do you know how much software is in a large Hadron Collider?"}, {"time": 1419, "text": "I mean, it depends at which level a lot."}, {"time": 1421, "text": "I mean, the whole thing is obviously computer controlled."}, {"time": 1423, "text": "So, I mean, I don't know a huge amount about how the software for the actual accelerator works, but I've been in the control center."}, {"time": 1431, "text": "So at CERN, there's this big control room, which is like a bit like a NASA mission control with big banks of desks where the engineers sit and they monitor the LHC."}, {"time": 1439, "text": "Cause you obviously can't be in the tunnel when it's running."}, {"time": 1441, "text": "So everything's remote."}, {"time": 1443, "text": "I mean, one sort of anecdote about the software side, in 2008, when the LHC first switched on, they had this big launch event and then big press conference party to inaugurate the machine."}, {"time": 1456, "text": "And about 10 days after that, they were doing some tests and this dramatic event happened where a huge explosion basically took place in the tunnel that destroyed or damaged, badly damaged about half a kilometer of the machine."}, {"time": 1469, "text": "But the stories, the engineers are in the control room that day."}, {"time": 1473, "text": "One guy told me this story about, basically all these screens they have in the control room started going red."}, {"time": 1478, "text": "So these alarms like kind of in software going off and then they assume that there's something wrong with the software, cause there's no way something this catastrophic could have happened."}, {"time": 1488, "text": "But I mean, when I worked on, when I was a PhD student, one of my jobs was to help to maintain the software that's used to control the detector that we work on."}, {"time": 1499, "text": "And that was, it's relatively robust, not such, you don't want it to be too fancy."}, {"time": 1502, "text": "You don't want it to sort of fall over too easily."}, {"time": 1504, "text": "The more clever stuff comes when you're talking about analyzing the data and that's where the sort of, you know."}, {"time": 1510, "text": "Are we jumping around too much?"}, {"time": 1511, "text": "Do we finish with a standard model?"}, {"time": 1513, "text": "We didn't, no."}, {"time": 1514, "text": "We didn't, so have we even started talking about quarks?"}, {"time": 1517, "text": "We haven't talked to them yet."}, {"time": 1517, "text": "No, we got to the messy zoo of particles."}, {"time": 1520, "text": "Let me, let's go back there if it's okay."}, {"time": 1522, "text": "Okay, that's fine."}, {"time": 1523, "text": "Can you take us to the rest of the history of physics in the 20th century?"}, {"time": 1529, "text": "Okay, so circa 1960, you have this, you have these a hundred or so particles."}, {"time": 1533, "text": "It's a bit like the periodic table all over again."}, {"time": 1535, "text": "So you've got like having a hundred elements, it's sort of a bit like that."}, {"time": 1539, "text": "And people start to try to impose some order."}, {"time": 1541, "text": "So Murray Gellman, he's a theoretical physicist, American from New York."}, {"time": 1547, "text": "He realizes that there are these symmetries in these particles that if you arrange them in certain ways, they relate to each other."}, {"time": 1554, "text": "And he uses these symmetry principles to predict the existence of particles that haven't been discovered, which are then discovered in accelerators."}, {"time": 1561, "text": "So this starts to suggest there's not just random collections of crap."}, {"time": 1564, "text": "There's like, you know, actually some order to this underlying it."}, {"time": 1568, "text": "A little bit later in 1960, again, around the 1960s, he proposes along with another physicist called George Zweig that these symmetries arise because just like the patterns in the periodic table arise because atoms are made of electrons and protons, that these patterns are due to the fact that these particles are made of smaller things."}, {"time": 1590, "text": "And they are called quarks."}, {"time": 1591, "text": "So these are the particles they're predicted from theory."}, {"time": 1594, "text": "For a long time, no one really believes they're real."}, {"time": 1596, "text": "A lot of people think that they're a kind of theoretical convenience that happened to fit the data, but there's no evidence."}, {"time": 1602, "text": "No one's ever seen a quark in any experiment."}, {"time": 1605, "text": "And lots of experiments are done to try to find quarks, to try to knock a quark out of a..."}, {"time": 1610, "text": "So the idea, if protons and neutrons are made of quarks, you should be able to knock a quark out and see the quark."}, {"time": 1615, "text": "That never happens."}, {"time": 1616, "text": "And we still have never actually managed to do that."}, {"time": 1620, "text": "So the way that it's done in the end is this machine that's built in California at the Stanford Lab, Stanford Linear Accelerator, which is essentially a gigantic, three kilometer long electron gun."}, {"time": 1632, "text": "It fires electrons, almost the speed of light, at protons."}, {"time": 1636, "text": "And when you do these experiments, what you find is at very high energy, the electrons bounce off small, hard objects inside the proton."}, {"time": 1645, "text": "So it's a bit like taking an X ray of the proton."}, {"time": 1648, "text": "You're firing these very light, high energy particles, and they're pinging off little things inside the proton that are like ball bearings, if you like."}, {"time": 1656, "text": "So you actually, that way, they resolve that there are three things inside the proton, which are quarks, the quarks that Gellman and Zweig had predicted."}, {"time": 1665, "text": "So that's really the evidence that convinces people that these things are real."}, {"time": 1669, "text": "The fact that we've never seen one in an experiment directly, they're always stuck inside other particles."}, {"time": 1676, "text": "And the reason for that is essentially to do with a strong force."}, {"time": 1679, "text": "The strong force is the force that holds quarks together."}, {"time": 1681, "text": "And it's so strong that it's impossible to actually liberate a quark."}, {"time": 1686, "text": "So if you try and pull a quark out of a proton, what actually ends up happening is that you kind of create this spring like bond in the strong force."}, {"time": 1695, "text": "You imagine two quarks that are held together by a very powerful spring."}, {"time": 1698, "text": "You pull and pull and pull, more and more energy gets stored in that bond, like stretching a spring, and eventually the tension gets so great, the spring snaps, and the energy in that bond gets turned into two new quarks that go on the broken ends."}, {"time": 1712, "text": "So you started with two quarks, you end up with four quarks."}, {"time": 1714, "text": "So you never actually get to take a quark out."}, {"time": 1717, "text": "You just end up making loads more quarks in the process."}, {"time": 1719, "text": "So how do we, again, forgive the dumb question, how do we know quarks are real then?"}, {"time": 1724, "text": "Well, A, from these experiments where we can scatter, you fire electrons into the protons."}, {"time": 1729, "text": "They can burrow into the proton and knock off, and they can bounce off these quarks."}, {"time": 1735, "text": "So you can see from the angles, the electrons come out."}, {"time": 1738, "text": "I see, you can infer."}, {"time": 1739, "text": "You can infer that these things are there."}, {"time": 1742, "text": "The quark model can also be used."}, {"time": 1743, "text": "It has a lot of successes that you can use it to predict the existence of new particles that hadn't been seen."}, {"time": 1748, "text": "So, and it basically, there's lots of data basically showing from, you know, when we fire protons at each other at the LHC, a lot of quarks get knocked all over the place."}, {"time": 1758, "text": "And every time they try and escape from, say, one of their protons, they make a whole jet of quarks that go flying off, bound up in other sorts of particles made of quarks."}, {"time": 1768, "text": "So all the sort of the theoretical predictions from the basic theory of the strong force and the quarks all agrees with what we are seeing in experiments."}, {"time": 1775, "text": "We've just never seen an actual quark on its own because unfortunately it's impossible to get them out on their own."}, {"time": 1781, "text": "So quarks, these crazy smaller things that are hard to imagine are real."}, {"time": 1788, "text": "What else is part of the story here?"}, {"time": 1789, "text": "So the other thing that's going on at the time, around the 60s, is an attempt to understand the forces that make these particles interact with each other."}, {"time": 1800, "text": "So you have the electromagnetic force, which is the force that was sort of discovered to some extent in this room, or at least in this building."}, {"time": 1807, "text": "So the first, what we call quantum field theory of the electromagnetic force is developed in the 1940s and 50s by Feynman, Richard Feynman amongst other people, Julian Schrodinger, Tom Onaga, who come up with the first, what we call a quantum field theory of the electromagnetic force."}, {"time": 1825, "text": "And this is where this description of, which I gave you at the beginning, that particles are ripples in fields."}, {"time": 1830, "text": "Well, in this theory, the photon, the particle of light is described as a ripple in this quantum field called the electromagnetic field."}, {"time": 1838, "text": "And the attempt then is made to try, well, can we come up with a quantum field theory of the other forces, of the strong force and the weak, the third force, which we haven't discussed, which is the weak force, which is a nuclear force."}, {"time": 1850, "text": "We don't really experience it in our everyday lives, but it's responsible for radioactive decay."}, {"time": 1854, "text": "It's the force that allows, you know, on a radioactive atom to turn into a different element, for example."}, {"time": 1861, "text": "And I don't know if you've explicitly mentioned, but so there's technically four forces."}, {"time": 1866, "text": "I guess three of them would be in the standard model, like the weak, the strong, and the electromagnetic, and then there's gravity."}, {"time": 1874, "text": "And there's gravity, which we don't worry about that, because it's too hard."}, {"time": 1877, "text": "It's too hard."}, {"time": 1877, "text": "Well, no, maybe we bring that up at the end, but yeah."}, {"time": 1879, "text": "Gravity, so far, we don't have a quantum theory of, and if you can solve that problem, you'll win a Nobel Prize."}, {"time": 1885, "text": "Well, we're gonna have to bring up the graviton at some point, I'm gonna ask you, but let's leave that to the side for now."}, {"time": 1891, "text": "So those three, okay, Feynman, electromagnetic force, the quantum field, and where does the weak force come in?"}, {"time": 1901, "text": "So yeah, well, first of all, I mean, the strong force is the easiest."}, {"time": 1904, "text": "The strong force is a little bit like the electromagnetic force."}, {"time": 1907, "text": "It's a force that binds things together."}, {"time": 1909, "text": "So that's the force that holds quarks together inside the proton, for example."}, {"time": 1912, "text": "So a quantum field theory of that force is discovered in the, I think it's in the 60s, and it predicts the existence of new force particles called gluons."}, {"time": 1924, "text": "So gluons are a bit like the photon."}, {"time": 1926, "text": "The photon is the particle of electromagnetism."}, {"time": 1929, "text": "Gluons are the particles of the strong force."}, {"time": 1933, "text": "So just like there's an electromagnetic field, there's something called a gluon field, which is also all around us."}, {"time": 1939, "text": "So some of these particles, I guess, are the force carriers or whatever."}, {"time": 1943, "text": "They carry the force."}, {"time": 1944, "text": "It depends how you want to think about it."}, {"time": 1945, "text": "I mean, really the field, the strong force field, the gluon field is the thing that binds the quarks together."}, {"time": 1952, "text": "The gluons are the little ripples in that field."}, {"time": 1955, "text": "So that like, in the same way that the photon is a ripple in the electromagnetic field."}, {"time": 1959, "text": "But the thing that really does the binding is the field."}, {"time": 1963, "text": "I mean, you may have heard people talk about things like you've heard the phrase virtual particle."}, {"time": 1969, "text": "So sometimes in some, if you hear people describing how forces are exchanged between particles, they quite often talk about the idea that if you have an electron and another electron, say, and they're repelling each other through the electromagnetic force, you can think of that as if they're exchanging photons."}, {"time": 1985, "text": "So they're kind of firing photons backwards and forwards between each other."}, {"time": 1988, "text": "And that causes them to repel."}, {"time": 1991, "text": "That photon is then a virtual particle."}, {"time": 1993, "text": "Yes, that's what we call a virtual particle."}, {"time": 1994, "text": "In other words, it's not a real thing, it doesn't actually exist."}, {"time": 1996, "text": "So it's an artifact of the way theorists do calculations."}, {"time": 1999, "text": "So when they do calculations in quantum field theory, rather than, no one's discovered a way of just treating the whole field."}, {"time": 2005, "text": "You have to break the field down into simpler things."}, {"time": 2008, "text": "So you can basically treat the field as if it's made up of lots of these virtual photons, but there's no experiment that you can do that can detect these particles being exchanged."}, {"time": 2018, "text": "What's really happening in reality is that the electromagnetic field is warped by the charge of the electron and that causes the force."}, {"time": 2026, "text": "But the way we do calculations involves particles."}, {"time": 2029, "text": "So it's a bit confusing, but it's really a mathematical technique."}, {"time": 2033, "text": "It's not something that corresponds to reality."}, {"time": 2035, "text": "I mean, that's part, I guess, of the Feynman diagrams."}, {"time": 2039, "text": "Is this these virtual particles, okay."}, {"time": 2041, "text": "Some of these have mass, some of them don't."}, {"time": 2046, "text": "What does that even mean, not to have mass?"}, {"time": 2049, "text": "And maybe you can say which one of them have mass and which don't."}, {"time": 2054, "text": "And why is mass important or relevant in this field view of the universe?"}, {"time": 2062, "text": "Well, there are actually only two particles in the standard model that don't have mass, which are the photon and the gluons."}, {"time": 2068, "text": "So they are massless particles, but the electron, the quarks, and there are a bunch of other particles I haven't discussed."}, {"time": 2074, "text": "There's something called a muon and a tau, which are basically heavy versions of the electron that are unstable."}, {"time": 2080, "text": "You can make them in accelerators, but they don't form atoms or anything."}, {"time": 2084, "text": "They don't exist for long enough."}, {"time": 2085, "text": "But all the matter particles, there are 12 of them, six quarks and six, what we call leptons, which includes the electron and its two heavy versions and three neutrinos, all of them have mass."}, {"time": 2097, "text": "And so do, this is the critical bit."}, {"time": 2099, "text": "So the weak force, which is the third of these quantum forces, which is one of the hardest to understand, the force particles of that force have very large masses."}, {"time": 2113, "text": "And there are three of them."}, {"time": 2114, "text": "They're called the W plus, the W minus, and the Z boson."}, {"time": 2119, "text": "And they have masses of between 80 and 90 times that of the protons."}, {"time": 2124, "text": "They're very heavy."}, {"time": 2126, "text": "They're very heavy things."}, {"time": 2127, "text": "So they're what, the heaviest, I guess?"}, {"time": 2129, "text": "They're not the heaviest."}, {"time": 2130, "text": "The heaviest particle is the top quark, which has a mass of about 175 ish protons."}, {"time": 2138, "text": "So that's really massive."}, {"time": 2139, "text": "And we don't know why it's so massive, but coming back to the weak force, so the problem in the 60s and 70s was that the reason that the electromagnetic force is a force that we can experience in our everyday lives."}, {"time": 2151, "text": "So if we have a magnet and a piece of metal, you can hold it, you know, a meter apart if it's powerful enough and you'll feel a force."}, {"time": 2157, "text": "Whereas the weak force only becomes apparent when you basically have two particles touching at the scale of a nucleus."}, {"time": 2165, "text": "So we just get to very short distances before this force becomes manifest."}, {"time": 2169, "text": "It's not, we don't get weak forces going on in this room."}, {"time": 2172, "text": "We don't notice them."}, {"time": 2174, "text": "And the reason for that is that the particle, well, the field that transmits the weak force, the particle that's associated with that field has a very large mass, which means that the field dies off very quickly."}, {"time": 2186, "text": "So as you, whereas an electric charge, if you were to look at the shape of the electromagnetic field, it would fall off with this, you have this thing called the inverse square law, which is the idea that the force halves every time you double the distance."}, {"time": 2198, "text": "No, sorry, it doesn't half."}, {"time": 2199, "text": "It quarters every time you double the distance between say the two particles."}, {"time": 2204, "text": "Whereas the weak force kind of, you move a little bit away from the nucleus and just disappears."}, {"time": 2209, "text": "The reason for that is because these fields, the particles that go with them have a very large mass."}, {"time": 2215, "text": "But the problem that theorists faced in the 60s was that if you tried to introduce massive force fields, the theory gave you nonsensical answers."}, {"time": 2226, "text": "So you'd end up with infinite results for a lot of the calculations you tried to do."}, {"time": 2231, "text": "So the basically, it seemed that quantum field theory was incompatible with having massive particles, not just the force particles actually, but even the electron was a problem."}, {"time": 2241, "text": "So this is where the Higgs that we sort of alluded to comes in."}, {"time": 2245, "text": "And the solution was to say, okay, well, actually all the particles in the Standard Model are mass."}, {"time": 2250, "text": "They have no mass."}, {"time": 2251, "text": "So the quarks, the electron, they don't have a mass."}, {"time": 2253, "text": "Neither do these weak particles."}, {"time": 2254, "text": "They don't have mass either."}, {"time": 2256, "text": "What happens is they actually acquire mass through another process."}, {"time": 2260, "text": "They get it from somewhere else."}, {"time": 2261, "text": "They don't actually have it intrinsically."}, {"time": 2263, "text": "So this idea that was introduced by, well, Peter Higgs is the most famous, but actually there are about six people that came up with the idea more or less at the same time, is that you introduce a new quantum field, which is another one of these invisible things that's everywhere."}, {"time": 2278, "text": "And it's through the interaction with this field that particles get mass."}, {"time": 2282, "text": "So you can think of say an electron in the Higgs field, the Higgs field kind of bunches around the electron."}, {"time": 2290, "text": "It's sort of drawn towards the electron."}, {"time": 2292, "text": "And that energy that's stored in that field around the electron is what we see as the mass of the electron."}, {"time": 2299, "text": "But if you could somehow turn off the Higgs field, then all the particles in nature would become massless and fly around at the speed of light."}, {"time": 2306, "text": "So this idea of the Higgs field allowed other people, other theorists to come up with a, well, it was another, basically a unified theory of the electromagnetic force and the weak force."}, {"time": 2321, "text": "So once you bring in the Higgs field, you can combine two of the forces into one."}, {"time": 2325, "text": "So it turns out the electromagnetic force and the weak force are just two aspects of the same fundamental force."}, {"time": 2332, "text": "And at the LHC, we go to high enough energies that you see these two forces unifying effectively."}, {"time": 2339, "text": "So first of all, it started as a theoretical notion, like this is some, and then, I mean, wasn't the Higgs called the God particle at some point?"}, {"time": 2350, "text": "It was by a guy trying to sell popular science books, yeah."}, {"time": 2353, "text": "Yeah, but I mean, I remember because when I was hearing it, I thought it would, I mean, that would solve a lot of, that unify a lot of our ideas of physics was my notion."}, {"time": 2366, "text": "But maybe you can speak to that."}, {"time": 2369, "text": "Is it as big of a leap as a God particle or is it a Jesus particle, which, you know, what's the big contribution of Higgs in terms of this unification power?"}, {"time": 2380, "text": "Yeah, I mean, to understand that, it maybe helps know the history a little bit."}, {"time": 2385, "text": "So when the, what we call electroweak theory was put together, which is where you unify electromagnetism with the weak force and Higgs is involved in all of that."}, {"time": 2393, "text": "So that theory, which was written in the mid 70s, predicted the existence of four new particles, the W plus boson, the W minus boson, the Z boson and the Higgs boson."}, {"time": 2403, "text": "So there were these four particles that came with the theory, that were predicted by the theory."}, {"time": 2407, "text": "In 1983, 84, the W's and the Z particles were discovered at an accelerator at CERN called the super proton synchrotron, which was a seven kilometer particle collider."}, {"time": 2419, "text": "So three of the bits of this theory had already been found."}, {"time": 2422, "text": "So people were pretty confident from the 80s that the Higgs must exist because it was a part of this family of particles that this theoretical structure only works if the Higgs is there."}, {"time": 2434, "text": "So what then happens, and so you've got this question about why is the LHC the size it is?"}, {"time": 2439, "text": "Well, actually the tunnel that the LHC is in was not built for the LHC."}, {"time": 2442, "text": "It was built for a previous accelerator called the large electron positron collider."}, {"time": 2448, "text": "So that began operation in the late 80s, early 90s."}, {"time": 2453, "text": "They basically, that's when they dug the 27 kilometer tunnel."}, {"time": 2456, "text": "They put this accelerator into it, the collider that fires electrons and anti electrons at each other, electrons and positrons."}, {"time": 2462, "text": "So the purpose of that machine was, well, it was actually to look for the Higgs."}, {"time": 2466, "text": "That was one of the things it was trying to do."}, {"time": 2468, "text": "It didn't have enough energy to do it in the end."}, {"time": 2471, "text": "But the main thing it achieved was it studied the W and the Z particles at very high precision."}, {"time": 2477, "text": "So it made loads of these things."}, {"time": 2479, "text": "Previously, you can only make a few of them at the previous accelerator."}, {"time": 2481, "text": "So you could study these really, really precisely."}, {"time": 2484, "text": "And by studying their properties, you could really test this electroweak theory that had been invented in the 70s and really make sure that it worked."}, {"time": 2491, "text": "So actually by 1999, when this machine turned off, people knew, well, okay, you never know until you find the thing."}, {"time": 2501, "text": "But people were really confident this electroweak theory was right."}, {"time": 2504, "text": "And that the Higgs almost, the Higgs or something very like the Higgs had to exist because otherwise the whole thing doesn't work."}, {"time": 2512, "text": "It'd be really weird if you could discover and these particles, they all behave exactly as your theory tells you they should."}, {"time": 2517, "text": "But somehow this key piece of the picture is not there."}, {"time": 2520, "text": "So in a way, it depends how you look at it."}, {"time": 2523, "text": "The discovery of the Higgs on its own is obviously a huge achievement in many, both experimentally and theoretically."}, {"time": 2532, "text": "On the other hand, it's like having a jigsaw puzzle where every piece has been filled in."}, {"time": 2537, "text": "You have this beautiful image, there's one gap and you kind of know that piece must be there somewhere."}, {"time": 2542, "text": "So the discovery in itself, although it's important, is not so interesting."}, {"time": 2550, "text": "It's like a confirmation of the obvious at that point."}, {"time": 2554, "text": "But what makes it interesting is not that it just completes the standard model, which is a theory that we've known had the basic layout offs for 40 years or more now."}, {"time": 2564, "text": "It's that the Higgs actually is a unique particle."}, {"time": 2568, "text": "It's very different to any of the other particles in the standard model."}, {"time": 2571, "text": "And it's a theoretically very troublesome particle."}, {"time": 2575, "text": "There are a lot of nasty things to do with the Higgs, but also opportunities."}, {"time": 2580, "text": "So that we basically, we don't really understand how such an object can exist in the form that it does."}, {"time": 2586, "text": "So there are lots of reasons for thinking that the Higgs must come with a bunch of other particles or that it's perhaps made of other things."}, {"time": 2595, "text": "So it's not a fundamental particle, that it's made of smaller things."}, {"time": 2597, "text": "I can talk about that if you like a bit."}, {"time": 2599, "text": "That's still a notion, so the Higgs might not be a fundamental particle, that there might be some, it might, oh man."}, {"time": 2607, "text": "So that is an idea, it's not been demonstrated to be true."}, {"time": 2611, "text": "But I mean, all of these ideas basically come from the fact that this is a problem that motivated a lot of development in physics in the last 30 years or so."}, {"time": 2622, "text": "And it's this basic fact that the Higgs field, which is this field that's everywhere in the universe, this is the thing that gives mass to the particles."}, {"time": 2629, "text": "And the Higgs field is different from all the other fields in that, let's say you take the electromagnetic field, which is, if we actually were to measure the electromagnetic field in this room, we would measure all kinds of stuff going on because there's light, there's gonna be microwaves and radio waves and stuff."}, {"time": 2642, "text": "But let's say we could go to a really, really remote part of empty space and shield it and put a big box around it and then measure the electromagnetic field in that box."}, {"time": 2650, "text": "The field would be almost zero, apart from some little quantum fluctuations, but basically it goes to naught."}, {"time": 2656, "text": "The Higgs field has a value everywhere."}, {"time": 2659, "text": "So it's a bit like the whole, it's like the entire space has got this energy stored in the Higgs field, which is not zero, it's finite, it's a bit like having the temperature of space raised to some background temperature."}, {"time": 2673, "text": "And it's that energy that gives mass to the particles."}, {"time": 2676, "text": "So the reason that electrons and quarks have mass is through the interaction with this energy that's stored in the Higgs field."}, {"time": 2684, "text": "Now, it turns out that the precise value this energy has has to be very carefully tuned if you want a universe where interesting stuff can happen."}, {"time": 2724, "text": "And at that point, if the Higgs field was that strong, even an electron would become so massive that it would collapse into a black hole."}, {"time": 2731, "text": "And then you have a universe made of black holes and nothing like us."}, {"time": 2734, "text": "So it seems that the strength of the Higgs field is to achieve the value that we see requires what we call fine tuning of the laws of physics."}, {"time": 2742, "text": "You have to fiddle around with the other fields in the Standard Model and their properties to just get it to this right sort of Goldilocks value that allows atoms to exist."}, {"time": 2753, "text": "This is deeply fishy."}, {"time": 2754, "text": "People really dislike this."}, {"time": 2757, "text": "Well, yeah, I guess, so what would be, so two explanations."}, {"time": 2760, "text": "One, there's a god that designed this perfectly, and two is there's an infinite number of alternate universes, and we just happen to be in the one in which life is possible, complexity."}, {"time": 2772, "text": "So when you say, I mean, life, any kind of complexity, that's not either complete chaos or black holes."}, {"time": 2781, "text": "I mean, how does that make you feel?"}, {"time": 2783, "text": "That's such a fascinating notion that this perfectly tuned field that's the same everywhere is there."}, {"time": 2793, "text": "Yeah, what do you make of that?"}, {"time": 2794, "text": "I mean, yeah, so you laid out two of the possible explanations."}, {"time": 2797, "text": "Some, well, yeah, I mean, well, someone, some cosmic creator went, yeah, let's fix that to be at the right level."}, {"time": 2803, "text": "That's one possibility, I guess."}, {"time": 2804, "text": "It's not a scientifically testable one, but theoretically, I guess, it's possible."}, {"time": 2808, "text": "Sorry to interrupt, but there could also be not a designer, but couldn't there be just, I guess I'm not sure what that would be, but some kind of force that, that some kind of mechanism by which this kind of field is enforced in order to create complexity, basically forces that pull the universe towards an interesting complexity."}, {"time": 2839, "text": "I mean, yeah, I mean, there are people who have those ideas."}, {"time": 2842, "text": "I don't really subscribe to them."}, {"time": 2843, "text": "As I'm saying, it sounds really stupid."}, {"time": 2845, "text": "No, I mean, there are definitely people that make those kind of arguments."}, {"time": 2849, "text": "There's ideas that, I think it's Lee Smolin's idea, or one, I think, that universes are born inside black holes."}, {"time": 2858, "text": "And so, universes, they basically have like Darwinian evolution of the universe, where universes give birth to other universes."}, {"time": 2864, "text": "And if universes where black holes can form are more likely to give birth to more universes, so you end up with universes which have similar laws."}, {"time": 2871, "text": "I mean, I don't know, whatever."}, {"time": 2872, "text": "Well, I talked to Lee recently on this podcast, and he's a reminder to me that the physics community has like so many interesting characters in it."}, {"time": 2886, "text": "Anyway, sorry, so."}, {"time": 2888, "text": "I mean, as an experimentalist, I tend to sort of think, these are interesting ideas, but they're not really testable, so I tend not to think about them very much."}, {"time": 2894, "text": "So, I mean, going back to the science of this, there is an explanation."}, {"time": 2899, "text": "There is a possible solution to this problem of the Higgs, which doesn't involve multiverses or creators fiddling about with the laws of physics."}, {"time": 2906, "text": "If the most popular solution was something called supersymmetry, which is a theory which involves a new type of symmetry of the universe."}, {"time": 2915, "text": "In fact, it's one of the last types of symmetries that it's possible to have that we haven't already seen in nature, which is a symmetry between force particles and matter particles."}, {"time": 2924, "text": "So what we call fermions, which are the matter particles and bosons, which are force particles."}, {"time": 2929, "text": "And if you have supersymmetry, then there is a super partner for every particle in the standard model."}, {"time": 2935, "text": "And without going into the details, the effect of this basically is that you have a whole bunch of other fields, and these fields cancel out the effect of the standard model fields, and they stabilize the Higgs field at a nice sensible value."}, {"time": 2949, "text": "So in supersymmetry, you naturally, without any tinkering about with the constants of nature or anything, you get a Higgs field with a nice value, which is the one we see."}, {"time": 2958, "text": "So this is one of the, and supersymmetry's also got lots of other things going for it."}, {"time": 2962, "text": "It predicts the existence of a dark matter particle, which would be great."}, {"time": 2967, "text": "It potentially suggests that the strong force and the electroweak force unify at high energy."}, {"time": 2972, "text": "So lots of reasons people thought this was a productive idea."}, {"time": 2999, "text": "So it was kind of thought, you discover the Higgs, you probably discover super partners as well."}, {"time": 3003, "text": "So once you start creating ripples in this Higgs field, you should be able to see these kinds of, you should be, yeah."}, {"time": 3009, "text": "So the super fields would be there."}, {"time": 3011, "text": "When I, at the very beginning I said, we're probing the vacuum."}, {"time": 3013, "text": "What I mean is really that, you know, okay, let's say these super fields exist."}, {"time": 3016, "text": "The vacuum contains super fields."}, {"time": 3018, "text": "They're there, these supersymmetric fields."}, {"time": 3020, "text": "If we hit them hard enough, we can make them vibrate."}, {"time": 3022, "text": "We see super particles come flying out."}, {"time": 3024, "text": "That's the sort of, that's the idea."}, {"time": 3026, "text": "That's the whole, okay."}, {"time": 3027, "text": "That's the whole point."}, {"time": 3029, "text": "But we haven't."}, {"time": 3031, "text": "So, so far at least, I mean, we've had now a decade of data taking at the LHC."}, {"time": 3038, "text": "No signs of super partners have, supersymmetric particles have been found."}, {"time": 3043, "text": "In fact, no signs of any physics, any new particles beyond the Standard Model have been found."}, {"time": 3047, "text": "So supersymmetry is not the only thing that can do this."}, {"time": 3049, "text": "There are other theories that involve additional dimensions of space or potentially involve the Higgs boson being made of smaller things, being made of other particles."}, {"time": 3058, "text": "Yeah, that's an interesting, you know, I haven't heard that before."}, {"time": 3060, "text": "That's really, that's an interesting, but can you maybe linger on that?"}, {"time": 3063, "text": "Like what, what could be, what could the Higgs particle be made of?"}, {"time": 3068, "text": "Well, so the oldest, I think the original ideas about this was these theories called technicolor, which were basically like an analogy with the strong force."}, {"time": 3077, "text": "So the idea was the Higgs boson was a bound state of two very strongly interacting particles that were a bit like quarks."}, {"time": 3085, "text": "So like quarks, but I guess higher energy things with a super strong force."}, {"time": 3090, "text": "So not the strong force, but a new force that was very strong."}, {"time": 3093, "text": "And the Higgs was a bound state of these, these objects."}, {"time": 3096, "text": "And the Higgs would in principle, if that was right, would be the first in a series of technicolor particles."}, {"time": 3102, "text": "Technicolor, I think not being a theorist, but it's not, it's basically not done very well, particularly since the LHC found the Higgs, that kind of, it rules out, you know, a lot of these technicolor theories, but there are other things that are a bit like technicolor."}, {"time": 3115, "text": "So there's a theory called partial composite, which is an idea that some of my colleagues at Cambridge have worked on, which is a similar sort of idea that the Higgs is a bound state of some strongly interacting particles, and that the standard model particles themselves, the more exotic ones like the top quark are also sort of mixtures of these composite particles."}, {"time": 3216, "text": "Is it possible that the deeper order includes like almost a single entity, so like something that I guess like string theory dreams about, is this essentially the dream, is to discover something simple, beautiful and unifying?"}, {"time": 3340, "text": "Yeah, probably ever."}, {"time": 3342, "text": "By the way, so sorry to take a million tangents, but is there room for complete innovation of how to build a particle collider that could give us an order of magnitude increase in the kind of energies, or do we need to keep just increasing the size of things?"}, {"time": 3358, "text": "I mean, maybe, yeah, I mean, there are ideas, to give you a sense of the gulf that has to be bridged."}, {"time": 3363, "text": "So the LHC collides particles at an energy of what we call 14 tera electron volts, so that's basically the equivalent if you've accelerated a proton through 14 trillion volts."}, {"time": 3379, "text": "That gets us to the energies where the Higgs and these weak particles live."}, {"time": 3383, "text": "They're very massive."}, {"time": 3384, "text": "The scale where strings become manifest is something called the Planck scale, which I think is of the order 10 to the, hang on, get this right, it's 10 to the 18 giga electron volts, so about 10 to the 15 tera electron volts."}, {"time": 3401, "text": "So you're talking trillions of times more energy."}, {"time": 3404, "text": "Yeah, 10 to the 15th or 10 to the 14th larger, I don't even."}, {"time": 3409, "text": "It's of that order."}, {"time": 3410, "text": "It's a very big number."}, {"time": 3412, "text": "So we're not talking just an order of magnitude increase in energy, we're talking 14 orders of magnitude energy increase."}, {"time": 3418, "text": "So to give you a sense of what that would look like, were you to build a particle accelerator with today's technology."}, {"time": 3424, "text": "Bigger or smaller than our solar system?"}, {"time": 3427, "text": "The size of the galaxy."}, {"time": 3429, "text": "The galaxy."}, {"time": 3430, "text": "So you'd need to put a particle accelerator that circled the Milky Way to get to the energies where you would see strings if they exist."}, {"time": 3437, "text": "So that is a fundamental problem, which is that most of the predictions of these unified theories, quantum theories of gravity, only make statements that are testable at energies that we will not be able to probe, and barring some unbelievable, completely unexpected technological or scientific breakthrough, which is almost impossible to imagine."}, {"time": 3460, "text": "You never say never, but it seems very unlikely."}, {"time": 3462, "text": "Yeah, I can just see the news story."}, {"time": 3465, "text": "Elon Musk decides to build a particle collider the size of our galaxy."}, {"time": 3471, "text": "We'd have to get together with all our galactic neighbors to pay for it, I think."}, {"time": 3475, "text": "What is the exciting possibilities of the Large Hadron Collider?"}, {"time": 3478, "text": "What is there to be discovered in this order of magnitude of scale?"}, {"time": 3484, "text": "Is there other bigger efforts on the horizon in this space?"}, {"time": 3489, "text": "What are the open problems, the exciting possibilities?"}, {"time": 3492, "text": "You mentioned supersymmetry."}, {"time": 3494, "text": "Yeah, so, well, there are lots of new ideas."}, {"time": 3497, "text": "Well, there are lots of problems that we're facing."}, {"time": 3498, "text": "So there's a problem with the Higgs field, which supersymmetry was supposed to solve."}, {"time": 3503, "text": "There's the fact that 95% of the universe we know from cosmology, astrophysics, is invisible, that it's made of dark matter and dark energy, which are really just words for things that we don't know what they are."}, {"time": 3515, "text": "It's what Donald Rumsfeld called a known unknown."}, {"time": 3517, "text": "So we know we don't know what they are."}, {"time": 3519, "text": "Well, that's better than unknown unknown."}, {"time": 3522, "text": "Yeah, well, there may be some unknown unknowns, but by definition we don't know what those are, so, yeah."}, {"time": 3527, "text": "But the hope is a particle accelerator could help us make sense of dark energy, dark matter."}, {"time": 3535, "text": "There's still, there's some hope for that?"}, {"time": 3537, "text": "There's hope for that, yeah."}, {"time": 3538, "text": "So one of the hopes is the LHC could produce a dark matter particle in its collisions."}, {"time": 3543, "text": "And it may be that the LHC will still discover new particles, that it might still, supersymmetry could still be there."}, {"time": 3551, "text": "It's just maybe more difficult to find than we thought originally."}, {"time": 3555, "text": "And dark matter particles might be being produced, but we're just not looking in the right part of the data for them, that's possible."}, {"time": 3562, "text": "It might be that we need more data, that these processes are very rare and we need to collect lots and lots of data before we see them."}, {"time": 3567, "text": "But I think a lot of people would say now that the chances of the LHC directly discovering new particles in the near future is quite slim."}, {"time": 3577, "text": "It may be that we need a decade more data before we can see something, or we may not see anything."}, {"time": 3583, "text": "That's the, that's where we are."}, {"time": 3585, "text": "So, I mean, the physics, the experiments that I work on, so I work on a detector called LHCb, which is one of these four big detectors that are spaced around the ring."}, {"time": 3594, "text": "And we do slightly different stuff to the big guys."}, {"time": 3597, "text": "There's two big experiments called Atlas and CMS, 3000 physicists and scientists and computer scientists on them each."}, {"time": 3604, "text": "They are the ones that discovered the Higgs and they look for supersymmetry and dark matter and so on."}, {"time": 3608, "text": "What we look at are standard model particles called bequarks, which depending on your preferences, either bottom or beauty, we tend to say beauty because it sounds sexier."}, {"time": 3620, "text": "But these particles are interesting because they have, we can make lots of them."}, {"time": 3625, "text": "We make billions or hundreds of billions of these things."}, {"time": 3628, "text": "You can therefore measure their properties very precisely."}, {"time": 3631, "text": "So you can make these really lovely precision measurements."}, {"time": 3634, "text": "And what we are doing really is a sort of complimentary thing to the other big experiments, which is they, if you think of the sort of analogy they often use is, if you imagine you're looking in, you're in the jungle and you're looking for an elephant, say, and you are a hunter and you're kind of like, let's say there's the relevance, very rare."}, {"time": 3653, "text": "You don't know where in the jungle, the jungle's big."}, {"time": 3655, "text": "So there's two ways you go about this."}, {"time": 3656, "text": "Either you can go wandering around the jungle and try and find the elephant."}, {"time": 3660, "text": "The problem is if the elephant, if there's only one elephant and the jungle's big, the chances of running into it are very small."}, {"time": 3664, "text": "Or you could look on the ground and see if you see footprints left by the elephant."}, {"time": 3669, "text": "And if the elephant's moving around, you've got a chance, that you're better chance maybe of seeing the elephant's footprints."}, {"time": 3673, "text": "If you see the footprints, you go, okay, there's an elephant."}, {"time": 3676, "text": "I maybe don't know what kind of elephant it is, but I got a sense there's something out there."}, {"time": 3680, "text": "So that's sort of what we do."}, {"time": 3681, "text": "We are the footprint people."}, {"time": 3683, "text": "We are, we're looking for the footprints, the impressions that quantum fields that we haven't managed to directly create the particle of, the effects these quantum fields have on the ordinary standard model fields that we already know about."}, {"time": 3696, "text": "So these B particles, the way they behave can be influenced by the presence of say, super fields or dark matter fields or whatever you like."}, {"time": 3705, "text": "And the way they decay and behave can be altered slightly from what our theory tells us they ought to behave."}, {"time": 3712, "text": "And it's easier to collect huge amounts of data on B quarks."}, {"time": 3716, "text": "We get billions and billions of these things."}, {"time": 3718, "text": "You can make very precise measurements."}, {"time": 3720, "text": "And the only place really at the LHC or really in high energy physics at the moment where there's fairly compelling evidence that there might be something beyond the standard model is in these B, these beauty quarks decays."}, {"time": 3735, "text": "Just to clarify, which is the difference between the different, the four experiments, for example, that you mentioned, is it the kind of particles that are being collided?"}, {"time": 3744, "text": "Is it the energies which they're collided?"}, {"time": 3747, "text": "What's the fundamental difference between the different experiments?"}, {"time": 3750, "text": "The collisions are the same."}, {"time": 3752, "text": "What's different is the design of the detectors."}, {"time": 3754, "text": "So Atlas and CMS are called, they're called what are called general purpose detectors."}, {"time": 3759, "text": "And they are basically barrel shaped machines and the collisions happen in the middle of the barrel and the barrel captures all the particles that go flying out in every direction."}, {"time": 3768, "text": "So in a sphere effectively that can fly out and it can record all of those particles."}, {"time": 3771, "text": "And what's the, sorry to be interrupting, but what's the mechanism of the recording?"}, {"time": 3777, "text": "Oh, so these detectors, if you've seen pictures of them, they're huge, like Atlas is 25 meters high and 45 meters long, they're vast machines, instruments, I guess you should call them really."}, {"time": 3789, "text": "They are, they're kind of like onions."}, {"time": 3791, "text": "So they have layers, concentric layers of detectors, different sorts of detectors."}, {"time": 3796, "text": "So close into the beam pipe, you have what are called usually made of silicon, they're tracking detectors."}, {"time": 3801, "text": "So they're little made of strips of silicon or pixels of silicon."}, {"time": 3804, "text": "And when a particle goes through the silicon, it gives a little electrical signal and you get these dots, electrical dots through your detector, which allows you to reconstruct the trajectory of the particle."}, {"time": 3814, "text": "So that's the middle and then the outsides of these detectors, you have things called calorimeters, which measure the energies of the particles and the very edge you have things called muon chambers, which basically these muon particles, which are the heavy version of the electron, they're like high velocity bullets and they can get right to the edge of the detectors."}, {"time": 3830, "text": "If you see something at the edge, that's a muon."}, {"time": 3832, "text": "So that's broadly how they work."}, {"time": 3834, "text": "And all of that is being recorded."}, {"time": 3835, "text": "That's all being fed out to, you know, computers."}, {"time": 3838, "text": "Data must be awesome, okay."}, {"time": 3840, "text": "So LHCb is different."}, {"time": 3842, "text": "So we, because we're looking for these be quarks, be quarks tend to be produced along the beam line."}, {"time": 3847, "text": "So in a collision, the be quark tend to fly sort of close to the beam pipe."}, {"time": 3852, "text": "So we built a detector that sort of pyramid cone shaped basically, that just looks in one direction."}, {"time": 3858, "text": "So we ignore, if you have your collision, stuff goes everywhere."}, {"time": 3861, "text": "We ignore all the stuff over here and going off sideways."}, {"time": 3863, "text": "We're just looking in this little region close to the beam pipe where most of these be quarks are made."}, {"time": 3868, "text": "So is there a different aspect of the sensors involved in the collection of the be quark trajectories?"}, {"time": 3877, "text": "There are some differences."}, {"time": 3878, "text": "So one of the differences is that, one of the ways you know you've seen a be quark is that be quarks are actually quite long lived by particle standards."}, {"time": 3885, "text": "So they live for 1.5 trillionths of a second, which is if you're a fundamental particle is a very long time."}, {"time": 3891, "text": "Cause the Higgs boson, I think lives for about a trillionth of a trillionth of a second, or maybe even less than that."}, {"time": 3898, "text": "So these are quite long lived things and they will actually fly a little distance before they decay."}, {"time": 3903, "text": "So they will fly a few centimeters maybe if you're lucky, then they'll decay into other stuff."}, {"time": 3907, "text": "So what we need to do in the middle of the detector, you wanna be able to see, you have your place where the protons crash into each other and that produces loads of particles that come flying out."}, {"time": 3916, "text": "So you have loads of lines, loads of tracks that point back to that proton collision."}, {"time": 3921, "text": "And then you're looking for a couple of other tracks, maybe two or three that point back to a different place that's maybe a few centimeters away from the proton collision."}, {"time": 3928, "text": "And that's the sign that a little B particle has flown a few centimeters and decayed somewhere else."}, {"time": 3933, "text": "So we need to be able to very accurately resolve the proton collision from the B particle decay."}, {"time": 3939, "text": "So the middle of our detector is very sensitive and it gets very close to the collision."}, {"time": 3944, "text": "So you have this really beautiful delicate silicon detector that sits, I think it's seven millimeters from the beam."}, {"time": 3952, "text": "And the LHC beam has as much energy as a jumbo jet at takeoff."}, {"time": 3955, "text": "So it's enough to melt a ton of copper."}, {"time": 3957, "text": "So you have this furiously powerful thing sitting next to this tiny delicate silicon sensor."}, {"time": 3963, "text": "So those aspects of our detector that are specialized to measure these particular B quarks that we're interested in."}, {"time": 3970, "text": "And is there, I mean, I remember seeing somewhere that there's some mention of matter and antimatter connected to the B, these beautiful quarks."}, {"time": 3978, "text": "Is that, what's the connection?"}, {"time": 3983, "text": "Yeah, what's the connection there?"}, {"time": 3985, "text": "Yeah, so there is a connection, which is that when you produce these B particles, these particles, because you don't see the B quark, you see the thing that B quark is inside."}, {"time": 3995, "text": "So they're bound up inside what we call beauty particles, where the B quark is joined together with another quark or two, maybe two other quarks, depending on what it is."}, {"time": 4003, "text": "They're a particular set of these B particles that exhibit this property called oscillation."}, {"time": 4009, "text": "So if you make a, for the sake of argument, a matter version of one of these B particles, as it travels, because of the magic of quantum mechanics, it oscillates backwards and forwards between its matter and antimatter versions."}, {"time": 4023, "text": "So it does this weird flipping about backwards and forwards."}, {"time": 4026, "text": "And what we can use this for is a laboratory for testing the symmetry between matter and antimatter."}, {"time": 4032, "text": "So if the symmetry between antimatter is precise, it's exact, then we should see these B particles decaying as often as matter, as they do as antimatter, because this oscillation should be even."}, {"time": 4043, "text": "It should spend as much time in each state."}, {"time": 4046, "text": "But what we actually see is that one of the states, it spends more time and it's more likely to decay in one state than the other."}, {"time": 4052, "text": "So this gives us a way of testing this fundamental symmetry between matter and antimatter."}, {"time": 4059, "text": "So what can you, sort of returning to the question before about this fundamental symmetry, it seems like if there's perfect symmetry between matter and antimatter, if we have the equal amount of each in our universe, it would just destroy itself."}, {"time": 4077, "text": "And just like you mentioned, we seem to live in a very unlikely universe where it doesn't destroy itself."}, {"time": 4083, "text": "So do you have some intuition about why that is?"}, {"time": 4087, "text": "I mean, well, I'm not a theorist."}, {"time": 4090, "text": "I don't have any particular ideas myself."}, {"time": 4108, "text": "They always come together."}, {"time": 4109, "text": "They always annihilate together."}, {"time": 4110, "text": "So there's no way of making more matter than antimatter that we've discovered so far."}, {"time": 4115, "text": "So that means in the Big Bang, you get equal amounts of matter and antimatter."}, {"time": 4118, "text": "As the universe expands and cools down during the Big Bang, not very long after the Big Bang, I think a few seconds after the Big Bang, you have this event called the Great Annihilation, which is where all the particles and antiparticles smack into each other, annihilate, turn into light mostly, and you end up with a universe later on."}, {"time": 4135, "text": "If that was what happened, then the universe we live in today would be black and empty, apart from some photons, that would be it."}, {"time": 4141, "text": "So there is stuff in the universe."}, {"time": 4143, "text": "It appears to be just made of matter."}, {"time": 4144, "text": "So there's this big mystery as to how did this happen?"}, {"time": 4148, "text": "And there are various ideas, which all involve sort of physics going on in the first trillionth of a second or so of the Big Bang."}, {"time": 4157, "text": "So it could be that one possibility is that the Higgs field is somehow implicated in this, that there was this event that took place in the early universe where the Higgs field basically switched on, it acquired its modern value."}, {"time": 4171, "text": "And when that happened, this caused all the particles to acquire mass and the universe basically went through a phase transition where you had a hot plasma of massless particles."}, {"time": 4181, "text": "And then in that plasma, it's almost like a gas turning into droplets of water."}, {"time": 4184, "text": "You get kind of these little bubbles forming in the universe where the Higgs field has acquired its modern value, the particles have got mass."}, {"time": 4192, "text": "And this phase transition in some models can cause more matter than antimatter to be produced, depending on how matter bounces off these bubbles in the early universe."}, {"time": 4201, "text": "So that's one idea."}, {"time": 4202, "text": "There's other ideas to do with neutrinos, that there are exotic types of neutrinos that can decay in a biased way to just matter and not to antimatter."}, {"time": 4210, "text": "So, and people are trying to test these ideas."}, {"time": 4212, "text": "That's what we're trying to do at LHCb."}, {"time": 4214, "text": "There's neutrino experiments planned that are trying to do these sorts of things as well."}, {"time": 4217, "text": "So yeah, there are ideas, but at the moment, no clear evidence for which of these ideas might be right."}, {"time": 4222, "text": "So we're talking about some incredible ideas."}, {"time": 4225, "text": "By the way, never heard anyone be so eloquent about describing even just the standard model."}, {"time": 4231, "text": "So I'm in awe just listening."}, {"time": 4234, "text": "Oh, thank you."}, {"time": 4235, "text": "Yeah, just having fun enjoying it."}, {"time": 4238, "text": "So the, yes, the theoretical, the particle physics is fascinating here."}, {"time": 4242, "text": "To me, one of the most fascinating things about the Large Hadron Collider is the human side of it."}, {"time": 4247, "text": "That a bunch of sort of brilliant people that probably have egos got together and were collaborate together and countries, I guess, collaborate together for the funds and everything's just collaboration everywhere."}, {"time": 4263, "text": "Cause you may be, I don't know what the right question here to ask, but almost what's your intuition about how it was possible to make this happen and what are the lessons we should learn for the future of human civilization in terms of our scientific progress?"}, {"time": 4277, "text": "Cause it seems like this is a great, great illustration of us working together to do something big."}, {"time": 4284, "text": "Yeah, I think it's possibly the best example."}, {"time": 4287, "text": "Maybe I can think of international collaboration that isn't for some unpleasant purpose, basically."}, {"time": 4293, "text": "You know, I mean, so when I started out in the field in 2008 as a new PhD student, the LHC was basically finished."}, {"time": 4301, "text": "So I didn't have to go around asking for money for it or trying to make the case."}, {"time": 4305, "text": "So I have huge admiration for the people who managed that."}, {"time": 4308, "text": "Cause this was a project that was first imagined in the 1970s, in the late 70s was when the first conversations about the LHC were mooted and it took two and a half decades of campaigning and fundraising and persuasion until they started breaking ground and building the thing in the early noughties in 2000."}, {"time": 4328, "text": "So, I mean, I think the reason just from a sort of, from the point of view of the sort of science, the scientists there, I think the reason it works ultimately is that everywhere, everyone there is there for the same reason, which is, well, in principle, at least they're there because they're interested in the world."}, {"time": 4345, "text": "They want to find out, you know, what are the basic ingredients of our universe?"}, {"time": 4349, "text": "What are the laws of nature?"}, {"time": 4351, "text": "And so everyone is pulling in the same direction."}, {"time": 4352, "text": "Now, of course, everyone has their own things they're interested in."}, {"time": 4355, "text": "Everyone has their own careers to consider."}, {"time": 4357, "text": "And, you know, I wouldn't pretend that there isn't also a lot of competition."}, {"time": 4360, "text": "So there's this funny thing in these experiments where your collaborators, your 800 collaborators in LHCb, but you're also competitors because your academics in your various universities and you want to be the one that gets the paper out on the most exciting, you know, new measurements."}, {"time": 4373, "text": "So there's this funny thing where you're kind of trying to stake out your territory while also collaborating and having to work together to make the experiments work."}, {"time": 4380, "text": "And it does work amazingly well, actually considering all of that."}, {"time": 4385, "text": "And I think there was actually, I think McKinsey or one of these big management consultancy firms went into CERN maybe a decade or so ago to try to understand how these organizations function."}, {"time": 4395, "text": "Did they figure it out?"}, {"time": 4396, "text": "I don't think they could."}, {"time": 4396, "text": "I mean, I think one of the things that's interesting, one of the other interesting things about these experiments is, you know, they're big operations like say Atlas has 3000 people."}, {"time": 4404, "text": "Now there was a person nominally who was the head of Atlas, they're called the spokesperson."}, {"time": 4409, "text": "And the spokesperson is elected by, usually by the collaboration, but they have no actual power really."}, {"time": 4416, "text": "I mean, they can't fire anyone."}, {"time": 4418, "text": "They're not anyone's boss."}, {"time": 4419, "text": "So, you know, my boss is a professor at Cambridge, not the head of my experiments."}, {"time": 4425, "text": "The head of my experiment can't tell me what to do really."}, {"time": 4427, "text": "And there's all these independent academics who are their own bosses who, you know, so that somehow it, nonetheless, by kind of consensus and discussion and lots of meetings, these things do happen and it does get done, but."}, {"time": 4441, "text": "It's like the queen here in the UK is the spokesperson."}, {"time": 4444, "text": "I guess so."}, {"time": 4445, "text": "No actual power."}, {"time": 4445, "text": "Except we don't elect her, no."}, {"time": 4447, "text": "No, we don't elect her."}, {"time": 4448, "text": "But everybody seems to love her."}, {"time": 4450, "text": "I don't know, from my outside perspective."}, {"time": 4456, "text": "But yeah, giant egos, brilliant people."}, {"time": 4459, "text": "And moving forward, do you think there's."}, {"time": 4462, "text": "Actually, I would pick up one thing you said just there, just the brilliant people thing."}, {"time": 4465, "text": "Cause I'm not saying that people aren't great."}, {"time": 4468, "text": "But I think there is this sort of impression that physicists all have to be brilliant or geniuses, which is not true actually."}, {"time": 4474, "text": "And you know, you have to be relatively bright for sure."}, {"time": 4477, "text": "But you know, a lot of people, a lot of the most successful experimental physicists are not necessarily the people with the biggest brains."}, {"time": 4483, "text": "They're the people who, you know, particularly one of the skills that's most important in particle physics is the ability to work with others and to collaborate and exchange ideas and also to work hard."}, {"time": 4492, "text": "And it's a sort of, often it's more a determination or a sort of other set of skills."}, {"time": 4497, "text": "It's not just being, you know, kind of some great brain."}, {"time": 4502, "text": "So, I mean, there's parallels to that in the machine learning world."}, {"time": 4505, "text": "If you wanna solve any real world problems, which I see as the particle accelerators, essentially a real world instantiation of theoretical physics."}, {"time": 4516, "text": "And for that, you have to not necessarily be brilliant, but be sort of obsessed, systematic, rigorous, sort of unborable, stubborn, all those kind of qualities that make for a great engineer."}, {"time": 4531, "text": "So, scientists purely speaking, that practitioner of the scientific method."}, {"time": 4537, "text": "But nevertheless, to me that's brilliant."}, {"time": 4541, "text": "I argue with him all the time."}, {"time": 4543, "text": "To me, engineering is the highest form of science."}, {"time": 4546, "text": "And he thinks that's all nonsense, that the real work is done by the theoretician."}, {"time": 4550, "text": "So, in fact, we have arguments about like people like Elon Musk, for example, because I think his work is quite brilliant, but he's fundamentally not coming up with any serious breakthroughs."}, {"time": 4562, "text": "He's just creating in this world, implementing, like making ideas happen that have a huge impact."}, {"time": 4569, "text": "To me, that's the Edison."}, {"time": 4572, "text": "That to me is a brilliant work, but to him, it's messy details that somebody will figure out anyway."}, {"time": 4585, "text": "I mean, I don't know whether you think there is a actual difference in temperament between say a physicist and an engineer, whether it's just what you got interested in."}, {"time": 4594, "text": "I mean, a lot of what experimental physicists do is to some extent engineering."}, {"time": 4600, "text": "I mean, it's not what I do."}, {"time": 4600, "text": "I mostly do data stuff, but a lot of people would be called electrical engineers, but they trained as physicists, but they learned electrical engineering, for example, because they were building detectors."}, {"time": 4610, "text": "So, there's not such a clear divide, I think."}, {"time": 4613, "text": "I mean, but there does seem to be, like you work with data."}, {"time": 4617, "text": "There does seem to be a certain, like I love data collection."}, {"time": 4621, "text": "There might be an OCD element or something that you're more naturally predisposed to as opposed to theory."}, {"time": 4627, "text": "Like I'm not afraid of data."}, {"time": 4628, "text": "I love data."}, {"time": 4630, "text": "And there's a lot of people in machine learning who are more like, they're basically afraid of data collection, afraid of data sets, afraid of all of that."}, {"time": 4638, "text": "They just want to stay in more than theoretical and they're really good at it, space."}, {"time": 4642, "text": "So, I don't know if that's the genetic, that's your upbringing, the way you go to school, but looking into the future of LHC and other colliders."}, {"time": 4653, "text": "So, there's in America, there's whatever it was called, the super, there's a lot of super."}, {"time": 4658, "text": "Superconducting super colliders."}, {"time": 4659, "text": "Yeah, superconducting."}, {"time": 4660, "text": "The desertron, yeah."}, {"time": 4661, "text": "Desertron, yeah."}, {"time": 4663, "text": "So, that was canceled, the construction of that."}, {"time": 4668, "text": "Which is a sad thing, but what do you think is the future of these efforts?"}, {"time": 4674, "text": "Will a bigger collider be built?"}, {"time": 4676, "text": "Will LHC be expanded?"}, {"time": 4679, "text": "Well, in the near future, the LHC is gonna get an upgrade."}, {"time": 4683, "text": "So, that's pretty much confirmed."}, {"time": 4684, "text": "I think it is confirmed, which is, it's not an energy upgrade."}, {"time": 4688, "text": "It's what we call a luminosity upgrade."}, {"time": 4690, "text": "So, it basically means increasing the data collection rates."}, {"time": 4693, "text": "So, more collisions per second, basically, because after a few years of data taking, you get this law of diminishing returns where each year's worth of data is a smaller and smaller fraction of the lot you've already got."}, {"time": 4703, "text": "So, to get a real improvement in sensitivity, you need to increase the data rate by an order of magnitude."}, {"time": 4708, "text": "So, that's what this upgrade is gonna do."}, {"time": 4710, "text": "LHCb, at the moment, the whole detector is basically being rebuilt to allow it to record data at a much larger rate than we could before."}, {"time": 4718, "text": "So, that will make us sensitive to whole loads of new processes that we weren't able to study before."}, {"time": 4722, "text": "And I mentioned briefly these anomalies that we've seen."}, {"time": 4725, "text": "So, we've seen a bunch of very intriguing anomalies in these b quark decays, which may be hinting at the first signs of this kind of the elephant, the signs of some new quantum field or fields maybe beyond the standard model."}, {"time": 4741, "text": "It's not yet at the statistical threshold where you can say that you've observed something, but there's lots of anomalies in many measurements that all seem to be consistent with each other."}, {"time": 4751, "text": "So, it's quite interesting."}, {"time": 4752, "text": "So, the upgrade will allow us to really home in on these things and see whether these anomalies are real, because if they are real, and this kind of connects to your point about the next generation of machines, what we would have seen then is, we would have seen the tail end of some quantum field in influencing these b quarks."}, {"time": 4771, "text": "What we then need to do is to build a bigger collider to actually make the particle of that field."}, {"time": 4777, "text": "So, if these things really do exist."}, {"time": 4780, "text": "So, that would be one argument."}, {"time": 4781, "text": "I mean, so at the moment, Europe is going through this process of thinking about the strategy for the future."}, {"time": 4787, "text": "So, there are a number of different proposals on the table."}, {"time": 4789, "text": "One is for a sort of higher energy upgrade of the LHC, where you just build more powerful magnets and put them in the same tunnel."}, {"time": 4796, "text": "That's a sort of cheaper, less ambitious possibility."}, {"time": 4799, "text": "Most people don't really like it because it's sort of a bit of a dead end, because once you've done that, there's nowhere to go."}, {"time": 4805, "text": "There's a machine called Click, which is a compact linear collider, which is a electron positron collider that uses a novel type of acceleration technology to accelerate at shorter distances."}, {"time": 4815, "text": "We're still talking kilometers long, but not like 100 kilometers long."}, {"time": 4819, "text": "And then probably the project that is, I think getting the most support, it'd be interesting to see what happens, something called the Future Circular Collider, which is a really ambitious longterm multi decade project to build a 100 kilometer circumference tunnel under the Geneva region."}, {"time": 4838, "text": "The LHC would become a kind of feeding machine."}, {"time": 4840, "text": "It would just feed."}, {"time": 4841, "text": "So the same area, so it would be a feeder for the."}, {"time": 4844, "text": "So it would kind of, the edge of this machine would be where the LHC is, but it would sort of go under Lake Geneva and round to the Alps, basically, up to the edge of the Geneva basin."}, {"time": 4852, "text": "So it's basically the biggest tunnel you can fit in the region based on the geology."}, {"time": 4857, "text": "100 kilometers."}, {"time": 4858, "text": "Yeah, so it's big."}, {"time": 4858, "text": "It'd be a long drive if your experiment's on one side."}, {"time": 4861, "text": "You've got to go back to CERN for lunch, so that would be a pain."}, {"time": 4864, "text": "But you know, so this project is, in principle, it's actually two accelerators."}, {"time": 4869, "text": "The first thing you would do is put an electron positron machine in the 100 kilometer tunnel to study the Higgs."}, {"time": 4874, "text": "So you'd make lots of Higgs bows and study it really precisely in the hope that you see it misbehaving and doing something it's not supposed to."}, {"time": 4880, "text": "And then in the much longer term, 100, that machine gets taken out, you put in a proton proton machine."}, {"time": 4886, "text": "So it's like the LHC, but much bigger."}, {"time": 4889, "text": "And that's the way you start going and looking for dark matter, or you're trying to recreate this phase transition that I talked about in the early universe, where you can see matter anti matter being made, for example."}, {"time": 4900, "text": "There's lots of things you can do with these machines."}, {"time": 4901, "text": "The problem is that they will take, you know, the most optimistic, you're not gonna have any data from any of these machines until 2040, or, you know, because they take such a long time to build and they're so expensive."}, {"time": 4912, "text": "So you have, there'll be a process of R&D design, but also the political case being made."}, {"time": 4917, "text": "So LHC, what costs a few billion?"}, {"time": 4921, "text": "Depends how you count it."}, {"time": 4923, "text": "I think most of the sort of more reasonable estimates that take everything into account properly, it's around the sort of 10, 11, 12 billion euro mark."}, {"time": 4930, "text": "What would be the future, sorry, I forgot the name already."}, {"time": 4933, "text": "Future Circular Collider."}, {"time": 4935, "text": "Presumably they won't call it that when it's built, cause it won't be the future anymore."}, {"time": 4938, "text": "But I don't know, I don't know what they'll call it then."}, {"time": 4940, "text": "The very big Hadron Collider, I don't know."}, {"time": 4945, "text": "But that will, now I should know the numbers, but I think the whole project is estimated at about 30 billion euros, but that's money spent over between now and 2070 probably, which is when the last bit of it would be sort of finishing up, I guess."}, {"time": 4962, "text": "So you're talking a half a century of science coming out of this thing, shared by many countries."}, {"time": 4968, "text": "So the actual cost, the arguments that are made is that you could make this project fit within the existing budget of CERN, if you didn't do anything else."}, {"time": 4977, "text": "And CERN, by the way, we didn't mention, what is CERN?"}, {"time": 4980, "text": "CERN is the European Organization for Nuclear Research."}, {"time": 4983, "text": "It's an international organization that was established in the 1950s in the wake of the second world war as a kind of, it was sort of like a scientific Marshall plan for Europe."}, {"time": 4992, "text": "The idea was that you bring European science back together for peaceful purposes, because what happened in the forties was, a lot of particular Jewish scientists, but a lot of scientists from central Europe had fled to the United States and Europe had sort of seen this brain drain."}, {"time": 5007, "text": "So there was a desire to bring the community back together for a project that wasn't building nasty bombs, but was doing something that was curiosity driven."}, {"time": 5014, "text": "So, and that has continued since then."}, {"time": 5017, "text": "So it's kind of a unique organization."}, {"time": 5018, "text": "It's you, to be a member as a country, you sort of sign up as a member and then you have to pay a fraction of your GDP each year as a subscription."}, {"time": 5027, "text": "I mean, it's a very small fraction, relatively speaking."}, {"time": 5029, "text": "I think it's like, I think the UK's contribution is a hundred or 200 million quid or something like that."}, {"time": 5034, "text": "Yeah, which is quite a lot, but not so."}, {"time": 5038, "text": "I mean, just the whole thing that is possible, it's beautiful."}, {"time": 5041, "text": "It's a beautiful idea, especially when there's no wars on the line, it's not like we're freaking out, as we're actually legitimately collaborating to do good science."}, {"time": 5049, "text": "One of the things I don't think we really mentioned is on the final side, that sort of the data analysis side, is there breakthroughs possible there and the machine learning side, like is there a lot more signal to be mined in more effective ways from the actual raw data?"}, {"time": 5065, "text": "Yeah, a lot of people are looking into that."}, {"time": 5067, "text": "I mean, so I use machine learning in my data analysis, but pretty naughty, basic stuff, cause I'm not a machine learning expert."}, {"time": 5075, "text": "I'm just a physicist who had to learn to do this stuff for my day job."}, {"time": 5078, "text": "So what a lot of people do is they use kind of off the shelf packages that you can train to do signal noise."}, {"time": 5086, "text": "Just clean up all the data."}, {"time": 5088, "text": "But one of the big challenges, the big challenge of the data is A, it's volume, there's huge amounts of data."}, {"time": 5093, "text": "So the LHC generates, now, okay, I try to remember what the actual numbers are, but if you, we don't record all our data, we record a tiny fraction of the data."}, {"time": 5102, "text": "It's like of order one 10,000th or something, I think."}, {"time": 5104, "text": "Is that right?"}, {"time": 5105, "text": "Around that."}, {"time": 5107, "text": "So most of it gets thrown away."}, {"time": 5108, "text": "You couldn't record all the LHC data cause it would fill up every computer in the world in a matter of days, basically."}, {"time": 5113, "text": "So there's this process that happens on live, on the detector, something called a trigger, which in real time, 40 million times every second has to make a decision about whether this collision is likely to contain an interesting object, like a Higgs boson or a dark matter particle."}, {"time": 5128, "text": "And it has to do that very fast."}, {"time": 5129, "text": "And the software algorithms in the past were quite relatively basic."}, {"time": 5136, "text": "They did things like measure mementos and energies of particles and put some requirements."}, {"time": 5140, "text": "So you would say, if there's a particle with an energy above some threshold, then record this collision."}, {"time": 5144, "text": "But if there isn't, don't."}, {"time": 5146, "text": "Whereas now the attempt is get more and more machine learning in at the earliest possible stage."}, {"time": 5151, "text": "That's cool, at the stage of deciding whether we want to keep this data or not."}, {"time": 5155, "text": "But also maybe even lower down than that, which is the point where there's this, so generally how the data is reconstructed is you start off with a set of digital hits in your detector."}, {"time": 5167, "text": "So channels saying, did you see something?"}, {"time": 5168, "text": "Did you not see something?"}, {"time": 5170, "text": "That has to be then turned into tracks, particles going in different directions."}, {"time": 5174, "text": "And that's done by using fits that fit through the data points."}, {"time": 5177, "text": "And then that's passed to the algorithms that then go, is this interesting or not?"}, {"time": 5180, "text": "What'd be better is you could train machine learning to just look at the raw hits, the basic real base level information, not have any of the reconstruction done."}, {"time": 5188, "text": "And it just goes, and it can learn to do pattern recognition on this strange three dimensional image that you get."}, {"time": 5194, "text": "And potentially that's where you could get really big gains because our triggers tend to be quite inefficient because they don't have time to do the full whiz bang processing to get all the information out that we would like, because you have to do the decision very quickly."}, {"time": 5206, "text": "So if you can come up with some clever machine learning technique, then potentially you can massively increase the amount of useful data you record and get rid of more of the background earlier in the process."}, {"time": 5219, "text": "Yeah, to me, that's an exciting possibility because then you don't have to build a sort of, you can get a gain without having to."}, {"time": 5228, "text": "Without having to build any hardware, I suppose."}, {"time": 5230, "text": "Hardware, yeah."}, {"time": 5231, "text": "Although you need lots of new GPU farms, I guess."}, {"time": 5233, "text": "So hardware still helps."}, {"time": 5235, "text": "But I got to talk to you, sort of I'm not sure how to ask, but you're clearly an incredible science communicator."}, {"time": 5247, "text": "I don't know if that's the right term, but you're basically a younger Neil deGrasse Tyson with a British accent."}, {"time": 5253, "text": "So, and you've, I mean, can you say where we are today, actually?"}, {"time": 5259, "text": "Yeah, so today we're in the Royal Institution in London, which is a very old organization."}, {"time": 5265, "text": "It's been around for about 200 years now, I think."}, {"time": 5267, "text": "Maybe even I should know when it was founded."}, {"time": 5269, "text": "Sort of early 19th century, it was set up to basically communicate science to the public."}, {"time": 5275, "text": "So it was one of the first places in the world where famous scientists would come and give talks."}, {"time": 5281, "text": "So very famously Humphrey Davy, who you may know of, who was the person who discovered nitrous oxide."}, {"time": 5287, "text": "He was a very famous chemist and scientist."}, {"time": 5291, "text": "Also discovered electrolysis."}, {"time": 5292, "text": "So he used to do these fantastic, he was a very charismatic speaker."}, {"time": 5295, "text": "So he used to appear here."}, {"time": 5295, "text": "There's a big desk that they usually have in the theater and he would do demonstrations to the sort of the, the folk of London back in the early 19th century."}, {"time": 5303, "text": "And Michael Faraday, who I talked about, who is the person who did so much work on electromagnetism, he used, he lectured here."}, {"time": 5308, "text": "He also did experiments in the basement."}, {"time": 5309, "text": "So this place has got a long history of both scientific research, but also communication of scientific research."}, {"time": 5315, "text": "So you gave a few lectures here."}, {"time": 5318, "text": "How many, two?"}, {"time": 5319, "text": "I've given, yeah, I've given a couple of lectures in this theater before, so."}, {"time": 5322, "text": "I mean, that's, so people should definitely go watch online."}, {"time": 5326, "text": "It's just the explanation of particle physics."}, {"time": 5328, "text": "So all the, I mean, it's incredible."}, {"time": 5330, "text": "Like your lectures are just incredible."}, {"time": 5333, "text": "I can't sing it enough praise."}, {"time": 5334, "text": "So it was awesome."}, {"time": 5335, "text": "But maybe can you say, what did that feel like?"}, {"time": 5340, "text": "What does it feel like to lecture here, to talk about that?"}, {"time": 5343, "text": "And maybe from a different perspective, more kind of like how the sausage is made is, how do you prepare for that kind of thing?"}, {"time": 5352, "text": "How do you think about communication, the process of communicating these ideas in a way that's inspiring to, what I would say your talks are inspiring to like the general audience."}, {"time": 5362, "text": "You don't actually have to be a scientist."}, {"time": 5365, "text": "You can still be inspired without really knowing much of the, you start from the very basics."}, {"time": 5370, "text": "So what's the preparation process?"}, {"time": 5373, "text": "And then the romantic question is, what did that feel like to perform here?"}, {"time": 5378, "text": "I mean, profession, yeah."}, {"time": 5379, "text": "I mean, the process, I mean, the talk, my favorite talk that I gave here was one called Beyond the Higgs, which you can find on the Royal Institute's YouTube channel, which you should go and check out."}, {"time": 5388, "text": "I mean, and their channel's got loads of great talks with loads of great people as well."}, {"time": 5392, "text": "I mean, that one, I'd sort of given a version of it many times, so part of it is just practice, right?"}, {"time": 5397, "text": "And actually, I don't have some great theory of how to communicate with people."}, {"time": 5400, "text": "It's more just that I'm really interested and excited by those ideas and I like talking about them."}, {"time": 5405, "text": "And through the process of doing that, I guess I figured out stories that work and explanations that work."}, {"time": 5410, "text": "When you say practice, you mean legitimately just giving talks?"}, {"time": 5412, "text": "Just giving talks, yeah."}, {"time": 5414, "text": "I started off when I was a PhD student doing talks in schools and I still do that as well some of the time and doing things, I've even done a bit of standup comedy, which sort of went reasonably well, even if it was terrifying."}, {"time": 5426, "text": "And that's on YouTube as well."}, {"time": 5427, "text": "That's also on, I wouldn't necessarily recommend you check that out."}, {"time": 5430, "text": "I'm gonna post the links several places to make sure people click on it."}, {"time": 5435, "text": "But it's basically, I kind of have a story in my head and I kind of, I have to think about what I wanna say."}, {"time": 5441, "text": "I usually have some images to support what I'm saying and I get up and do it."}, {"time": 5444, "text": "And it's not really, I wish there was some kind of, I probably should have some proper process."}, {"time": 5448, "text": "This is very sounds like I'm just making up as I go along and I sort of am."}, {"time": 5452, "text": "Well, I think the fundamental thing that you said, I think it's like, I don't know if you know who a guy named Joe Rogan is."}, {"time": 5462, "text": "So he's also kind of sounds like you in a sense that he's not very introspective about his process, but he's an incredibly engaging conversationalist."}, {"time": 5473, "text": "And I think one of the things that you and him share that I could see is like a genuine curiosity and passion for the topic."}, {"time": 5482, "text": "I think that could be systematically cultivated."}, {"time": 5486, "text": "I'm sure there's a process to it, but you come to it naturally somehow."}, {"time": 5490, "text": "I think maybe there's something else as well, which is to understand something."}, {"time": 5494, "text": "There's this quote by Feynman, which I really like, which is what I cannot create, I do not understand."}, {"time": 5498, "text": "So I'm not particularly super bright."}, {"time": 5503, "text": "So for me to understand something, I have to break it down into its simplest elements."}, {"time": 5507, "text": "And if I can then tell people about that, that helps me understand it as well."}, {"time": 5511, "text": "So I've learned to understand physics a lot more from the process of communicating, because it forces you to really scrutinize the ideas that you're communicating and it often makes you realize you don't really understand the ideas you're talking about."}, {"time": 5526, "text": "And I'm writing a book at the moment, and I had this experience yesterday where I realized I didn't really understand a pretty fundamental theoretical aspect of my own subject."}, {"time": 5534, "text": "And I had to go and I had to sort of spend a couple of days reading textbooks and thinking about it in order to make sure that the explanation I gave captured the, got as close to what is actually happening in the theory."}, {"time": 5546, "text": "And to do that, you have to really understand it properly."}, {"time": 5549, "text": "Yeah, and there's layers to understanding."}, {"time": 5551, "text": "It seems like the more, there must be some kind of Feynman law."}, {"time": 5555, "text": "I mean, the more you understand sort of the simpler you're able to really convey the essence of the idea, right?"}, {"time": 5566, "text": "So it's like this reverse effect that it's like the more you understand, the simpler the final thing that you actually convey."}, {"time": 5576, "text": "And so the more accessible somehow it becomes."}, {"time": 5578, "text": "That's why Feynman's lectures are really accessible."}]}]