[{"title": "Michio Kaku: Future of Humans, Aliens, Space Travel & Physics | Lex Fridman Podcast #45", "id": "kD5yc1LQrpQ", "quotes": [{"time": 297, "text": "That's it, folks."}, {"time": 298, "text": "And he kept persisting and saying, no, there's type four, the power of the continuum."}, {"time": 305, "text": "And I thought about it for a moment."}, {"time": 307, "text": "And I said to myself, is there an extra galactic source of energy, the continuum of Star Trek?"}, {"time": 314, "text": "And the answer is yes, there could be a type four."}, {"time": 318, "text": "And that's dark energy."}, {"time": 320, "text": "We now know that 73% of the energy of the universe is dark energy."}, {"time": 327, "text": "Dark matter represents maybe 23% or so, and we only represent 4%."}, {"time": 333, "text": "We're the oddballs."}, {"time": 334, "text": "And so you begin to realize that, yeah, there could be type four, maybe even type five."}, {"time": 339, "text": "So type four, you're saying being able to harness sort of like dark energy, something that permeates the entire universe."}, {"time": 347, "text": "So be able to plug into the entire universe as a source of energy."}, {"time": 352, "text": "And dark energy is the energy of the Big Bang."}, {"time": 355, "text": "It's why the galaxies are being pushed apart."}, {"time": 358, "text": "It's the energy of nothing."}, {"time": 360, "text": "The more nothing you have, the more dark energy that's repulsive."}, {"time": 365, "text": "And so the acceleration of the universe is accelerating because the more you have, the more you can have."}, {"time": 372, "text": "And that, of course, is by definition an exponential curve."}, {"time": 375, "text": "It's called a de Sitter expansion, and that's the current state of the universe."}, {"time": 380, "text": "And then type five, would that be able to seek energy sources somehow outside of our universe?"}, {"time": 391, "text": "And how crazy is that idea?"}, {"time": 393, "text": "Yeah, type five will be the multiverse."}, {"time": 395, "text": "Multiverse, okay."}, {"time": 396, "text": "I'm a quantum physicist, and we quantum physicists don't believe that the Big Bang happened once."}, {"time": 402, "text": "That would violate the Heisenberg uncertainty principle."}, {"time": 405, "text": "And that means that there could be multiple bangs happening all the time."}, {"time": 409, "text": "Even as we speak today, universes are being created, and that fits the data."}, {"time": 416, "text": "The inflationary universe is a quantum theory."}, {"time": 419, "text": "So there's a certain finite probability that universes are being created all the time."}, {"time": 425, "text": "And for me, this is actually rather aesthetically pleasing because I was raised as a Presbyterian, but my parents were Buddhists."}, {"time": 435, "text": "And there's two diametrically opposed ideas about the universe."}, {"time": 441, "text": "In Buddhism, there's only nirvana."}, {"time": 443, "text": "There's no beginning, there's no end, there's only timelessness."}, {"time": 446, "text": "But in Christianity, there is the instant when God said, let there be light."}, {"time": 452, "text": "In other words, an instant of creation."}, {"time": 455, "text": "So I've had these two mutually exclusive ideas in my head, and I now realize that it's possible to meld them into a single theory."}, {"time": 465, "text": "Either the universe had a beginning or it didn't, right?"}, {"time": 468, "text": "Wrong."}, {"time": 469, "text": "You see, our universe had a beginning."}, {"time": 473, "text": "Our universe had an instant where somebody might have said, let there be light."}, {"time": 477, "text": "But there are other bubble universes out there in a bubble bath of universes."}, {"time": 482, "text": "And that means that these universes are expanding into a dimension beyond our three dimensional comprehension."}, {"time": 491, "text": "In other words, hyperspace."}, {"time": 493, "text": "In other words, 11 dimensional hyperspace."}, {"time": 496, "text": "So nirvana would be this timeless 11 dimensional hyperspace where big bangs are happening all the time."}, {"time": 504, "text": "So we can now combine two mutually exclusive theories of creation."}, {"time": 510, "text": "And Stephen Hawking, for example, even in his last book, even said that this is an argument against the existence of God."}, {"time": 519, "text": "He said there is no God because there was not enough time for God to create the universe because the big bang happened in an instant of time."}, {"time": 527, "text": "Therefore, there was no time available for him to create the universe."}, {"time": 532, "text": "But you see, the multiverse idea means that there was a time before time."}, {"time": 538, "text": "And there are multiple times, each bubble has its own time."}, {"time": 541, "text": "And so it means that there could actually be a universe before the beginning of our universe."}, {"time": 549, "text": "So if you think of a bubble bath, when two bubbles collide, or when two bubbles fission to create a baby bubble, that's called the big bang."}, {"time": 558, "text": "So the big bang is nothing but the collision of universes or the budding of universes."}, {"time": 563, "text": "That's such a beautiful picture of our incredibly mysterious existence."}, {"time": 568, "text": "So is that humbling to you?"}, {"time": 570, "text": "Exciting, the idea of multiverses?"}, {"time": 572, "text": "I don't even know how to even begin to wrap my mind around it."}, {"time": 577, "text": "It's exciting for me because what I do for a living is string theory."}, {"time": 581, "text": "That's my day job."}, {"time": 583, "text": "I get paid by the city of New York to work on string theory."}, {"time": 586, "text": "And you see, string theory is a multiverse theory."}, {"time": 590, "text": "So people say, first of all, what is string theory?"}, {"time": 593, "text": "String theory simply says that all the particles we see in nature, the electron, the proton, the quarks, what have you, are nothing but vibrations on a musical string, on a tiny, tiny little string."}, {"time": 605, "text": "You know, G. Robert Oppenheimer, the creator of the atomic bomb, was so frustrated in the 1950s with all these subatomic particles being created in our atom smashers that he announced, he announced one day that the Nobel Prize in physics should go to the physicist who does not discover a new particle that year."}, {"time": 628, "text": "Well, today we think they're nothing but musical notes on these tiny little vibrating strings."}, {"time": 632, "text": "So what is physics?"}, {"time": 634, "text": "Physics is the harmonies you can write on vibrating strings."}, {"time": 638, "text": "What is chemistry?"}, {"time": 640, "text": "Chemistry is the melodies you can play on these strings."}, {"time": 644, "text": "What is the universe?"}, {"time": 647, "text": "The universe is a symphony of strings."}, {"time": 650, "text": "And then what is the mind of God that Albert Einstein so eloquently wrote about for the last 30 years of his life?"}, {"time": 658, "text": "The mind of God would be cosmic music, resonating through 11 dimensional hyperspace."}, {"time": 667, "text": "What do you think is the mind of Einstein's God?"}, {"time": 671, "text": "Do you think there's a why that we could untangle from this universe of strings?"}, {"time": 679, "text": "Why are we here?"}, {"time": 680, "text": "What is the meaning of it all?"}, {"time": 683, "text": "Well, Steven Weinberg, winner of the Nobel Prize, once said that the more we learn about the universe, the more we learn that it's pointless."}, {"time": 692, "text": "Well, I don't know."}, {"time": 695, "text": "I don't profess to understand the great secrets of the universe."}, {"time": 699, "text": "However, let me say two things about what the giants of physics have said about this question."}, {"time": 705, "text": "Einstein believed in two types of God."}, {"time": 709, "text": "One was the God of the Bible, the personal God, the God that answers prayers, walks on waters, performs miracles, smites the Philistines."}, {"time": 720, "text": "That's the personal God that he didn't believe in."}, {"time": 722, "text": "He believed in the God of Spinoza, the God of order, simplicity, harmony, beauty."}, {"time": 730, "text": "The universe could have been ugly."}, {"time": 732, "text": "The universe could have been messy, random, but it's gorgeous."}, {"time": 737, "text": "You realize that on a single sheet of paper, we can write down all the known laws of the universe."}, {"time": 743, "text": "It's amazing, on one sheet of paper, Einstein's equation is one inch long, string theory is a lot longer, and so it's a standard model, but you could put all these equations on one sheet of paper."}, {"time": 756, "text": "It didn't have to be that way."}, {"time": 758, "text": "It could have been messy."}, {"time": 760, "text": "And so, Einstein thought of himself as a young boy entering this huge library for the first time, being overwhelmed by the simplicity, elegance, and beauty of this library, but all he could do was read the first page of the first volume."}, {"time": 778, "text": "Well, that library is the universe, with all sorts of mysterious, magical things that we have yet to find."}, {"time": 785, "text": "And then Galileo was asked about this."}, {"time": 787, "text": "Galileo said that the purpose of science, the purpose of science is to determine how the heavens go."}, {"time": 797, "text": "The purpose of religion is to determine how to go to heaven."}, {"time": 802, "text": "So in other words, science is about natural law, and religion is about ethics, how to be a good person, how to go to heaven."}, {"time": 812, "text": "As long as we keep these two things apart, we're in great shape."}, {"time": 816, "text": "The problem occurs when people from the natural sciences begin to pontificate about ethics, and people from religion begin to pontificate about natural law."}, {"time": 827, "text": "That's where we get into big trouble."}, {"time": 830, "text": "You think they're fundamentally distinct, morality and ethics and our idea of what is right and what is wrong."}, {"time": 839, "text": "That's something that's outside the reach of string theory and physics."}, {"time": 844, "text": "If you talk to a squirrel about what is right and what is wrong, there's no reference frame for a squirrel, and realize that aliens from outer space, if they ever come visit us, they'll try to talk to us like we talk to squirrels in the forest, but eventually we get bored talking to the squirrels because they don't talk back to us."}, {"time": 868, "text": "Same thing with aliens from outer space."}, {"time": 870, "text": "They come down to earth, they'll be curious about us to a degree, but after a while they just get bored because we have nothing to offer them."}, {"time": 877, "text": "So our sense of right and wrong, what does that mean compared to a squirrel's sense of right and wrong?"}, {"time": 886, "text": "Now we of course do have an ethics that keeps civilizations in line, enriches our life and makes civilization possible."}, {"time": 896, "text": "And I think that's a good thing, but it's not mandated by a law of physics."}, {"time": 901, "text": "So if aliens do, alien species were to make contact, forgive me for staying on aliens for a bit longer."}, {"time": 910, "text": "Do you think they're more likely to be friendly, to befriend us or to destroy us?"}, {"time": 918, "text": "Well, I think for the most part, they'll pretty much ignore us."}, {"time": 922, "text": "If you're a deer in the forest, who do you fear the most?"}, {"time": 925, "text": "Do you fear the hunter with his gigantic 16 gauge shotgun?"}, {"time": 930, "text": "Or do you fear the guy with a briefcase and glasses?"}, {"time": 935, "text": "Well, the guy with the briefcase could be a developer about to basically flatten the entire forest, destroying your livelihood."}, {"time": 944, "text": "So instinctively you may be afraid of the hunter, but actually the problem with deers in the forest is that they should fear developers because developers look at deer as simply getting in the way."}, {"time": 959, "text": "I mean, in War of the Worlds by H.G."}, {"time": 959, "text": "Wells, the aliens did not hate us."}, {"time": 964, "text": "If you read the book, the aliens did not have evil intentions toward homo sapiens."}, {"time": 971, "text": "No, we were in the way."}, {"time": 973, "text": "So I think we have to realize that alien civilizations may view us quite differently than in science fiction novels."}, {"time": 981, "text": "However, I personally believe, and I cannot prove any of this, I personally believe that they're probably gonna be peaceful because there's nothing that they want from our world."}, {"time": 991, "text": "I mean, what are they gonna take us?"}, {"time": 993, "text": "What are they gonna take us for, gold?"}, {"time": 995, "text": "No, gold is a useless metal for the most part."}, {"time": 999, "text": "It's silver, I mean, it's gold in color, but that only affects homo sapiens."}, {"time": 1005, "text": "Squirrels don't care about gold."}, {"time": 1007, "text": "And so gold is a rather useless element."}, {"time": 1010, "text": "Rare earths maybe, platinum based elements, rare earths for the electronics, yeah, maybe."}, {"time": 1015, "text": "But other than that, we have nothing to offer them."}, {"time": 1019, "text": "I mean, think about it for a moment."}, {"time": 1021, "text": "People love Shakespeare and they love the arts and poetry, but outside of the earth, they mean nothing, absolutely nothing."}, {"time": 1032, "text": "I mean, when I write down an equation in string theory, I would hope that on the other side of the galaxy, there's an alien writing down that very same equation in different notation, but that alien on the other side of the galaxy, Shakespeare, poetry, Hemingway, it would mean nothing to him or her or it."}, {"time": 1053, "text": "When you think about entities that's out there, extraterrestrial, do you think they would naturally look something that even is recognizable to us as life?"}, {"time": 1068, "text": "Or would they be radically different?"}, {"time": 1070, "text": "Well, how did we become intelligent?"}, {"time": 1072, "text": "Basically three things made us intelligent."}, {"time": 1076, "text": "One is our eyesight, stereo eyesight."}, {"time": 1079, "text": "We have the eyes of a hunter, stereo vision so we lock in on targets."}, {"time": 1084, "text": "And who is smarter, predator or prey?"}, {"time": 1089, "text": "Predators are smarter than prey."}, {"time": 1091, "text": "They have their eyes at the front of their face, like lions, tigers, while rabbits have eyes to the side of their face."}, {"time": 1099, "text": "Hunters have to zero in on the target."}, {"time": 1102, "text": "They have to know how to ambush."}, {"time": 1104, "text": "They have to know how to hide, camouflage, sneak up, stealth, deceit."}, {"time": 1110, "text": "That takes a lot of intelligence."}, {"time": 1111, "text": "Rabbits, all they have to do is run."}, {"time": 1115, "text": "So that's the first criterion, stereo eyesight of some sort."}, {"time": 1119, "text": "Second is the thumb."}, {"time": 1122, "text": "The opposable thumb of some sort could be a claw or a tentacle."}, {"time": 1126, "text": "So hand eye coordination."}, {"time": 1128, "text": "Hand eye coordination is the way we manipulate the environment."}, {"time": 1132, "text": "And then three, language."}, {"time": 1135, "text": "Because mama bear never tells baby bear to avoid the human hunter."}, {"time": 1140, "text": "Bears just learn by themselves."}, {"time": 1142, "text": "They never hand out information from one generation to the next."}, {"time": 1146, "text": "So these are the three basic ingredients of intelligence."}, {"time": 1150, "text": "Eyesight of some sort, an opposable thumb or tentacle or claw of some sort, and language."}, {"time": 1156, "text": "Now ask yourself a simple question."}, {"time": 1159, "text": "How many animals have all three?"}, {"time": 1162, "text": "Just us."}, {"time": 1163, "text": "It's just us."}, {"time": 1165, "text": "I mean, the primates, they have a language, yeah, they may get up to maybe 20 words, but a baby learns a word a day, several words a day a baby learns."}, {"time": 1175, "text": "And a typical adult knows about almost 5,000 words."}, {"time": 1181, "text": "While the maximum number of words that you can teach a gorilla in any language, including their own language, is about 20 or so."}, {"time": 1189, "text": "And so we see the difference in intelligence."}, {"time": 1193, "text": "So when we meet aliens from outer space, chances are they will have been descended from predators of some sort."}, {"time": 1201, "text": "They'll have some way to manipulate the environment and communicate their knowledge to the next generation."}, {"time": 1209, "text": "So functionally, that would be similar."}, {"time": 1212, "text": "That would, we would be able to recognize them."}, {"time": 1215, "text": "Well, not necessarily, because I think even with Homo sapiens, we are eventually going to perhaps become part cybernetic and genetically enhanced."}, {"time": 1227, "text": "Already, robots are getting smarter and smarter."}, {"time": 1231, "text": "Right now, robots have the intelligence of a cockroach."}, {"time": 1235, "text": "But in the coming years, our robots will be as smart as a mouse, then maybe as smart as a rabbit."}, {"time": 1242, "text": "If we're lucky, maybe as smart as a cat or a dog."}, {"time": 1247, "text": "And by the end of the century, who knows for sure, our robots will be probably as smart as a monkey."}, {"time": 1253, "text": "Now, at that point, of course, they could be dangerous."}, {"time": 1256, "text": "You see, monkeys are self aware."}, {"time": 1259, "text": "They know they are monkeys."}, {"time": 1263, "text": "They may have a different agenda than us."}, {"time": 1266, "text": "While dogs, dogs are confused."}, {"time": 1270, "text": "You see, dogs think that we are a dog, that we're the top dog."}, {"time": 1276, "text": "They're the underdog."}, {"time": 1277, "text": "That's why they whimper and follow us and lick us all the time."}, {"time": 1281, "text": "We're the top dog."}, {"time": 1282, "text": "Monkeys have no illusion at all."}, {"time": 1285, "text": "They know we are not monkeys."}, {"time": 1288, "text": "And so I think that in the future, we'll have to put a chip in their brain to shut them off once our robots have murderous thoughts."}, {"time": 1295, "text": "But that's in a hundred years."}, {"time": 1297, "text": "In 200 years, the robots will be smart enough to remove that fail safe chip in their brain and then watch out."}, {"time": 1306, "text": "At that point, I think rather than compete with our robots, we should merge with them."}, {"time": 1314, "text": "We should become part cybernetic."}, {"time": 1316, "text": "So I think when we meet alien life from outer space, they may be genetically and cybernetically enhanced."}, {"time": 1325, "text": "Genetically and cybernetically enhanced."}, {"time": 1327, "text": "Wow, so let's talk about that full range."}, {"time": 1331, "text": "In the near term and 200 years from now, how promising in the near term in your view is brain machine interfaces?"}, {"time": 1338, "text": "So starting to allow computers to talk directly to the brains, Elon Musk is working on that with Neuralink and there's other companies working on this idea."}, {"time": 1349, "text": "Do you see promise there?"}, {"time": 1350, "text": "Do you see hope for near term impact?"}, {"time": 1352, "text": "Well, every technology has pluses and minuses."}, {"time": 1356, "text": "Already we can record memories."}, {"time": 1358, "text": "I have a book, The Future of the Mind, where I detail some of these breakthroughs."}, {"time": 1362, "text": "We can now record simple memories of mice and send these memories on the internet."}, {"time": 1369, "text": "Eventually, we're gonna do this with primates at Wake Forest University and also in Los Angeles."}, {"time": 1375, "text": "And then after that, we'll have a memory chip for Alzheimer's patients."}, {"time": 1380, "text": "We'll test it out in Alzheimer's patients because of course, when Alzheimer's patients lose their memory, they wander."}, {"time": 1387, "text": "They create all sorts of havoc, wandering around, oblivious to their surroundings and they'll have a chip."}, {"time": 1395, "text": "They'll push the button and memories, memories will come flooding into their hippocampus and the chip telling them where they live and who they are."}, {"time": 1406, "text": "And so a memory chip is definitely in the cards."}, {"time": 1409, "text": "And I think this will eventually affect human civilization."}, {"time": 1413, "text": "What is the future of the internet?"}, {"time": 1415, "text": "The future of the internet is brain net."}, {"time": 1417, "text": "Brain net is when we send emotions, feelings, sensations on the internet."}, {"time": 1424, "text": "And we will telepathically communicate with other humans this way."}, {"time": 1429, "text": "This is gonna affect everything."}, {"time": 1431, "text": "Look at entertainment."}, {"time": 1432, "text": "Remember the silent movies?"}, {"time": 1434, "text": "Charlie Chaplin was very famous during the era of silent movies."}, {"time": 1438, "text": "But when the talkies came in, nobody wanted to see Charlie Chaplin anymore because he never talked in the movies."}, {"time": 1445, "text": "And so a whole generation of actors lost their job and a new series of actors came in."}, {"time": 1451, "text": "Next, we're gonna have the movies replaced by brain net because in the future, people will say, who wants to see a screen with images?"}, {"time": 1463, "text": "Sound and image, that's called the movies."}, {"time": 1467, "text": "In our entertainment industry, this multi billion dollar industry is based on screens with moving images and sound."}, {"time": 1474, "text": "But what happens when emotions, feelings, sensations, memories can be conveyed on the internet?"}, {"time": 1483, "text": "It's gonna change everything."}, {"time": 1484, "text": "Human relations will change because you'll be able to empathize and feel the suffering of other people."}, {"time": 1490, "text": "We'll be able to communicate telepathically."}, {"time": 1493, "text": "And this is coming."}, {"time": 1495, "text": "You described brain net and future of the mind."}, {"time": 1498, "text": "This is an interesting concept."}, {"time": 1500, "text": "Do you think, so you mentioned entertainment, but what kind of effect would it have on our personal relationships?"}, {"time": 1508, "text": "Hopefully it will deepen it."}, {"time": 1510, "text": "You realize that for most of human history, for over 90% of human history, we only knew maybe 20, 100 people."}, {"time": 1523, "text": "That was your tribe."}, {"time": 1525, "text": "That was everybody you knew in the universe was only maybe 50 or 100."}, {"time": 1531, "text": "With the coming of towns, of course it expanded to a few thousand."}, {"time": 1535, "text": "With the coming of the telephone, all of a sudden you could reach thousands of people with a telephone."}, {"time": 1541, "text": "And now with the internet, you can reach the entire population of the planet Earth."}, {"time": 1545, "text": "And so I think this is a normal progression."}, {"time": 1548, "text": "And you think that kind of sort of connection to the rest of the world, and then adding sensations like being able to share telepathically emotions and so on that would just further deepen our connection to our fellow humans."}, {"time": 1563, "text": "In fact, I disagree with many scientists on this question."}, {"time": 1567, "text": "Most scientists would say that technology is neutral."}, {"time": 1571, "text": "A double edged sword, one side of the sword can cut against people."}, {"time": 1575, "text": "The other side of the sword can cut against ignorance and disease."}, {"time": 1582, "text": "I think technology does have a moral direction."}, {"time": 1585, "text": "Look at the internet."}, {"time": 1587, "text": "The internet spreads knowledge, awareness, and that creates empowerment."}, {"time": 1593, "text": "People act on knowledge."}, {"time": 1595, "text": "When they begin to realize that they don't have to live that way, they don't have to suffer under a dictatorship, that there are other ways of living under freedom, then they begin to take things, take power."}, {"time": 1607, "text": "And that spreads democracy."}, {"time": 1609, "text": "And democracies do not war with other democracies."}, {"time": 1614, "text": "I'm a scientist."}, {"time": 1615, "text": "I believe in data."}, {"time": 1617, "text": "So let's take a sheet of paper and write down every single war you had to learn since you were in elementary school."}, {"time": 1625, "text": "Every single war, hundreds of them."}, {"time": 1627, "text": "Kings, queens, emperors, dictators."}, {"time": 1631, "text": "All these wars were between kings, queens, emperors, and dictators."}, {"time": 1635, "text": "Never between two major democracies."}, {"time": 1639, "text": "And so I think with the spread of this technology and which would accelerate with the coming of brain net, it means that, well, we will still have wars."}, {"time": 1648, "text": "Wars, of course, is politics by other means, but they'll be less intense and less frequent."}, {"time": 1655, "text": "Do you have worries of longer term existential risk from technology, from AI?"}, {"time": 1663, "text": "So I think that's a wonderful vision of a future where war is a distant memory, but now there's another agent."}, {"time": 1673, "text": "There's somebody else that's able to create conflict, that's able to create harm, AI systems."}, {"time": 1680, "text": "So do you have worry about such AI systems?"}, {"time": 1683, "text": "Well, yes, that is an existential risk, but again, I think an existential risk, not for this century."}, {"time": 1689, "text": "I think our grandkids are gonna have to confront this question as robots gradually approach the intelligence of a dog, a cat, and finally that of a monkey."}, {"time": 1700, "text": "However, I think we will digitize ourselves as well."}, {"time": 1703, "text": "Not only are we gonna merge with our technology, we'll also digitize our personality, our memories, our feelings."}, {"time": 1710, "text": "You realize during the Middle Ages, there was something called dualism."}, {"time": 1714, "text": "Dualism meant that the soul was separate from the body."}, {"time": 1718, "text": "When the body died, the soul went to heaven."}, {"time": 1720, "text": "That's dualism."}, {"time": 1722, "text": "Then in the 20th century, neuroscience came in and said, bah, humbug."}, {"time": 1727, "text": "Every time we look at the brain, it's just neurons."}, {"time": 1730, "text": "That's it, folks, period, end of story."}, {"time": 1734, "text": "Bunch of neurons firing."}, {"time": 1736, "text": "Now we're going back to dualism."}, {"time": 1739, "text": "Now we realize that we can digitize human memories, feelings, sensations, and create a digital copy of ourselves, and that's called the Connectome Project."}, {"time": 1751, "text": "Billions of dollars are now being spent to do not just the genome project of sequencing the genes of our body, but the Connectome Project, which is to map the entire connections of the human brain."}, {"time": 1766, "text": "And even before then, already in Silicon Valley, today, at this very moment, you can contact Silicon Valley companies that are willing to digitize your relatives because some people want to talk to their parents."}, {"time": 1779, "text": "There are unresolved issues with their parents, and one day, yes, firms will digitize people, and you'll be able to talk to them a reasonable facsimile."}, {"time": 1789, "text": "We leave a digital trail."}, {"time": 1792, "text": "Our ancestors did not."}, {"time": 1794, "text": "Our ancestors were lucky if they had one line, just one line in a church book, saying the date they were baptized and the date they died."}, {"time": 1805, "text": "That was their entire digital memory."}, {"time": 1808, "text": "I mean, their entire digital existence summarized in just a few letters of the alphabet, a whole life."}, {"time": 1815, "text": "Now we digitize everything."}, {"time": 1817, "text": "Every time you sneeze, you digitize it."}, {"time": 1820, "text": "You put it on the internet."}, {"time": 1822, "text": "And so I think that we are gonna digitize ourselves and give us digital immortality."}, {"time": 1828, "text": "We'll not only have biologic genetic immortality of some sort, but also digital immortality."}, {"time": 1834, "text": "And what are we gonna do with it?"}, {"time": 1837, "text": "I think we should send it into outer space."}, {"time": 1840, "text": "If you digitize the human brain and put it on a laser beam and shoot it to the moon, you're on the moon in one second."}, {"time": 1848, "text": "Shoot it to Mars, you're on Mars in 20 minutes."}, {"time": 1851, "text": "Shoot it to Pluto, you're on Pluto in eight hours."}, {"time": 1854, "text": "Think about it for a moment."}, {"time": 1856, "text": "You can have breakfast in New York and for a morning snack, vacation on the moon, then zap your way to Mars by noontime, journey through the asteroid belt of the afternoon, and then come back for dinner in New York at night."}, {"time": 1871, "text": "All in a day's work at the speed of light."}, {"time": 1876, "text": "Now, this means that you don't need booster rockets."}, {"time": 1879, "text": "You don't need weightlessness problems."}, {"time": 1881, "text": "You don't need to worry about meteorites."}, {"time": 1883, "text": "And what's on the moon?"}, {"time": 1885, "text": "On the moon, there is a mainframe that downloads your laser beam's information."}, {"time": 1891, "text": "And where does it download the information into?"}, {"time": 1894, "text": "An avatar."}, {"time": 1895, "text": "Now, what does that avatar look like?"}, {"time": 1897, "text": "Anything you want."}, {"time": 1901, "text": "You could be Superman, Superwoman, on the moon, on Mars, traveling throughout the universe at the speed of light, downloading your personality into any vehicle you want."}, {"time": 1915, "text": "Now, let me stick my neck out."}, {"time": 1917, "text": "So far, everything I've been saying is well within the laws of physics."}, {"time": 1920, "text": "Well within the laws of physics."}, {"time": 1922, "text": "Now, let me go outside the laws of physics again."}, {"time": 1924, "text": "Here we go."}, {"time": 1925, "text": "I think this already exists."}, {"time": 1928, "text": "I think outside the Earth, there could be a super highway a laser highway of laser porting with billions of souls of aliens zapping their way across the galaxy."}, {"time": 1940, "text": "Now, let me ask you a question."}, {"time": 1942, "text": "Are we smart enough to determine whether such a thing exists or not?"}, {"time": 1948, "text": "No, this could exist right outside the orbit of the planet Earth."}, {"time": 1952, "text": "And we're too stupid in our technology to even prove it or disprove it."}, {"time": 1958, "text": "We would need the aliens on this laser super highway to help us out, to send us a human interpretable signal."}, {"time": 1970, "text": "I mean, it ultimately boils down to the language of communication, but that's an exciting possibility that actually the sky is filled with aliens."}, {"time": 1979, "text": "The aliens could already be here."}, {"time": 1980, "text": "And we're just so oblivious that we're too stupid to know it."}, {"time": 1985, "text": "See, they don't have to be in alien form with little green men."}, {"time": 1989, "text": "They can be in any form they want in an avatar of their creation."}, {"time": 1993, "text": "Well, in fact, they could very well be."}, {"time": 1996, "text": "They can even look like us."}, {"time": 1998, "text": "We'd never know."}, {"time": 1999, "text": "One of us could be an alien."}, {"time": 2001, "text": "You know, in the zoo, did you know that we sometimes have zookeepers that imitate animals?"}, {"time": 2006, "text": "We create a fake animal and we put it in so that the animal is not afraid of this fake animal."}, {"time": 2013, "text": "And of course, these animals brains, their brain is about as big as a walnut."}, {"time": 2017, "text": "They accept these dummies as if they were real."}, {"time": 2021, "text": "So an alien civilization in outer space would say, oh yeah, human brains are so tiny."}, {"time": 2026, "text": "We could put a dummy on their world, an avatar, and they'd never know it."}, {"time": 2031, "text": "That would be an entertaining thing to watch from the alien perspective."}, {"time": 2035, "text": "So you kind of implied that with a digital form of our being, but also biologically, do you think one day technology will allow individual human beings to become immortal besides just through the ability to digitize our essence?"}, {"time": 2051, "text": "Yeah, I think that artificial intelligence will give us the key to genetic immortality."}, {"time": 2057, "text": "You see, in the coming decades, everyone's gonna have their gene sequence."}, {"time": 2061, "text": "We'll have billions of genomes of old people, billions of genomes of young people."}, {"time": 2068, "text": "We're gonna run it through an AI machine, which has pattern recognition, to look for the age genes."}, {"time": 2075, "text": "In other words, the fountain of youth that emperors, kings, and queens lusted over."}, {"time": 2081, "text": "The fountain of youth will be found by artificial intelligence."}, {"time": 2086, "text": "Artificial intelligence will identify where these age genes are located."}, {"time": 2092, "text": "First of all, what is aging?"}, {"time": 2093, "text": "We now know what aging is."}, {"time": 2095, "text": "Aging is the buildup of errors."}, {"time": 2099, "text": "That's all aging is, the buildup of genetic errors."}, {"time": 2103, "text": "This means that cells eventually become slower, sluggish, they go into senescence, and they die."}, {"time": 2110, "text": "In fact, that's why we die."}, {"time": 2113, "text": "We die because of the buildup of mistakes in our genome, in our cellular activity."}, {"time": 2120, "text": "But you see, in the future, we'll be able to fix those genes with CRISPR type technologies, and perhaps even live forever."}, {"time": 2127, "text": "So let me ask you a question."}, {"time": 2129, "text": "Where does aging take place in a car?"}, {"time": 2132, "text": "Given a car, where does aging take place?"}, {"time": 2134, "text": "Well, it's obvious, the engine, right?"}, {"time": 2137, "text": "A, that's where you have a lot of moving parts."}, {"time": 2139, "text": "B, that's where you have combustion."}, {"time": 2141, "text": "Well, where in the cell do we have combustion?"}, {"time": 2147, "text": "The mitochondria."}, {"time": 2148, "text": "We now know where aging takes place."}, {"time": 2152, "text": "And if we cure many of the mistakes that build up in the mitochondria of the cell, we could become immortal."}, {"time": 2159, "text": "Let me ask you, if you yourself could become immortal, would you?"}, {"time": 2166, "text": "Damn straight."}, {"time": 2167, "text": "No, I think about it for a while, because of course, it depends on how you become immortal."}, {"time": 2174, "text": "You know, there's a famous myth of Tithonus."}, {"time": 2177, "text": "It turns out that years ago, in the Greek mythology, there was the saga of Tithonus and Aurora."}, {"time": 2185, "text": "Aurora was the goddess of the dawn, and she fell in love with a mortal, a human called Tithonus."}, {"time": 2192, "text": "And so Aurora begged Zeus to grant her the gift of immortality to give to her lover."}, {"time": 2202, "text": "So Zeus took pity on Aurora and made Tithonus immortal."}, {"time": 2207, "text": "But you see, Aurora made a mistake, a huge mistake."}, {"time": 2212, "text": "She asked for immortality, but she forgot to ask for eternal youth."}, {"time": 2219, "text": "So poor Tithonus got older and older and older every year, decrepit, a bag of bones, but he could never die."}, {"time": 2228, "text": "Never die."}, {"time": 2229, "text": "Quality of life is important."}, {"time": 2231, "text": "So I think immortality is a great idea, as long as you also have immortal youth as well."}, {"time": 2238, "text": "Now, I personally believe, and I cannot prove this, but I personally believe that our grandkids may have the option of reaching the age of 30 and then stopping."}, {"time": 2248, "text": "They may like being age 30, because you have wisdom, you have all the benefits of age and maturity, and you still live forever with a healthy body."}, {"time": 2259, "text": "Our descendants may like being 30 for several centuries."}, {"time": 2263, "text": "Is there an aspect of human existence that is meaningful only because we're mortal?"}, {"time": 2269, "text": "Well, every waking moment, we don't think about it this way, but every waking moment, actually, we are aware of our death and our mortality."}, {"time": 2281, "text": "When you go to college, you realize that you are in a period of time where soon you will reach middle age and have a career."}, {"time": 2290, "text": "And after that, you'll retire and then you'll die."}, {"time": 2293, "text": "And so even as a youth, even as a child, without even thinking about it, you are aware of your own death, because it sets limits to your lifespan."}, {"time": 2304, "text": "I gotta graduate from high school."}, {"time": 2306, "text": "I gotta graduate from college."}, {"time": 2308, "text": "Because you're gonna die."}, {"time": 2310, "text": "Because unless you graduate from high school, unless you graduate from college, you're not gonna enter old age with enough money to retire and then die."}, {"time": 2319, "text": "And so, yeah, people think about it unconsciously, because it affects every aspect of your being."}, {"time": 2326, "text": "The fact that you go to high school, college, get married, have kids, there's a clock, a clock ticking even without your permission."}, {"time": 2336, "text": "It gives a sense of urgency."}, {"time": 2338, "text": "Do you yourself, I mean, there's so much excitement and passion in the way you talk about physics and the way you talk about technology in the future."}, {"time": 2347, "text": "Do you yourself meditate on your own mortality?"}, {"time": 2351, "text": "Do you think about this clock that's ticking?"}, {"time": 2354, "text": "Well, I try not to, because it then begins to affect your behavior."}, {"time": 2359, "text": "You begin to alter your behavior to match your expectation of when you're gonna die."}, {"time": 2366, "text": "So let's talk about youth, and then let's talk about death, okay?"}, {"time": 2371, "text": "When I interview scientists on radio, I often ask them, what made the difference?"}, {"time": 2377, "text": "How old were you?"}, {"time": 2379, "text": "What changed your life?"}, {"time": 2381, "text": "And they always say more or less the same thing."}, {"time": 2384, "text": "No, these are Nobel Prize winners, directors of major laboratories, very distinguished scientists."}, {"time": 2388, "text": "They always say, when I was 10, when I was 10, something happened."}, {"time": 2395, "text": "It was a visit to the planetarium."}, {"time": 2397, "text": "It was a telescope."}, {"time": 2399, "text": "For Steven Weinberg, winner of the Nobel Prize, it was the chemistry kit."}, {"time": 2403, "text": "For Heinz Pagels, it was a visit to the planetarium."}, {"time": 2407, "text": "For Isidor Rabi, it was a book about the planets."}, {"time": 2410, "text": "For Albert Einstein, it was a compass."}, {"time": 2414, "text": "Something happened, which gives them this existential shock."}, {"time": 2418, "text": "Because you see, before the age of 10, everything is mommy and daddy, mommy and dad."}, {"time": 2422, "text": "That's your universe, mommy and daddy."}, {"time": 2425, "text": "Around the age of 10, you begin to wonder, what's beyond mommy and daddy?"}, {"time": 2430, "text": "And that's when you have this epiphany, when you realize, oh my God, there's a universe out there, a universe of discovery."}, {"time": 2440, "text": "And that sensation stays with you for the rest of your life."}, {"time": 2445, "text": "You still remember that shock that you felt gazing at the universe."}, {"time": 2450, "text": "And then you hit the greatest destroyer of scientists known to science."}, {"time": 2457, "text": "The greatest destroyer of scientists known to science is junior high school."}, {"time": 2465, "text": "When you hit junior high school, folks, it's all over."}, {"time": 2468, "text": "It's all over."}, {"time": 2470, "text": "Because in junior high school, people say, hey, stupid."}, {"time": 2474, "text": "I mean, you like that nerdy stuff."}, {"time": 2477, "text": "And your friends shun you."}, {"time": 2479, "text": "All of a sudden, people think you're a weirdo."}, {"time": 2482, "text": "And scientists made boring."}, {"time": 2485, "text": "Richard Feynman, the Nobel Prize winner, when he was a child, his father would take him into the forest."}, {"time": 2491, "text": "And the father would teach him everything about birds, why they're shaped the way they are, their wings, the coloration, the shape of their beak, everything about birds."}, {"time": 2503, "text": "So one day, a bully comes up to the future Nobel Prize winner and says, hey, Dick, what's the name of that bird over there?"}, {"time": 2511, "text": "Well, he didn't know."}, {"time": 2513, "text": "He knew everything about that bird except its name."}, {"time": 2518, "text": "So he said, I don't know."}, {"time": 2520, "text": "And then the bully said, what's the matter, Dick?"}, {"time": 2523, "text": "You stupid or something?"}, {"time": 2525, "text": "And then in that instant, he got it."}, {"time": 2528, "text": "He got it."}, {"time": 2529, "text": "He realized that for most people, science is giving names to birds."}, {"time": 2535, "text": "That's what science is."}, {"time": 2537, "text": "You know lots of names of obscure things."}, {"time": 2539, "text": "Hey, people say, you're smart."}, {"time": 2541, "text": "You're smart."}, {"time": 2542, "text": "You know all the names of the dinosaurs."}, {"time": 2544, "text": "You know all the names of the plants."}, {"time": 2546, "text": "No, that's not science at all."}, {"time": 2549, "text": "Science is about principles, concepts, physical pictures."}, {"time": 2556, "text": "That's what science is all about."}, {"time": 2558, "text": "My favorite quote from Einstein is that, unless you can explain the theory to a child, the theory is probably worthless."}, {"time": 2567, "text": "Meaning that all great theories are not big words."}, {"time": 2572, "text": "All great theories are simple concepts, principles, basic physical pictures."}, {"time": 2580, "text": "Relativity is all about clocks, meter sticks, rocket ships and locomotives."}, {"time": 2587, "text": "Newton's laws of gravity are all about balls and spinning wheels and things like that."}, {"time": 2593, "text": "That's what physics and science is all about, not memorizing things."}, {"time": 2597, "text": "And that stays with you for the rest of your life."}, {"time": 2600, "text": "So even in old age, I've noticed that these scientists, when they sit back, they still remember."}, {"time": 2608, "text": "They still remember that flush, that flush of excitement they felt with that first telescope, that first moment when they encountered the universe."}, {"time": 2618, "text": "That keeps them going."}, {"time": 2622, "text": "By the way, I should point out that when I was eight, something happened to me as well."}, {"time": 2629, "text": "When I was eight years old, it was in all the papers that a great scientist had just died."}, {"time": 2636, "text": "And they put a picture of his desk on the front page."}, {"time": 2640, "text": "That's it, just a simple picture of the front page of the newspapers of his desk."}, {"time": 2646, "text": "That desk had a book on it, which was opened."}, {"time": 2649, "text": "And the caption said more or less, this is the unfinished manuscript from the greatest scientists of our time."}, {"time": 2657, "text": "So I said to myself, well, why couldn't he finish it?"}, {"time": 2662, "text": "What's so hard that you can't finish it if you're a great scientist?"}, {"time": 2666, "text": "It's a homework problem, right?"}, {"time": 2668, "text": "You go home, you solve it, or you ask your mom, why couldn't he solve it?"}, {"time": 2673, "text": "So to me, this was a murder mystery."}, {"time": 2675, "text": "This was greater than any adventure story."}, {"time": 2677, "text": "I had to know why the greatest scientists of our time couldn't finish something."}, {"time": 2683, "text": "And then over the years, I found out the guy had a name, Albert Einstein, and that book was The Theory of Everything."}, {"time": 2691, "text": "It was unfinished."}, {"time": 2693, "text": "Well, today I can read that book."}, {"time": 2695, "text": "I can see all the dead ends and false starts that he made."}, {"time": 2699, "text": "And I began to realize that he lost his way because he didn't have a physical picture to guide him on the third try."}, {"time": 2709, "text": "On the first try, he talked about clocks and lightning bolts and meter sticks, and that gave us special relativity, which gave us the atomic bomb."}, {"time": 2719, "text": "The second great picture was gravity with balls rolling on curved surfaces."}, {"time": 2726, "text": "And that gave us the Big Bang, creation of the universe, black holes."}, {"time": 2730, "text": "On the third try, he missed it."}, {"time": 2734, "text": "He had no picture at all to guide him."}, {"time": 2738, "text": "In fact, there's a quote I have where he said, I'm still looking."}, {"time": 2741, "text": "I'm still looking for that picture."}, {"time": 2744, "text": "He never found it."}, {"time": 2745, "text": "Well, today we think that picture is strength theory."}, {"time": 2749, "text": "The strength theory can unify gravity and this mysterious thing that Einstein didn't like, which is quantum mechanics, or couldn't quite pin down and make sense of."}, {"time": 2760, "text": "Mother nature has two hands, a left hand and a right hand."}, {"time": 2762, "text": "The left hand is a theory of the small."}, {"time": 2765, "text": "The right hand is a theory of the big."}, {"time": 2767, "text": "The theory of the small is the quantum theory, the theory of atoms and quarks."}, {"time": 2771, "text": "The theory of the big is relativity, the theory of black holes, big bangs."}, {"time": 2776, "text": "The problem is the left hand does not talk to the right hand."}, {"time": 2782, "text": "They hate each other."}, {"time": 2784, "text": "The left hand is based on discrete particles."}, {"time": 2787, "text": "The right hand is based on smooth surfaces."}, {"time": 2791, "text": "How do you put these two things together into a single theory?"}, {"time": 2795, "text": "The greatest minds of our time, the greatest minds of our time worked on this problem and failed."}, {"time": 2803, "text": "Today, the only theory that has survived every challenge so far is string theory."}, {"time": 2809, "text": "That doesn't mean string theory is correct."}, {"time": 2811, "text": "It could very well be wrong, but right now it's the only game in town."}, {"time": 2816, "text": "Some people come up to me and say, ''Professor, I don't believe in string theory."}, {"time": 2820, "text": "Give me an alternative.''"}, {"time": 2822, "text": "And I tell them there is none."}, {"time": 2825, "text": "Get used to it."}, {"time": 2827, "text": "It's the best theory we got."}, {"time": 2829, "text": "It's the only theory we have."}, {"time": 2833, "text": "Do you see, you know, the strings kind of inspire a view, as did atoms and particles and quarks, but especially strings inspire a view of a universe as a kind of information processing system, as a computer of sorts."}, {"time": 2851, "text": "Do you see the universe in this way?"}, {"time": 2854, "text": "Some people think, in fact, the whole universe is a computer of some sort."}, {"time": 2859, "text": "And they believe that perhaps everything, therefore, is a simulation."}, {"time": 2866, "text": "I don't think that there is a super video game where we are nothing but puppets dancing on the screen and somebody hit the play button and here we are talking about simulations."}, {"time": 2878, "text": "Even Newtonian mechanics says that the weather, the simple weather is so complicated with trillions upon trillions of atoms that it cannot be simulated in a finite amount of time."}, {"time": 2890, "text": "In other words, the smallest object which can describe the weather and simulate the weather is the weather itself."}, {"time": 2901, "text": "The smallest object that can simulate a human is the human itself."}, {"time": 2906, "text": "And if you had quantum mechanics, it becomes almost impossible to simulate it with a conventional computer."}, {"time": 2914, "text": "This quantum mechanics deals with all possible universes, parallel universes, a multiverse of universes."}, {"time": 2922, "text": "And so the calculation just spirals out of control."}, {"time": 2926, "text": "Now, so far, there's only one way where you might be able to argue that the universe is a simulation."}, {"time": 2934, "text": "And this is still being debated by quantum physicists."}, {"time": 2938, "text": "It turns out that if you throw the encyclopedia into a black hole, the information is not lost."}, {"time": 2944, "text": "Eventually it winds up on the surface of the black hole."}, {"time": 2947, "text": "Now, the surface of the black hole is finite."}, {"time": 2949, "text": "In fact, you can calculate the maximum amount of information you can store in a black hole."}, {"time": 2955, "text": "It's a finite number."}, {"time": 2957, "text": "It's a calculable number, believe it or not."}, {"time": 2959, "text": "Now, if the universe were made out of black holes, which is the maximum universe you can conceive of, each universe, each black hole has a finite amount of information."}, {"time": 2969, "text": "Therefore, ergo, da da!"}, {"time": 2972, "text": "Ergo, the total amount of information in a universe is finite."}, {"time": 2978, "text": "This is mind boggling."}, {"time": 2980, "text": "This, I consider mind boggling, that all possible universes are countable and all possible universes can be summarized in a number, a number you can write on a sheet of paper, all possible universes, and it's a finite number."}, {"time": 2995, "text": "Now, it's huge."}, {"time": 2996, "text": "It's a number beyond human imagination."}, {"time": 2999, "text": "It's a number based on what is called a Planck length, but it's a number."}, {"time": 3003, "text": "And so if a computer could ever simulate that number, then the universe would be a simulation."}, {"time": 3010, "text": "So theoretically, because the amount of information is finite, well, there necessarily must be able to exist a computer."}, {"time": 3019, "text": "It's just, from an engineering perspective, maybe impossible to build."}, {"time": 3024, "text": "Yes, no computer can build a universe capable of simulating the entire universe, except the universe itself."}, {"time": 3031, "text": "So that's your intuition, that our universe is very efficient, and so there's no shortcuts."}, {"time": 3037, "text": "Right, two reasons why I believe the universe is not a simulation."}, {"time": 3041, "text": "First, the calculational numbers are just incredible."}, {"time": 3044, "text": "No finite Turing machine can simulate the universe."}, {"time": 3048, "text": "And second, why would any super intelligent being simulate humans?"}, {"time": 3054, "text": "If you think about it, most humans are kind of stupid."}, {"time": 3057, "text": "I mean, we do all sorts of crazy, stupid things, right?"}, {"time": 3061, "text": "And we call it art, we call it humor."}, {"time": 3063, "text": "We call it human civilization."}, {"time": 3066, "text": "So why should an advanced civilization go through all that effort just to simulate Saturday Night Live?"}, {"time": 3074, "text": "Well, that's a funny idea, but it's also, do you think it's possible that the act of creation cannot anticipate humans?"}, {"time": 3082, "text": "You simply set the initial conditions and set a bunch of physical laws, and just for the fun of it, see what happens."}, {"time": 3088, "text": "You launch the thing, so you're not necessarily simulating everything."}, {"time": 3091, "text": "You're not simulating every little bit in the sense that you could predict what's going to happen, but you set the initial conditions, set the laws, and see what kind of fun stuff happens."}, {"time": 3103, "text": "Well, in some sense, that's how life got started."}, {"time": 3106, "text": "In the 1950s, Stanley did what is called the Miller experiment."}, {"time": 3111, "text": "He put a bunch of hydrogen gas, methane, toxic gases with liquid and a spark in a small glass beaker."}, {"time": 3122, "text": "And then he just walked away for a few weeks, came back a few weeks later, and bingo."}, {"time": 3128, "text": "Out of nothing and chaos came amino acids."}, {"time": 3132, "text": "If he had left it there for a few years, he might have gotten protein, protein molecules for free."}, {"time": 3139, "text": "That's probably how life got started, as a accident."}, {"time": 3143, "text": "And if he had left it there for perhaps a few million years, DNA might have formed in that beaker."}, {"time": 3150, "text": "And so we think that, yeah, DNA, life, all that could have been an accident if you wait long enough."}, {"time": 3158, "text": "And remember, our universe is roughly 13.8 billion years old."}, {"time": 3162, "text": "That's plenty of time for lots of random things to happen, including life itself."}, {"time": 3171, "text": "Yeah, we could be just a beautiful little random moment."}, {"time": 3176, "text": "And there could be an infinite number of those throughout the history of the universe, many creatures like us."}, {"time": 3184, "text": "We perhaps are not the epitome of what the universe is created for."}, {"time": 3189, "text": "Let's hope not."}, {"time": 3191, "text": "Just look around."}, {"time": 3193, "text": "Look to your left, look to your right."}, {"time": 3196, "text": "When do you think the first human will step foot on Mars?"}, {"time": 3200, "text": "I think it's a good chance in the 2030s that we will be on Mars."}, {"time": 3205, "text": "In fact, there's no physics reason why we can't do it."}, {"time": 3209, "text": "It's an engineering problem."}, {"time": 3211, "text": "It's a very difficult and dangerous engineering problem, but it is an engineering problem."}, {"time": 3216, "text": "And in my book, Future of Humanity, I even speculate beyond that, that by the end of this century, we'll probably have the first starships."}, {"time": 3225, "text": "The first starships will not look like the Enterprise at all."}, {"time": 3229, "text": "They'll probably be small computer chips that are fired by laser beams with parachutes."}, {"time": 3234, "text": "And like what Stephen Hawking advocated, the Breakthrough Starshot program could send ships to the nearby stars, traveling at 20% the speed of light, reaching Alpha Centauri in about 20 years time."}, {"time": 3249, "text": "Beyond that, we should have fusion power."}, {"time": 3252, "text": "Fusion power is, in some sense, one of the ultimate sources of energy, but it's unstable."}, {"time": 3259, "text": "And we don't have fusion power today."}, {"time": 3262, "text": "Now, why is that?"}, {"time": 3263, "text": "First of all, stars form almost for free."}, {"time": 3266, "text": "You get a bunch of gas large enough, it becomes a star."}, {"time": 3269, "text": "I mean, you don't even have to do anything to it, and it becomes a star."}, {"time": 3273, "text": "Why is fusion so difficult to put on the Earth?"}, {"time": 3277, "text": "Because in outer space, stars are monopoles."}, {"time": 3280, "text": "They are pole, single poles that are spherically symmetric."}, {"time": 3284, "text": "And it's very easy to get spherically symmetric configurations of gas to compress into a star."}, {"time": 3291, "text": "It just happens naturally all by itself."}, {"time": 3293, "text": "The problem is magnetism is bipolar."}, {"time": 3296, "text": "You have a North Pole and a South Pole."}, {"time": 3299, "text": "And it's like trying to squeeze a long balloon."}, {"time": 3302, "text": "Take a long balloon and try to squeeze it."}, {"time": 3304, "text": "You squeeze one side, it bulges out the other side."}, {"time": 3308, "text": "Well, that's the problem with fusion machines."}, {"time": 3310, "text": "We use magnetism with a North Pole and a South Pole to squeeze gas, and all sorts of anomalies and horrible configurations can take place because we're not squeezing something uniformly like in a star."}, {"time": 3324, "text": "Stars, in some sense, are for free."}, {"time": 3327, "text": "Fusion on the Earth is very difficult."}, {"time": 3331, "text": "But I think it's inevitable."}, {"time": 3332, "text": "And it'll eventually give us unlimited power from seawater."}, {"time": 3337, "text": "So seawater will be the ultimate source of energy for the planet Earth."}, {"time": 3342, "text": "Because we'll extract hydrogen from seawater, burn hydrogen in a fusion reactor to give us unlimited energy without the meltdown, without the nuclear waste."}, {"time": 3353, "text": "Why do we have meltdowns?"}, {"time": 3355, "text": "We have meltdowns because in the fusion reactors, every time you split the uranium atom, you get nuclear waste."}, {"time": 3360, "text": "Tons of it."}, {"time": 3361, "text": "30 tons of nuclear waste per reactor per year."}, {"time": 3367, "text": "And it's hot."}, {"time": 3368, "text": "It's hot for thousands, millions of years."}, {"time": 3371, "text": "That's why we have meltdowns."}, {"time": 3373, "text": "But you see, the waste product of a fusion reactor is helium gas."}, {"time": 3377, "text": "Helium gas is actually commercially valuable."}, {"time": 3379, "text": "You can make money selling helium gas."}, {"time": 3382, "text": "And so the waste product of a fusion reactor is helium, not nuclear waste that we find in a commercial fission plant."}, {"time": 3390, "text": "And that controlling, mastering and controlling fusion allows us to, converts us into a type one, I guess, civilization, right?"}, {"time": 3400, "text": "Yeah, probably the backbone of a type one civilization will be fusion power."}, {"time": 3405, "text": "We, by the way, are type zero."}, {"time": 3407, "text": "We don't even rate on this scale."}, {"time": 3409, "text": "We get our energy from dead plants, for God's sake, oil and coal."}]}]