[{"title": "Stephen Kotkin: Putin, Stalin, Hitler, Zelenskyy, and War in Ukraine | Lex Fridman Podcast #289", "id": "2a7CDKqWcZ0", "quotes": [{"time": 314, "text": "And it's the dilemma for Putin."}, {"time": 316, "text": "Russia is smaller now compared to when Stalin was in that Kremlin."}, {"time": 322, "text": "It's got pushed back to borders almost the time of Peter the Great."}, {"time": 328, "text": "It's farther from the main European capitals now than any time since that 18th century."}, {"time": 335, "text": "And the West has only grown stronger in that period of time."}, {"time": 340, "text": "So the dilemma is greater than ever."}, {"time": 343, "text": "The irony of being in that position, of sitting in the Kremlin, trying to manage Russian power in the world, trying to be a providential power, a country with a special mission in the world, a country which imagines itself to be a whole civilization and yet not having the capabilities to meet those aspirations and falling farther and farther behind the West."}, {"time": 369, "text": "The irony of all of that is the attempted solutions put Russia in a worse place every single time."}, {"time": 377, "text": "So you try to manage the gap with the West."}, {"time": 380, "text": "You try to realize these aspirations."}, {"time": 383, "text": "You try to raise your capabilities and you build a strong state."}, {"time": 388, "text": "The quest to build a strong state and use coercive modernization to try somehow, if not to close the gap with the West, at least to manage it."}, {"time": 400, "text": "And the result is different versions of personalist rule."}, {"time": 406, "text": "So they don't build a strong state."}, {"time": 408, "text": "They build a personal dictatorship."}, {"time": 410, "text": "They build an autocracy."}, {"time": 413, "text": "And moreover, that autocracy undertakes measures which then worsen the very geopolitical dilemma that gave rise to this personalist rule in the first place."}, {"time": 424, "text": "And so I call this Russia's perpetual geopolitics."}, {"time": 428, "text": "I've been writing about this for many, many years."}, {"time": 431, "text": "What's important about this analysis is this is not a story of eternal Russian cultural proclivity to aggression, right?"}, {"time": 444, "text": "It's not something that's in the mother's milk."}, {"time": 446, "text": "It's not something that can't be changed."}, {"time": 450, "text": "Russia doesn't have an innate cultural tendency to aggression."}, {"time": 455, "text": "This is a choice."}, {"time": 457, "text": "It's a strategic choice to try to match the power of the West, which from Russia's vantage point is actually unmatchable, but it's a choice that's made again and again."}, {"time": 469, "text": "And Putin has made this choice, just as Stalin made the choice, right?"}, {"time": 472, "text": "Stalin presided over the World War II victory, and then he lost the peace."}, {"time": 479, "text": "After he died in 1953, there was, of course, other rulers who succeeded him."}, {"time": 486, "text": "He was still the most important person in the country after he died, because they were trying to manage that system that he built, and more importantly, manage that growing gap with the West."}, {"time": 498, "text": "By the time the 90s rolled around, former Soviet troops, now Russian troops, withdrew from all those advanced positions that they had achieved as a result of the World War II victory, and it was Napoleon in reverse."}, {"time": 514, "text": "They went on the same roads, but not from Moscow back to Paris, but instead from Warsaw and from East Berlin and from Tallinn and Riga and all the other places of former Warsaw Pact and former Soviet republics in the Baltic region."}, {"time": 535, "text": "They went back to Russia in retreat, and so Stalin, in the fullness of time, lost the peace."}, {"time": 542, "text": "And Putin, in his own way, inheriting some of this, attempting to reverse it when, as I said, Russia was smaller, farther away, weaker, the West was bigger and stronger and had absorbed those former Warsaw Pact countries and Baltic states, because they voluntarily begged to join the West."}, {"time": 567, "text": "The West didn't impose itself on them."}, {"time": 570, "text": "It's a voluntary sphere of influence that the West conducts."}, {"time": 574, "text": "And so that dilemma is where you can put Putin and Stalin in the same sentence, and the terrible outcome for Russia in the fullness of time also has echoes."}, {"time": 586, "text": "But of course, Putin hasn't murdered 18 to 20 million people and the scale of his abilities to cause grief with the nuclear weapons aside is nothing like Stalin's."}, {"time": 599, "text": "And so we have to be careful, right?"}, {"time": 602, "text": "Only Mao put bigger numbers on the board from a tragic point of view than Stalin."}, {"time": 608, "text": "And numbers matter here, if we compare these singular figures."}, {"time": 614, "text": "Yeah, Mao killed more people than Stalin because Mao had more people to kill."}, {"time": 620, "text": "The most amazing thing about Mao is he watched Stalin do it."}, {"time": 626, "text": "He watched Stalin collectivize agriculture and famine result."}, {"time": 630, "text": "He watched Stalin impose this communist monopoly, and all of those people sent to prison or given a bullet in the back of the neck."}, {"time": 640, "text": "He watched all of that, and then he did it again himself in China."}, {"time": 643, "text": "Do you think he saw the human cost directly that when you say he saw, do you think he was focused on the policies or was he also aware distinctly as a human being of the human costs in the lives of peasants and in the lives of the working class and lives of the poor?"}, {"time": 661, "text": "I think the prima facie evidence is that he didn't value human life."}, {"time": 667, "text": "Otherwise, I don't think after seeing the amount of lives that were taken in the Soviet experiment, he would have done something similar after that."}, {"time": 676, "text": "I think the answer, Lex, is it's very hard to get inside Mao's head and figure out what he was really thinking."}, {"time": 684, "text": "But if you just look at the results that happened, the policies that were undertaken and the consequences of them, you would have to conclude that there was, let's say, no value or little value placed on human life."}, {"time": 698, "text": "Unfortunately, that's characteristic not only of communist dictators, right, of post communist dictators as well, but the scale of the horrors that they inflict, as horrific as they are, just can't compare."}, {"time": 714, "text": "And so we're in a situation where Eurasia, that is to say the ancient civilizations of Eurasia, which would be Russia, Iran, China, all have some version of non democratic, illiberal autocratic regimes, and they're all pushing up against the greater power of the West in some form."}, {"time": 741, "text": "Sometimes they coordinate their actions and sometimes they don't."}, {"time": 745, "text": "But this is a very longstanding phenomenon, Lex, that predates Vladimir Putin or Xi Jinping or the latest incarnation of the supreme leader in Iran."}, {"time": 757, "text": "So we'll talk about this, I think, really powerful framework of five dimensions of authoritarian regimes that you've put together."}, {"time": 767, "text": "But first, let's go to this Napoleon and reverse retreat from Warsaw back."}, {"time": 776, "text": "Putin has called, from the perspective of Putin, this retreat, this collapse of Stalin is one of the great tragedies of that region, of Russia."}, {"time": 789, "text": "Do you think there's a sense where as Putin sits now in power for 22 plus years, he really dreams of a return to the power, the influence, the land of Stalin?"}, {"time": 811, "text": "So while you said that they're not in the same place in terms of the numbers of people that suffer due to their regime, do you think he hopes to have the same power, the same influence for a nation that was in the 30s, in the 40s, in the 50s of the 20th century under Stalin?"}, {"time": 834, "text": "If he does, Lex, he's deluding himself."}, {"time": 839, "text": "Very few people talk to him."}, {"time": 842, "text": "Very few people have access to him."}, {"time": 845, "text": "A handful of Western leaders have met with him for short periods of time."}, {"time": 851, "text": "Those inside Russia barely meet with him."}, {"time": 853, "text": "His own minions in the regime barely have FaceTime with him."}, {"time": 859, "text": "We don't know exactly what he thinks."}, {"time": 861, "text": "It could be that he has delusions of reconquering Russian influence, if not direct control over the territories that broke away, but it's not gonna happen."}, {"time": 876, "text": "Let's talk a little bit about this guy, Nikolai Patrushev."}, {"time": 880, "text": "Nikolai Patrushev is probably not well known to your listeners."}, {"time": 885, "text": "He's the head of Russia's Security Council."}, {"time": 889, "text": "And so you could probably call him the second most important or second most powerful man in Russia, certainly inside the regime."}, {"time": 899, "text": "Arguably, Navalny is the second most important person in the country and Russia is the second most powerful man and we'll talk about that later, I'm sure."}, {"time": 908, "text": "In terms of influence, yes."}, {"time": 909, "text": "Yes, but Patrushev is a version of Putin's right hand man."}, {"time": 917, "text": "And Patrushev has been giving interviews in the press."}, {"time": 922, "text": "You probably saw the interview with Nizavisimaya Gazeta not that long ago."}, {"time": 927, "text": "He writes also his own blog like interventions in the public sphere using the few channels that are left."}, {"time": 973, "text": "And so for example, the CIA and the American government wanted to bring down the Soviet Union."}, {"time": 979, "text": "Nevermind that the Bush administration, the first Bush, the father, was trying desperately to hold the Soviet Union together because they were afraid of the chaos that might ensue and the nukes that might get loose as a result of a Soviet collapse."}, {"time": 997, "text": "And it wasn't until the very last moment where Bush decided, his administration decided to back those Republican leaders who were breaking away from Mikhail Gorbachev and the Soviet Union, right?"}, {"time": 1013, "text": "So nevermind the empirics of it."}, {"time": 1016, "text": "Nevermind that Bill Clinton's administration following George Bush sent boatloads of money, Western taxpayer money to Russia."}, {"time": 1026, "text": "We don't know exactly how much because it came from different sources."}, {"time": 1030, "text": "People talk about how there was no Marshall Plan."}, {"time": 1033, "text": "It was tens of billions of dollars from various sources, from the IMF and other sources."}, {"time": 1040, "text": "And next it disappeared, it's gone."}, {"time": 1042, "text": "Just like the German money that went to Gorbachev for unification disappeared even before the Soviet collapsed."}, {"time": 1048, "text": "The money disappeared, but the West sent the money."}, {"time": 1052, "text": "So how was that a plot?"}, {"time": 1053, "text": "And then you could go all the way, Obama's administration, George Bush trying to do business deals and reset the relations and Obama administration trying to reset the relations and doing nothing after the Georgian war and slapping Putin on the wrist, following the seizure force of Putin."}, {"time": 1075, "text": "And you could go on and you could go on all the way through the Trump administration telling Putin that he's right."}, {"time": 1081, "text": "Trump believes Putin and doesn't believe US intelligence about Russian efforts to interfere in American domestic politics."}, {"time": 1088, "text": "So despite all the empirics of it, you have Patrushev and likely Putin talking about this multi decade Western conspiracy to bring Russia down."}, {"time": 1101, "text": "At the same time as that's happening, the Germans are voluntarily increasing their dependence on Russian energy, voluntarily increasing their dependence on Russia."}, {"time": 1113, "text": "So here's the conspiracy to bring Russia down."}, {"time": 1116, "text": "The French who fantasize about themselves as a diplomatic superpower are constantly, the French leaders are constantly running to the Kremlin to ask what Russia needs, what concessions from the West Russia needs to be filled to feel respected again."}, {"time": 1133, "text": "The British provide all manner of money laundering and reputation laundering services for the whole Russian oligarchy, including the state officials who are looting the state and using the West British institutions to launder their money."}, {"time": 1151, "text": "So all of this is happening and yet Patrushev imagines this conspiracy to bring Russia down by the West."}, {"time": 1159, "text": "And so that's what we've got in the Kremlin again."}, {"time": 1162, "text": "Stalin had that same conspiratorial mentality of the West."}, {"time": 1166, "text": "Everything that happened in the world was part of a Western conspiracy directed against the Soviet Union and now directed against Russia."}, {"time": 1174, "text": "Even though the West is trying to appease, the West is offering its services, the West is trying to change Russia through investment in a positive way, but instead the West is what's changing."}, {"time": 1186, "text": "The West is becoming more corrupt."}, {"time": 1188, "text": "Western services are being corrupted by the relationship with Russia."}, {"time": 1192, "text": "So you have to ask yourself, who are these people in power in the Kremlin who imagine that while they're availing themselves of every service and every blandishment of the West, while they're availing themselves of this, that they're fighting a conspiracy by the West to bring them down."}, {"time": 1214, "text": "So this is what they call the Abyssinia in Russian, which is a term, as you know, that means those who are resentful, or you might call them the losers, the losers in the transition."}, {"time": 1231, "text": "So when the Soviet Union fell and there was a very substantial diminution in Russian power and influence in the world, a lot of people lost out."}, {"time": 1243, "text": "They weren't able to steal the property."}, {"time": 1246, "text": "They weren't able to loot the state in the 90s."}, {"time": 1250, "text": "And they were on the outside."}, {"time": 1252, "text": "They gradually came back in."}, {"time": 1255, "text": "They were the losers in the transition domestically."}, {"time": 1259, "text": "And for them, they wanted to reverse being on the losing side."}, {"time": 1265, "text": "And so they began to expropriate, to steal the money, steal the property from those first thieves who stole in the 90s."}, {"time": 1276, "text": "And the 2000s and on have been about restealing, taking the losers in the transition, taking the money from the winners and reversing this resentment, this loser status."}, {"time": 1290, "text": "Those are your Patrushevs and your Putins."}, {"time": 1293, "text": "But at the same time, this blows out to let's reverse the losses, being on the losing side, the roiling resentment at the decline of their power internationally."}, {"time": 1307, "text": "Let's try to reverse that too."}, {"time": 1309, "text": "So you have a profound psychological whole generation of people who are on the losing end domestically and reverse that domestically."}, {"time": 1320, "text": "That's what the Putin regime is about."}, {"time": 1322, "text": "Remember Mikhail Khodorkovsky's Yukos?"}, {"time": 1326, "text": "Remember all the companies that are now owned by Putin cronies because they were taken away from whoever stole them in the first place."}, {"time": 1335, "text": "And now they're trying to do that on the international scale."}, {"time": 1339, "text": "It's one thing to put domestic opponents in jail."}, {"time": 1342, "text": "It's one thing to take away someone's property domestically, but you're not gonna reverse the power of the West with the diminished Russia that you have."}, {"time": 1353, "text": "And so that project, that Patrushev project, which we see him expressing again and again, he speaks about it publicly."}, {"time": 1363, "text": "It's not something that we need to go looking for, a quest, the secret, we can't find it."}, {"time": 1371, "text": "It's right there in front of our face."}, {"time": 1373, "text": "And Putin has spoken the same way for a long time."}, {"time": 1376, "text": "People point to the 2007 speech at the Munich Security Conference that Putin delivered, and certainly your listeners could use a snippet or two of that, just like they could use a couple of quotes from Patrushev to contextualize what we're talking about."}, {"time": 1393, "text": "But it predates the 2007 Munich speech, the reaction to Ukraine's uprising in 2004, attempt to steal the election inside Ukraine, which the Ukrainian people rose up valiantly against and risked their lives and overturned, right?"}, {"time": 1414, "text": "So there were public statements from Putin already back then, the statements about Khodorkovsky in 2003 when he was arrested and expropriated."}, {"time": 1424, "text": "This is a longstanding deeply psychological issue, which is about managing Russian power in the world, as I was saying, the gap with the West, but has this further dimension of feeling like losers and wanting to reverse that, that's their life experience."}, {"time": 1443, "text": "I'd be a zhenei."}, {"time": 1444, "text": "So there's that resentment that fuels this narrative, fuels this geopolitics and internal policy."}, {"time": 1454, "text": "But so resentment is behind some of the worst things that have ever been done in human history."}, {"time": 1459, "text": "Hitler was probably fueled by resentment."}, {"time": 1462, "text": "So resentment is a really powerful force, yes."}, {"time": 1466, "text": "Just to maybe not push back, but to give fuller context on the West, you said there's a narrative from Putin's Russia that the West is somehow an enemy, you position everything against the West, but is there a degree and to what degree is the West willing to feed that narrative?"}, {"time": 1490, "text": "That it's also convenient for the West to have an enemy."}, {"time": 1493, "text": "It seems like in the place, in the span, it seems like in geopolitics, having an enemy is useful for forming a narrative."}, {"time": 1506, "text": "Now, having an enemy for the basic respect of humanity is not good, but in terms of maintaining power, if you're a leader in a game of geopolitics, it seems to be good to have an enemy."}, {"time": 1518, "text": "It seems to be good to have something like a cold war."}, {"time": 1521, "text": "We can always point your finger and says, all our actions are fighting this evil, whatever that evil is."}, {"time": 1528, "text": "It could be like with George W. Bush, the war on terror."}, {"time": 1532, "text": "Terrorism is this evil."}, {"time": 1533, "text": "You can always point at something."}, {"time": 1535, "text": "So you've made it seem that the West is trying."}, {"time": 1538, "text": "There's a lot of forces within the West that are trying to reach out a friendly hand, trying to help, sending money, sending compassion, trying to sort of."}, {"time": 1548, "text": "Trying to integrate Russia into a global institution."}, {"time": 1551, "text": "Which was a longstanding multi decade effort across multiple countries and multiple administrations in those countries."}, {"time": 1559, "text": "But is there also warmongers on the West?"}, {"time": 1562, "text": "Of course, Lex."}, {"time": 1563, "text": "Of course you're right about that."}, {"time": 1564, "text": "But let's put it this way."}, {"time": 1566, "text": "People talk about the cold war and they usually looking to assign blame for the cold war as if it's some kind of mistake, a misunderstanding, or a search for an enemy that was convenient to rally domestic politics."}, {"time": 1583, "text": "So Lex, there's a coup in Czechoslovakia and somebody installs a communist regime in February 1948."}, {"time": 1593, "text": "No reaction to that?"}, {"time": 1594, "text": "That's just okay?"}, {"time": 1596, "text": "There's a blockade of Berlin."}, {"time": 1599, "text": "Is that cool by you?"}, {"time": 1600, "text": "Where they try to strangle West Berlin so that they can swallow West Berlin and add it to East Berlin."}, {"time": 1608, "text": "You cool with that?"}, {"time": 1610, "text": "How about Korean War, invasion of North Korea, invasion of South Korea by North Korea?"}, {"time": 1618, "text": "How about the murders and the show trials up and down Eastern Europe in the late 40s after the imposition of the clone regimes?"}, {"time": 1628, "text": "You good with that?"}, {"time": 1629, "text": "Yeah, it's very convenient to have an enemy."}, {"time": 1633, "text": "But you know, there was some actions, Lex."}, {"time": 1637, "text": "There was some threats to people's freedom."}, {"time": 1639, "text": "There was some invasions."}, {"time": 1641, "text": "There was some aggression and violence on a mass scale, like collectivization of Eastern Europe."}, {"time": 1648, "text": "And we could go on, Lex, with the examples."}, {"time": 1650, "text": "I'm just giving a few of them."}, {"time": 1653, "text": "And so the Cold War was not a mistake."}, {"time": 1656, "text": "It was not a misunderstanding."}, {"time": 1658, "text": "We don't have to blame someone for the Cold War."}, {"time": 1661, "text": "We have to give credit for the Cold War."}, {"time": 1664, "text": "The Truman administration deserves credit for standing up to Stalin's regime, for standing up to these actions, for saying, yeah, we're not just gonna take this."}, {"time": 1677, "text": "We're not gonna let this go on."}, {"time": 1679, "text": "We're not gonna let this expand to further territories."}, {"time": 1682, "text": "We're gonna create the NATO alliance."}, {"time": 1684, "text": "And we're gonna rally democratic liberal regimes to stand up to this illiberalism, this violence, and this aggression."}, {"time": 1694, "text": "And so, yeah, Lex, it's always convenient to have an enemy."}, {"time": 1699, "text": "But there was an enemy."}, {"time": 1701, "text": "Nikolai Leonov, who recently died, he died in April 2022, and he had a major funeral."}, {"time": 1708, "text": "He was the last head analyst of the Soviet KGB."}, {"time": 1716, "text": "And Leonov is one of the most important figures for understanding the Soviet collapse."}, {"time": 1721, "text": "And he has the best memoir on the Soviet collapse, which is known in Russian as Likholetya."}, {"time": 1729, "text": "You will understand that."}, {"time": 1730, "text": "And you'll help your podcast listeners understand."}, {"time": 1736, "text": "There's a singularity to that kind of expression, Likholetya."}, {"time": 1740, "text": "Leonov just died."}, {"time": 1742, "text": "But one of the things, and in fact, the people who were supposedly arrested by Putin as scapegoats for the Ukraine war, the main one, Sergei Beseda, gave the eulogy at Leonov's funeral in April 2022, showing that it's a lie that all of these people have been arrested and purged and other nonsense in social media."}, {"time": 1767, "text": "But to get back to what Leonov said and get back to your enemy point, Leonov said, you know, the West spent all this time blackening the image of the Soviet Union."}, {"time": 1779, "text": "All these resources and propaganda and covert operations to blacken the Soviet image."}, {"time": 1785, "text": "And they did, Lex, the West did do that."}, {"time": 1788, "text": "And then Leonov wrote in the next sentence, and you know what?"}, {"time": 1791, "text": "We gave them a lot of material to work with to blacken our image."}, {"time": 1797, "text": "Yeah, so you're saying a kind of sobering reality, which it is possible to some degree to draw a line between the good guys and the bad guys."}, {"time": 1807, "text": "Freedom is better than unfreedom, Lex."}, {"time": 1810, "text": "It's a lot better than unfreedom, and a guy like you understands that really well."}, {"time": 1815, "text": "Well, so yes, but those are all, you know, there's words like justice, freedom."}, {"time": 1826, "text": "Love, you can use a lot of words that Hitler himself used to describe why he is actually creating a better world than those he's fighting."}, {"time": 1837, "text": "So some of it is propaganda."}, {"time": 1839, "text": "The question is on the ground, what is actually increasing the amount of freedom in the world, human prosperity?"}, {"time": 1844, "text": "Institutions, Lex, right?"}, {"time": 1845, "text": "We're not talking about propaganda here."}, {"time": 1848, "text": "When we use words like freedom, we're talking about rule of law."}, {"time": 1853, "text": "We're talking about protection of civil liberties."}, {"time": 1855, "text": "We're talking about protection of private property."}, {"time": 1858, "text": "We're talking about an independent and well funded judiciary."}, {"time": 1863, "text": "We're talking about an impartial, non corrupt, competent civil service."}, {"time": 1869, "text": "We're talking about separation of powers where the executive branch's power is limited, usually by an elected parliament."}, {"time": 1877, "text": "In fact, yes, let's talk about elections."}, {"time": 1880, "text": "Let's talk about freedom of speech and freedom of the public sphere."}, {"time": 1885, "text": "We're not talking about freedom as a slogan here."}, {"time": 1888, "text": "We're talking about a huge array of institutions and practices and norms ultimately, right?"}, {"time": 1895, "text": "And if they exist, you know, and you live under them."}, {"time": 1899, "text": "And if they don't exist, you fully understand that as well, right?"}, {"time": 1903, "text": "Ukraine was a flawed democracy before Russia invaded."}, {"time": 1910, "text": "It's utterly corrupt, many ways dysfunctional, especially the elites were dysfunctional."}, {"time": 1918, "text": "The gas industry in Ukraine was absolutely terrible because of the corruption that it generated, the oligarch problem, a handful of people stealing the state resources."}, {"time": 1930, "text": "And yet Ukraine had an open public sphere and it had a parliament that functioned."}, {"time": 1936, "text": "And so despite its flaws, it was still a democracy."}, {"time": 1943, "text": "The regime in Moscow, you can't say that Lex."}, {"time": 1946, "text": "It's not a comparable regime to Ukraine."}, {"time": 1950, "text": "You could say, oh, well, there were oligarchs in Ukraine and there were oligarchs in Russia."}, {"time": 1954, "text": "There's corruption in Ukraine, there's corruption in Russia."}, {"time": 1957, "text": "So really what's the big difference?"}, {"time": 1958, "text": "And the answer is, well, Ukraine had the open public sphere."}, {"time": 1963, "text": "Ukraine had a real parliament."}, {"time": 1964, "text": "Can you call Russia's Duma a real parliament?"}, {"time": 1969, "text": "I don't think you can."}, {"time": 1970, "text": "Can you say that there were any checks whatsoever on the executive branch in Russia?"}, {"time": 1977, "text": "Can you say that the Russian judiciary had any independence or really full level of competence even compared to the Ukrainian judiciary, which was nothing to brag about?"}, {"time": 1990, "text": "No, you can't say that Lex."}, {"time": 1992, "text": "So we can differentiate between the very flawed, corrupt oligarchic democracy in Ukraine and the very corrupt oligarchic autocracy in Russia."}, {"time": 2006, "text": "I think that's a fair distinction."}, {"time": 2009, "text": "Yeah, we should say that Russia and Ukraine have the great honor of being the number one and the number two most corrupt nations in Europe by many measures."}, {"time": 2018, "text": "But there is a fundamental difference, as you were highlighting."}, {"time": 2022, "text": "Russia is a corrupt autocracy."}, {"time": 2024, "text": "Ukraine, we can say, is a corrupt democracy."}, {"time": 2028, "text": "And to that level, there's a fundamental difference."}, {"time": 2033, "text": "Ukraine is not murdering its own journalists in systematic fashion."}, {"time": 2039, "text": "If journalists are killed in Ukraine, it's a tragedy."}, {"time": 2043, "text": "If journalists are killed in Russia or Russian journalists are killed abroad, it's regime policy."}, {"time": 2048, "text": "And the degree to which a nation is authoritarian means that it's suffocating its own spirit, its capacity to flourish."}, {"time": 2059, "text": "We're not just talking about sort of the freedom of the press, those kinds of things, but basically all industries get suffocated and you're no longer being able to, yeah, flourish as a nation, grow the production, the GDP, the scientists, the art, the culture, all those kinds of things."}, {"time": 2079, "text": "Yes, Lex, you're absolutely right."}, {"time": 2080, "text": "And so before the invasion, the full blown invasion of February 2022 into Ukraine, because as you know, the war has been going on for many years at a lower level compared to what it is these days, but still a tragic war with many deaths prior to February 2022."}, {"time": 2100, "text": "Before this latest war, we could have said that the greatest victims of the Putin regime are Russian, domestic, that the people who are suffering the most from the Putin regime are not sitting here in New York City, but in fact are sitting there in Russia."}, {"time": 2162, "text": "So your powerful, precise, rigorous words are then in a stark contrast, I would say, to my very recent conversation with Oliver Stone, and I would love you to elaborate this agreement you have here with his words and maybe words of people like John Mearsheimer."}, {"time": 2185, "text": "The idea is that Putin's hand in this invasion of 2022 was forced by the expansion of NATO, the imperialist imperative of the United States and the NATO forces."}, {"time": 2203, "text": "You disagree with this point in terms of placing the blame somehow on the invasion on forces larger than the particular two nations involved, but more on the geopolitics of the world that's driven by the most powerful military nation in the world, which is the United States."}, {"time": 2224, "text": "Yeah, Lex, so let's imagine that a tragedy's happened here in New York, and a woman got raped."}, {"time": 2233, "text": "We know the perpetrator."}, {"time": 2235, "text": "They go to trial, and Oliver Stone gets up and says, you know what?"}, {"time": 2240, "text": "The woman was wearing a short skirt, and there was no option but for the rapist to rape her."}, {"time": 2248, "text": "The woman was wearing lipstick, or the woman was applying for NATO membership and just had to be raped."}, {"time": 2257, "text": "There's, I mean, didn't want to rape her, but was compelled because of what she was doing and what she looked like and the clothes she was wearing and the alliances that she was under international law signed by Moscow, all the treaties that sovereign countries get to choose whatever alliance they belong to."}, {"time": 2279, "text": "The treaties that the UN Charter signed by Russia, Soviet Union, the 1975 Helsinki Agreement signed by the Soviet Union, the 1990 Charter of Paris for a New Europe signed by the Soviet Union, the 1997 NATO Russia Founding Act signed by the Russian government, the post Soviet Russia."}, {"time": 2304, "text": "All of those documents signed by either the Soviet regime or the Russian regime, which is the legally recognized international inheritor, right, successor of the Soviet state."}, {"time": 2318, "text": "All of those agreements are still in force and all of them say that countries are sovereign and can freely choose their foreign policy and what alliances they want to join."}, {"time": 2330, "text": "Let's even go farther than that."}, {"time": 2332, "text": "I mean, you don't have to go farther than that, but let's go farther than that, Lex."}, {"time": 2337, "text": "Is an autocratic repressive regime that invades its neighbors in the name of its own security something new in Russian history?"}, {"time": 2347, "text": "Did we not see this before?"}, {"time": 2348, "text": "Is this, does this not predate NATO expansion?"}, {"time": 2353, "text": "Does this not predate the existence of NATO?"}, {"time": 2357, "text": "Would Oliver Stone sit here in this chair and say to you, you know, they had to impose serfdom in the 17th century because NATO expanded."}, {"time": 2367, "text": "They had no choice, their hands were tied."}, {"time": 2370, "text": "They were compelled to treat their own population like slaves because, you know, NATO expanded."}, {"time": 2377, "text": "I mean, I could go on through the examples of Russian history that predate the existence, let alone the expansion of NATO, where you have behavior, policies, actions, very similar to what we see now from the Kremlin."}, {"time": 2395, "text": "And you can't explain those by NATO expansion, can you?"}, {"time": 2399, "text": "And so that argument doesn't wash for me because I have a pattern here that predates NATO expansion."}, {"time": 2407, "text": "I have international agreements, founding documents, signed by the Kremlin over many, many decades acknowledging the freedom of countries to choose their alliances."}, {"time": 2420, "text": "And then I have this problem where when you rape somebody, it's not because they're wearing a short skirt."}, {"time": 2426, "text": "It's because you have raped them."}, {"time": 2432, "text": "You've committed a criminal act, Lex."}, {"time": 2435, "text": "That's a, I think there's a lot of people listening to this that will agree to the emotion, the power, and the spirit of this metaphor."}, {"time": 2443, "text": "And I was struggling to think how to dance within this metaphor because it feels like it wasn't precisely the right one, but I think it captures the spirit."}, {"time": 2455, "text": "I'm not suggesting, Lex, that everything the West has done has been honorable or intelligent."}, {"time": 2463, "text": "Fortunately, we live in a democracy."}, {"time": 2466, "text": "We live in liberal regimes."}, {"time": 2467, "text": "We live under rule of law, liberal in the classical sense of rule of law, not liberal in the leftist sense."}, {"time": 2477, "text": "We live in places like that and we can criticize ourselves."}, {"time": 2480, "text": "And we can criticize the mistakes that we made or the policy choices or the inactions that were taken."}, {"time": 2486, "text": "And there are a whole lot of things to answer for."}, {"time": 2490, "text": "And you can now discuss the ones that are your favorites, the dishonor or the mistakes."}, {"time": 2499, "text": "And I could discuss mine and we could spend the whole rest of our meeting today discussing the West's mistakes and problems."}, {"time": 2507, "text": "And we won't end up in prison for it."}, {"time": 2509, "text": "Yeah, Lex, and so I'm thankful for that."}, {"time": 2513, "text": "And I'm thankful that people may disagree and that people make the argument that NATO expansion is to blame."}, {"time": 2519, "text": "But you see, I'm countering two arguments here."}, {"time": 2522, "text": "I'm countering one argument, which is very deeply popular, pervasive, about how Russia has this cultural tendency to aggression."}, {"time": 2533, "text": "And it can help, but invade its neighbors and it does it again and again."}, {"time": 2537, "text": "And it's eternal Russian imperialism and you have to watch out for it."}, {"time": 2543, "text": "This very popular argument in the Baltic States, it's really popular in Warsaw."}, {"time": 2548, "text": "It's really popular with the liberal interventionists and it's very, very popular with those who were part of the Iraq war squad that got us into that mess."}, {"time": 2559, "text": "So I'm against that."}, {"time": 2560, "text": "And the reason I'm against it is because it's not true."}, {"time": 2563, "text": "It's empirically false."}, {"time": 2564, "text": "There is no cultural trait, inherent tendency for Russia to be aggressive."}, {"time": 2570, "text": "It's a strategic choice that they make."}, {"time": 2573, "text": "Every time it's a choice made, it's not some kind of momentum."}, {"time": 2576, "text": "Every time it's a choice that we should judge for the choice that it is for the decision."}, {"time": 2581, "text": "And therefore they could make different choices."}, {"time": 2583, "text": "They could say, we don't have to stand up to the West."}, {"time": 2586, "text": "We don't have the capabilities to do that."}, {"time": 2588, "text": "We can still be a great country."}, {"time": 2590, "text": "We can still be a civilization unto itself."}, {"time": 2593, "text": "We can still be Russia."}, {"time": 2595, "text": "We can still worship in Orthodox cathedrals or we can still be ourselves, but we don't have to pursue this chimerical pursuit, this elusive quest to stand up to the West and be in the first ranks of powers."}, {"time": 2611, "text": "So I'm countering that argument."}, {"time": 2613, "text": "I'm saying it's perpetual geopolitics."}, {"time": 2616, "text": "It's a geopolitical choice rising out of this dilemma of the mismatch between aspirations and capabilities."}, {"time": 2624, "text": "It's not eternal Russian imperialism."}, {"time": 2627, "text": "And I'm also countering the other argument here, Lex, which is to say that it's the West's fault."}, {"time": 2633, "text": "It's Western imperialism."}, {"time": 2636, "text": "I'm very popular on the left, very popular with realist scholars, very popular with some of the people recently on your podcast."}, {"time": 2644, "text": "And so it's neither eternal Russian imperialism nor is it Western imperialism, right?"}, {"time": 2651, "text": "The mere fact that the West is stronger than Russia is not a crime on the part of the West."}, {"time": 2657, "text": "It's not a crime that countries voluntarily wanna join the West, that beg to get in, either the EU or NATO or other bilateral alliances or other trade agreements."}, {"time": 2671, "text": "Those are voluntarily entered into and that's not criminal."}, {"time": 2675, "text": "If the West's sphere of influence, which is open, an open sphere of influence, which as I say, people voluntarily join, if that expands, that's not a crime, nor is that a threat to Russia, ipso facto, right?"}, {"time": 2689, "text": "NATO is a defensive alliance and the countries are largely pacifists who are members of NATO."}, {"time": 2695, "text": "And NATO doesn't attack, it defends members if they are attacked."}, {"time": 2700, "text": "And so the idea that Ukraine, which had the legal right, might wanna join NATO and the EU, which was not gonna happen in our lifetimes and was not a direct threat to the Putin regime since the Western countries that make up the EU and NATO decided that Ukraine was not ready for membership, there was no consensus, it was not gonna happen, but it's Ukraine's free choice to express that desire."}, {"time": 2731, "text": "And if your government is elected by your people, freely elected, meaning you can unelect that government in the next election, and that government makes foreign policy choices on the basis of its perceived interests, that's not a crime, Lex, that's not a provocation, that's not something that compels the leader of another country to invade you, right?"}, {"time": 2755, "text": "That is legal under international law, and it's also a realist fact of life."}, {"time": 2762, "text": "The realists like to tell you that Russia here was disrespected, Russia's interests were not taken into account, et cetera, et cetera, but the real world works in such a way that treaties matter, that international law matters."}, {"time": 2779, "text": "That's why people like me were not in favor of the US 2003 invasion of Iraq, Lex, because it wasn't legal, in addition to the fact that we thought it might backfire."}, {"time": 2792, "text": "But you know, Lex, like I said, there are a lot of things about the West that we ought to criticize as citizens, and we do criticize, but we have to be clear about where responsibility lies in these events that we're talking about today."}, {"time": 2808, "text": "So you get into trouble, it's largely erroneous to think about both the West or the United States from an imperialist perspective and Russia from an imperialist perspective."}, {"time": 2820, "text": "It's better, clearer to think about each individual aggressive decision on its own as a choice that was made."}, {"time": 2827, "text": "So let's talk about the most recent choice made by Vladimir Putin."}, {"time": 2834, "text": "The choice to invade Ukraine, or to escalate the invasion of Ukraine on February 24th, 2022."}, {"time": 2842, "text": "Now we're a few months removed from that decision, initial decision, why do you think he did it?"}, {"time": 2850, "text": "What are the errors in understanding the situation, in calculating the outcomes, and everything else about this decision in your view?"}, {"time": 2862, "text": "Yeah, Lex, when a war doesn't go well, it looks like lunacy to have launched it in the first place."}, {"time": 2872, "text": "Does it ever go well?"}, {"time": 2874, "text": "War never goes according to plan."}, {"time": 2876, "text": "All war is based upon miscalculation, but not everybody is punished for their miscalculation."}, {"time": 2883, "text": "All aggressive war we're talking about, not defensive war, is based upon miscalculation."}, {"time": 2890, "text": "But you can adjust, you can recalibrate."}, {"time": 2893, "text": "You know, when you're driving down the road and that very annoying voice is telling you in a thousand feet, make a right, and you fail to make a right, it recalibrates, right?"}, {"time": 2906, "text": "It tells you, okay, now go turn around, or U turn, or make a left."}, {"time": 2911, "text": "It doesn't say you're an idiot in turn around and make a U turn, but it does recalibrate."}, {"time": 2917, "text": "So you can miscalculate, and the problem is not the miscalculation usually, it's the failure to do that adjustment, right?"}, {"time": 2925, "text": "People I know who are hedge fund traders, I ask them, you know, what's your favorite trade?"}, {"time": 2932, "text": "And the line from the mall, and this is a cliche, is my favorite trade is when I made a mistake, but I got out early before all the carnage."}, {"time": 2942, "text": "So their favorite trade is not when they made some brilliant choice, but it's when they miscalculated but they reduce the consequences of their miscalculation by recalibrating quickly, right?"}, {"time": 2954, "text": "So let's talk about the calculation and miscalculation of February."}, {"time": 2959, "text": "Let's imagine, Lex, that you've been getting away with murder, I don't mean murder in a figurative sense."}, {"time": 2966, "text": "I mean, you've been murdering people, you've been murdering them domestically, and you've been murdering them all across Europe, and you've been murdering them not just with, for example, a car accident, a staged car accident, or using a handgun, you use Novichok, or you use some other internationally outlawed chemical weapon."}, {"time": 2994, "text": "And let's imagine that you did it and nothing happened to you."}, {"time": 2998, "text": "It wasn't like you were removed from power, it wasn't like you paid a personal price."}, {"time": 3004, "text": "Sure, maybe there was some sanctions on your economy, but you didn't pay the price of those sanctions."}, {"time": 3009, "text": "Little people paid the price of those sanctions."}, {"time": 3012, "text": "Other people in your country paid the price."}, {"time": 3015, "text": "Let's imagine not only were you murdering people literally, but you decided to entice the idiotic ruler of Georgia into a provocation that you could then invade the country."}, {"time": 3030, "text": "And you invaded the country and you bit off these territories, Abkhazia and South Ossetia, and what price did you pay for that?"}, {"time": 3039, "text": "And then you decided, you know, I think I'll now invade Crimea and forcibly annex Crimea, and I'll instigate an insurrection in the Donbass in Eastern Ukraine."}, {"time": 3051, "text": "In Luhansk."}, {"time": 3051, "text": "Let's imagine you did all that and then you had to stick out your wrist so that, you know, it could be slapped a couple of times."}, {"time": 3060, "text": "And you said, you know, I can pretty much do what I want."}, {"time": 3065, "text": "They're putting a sanction here and there and they're doing this and they're doing that."}, {"time": 3071, "text": "They're more energy dependent on me than before."}, {"time": 3074, "text": "I got better money laundering and reputation services than anybody had."}, {"time": 3078, "text": "Maybe the Middle East and the Chinese would disagree with you that you have better than them, but yours are pretty good."}, {"time": 3084, "text": "And the Panama Papers get released, revealing all of your offshoring and your corruption and what happened, nothing happens, Lex."}, {"time": 3093, "text": "So the first and most important consideration here is, in your own mind, you've been getting away with murder, literally, as well as figuratively, and you think, you know, I probably should have done that."}, {"time": 3107, "text": "You think, you know, I probably can do something again and get away with it."}, {"time": 3112, "text": "And so the failure to respond at scale, in fact, the indulgences, the further dependencies that are introduced, the illusion that trade is the mechanism to manage authoritarian regimes."}, {"time": 3128, "text": "You know, that great German cliche, Wandel durch Handel, right, change through trade or transformation through trade, one of Angela Merkel's favorite expressions, right?"}, {"time": 3141, "text": "You're gonna get the other side to be better rather than confront them in a Cold War fashion where you stand up to their aggressions and you punish them severely in order to deter further behavior."}, {"time": 3157, "text": "So that's the first and most important part of the calculation, miscalculation."}, {"time": 3161, "text": "There are a lot of other dimensions."}, {"time": 3162, "text": "So can we pause on that really quick?"}, {"time": 3202, "text": "Yeah, you're not sentimental, Lex."}, {"time": 3205, "text": "You say to yourself, the cause of Russian greatness is greater than any individual life."}, {"time": 3215, "text": "Russia being in the first rank of the great powers, Russia realizing its mission to be a special country with a special mission in the world, a civilization unto itself, the first rank of the great powers, maybe even the greatest power."}, {"time": 3233, "text": "That's worth the price that we have to pay, especially in other people's lives, right?"}, {"time": 3240, "text": "We have a lot of literature on the Putin regime, which talks about the kleptocracy, the place is a kleptocracy, and it is a kleptocracy."}, {"time": 3251, "text": "We all can see that, and anybody in London, living the high life, servicing this kleptocracy can testify that it's a kleptocracy, and not only in London, of course, right here in the United States, in New York."}, {"time": 3267, "text": "But you know, it's not only a kleptocracy, Lex."}, {"time": 3270, "text": "That was the problem of the Russian studies literature."}, {"time": 3273, "text": "It wasn't just about stealing, looting the state."}, {"time": 3277, "text": "It was about Russian greatness."}, {"time": 3279, "text": "You see those rituals in the Kremlin, right in the Grand Kremlin Palace, in the St. George's Hall, some of the greatest interiors in the world, and you see award ceremonies, and you see marking holidays, and all of these looters of the state have their uniforms on with their medals, and someone's given a speech or singing a ballad, and their eyes are moist."}, {"time": 3307, "text": "Their eyes are moist because they're thieves and looters?"}, {"time": 3311, "text": "No, Lex, because they believe in Russian greatness."}, {"time": 3315, "text": "They have a deep and fundamental passionate commitment to the greatness of Russia, which in unsentimental fashion, they're all sentimental to the max."}, {"time": 3327, "text": "That's why their eyes are moistening."}, {"time": 3330, "text": "But they imagine unsentimentally that any sacrifice is okay, a sacrifice of other people's lives, a sacrifice of their conscripts in the military, a sacrifice of Ukrainian women and children and elderly."}, {"time": 3344, "text": "That's a small price to pay for those moist eyes about Russian greatness and Russia's position in the world."}, {"time": 3352, "text": "Well, that human thing, that sentimentality, is the thing that can get us in trouble in the United States as well, and lead us to wars, the illegal wars and so on."}, {"time": 3361, "text": "But the United States, there's repercussions for breaking the law."}, {"time": 3367, "text": "You're going to pay for illegal wars in the end."}, {"time": 3369, "text": "You're saying that in authoritarian regimes, the sentimentality can really get out of hand, and you can, by charismatic leaders, they can take that to manipulate the populace to make, that in the span of history led to atrocities, and in today's world, lead to humanitarian crises."}, {"time": 3390, "text": "It's not just the kleptocracy, it's a belief system."}, {"time": 3393, "text": "It's passion, it's conviction."}, {"time": 3395, "text": "It's, you can call them illusions, you can call them fantasies, whatever you want to call them, they're real."}, {"time": 3404, "text": "They're real for those people."}, {"time": 3405, "text": "And so yes, they're looting that very state that they're trying to make one of the great powers in the world."}, {"time": 3412, "text": "And they resent the fact that the West doesn't acknowledge them as one of those great powers."}, {"time": 3418, "text": "And they resent that the West is more powerful."}, {"time": 3421, "text": "People talk about how Putin doesn't understand the world and that he gets really bad information."}, {"time": 3428, "text": "Lex, if you're sitting there in that Kremlin, and you're trying to conduct business in the world, and you're getting reports from your finance minister or your central bank governor, your whole economy, everything that matters, somehow all your trade is denominated in dollars and euros."}, {"time": 3447, "text": "Do you have any illusions about who controls the international financial system?"}, {"time": 3452, "text": "I don't think so, Lex."}, {"time": 3454, "text": "You're looking over your industrial plan for the next year, and you're looking over how many tanks you're gonna get, and how many cruise missiles you're gonna get, and how many submarines you're gonna get, and fill in the blank."}, {"time": 3471, "text": "It says right there in the paperwork where the component parts come from, where the software comes from, comes from the West, Lex."}, {"time": 3479, "text": "Your whole military industrial complex is dependent on high end Western technology."}, {"time": 3485, "text": "And let's say you're in Beijing, not just in Moscow, and you go to a meeting in your own neighborhood."}, {"time": 3491, "text": "You're the leader of China."}, {"time": 3493, "text": "You go to a meeting with other Asian leaders."}, {"time": 3496, "text": "Do they all speak in Chinese with you?"}, {"time": 3499, "text": "No, Lex, they don't speak Chinese."}, {"time": 3502, "text": "You go to an international meeting as the leader of China, and guess what language is the main language of intercourse?"}, {"time": 3509, "text": "Yes, the same one you and I are speaking right now."}, {"time": 3512, "text": "And so you live in that world."}, {"time": 3514, "text": "You live in the Western world, and it's very hard to have illusions about what world you live in."}, {"time": 3520, "text": "When you're under that, you need those Western banks."}, {"time": 3524, "text": "You need that foreign currency, right?"}, {"time": 3526, "text": "You need that high end Western technology, that technology transfer."}, {"time": 3531, "text": "You're speaking, or you're forced to speak, or your minions are forced to speak at international gatherings in English."}, {"time": 3537, "text": "And I could go on."}, {"time": 3538, "text": "All the indicators that you live in."}, {"time": 3541, "text": "And so Putin lives in that world."}, {"time": 3542, "text": "He's no fool."}, {"time": 3544, "text": "Well, to push back, isn't it possible that, as you said, the minions operate in that world?"}, {"time": 3583, "text": "That just becomes the blurry details that dissipate, because what matters is the greatness of this dream empire that I have in my mind as a dictator."}, {"time": 3594, "text": "I would put it this way, Lex."}, {"time": 3596, "text": "After you absorb all of that from your minions, and it impresses upon your consciousness where you live, you live in a Western dominated world, that the multipolar world doesn't exist."}, {"time": 3612, "text": "Your goal is to make that multipolar world exist."}, {"time": 3616, "text": "Your goal is to bring down the West."}, {"time": 3619, "text": "Your goal is for the West to weaken."}, {"time": 3621, "text": "Your goal is a currency other than the dollar and the euro."}, {"time": 3625, "text": "Your goal is an international financial system that you dominate."}, {"time": 3630, "text": "Your goal is technological self sufficiency made in China 2035, right?"}, {"time": 3636, "text": "Your goal is a world that you dominate, not that the West dominates."}, {"time": 3642, "text": "And you're gonna do everything you can to try to attain that world, which is a Russian centric world, or a Chinese centric world, or what we could call a Eurasian centric world."}, {"time": 3656, "text": "And it's not gonna be easy, Lex, just for the reasons that we enumerated before."}, {"time": 3662, "text": "But maybe you're gonna get a helping hand."}, {"time": 3664, "text": "Maybe the West is gonna transfer their best technology to you."}, {"time": 3667, "text": "They're gonna sell you their best stuff."}, {"time": 3670, "text": "And then you're gonna absorb it, and maybe copy it, and reverse engineer it."}, {"time": 3676, "text": "And if they won't sell it to you, maybe you'll just have to steal it."}, {"time": 3681, "text": "Maybe the West is gonna allow you to bank, even though you violate many laws that would prohibit the West from extending those banking services to you."}, {"time": 3692, "text": "Maybe the West is gonna buy your energy, and your palladium, and your titanium, and your rare metals like lithium, because you're willing to have your poor people mine that stuff and die of disease at an early age."}, {"time": 3708, "text": "But Western governments, they don't wanna do that."}, {"time": 3711, "text": "They don't wanna do that dirty mining of those very important rare earths."}, {"time": 3716, "text": "But you're willing to do that because it's just people whose lives you don't care about as an autocratic regime, right?"}, {"time": 3721, "text": "So that's the world you live in where you're trying to get to this other world."}, {"time": 3727, "text": "You're at the center of the other world."}, {"time": 3729, "text": "You dominate the other world."}, {"time": 3731, "text": "But the only way to get there, Lex, is the West has to weaken, divide itself, maybe even collapse."}, {"time": 3740, "text": "And so you're encouraging, to the extent possible, Western divisions, Western disunity, a Western lack of resolve, Western mistakes, and Western invasion of the wrong country, and Western destruction of its credibility through international financial crises, and one could go on."}, {"time": 3764, "text": "So if the West weakens itself through its mistakes and its own corruption, you're gonna survive and maybe even come out into that world where you're the center."}, {"time": 3775, "text": "And so Russia's entire grand strategy, just like China's grand strategy, Iran, it's hard to say they have a grand strategy because they're so profoundly weak."}, {"time": 3786, "text": "But Russia's grand strategy is, we're a mess."}, {"time": 3791, "text": "We don't invest in our human capital."}, {"time": 3794, "text": "Our human capital flees, or we actually drive it out."}, {"time": 3797, "text": "It goes to MIT, like you did, or it goes to fill in the blank, right?"}, {"time": 3803, "text": "We can't invest in our people."}, {"time": 3805, "text": "Our healthcare is terrible."}, {"time": 3807, "text": "Our education system is in decline."}, {"time": 3810, "text": "We don't build infrastructure, Lex."}, {"time": 3813, "text": "We don't improve our governance."}, {"time": 3815, "text": "We don't invest in those attributes of modern power that make the West powerful."}, {"time": 3822, "text": "We can't because when we try, the money is stolen."}, {"time": 3826, "text": "We try these grandiose projects of national projects, they're called."}, {"time": 3831, "text": "We're gonna invest in higher ed."}, {"time": 3832, "text": "We're gonna invest in high tech."}, {"time": 3834, "text": "We're gonna build our own Silicon Valley known as Skolkovo."}, {"time": 3838, "text": "We're gonna do all those things, and what happens?"}, {"time": 3841, "text": "They can't even build an airport without the money disappearing."}, {"time": 3844, "text": "The Sochi Olympics, Lex, officially cost them $50 billion."}, {"time": 3851, "text": "You look around at the infrastructure that endured from that $50 billion expense, and you're thinking, that's like the Second Avenue subway."}, {"time": 3860, "text": "You get almost nothing for your money."}, {"time": 3863, "text": "And so, yeah, it's corruption, Lex, but it's also because they don't wanna do that."}, {"time": 3868, "text": "They don't wanna invest in their people."}, {"time": 3871, "text": "They couldn't do it if they wanted to, and when they try, it doesn't work."}, {"time": 3876, "text": "But why invest in your own people?"}, {"time": 3879, "text": "Invest in your hardware, your military hardware, right?"}, {"time": 3883, "text": "Invest in your cyber capabilities."}, {"time": 3887, "text": "Invest in all your spoilation techniques and your hard power, and invest in further corrupting, and further weakening, and further dividing the West, because as I said, if the West is weak, divided, lacking resolve, you don't invest in your people, you don't build infrastructure, you don't improve your governance, but you'll muddle through."}, {"time": 3911, "text": "That's Russian grand strategy."}, {"time": 3913, "text": "So invest in the hard power, weaken the West."}, {"time": 3918, "text": "Those combined together means you're going to be heavily incentivized to escalate any military aggressive conflicts that are around you, or create new ones, or just."}, {"time": 3930, "text": "If you can get away with murder."}, {"time": 3932, "text": "But what happens, Lex, if it's a Harry Truman like response?"}, {"time": 3937, "text": "What happens if somebody says, you know, we're gonna stand up to this?"}, {"time": 3943, "text": "We're not gonna allow this to happen."}, {"time": 3945, "text": "We're not gonna launder your money anymore."}, {"time": 3949, "text": "We're not gonna be dependent on you for energy in the long term, we're gonna make a transition."}, {"time": 3956, "text": "We're gonna punish you for that kind of behavior instead."}, {"time": 3959, "text": "And the West is now switched to that only because of the courage and ingenuity of the Ukrainian people."}, {"time": 3970, "text": "The Ukrainian resistance to Russian aggression was one of the greatest gifts the West has ever received."}, {"time": 3980, "text": "The sacrifices that the Ukrainians are making, right now as we speak, meaning they're fighting a war by themselves against a major military power, their neighbor Russia."}, {"time": 3996, "text": "Nobody's fighting it with them."}, {"time": 3997, "text": "Yes, we are giving them weapons so they can conduct self defense, which by the way is legal under international law."}, {"time": 4006, "text": "Unlike the Russian invasion, which is illegal under international law, Western supply of weapons, including heavy weapons, including offensive weapons to Ukraine for its self defense in the invasion by Russia is actually legal under, and so thank God the Ukrainians surprised everybody."}, {"time": 4028, "text": "They surprised me, they surprised Putin and the Kremlin, they surprised the Biden administration, they surprised the European Union, not with the fact that they would resist."}, {"time": 4038, "text": "We knew that."}, {"time": 4040, "text": "We had the Orange Revolution in 2004, we had Maidan in 2013, 14, where they rose up against a domestic tyrant and they were willing to die on behalf of their country then, let alone against a foreign tyrant invading their country, right?"}, {"time": 4059, "text": "So we knew they would resist."}, {"time": 4060, "text": "We didn't know just how successful, certainly I didn't know, they would be on the battlefield."}, {"time": 4066, "text": "It's been breathtaking to watch."}, {"time": 4068, "text": "That sacrifice, that gift enabled the West to rediscover itself, to rediscover its power, to revive itself, to say to hell with this energy dependence in the long term, to hell with this money laundering and reputation laundering, to hell with this running back and forth to Moscow to try to see what Putin needs in order for him to feel respected, what appeasement he needs, right?"}, {"time": 4093, "text": "So we'll see if it endures, but this shift comes from the Ukrainians."}, {"time": 4100, "text": "And so it's no longer getting away with murder, Lex, and we thank the Ukrainians for that."}, {"time": 4105, "text": "The people and the leadership and the separate factions that make up Ukraine uniting, it's the unification, the uniting against the common enemy and standing up before anyone knew that they would be backed by all of these other nations, by this money and all this kind of stuff, standing there, especially with the president Zelensky, where it makes total sense to flee, he stood his ground."}, {"time": 4134, "text": "And... Let's take that point that you just raised, which is a deep and fundamental point, and I thank you for that."}, {"time": 4140, "text": "Do you guys hear that?"}, {"time": 4141, "text": "I think that was a compliment."}, {"time": 4145, "text": "Zelensky or unification, what do you say?"}, {"time": 4147, "text": "I'm sitting here in front of you."}, {"time": 4149, "text": "It's an honor."}, {"time": 4150, "text": "And it's a mutual honor."}, {"time": 4153, "text": "So, Ukraine before the war is run by a TV production company, right?"}, {"time": 4160, "text": "You're one guy running this fantastic, incredible podcast."}, {"time": 4164, "text": "There's 20 guys or so running a country the size of Ukraine."}, {"time": 4168, "text": "And one's a producer and one's like a makeup person and one's a video editor."}, {"time": 4175, "text": "And they're fantastically talented people if your country is a TV production."}, {"time": 4182, "text": "So before the war, Zelensky had what, 25% approval rating and he couldn't get much done and it wasn't working."}, {"time": 4190, "text": "He got elected with 73%, as you know, and then he was down to 20, that's a pretty big drop."}, {"time": 4196, "text": "And so you're thinking maybe having a major, large size, 40 million plus population European country run by a TV production company is not the best choice."}, {"time": 4209, "text": "And then what do we see?"}, {"time": 4211, "text": "We see President Zelensky decides to risk his life on behalf of his country, Ukraine."}, {"time": 4218, "text": "He decides to stay in the capital."}, {"time": 4221, "text": "He's not gonna flee, they're gonna stay and fight."}, {"time": 4225, "text": "And he could be killed, he can die."}, {"time": 4227, "text": "It's a decision where he put his life on the line."}, {"time": 4232, "text": "Obviously, he's Jewish descent, Russian speaking childhood and upbringing, Russian speaking Jewish descent puts his life on the line for the country of Ukraine."}, {"time": 4246, "text": "It's a pretty big message, don't you think?"}, {"time": 4249, "text": "And it's crucial."}, {"time": 4251, "text": "And it turns out not only that, Lex, but they're good at TV."}, {"time": 4256, "text": "They're good at information war."}, {"time": 4259, "text": "And in a war, it's a TV production company and a TV personality, that's exactly what you want running a country because they're crushing in the information war."}, {"time": 4271, "text": "And he's spectacular, European Parliament, US Congress, Israeli Parliament."}, {"time": 4278, "text": "There's no room on Zoom, let alone in person that he can't win over, he's just so effective."}, {"time": 4286, "text": "You know, this is the first time reality TV has been about reality instead of fake."}, {"time": 4293, "text": "Reality TV is just this completely fake nonsense."}, {"time": 4297, "text": "But Zelensky, this is real reality TV."}, {"time": 4301, "text": "And he means it and the nation is behind him and they're just as courageous and just as ingenious in many ways and it's spectacular."}, {"time": 4312, "text": "And so, yeah, who saw that coming?"}, {"time": 4315, "text": "I didn't see that coming, Lex."}, {"time": 4317, "text": "In fact, the Biden, we talk about Putin's miscalculation."}, {"time": 4321, "text": "The Biden administration, as you alluded to, offered him an exit from the country."}, {"time": 4326, "text": "They didn't say, you know, you wanna stand and fight, we'll back you."}, {"time": 4330, "text": "They said, we'll get you out, you wanna come now?"}, {"time": 4334, "text": "And famously, you know that quote, right?"}, {"time": 4336, "text": "What he said about how he doesn't need a ride."}, {"time": 4340, "text": "Remember that moment?"}, {"time": 4342, "text": "The Biden administration was poised to do another Afghanistan moment."}, {"time": 4348, "text": "That ignominious exit from Afghanistan was almost what happened in Ukraine when Biden administration offered him that ride out of there."}, {"time": 4359, "text": "And fortunately, he declined and helped rally and the people from below also rallied to stop the invader without the presidency and without the government in Ukraine, saving the Biden administration and the European leaders who latched on."}, {"time": 4376, "text": "Fortunately, they had the presence of mind to latch onto this gift, this bravery and ingeniousness of Zelensky and the rest of the Ukrainians and flipped and decided to support Ukraine's resistance, you know, first with 5,000 helmets only as the Germans initially promised and now with really heavy weapons."}, {"time": 4399, "text": "And so that's something that wasn't foreseen."}, {"time": 4402, "text": "I certainly didn't foresee that."}, {"time": 4404, "text": "I foresaw the Ukrainian society being courageous and resisting, but I didn't foresee a television production company being exactly what you want to run a country in a war, a president Zelensky willing to sacrifice, lay down his life and rallying others in the country to do that."}, {"time": 4427, "text": "And then the country being so effective, not just at a courage, but at battlefield resistance to the Russian invasion."}, {"time": 4436, "text": "So I stand corrected by the Ukrainians and I'm ecstatic that I was wrong, that I was proven wrong."}, {"time": 4444, "text": "And like I said, there's clear factions of the West and the East of Ukraine and here's a person that, like you said, was in the high 20s, low 30s percentage approval in the country before the war and now was able to use in the 90s."}, {"time": 4462, "text": "He's in the 90% approval rating."}, {"time": 4464, "text": "I mean, I think they stopped doing the polling."}, {"time": 4470, "text": "Once he hit 91% or whatever it was in the previous poll, I think they all understood that for now they didn't need any more polling, that it's pretty clear the nation."}, {"time": 4479, "text": "So 25% to 90 something percent."}, {"time": 4483, "text": "And just like the 25% was deserved, the 90 something percent is also deserved, fully deserved."}, {"time": 4490, "text": "And the question is how that all stabilizes, it feels like this set of events, I may be paying attention to Twitter too much, which is a concern of mine, whether the change I see is just surface level or deep level."}, {"time": 4511, "text": "But it seems like we're in a new world, that something dramatic has shifted."}, {"time": 4515, "text": "That this power that's rooted, I mean, in your study of the 20th century, it's so deeply rooted in history, there's this power center of the world is now going to, has been shaken by this event."}, {"time": 4533, "text": "And how that changes the world is unclear."}, {"time": 4537, "text": "It's unclear what lesson China learns from watching this, what lesson India learns from watching this."}, {"time": 4543, "text": "Both nations, as far as you can get polls about Chinese population, but both nations are largely in support of Putin."}, {"time": 4551, "text": "So Russia, India, and China are still supporting of Putin quietly."}, {"time": 4557, "text": "I would maybe elaborate a little bit on that point, Lex."}, {"time": 4563, "text": "I think you're right, the feeling that we're in an inflection moment, an inflection point, I think that's widespread."}, {"time": 4572, "text": "And I think it's widespread for good reason, we might be."}, {"time": 4576, "text": "But I also share your, let's say, modesty about where it's going and how hard it is to predict where this might go."}, {"time": 4589, "text": "It's only an inflection point if the trends continue, right, if the trends endure."}, {"time": 4596, "text": "There are plenty of non inflection points."}, {"time": 4598, "text": "After 9 11, the whole world rallied around the United States after it was attacked, after the bombing of the towers here in New York City and the hitting of the Pentagon, and that didn't last."}, {"time": 4613, "text": "It was not really an inflection point, was it?"}, {"time": 4616, "text": "It felt like it might be, but it wasn't."}, {"time": 4619, "text": "And so this is not a comparable moment in terms of what happened, but it has the feeling that it might be a watershed."}, {"time": 4628, "text": "And maybe we'll squander it the way we squandered the post 9 11, rallying around the United States."}, {"time": 4637, "text": "Maybe we'll actually consolidate it and it'll endure, or maybe it'll endure despite ourselves."}, {"time": 4644, "text": "And we can't tell and we can't know yet."}, {"time": 4646, "text": "And it depends in part on what we do and what we don't do."}, {"time": 4650, "text": "But here's a few things that we understand already."}, {"time": 4653, "text": "One, the idea that the West was in decline and that the rest of the world had risen and was more powerful and that we lived in a multipolar world, that turns out to be empirically false."}, {"time": 4672, "text": "I mean, it's just factually not true."}, {"time": 4675, "text": "There are no major important multinational institutions, organizations that are run on behalf of, or led by a South African, a Nigerian, person from India."}, {"time": 4691, "text": "Even the Chinese don't run these institutions."}, {"time": 4694, "text": "They would like to and they're trying, but they don't."}, {"time": 4699, "text": "And so whatever you pick, the IMF, the World Bank, the Federal Reserve, which is the most powerful multinational institution, which is actually only a domestic institution and doesn't have a legal mandate to act multilaterally, but does."}, {"time": 4717, "text": "It's got the most power of any institution in the world."}, {"time": 4721, "text": "NATO, the bilateral alliances that the US has up and down Asia, what organizations that have tremendous leverage on the international system, on the international order, are non Western."}, {"time": 4740, "text": "The UN is the most encompassing."}, {"time": 4744, "text": "And of course we know that it has five members of the Security Council with a veto, one of which is Russia, one of which is China, and the others are the US, Britain, and France, not India, not South Africa, not Indonesia, Indonesia, not all of these other countries where the people live, right?"}, {"time": 4765, "text": "The bulk of the population of the world and where the population is growing like on the African continent."}, {"time": 4772, "text": "So it's not a multipolar world."}, {"time": 4774, "text": "We talked already about the international financial system."}, {"time": 4778, "text": "That's the Western, not multipolar."}, {"time": 4780, "text": "We talked about the US military and NATO, or we could talk about the Japanese military, which is just very formidable, enormous number of platforms."}, {"time": 4790, "text": "Even the Australian military we could talk about, Lex, right?"}, {"time": 4794, "text": "And so it's a Western dominated world."}, {"time": 4797, "text": "And the West, remember, is not a geographic concept."}, {"time": 4801, "text": "It is an institutional and values club."}, {"time": 4806, "text": "The Japanese are not European, but they're Western."}, {"time": 4810, "text": "Just like Russia is European, but not Western."}, {"time": 4814, "text": "Because European is a cultural category and Western is an institutional category where you have rule of law and separation of powers and free and open public sphere and dynamic open market economy, okay."}, {"time": 4828, "text": "And then we have another thing which is pretty clear."}, {"time": 4831, "text": "The West is powerfully resented, powerfully envied and admired simultaneously."}, {"time": 4839, "text": "P.J."}, {"time": 4839, "text": "O Rourke, the comedian who died this year, fantastic, it was a big loss for the culture."}, {"time": 4848, "text": "He said, there are two things that are always characteristic of any American embassy abroad."}, {"time": 4854, "text": "One is a political protest outside and the other is the longest line you've ever seen for visas."}, {"time": 4865, "text": "And those things are true simultaneously."}, {"time": 4868, "text": "And that's the world we live in, meaning that non Western countries envy and admire the West, but they also resent the power of the West."}, {"time": 4880, "text": "Western hypocrisy, right?"}, {"time": 4883, "text": "The West invades countries when it wants, but when others do that, it's illegal, right?"}, {"time": 4890, "text": "The West arrests you for money laundering, but it's Western money laundering that is where you go when you need to launder money, right?"}, {"time": 4901, "text": "So they see the hypocrisy, they see the excessive power that the West has and they resent it."}, {"time": 4910, "text": "And they say, who elected you to run the world?"}, {"time": 4916, "text": "We have a billion plus people or we have a 200 plus million people and we don't have a say."}, {"time": 4924, "text": "You're the self appointed guardians of our world, who did that?"}, {"time": 4929, "text": "And so it's incumbent on the West not only to remember the power that it has, but also to exercise that power legally and with restraint and also to think about how we can expand institutions to be more encompassing so that other parts of the world are not on the outside being dictated to, but instead are on the inside."}, {"time": 4959, "text": "Too often, right, Western power is not consultative in a decision making fashion."}, {"time": 4969, "text": "It's consultative after the fact."}, {"time": 4972, "text": "Okay, you know, we got together in the EU or we got together in NATO or we got together at the Federal Reserve and here's our decision and we're announcing it today."}, {"time": 4983, "text": "And so your economy gets destroyed because the Federal Reserve decides it has to raise interest rates or you now go into default."}, {"time": 4994, "text": "You can't pay your debt because Western banks lent you money and now the West has changed interest rates or other considerations and you're in big trouble now."}, {"time": 5007, "text": "And so this is something which we fail to address."}, {"time": 5012, "text": "It's very hard to address."}, {"time": 5013, "text": "It's very hard to reform international institutions."}, {"time": 5016, "text": "It's very hard to share power."}, {"time": 5019, "text": "It's very hard to acknowledge that you have too much power and that maybe having too much power is not good, not only for the rest of the world, but for yourself."}, {"time": 5031, "text": "And so it's great to rediscover the West and rediscover its values and rediscover its authority and credibility and power, but that's not sufficient."}, {"time": 5042, "text": "So we know this now."}, {"time": 5044, "text": "We know that the rest of the world is not necessarily jumping on the Western bandwagon to condemn Russia for its actions because the West can do things like sanction your central bank, take away your reserves, deny you technology."}, {"time": 5064, "text": "It pretty much can do whatever it wants and it can say that it's legal and it can go through various mechanisms and it can freeze your property."}, {"time": 5073, "text": "And you say to yourself, should anybody have that much power?"}, {"time": 5077, "text": "And when do they come after me?"}, {"time": 5080, "text": "Now there's a caveat here."}, {"time": 5082, "text": "And the caveat, Lex, is they don't like the West having all of that power and they didn't join in the condemnation of Russia, but they also didn't join in Russia's aggression."}, {"time": 5097, "text": "So Russia's domestic civilian aerospace, aircraft industry, civilian aircraft industry is in big trouble now because of the export controls on spare parts and software."}, {"time": 5115, "text": "Brazil is a major power in aircraft manufacturing."}, {"time": 5121, "text": "Did they rush in and say, you know, Vladimir Putin, we didn't condemn necessarily your actions in Ukraine, okay, that's one thing."}, {"time": 5131, "text": "And how about we give you all of our aircraft technology and we help you rebuild your domestic aircraft industry."}, {"time": 5140, "text": "And you can have the aviation at the West, did that happen, Lex?"}, {"time": 5146, "text": "And you can look at India and you can look at China and you can look at South Africa and you can look at what they've done in practice and what they've done in practical terms."}, {"time": 5155, "text": "Yes, they haven't always joined in a full throated condemnation."}, {"time": 5160, "text": "Maybe they've been neutral or maybe they've been playing both sides of the fence like Turkey, for example."}, {"time": 5167, "text": "But are they rushing in to join Russia, to join Russia's aggression, to supply?"}, {"time": 5176, "text": "And the answer is no for two reasons."}, {"time": 5179, "text": "One, they actually don't wanna be party to that."}, {"time": 5182, "text": "And two, they understand that Western power."}, {"time": 5186, "text": "And they don't wanna be on the receiving end by crossing the West and then getting caught up in a sanctions regime or worse."}, {"time": 5195, "text": "Can we go to the mind of Vladimir Putin because what you just said, China, India, they seem to sit back and say, we're not going to condemn the actions of Vladimir Putin in Russia, but we would really like for this war to be over."}, {"time": 5213, "text": "So there's that kind of energy of we don't just stop this because you're putting us in a very, very bad position."}, {"time": 5220, "text": "And yet Vladimir Putin is continuing the aggression."}, {"time": 5225, "text": "What is he thinking?"}, {"time": 5226, "text": "What information is he getting?"}, {"time": 5228, "text": "Is it the system that you've described of authoritarian regimes that corrupts your flow of information, your ability to make clearheaded decisions just as a human being when you go to sleep at night?"}, {"time": 5241, "text": "Is he not able to see the world clearly or is this all deliberate systematic action that does have some reason behind it?"}, {"time": 5251, "text": "We gotta talk a little bit about China too, but let's answer your Putin question directly."}, {"time": 5257, "text": "So on Twitter, you've lost the war."}, {"time": 5261, "text": "Or as they say, there are these two Russian soldiers having a smoke in Warsaw, and they're taking a break, having a smoke, and they're sitting there in Warsaw on top of their tank and one says to the other, yeah, we lost the information war."}, {"time": 5279, "text": "And there they are sitting in Warsaw having that smoke, right?"}, {"time": 5283, "text": "So yeah, on Twitter, Russia has completely lost the war."}, {"time": 5287, "text": "In reality, they failed to take Kiev."}, {"time": 5289, "text": "They failed to capture Kiev."}, {"time": 5291, "text": "And they failed in phase two, as they called it, or plan B, which is to capture the entirety of the Donbass."}, {"time": 5301, "text": "We're three months into the war."}, {"time": 5303, "text": "If you had made a judgment about, let's say, the Nazi invasion of the Soviet Union, a definitive judgment after three months, you might've got the outcome wrong there."}, {"time": 5312, "text": "If you had judged the Winter War, the 1939, 40 Soviet invasion of Finland after three months, you would've got that wrong too of what the outcome was gonna be."}, {"time": 5323, "text": "So we're early in the game here, and we have to be careful about any definitive judgments."}, {"time": 5329, "text": "But it is the case that so far, they failed to take Kiev and they failed to capture the entirety of the Donbass, Luhansk and Donetsk provinces, Eastern Ukraine, a part of Eastern Ukraine."}, {"time": 5345, "text": "And they've been driven out of Kharkiv and the area immediately surrounding Kharkiv."}, {"time": 5353, "text": "They never captured Kharkiv, but they came close, but now the Ukrainians drove them back to the Russian border in that very large and important region."}, {"time": 5362, "text": "So those look like battlefield losses that are impossible to explain away if you're the regime in Russia, except by suppression of information."}, {"time": 5373, "text": "And as you know from Russian history, Lex, leaders in Russia have an easier time with the state of siege and deprivation than they do with explaining a lost war."}, {"time": 5389, "text": "But let's look at some other facts that are important to take into account."}, {"time": 5396, "text": "One, the Russian army has penetrated farther into Ukrainian territory since February, 2022, including in Kherson region, the famous Mariupol siege that just ended."}, {"time": 5413, "text": "They have built a large presence in areas north of Crimea on the Sea of Azov, the Black Sea littoral ultimately that they didn't previously hold."}, {"time": 5431, "text": "They're still fighting in Luhansk for full control over at least half of the Donbass and Ukrainians are resisting fiercely."}, {"time": 5441, "text": "But nonetheless, you can say that they've been driven out on the contrary, farther penetration than the beginning."}, {"time": 5451, "text": "Ukraine doesn't have an economy anymore."}, {"time": 5454, "text": "They have somewhere between 33 and 50% unemployment."}, {"time": 5458, "text": "It's hard to measure unemployment in a war economy, but their metallurgical industry, that Azov style steel plant in Mariupol is a ruin now."}, {"time": 5471, "text": "And a lot of farmers are not planting the fields because the harvest from the previous year still hasn't been sent, sold abroad because the ports are blockaded or destroyed."}, {"time": 5484, "text": "And so you don't have an economy and you need 5 billion or 7 billion or $8 billion a month to meet your payroll, to feed your people, to keep your army in the field."}, {"time": 5498, "text": "That's a lot of money per month and that's indefinite."}, {"time": 5502, "text": "That's as long as this blockade lasts."}, {"time": 5505, "text": "And so you don't have an economy anymore, you're indigent."}, {"time": 5509, "text": "And even if you take the lower number, 5 billion, as opposed to Zelensky's ask for 7 billion, 5 billion is 60 billion a year."}, {"time": 5517, "text": "That's 60 billion this year, that's 60 billion next year."}, {"time": 5521, "text": "And so who's got that kind of money?"}, {"time": 5523, "text": "Which Western taxpayers are ready?"}, {"time": 5526, "text": "And if you use the 7 or 8 billion, you get up to 100 billion a year."}, {"time": 5530, "text": "The Biden just signed, President Joe Biden just signed the bill making it law, $40 billion in aid to Ukraine."}, {"time": 5542, "text": "It's just an enormous sum."}, {"time": 5545, "text": "The economic piece of that is a month and a half, two months of Ukrainians covering Ukrainian expenditures."}, {"time": 5556, "text": "And they're asking the G7, they're asking everybody for this."}, {"time": 5559, "text": "So you have no economy and no prospect of an economy until you evict the Russians from your territory."}, {"time": 5566, "text": "And then you have a Western unity, Western resolve, it lasts or it doesn't last, Lex."}, {"time": 5575, "text": "So you're President Putin, and you've got more territory than before, and you've got a stranglehold over the Ukrainian economy, and you've got a lot of the world neutral, and you've got the Chinese propaganda supporting you to the hilt with those Oliver Stone and Mearsheimer lines about how this is really NATO's fault."}, {"time": 5602, "text": "And you've got Hungary dragging its feet on the oil embargo against Russia, and you've got Turkey dragging its feet on the recent applications of Sweden and Finland for NATO expansion, and you're saying to yourself, Lex, maybe I can ride this out."}, {"time": 5619, "text": "I got a lot of problems of my own, and we can go into the details on the Russian side's challenges, but he's on Ukrainian territory unless he's evicted, and he's got a stranglehold on their economy, and he's got the possibility that the West doesn't stay resolved and doesn't continue to pay for Ukraine's economy or supply those heavy weapons."}, {"time": 5646, "text": "And so you could argue that maybe he's deluded about all of this, and maybe he should go on Twitter."}, {"time": 5653, "text": "You know, I'm not on Twitter, but maybe Putin, who famously doesn't use the internet, should go on Twitter and see he's losing the war."}, {"time": 5659, "text": "Or you can argue that maybe he's calculating here that he's got a chance to still prevail."}, {"time": 5668, "text": "Wow, that is darkly insightful."}, {"time": 5671, "text": "If I could go to Henry Kissinger for a brief moment, and people should read this op ed he wrote in the Washington Post in March 5th, 2014, after the start of the war between Russia and Ukraine, but before Crimea was annexed."}, {"time": 5691, "text": "There's a lot of interesting historical description about the division within Ukraine, the corruption within Ukraine that will, if people read this article, will give context to how incredible it is, what Zelensky was able to accomplish in uniting the country."}, {"time": 5708, "text": "But I just want to comment because Henry Kissinger is an interesting figure in American history."}, {"time": 5714, "text": "He opens the article with, in my life, I have seen four wars begun with great enthusiasm and public support, all of which we did not know how to end, and from three of which we withdrew unilaterally."}, {"time": 5729, "text": "The test of policy is how it ends, not how it begins."}, {"time": 5735, "text": "So he's giving this cold, hard truth that we go into wars excited, are able to send $40 billion, financial aid, military aid, our own men and women, but the excitement fades, Twitter outrage fades, and then a country that's willing to wait patiently is willing to pay the cost of siege versus the cost of explaining to its own people that the war is lost, that country just might win, outlast."}, {"time": 5772, "text": "Let's hope not because the Ukrainians, resistance deserves to prevail here."}, {"time": 5781, "text": "Russia deserves to lose."}, {"time": 5783, "text": "No war of aggression like they've committed here against Ukraine should prevail if we can do anything about it."}, {"time": 5790, "text": "I support 1,000% the continued supply of heavy weapons, including offensive weapons, to the Ukrainians as long as they're willing to resist, and it's their choice."}, {"time": 5804, "text": "It's their choice when to negotiate."}, {"time": 5806, "text": "It's their choice how much to resist."}, {"time": 5808, "text": "It's their choice what kind of sacrifices to make, and it's our responsibility to meet their requests more quickly than we have so far and at greater scale."}, {"time": 5821, "text": "But ultimately, wars only have political ends."}, {"time": 5825, "text": "They never have military ends."}, {"time": 5827, "text": "You need a political solution here."}, {"time": 5830, "text": "So if the Ukrainians are able to conduct a successful counteroffensive at scale in July or August, whenever they launch, right now the heavy weapons are coming in and they're being moved to the battlefield and more are coming, you know, the dynamic."}, {"time": 5851, "text": "Russia bombs a school, Russia bombs a hospital."}, {"time": 5855, "text": "Americans and Europeans decide to send even more heavy weapons to Ukraine, right?"}, {"time": 5860, "text": "That's the self defeating dynamic from the Russian side."}, {"time": 5863, "text": "They commit the atrocities, we send more heavy weapons."}, {"time": 5916, "text": "It's something the Russians failed at in Ukraine and they come from the same place, the Soviet military."}, {"time": 5922, "text": "We hope this Ukrainian counter offensive at scale, this combined arms operation succeeds."}, {"time": 5930, "text": "And if it does succeed, there's the possibility of a battlefield victory."}, {"time": 5935, "text": "Whether that also includes Crimea, which as you know is not hostile on the contrary to the Russian military remains to be seen."}, {"time": 5946, "text": "But however much they regain territorially back towards the 1991 borders, which is their goal, their stated goal, and which we support them properly in trying to achieve, however much they achieve of that in this counter offensive that we're anticipating, that will set the stage for the next phase."}, {"time": 5971, "text": "And either Russia, which is to say one person, Vladimir Putin, will acknowledge that he's lost the war because the Ukrainians won it on the battlefield, or he'll try to announce a full scale mobilization, conscript the whole country, go back, and instead of acknowledging defeat, try to win with a different plan, recalibrate, remains to be seen."}, {"time": 6000, "text": "Will the Ukrainians negotiate any territory away or must they capture also Crimea, which puts a very high bar on the summer counter offensive that we're gonna see, which could last through the fall and into the winter as a result."}, {"time": 6017, "text": "We don't know the answers to that, nobody knows the answers to that."}, {"time": 6020, "text": "People are guessing, some people are better informed because they have inside intelligence."}, {"time": 6028, "text": "People are also worried about Russian escalation to nuclear weapons or chemical weapons if they begin to lose on the battlefield to Ukraine."}, {"time": 6038, "text": "Are you worried about nuclear war, the possibility of nuclear war?"}, {"time": 6044, "text": "I think it's necessary to pay attention to that possibility."}, {"time": 6049, "text": "That possibility existed before the February 2022 full blown invasion of Ukraine."}, {"time": 6057, "text": "The doomsday arsenal that Russia possesses is enough to destroy the world many times over, and that's been the case every year since the collapse of the Soviet Union in 1991."}, {"time": 6070, "text": "And so, of course, we're concerned about that."}, {"time": 6073, "text": "We do know, however, Lex, that they have a system known as dual key, dual key for their strategic nuclear weapons."}, {"time": 6083, "text": "Strategic nuclear weapons means the ones fired from silos, the missiles, the ones delivered from bombers, or the ones fired from submarines, right?"}, {"time": 6094, "text": "And they're ready to go."}, {"time": 6095, "text": "They're intercontinental."}, {"time": 6097, "text": "We watch that very, very closely."}, {"time": 6100, "text": "We watch all the movement of that and the alerts, et cetera."}, {"time": 6104, "text": "We have tremendously, let's say, tremendous inside intelligence on that."}, {"time": 6111, "text": "But dual key means that President Putin alone cannot fire them."}, {"time": 6115, "text": "He has one key, which he must insert, he must then insert the codes for a command to launch."}, {"time": 6124, "text": "That then goes to the head of the general staff, who must, he has his own key and separate codes, and must do the same, insert that key and codes for them to launch."}, {"time": 6136, "text": "And so will the general staff chief go along with the destruction of the world over a battlefield loss in Ukraine?"}, {"time": 6145, "text": "I don't know the answer to that, and I don't know if anybody knows the answer to that."}, {"time": 6149, "text": "Will those people flying those bombers, if they get the order from, if the dual key system goes into action and both keys are used and all the codes are implemented, will those young guys flying those bombers let those bombs go?"}, {"time": 6167, "text": "Will those at the missile silos decide to engage and fire?"}, {"time": 6172, "text": "We don't know, but you can see that it's more than one man making the decision here in a system of strategic nuclear weapons."}, {"time": 6180, "text": "As far as the tactical, the so called low yield or battlefield nuclear weapons, we're not sure the system that they have in Russia these days for their implement, for their use of such tactical nuclear weapons."}, {"time": 6195, "text": "It could well be that Putin and just himself, himself, he alone can fire them or order them be fired."}, {"time": 6207, "text": "What you know, Lex, there's no tactical nuclear weapon fired at Ukraine that's not also fired simultaneously at Russia."}, {"time": 6218, "text": "If the Kremlin is 600 miles from Ukraine and if the wind changes direction or the wind happens to be blowing east, northeast, the fallout hits your Kremlin, not just Ukraine."}, {"time": 6235, "text": "Moreover, you have all those border regions which are staging regions for the Russian offensive and they're a lot closer than 600 miles."}, {"time": 6244, "text": "They're actually right there."}, {"time": 6246, "text": "And so you fire that weapon on Ukrainian territory and you can get the fallout just like the Chernobyl fallout spread to Sweden which is how we got the Kremlin to finally, first they denied this at all."}, {"time": 6262, "text": "We don't know why there's a big nuclear cloud over Sweden."}, {"time": 6265, "text": "We don't know where that came from but eventually they admitted it."}, {"time": 6269, "text": "So Russia can actually use a nuclear weapon tactical battlefield one in Ukraine without also firing it at itself."}, {"time": 6278, "text": "And in addition, it's that same dynamic I alluded to earlier which is to say you bomb a hospital, you bomb a school, there's more heavy weapons going to Ukraine from the west."}, {"time": 6292, "text": "You can't get away with any of the, there's always going to be a response that's either proportional or greater than proportional."}, {"time": 6299, "text": "You could well have Europe signing on to NATO direct engagement, both Washington and Brussels direct engagement of the Russian army on the territory of Ukraine."}, {"time": 6313, "text": "You think that's possible to do that without dramatic escalation from the Russian side?"}, {"time": 6319, "text": "Yes, I do think it's possible but it's very worrisome just like you're saying."}, {"time": 6324, "text": "But if Putin were to escalate like that, he's firing that weapon at himself and he's potentially provoking a direct clash with NATO's military, not just with the Ukrainian military."}, {"time": 6339, "text": "If you're sitting in the Kremlin looking at those charts, Lex, of NATO capabilities and you can't conquer Ukraine which didn't really have heavy weapons before February 2022 at scale and you're thinking, okay, now I'm gonna take on NATO, that would be a bold step on the part of a Russian leader."}, {"time": 6363, "text": "And let's also remember, Lex, that there's another variable here."}, {"time": 6368, "text": "You're a despot as long as everyone implements your orders."}, {"time": 6376, "text": "And so if people start to say quietly, not necessarily publicly, I may not implement that order because that's maybe a criminal order or my grandma is Ukrainian or my wife is Ukrainian or I don't wanna go to the hog."}, {"time": 6396, "text": "I don't wanna spend the rest of my life in the hog or whatever it might be."}, {"time": 6400, "text": "At any point along the chain of command from the general staff all the way down, right, to the platoon, you're a despot provided they implement your orders."}, {"time": 6412, "text": "But who's to say that somewhere along the chain of command people start to say, I'm gonna ignore that order or I'm gonna sabotage that order or I'm gonna flee the battlefield or I'm gonna injure myself so that I don't have to fight or I'm gonna join the Ukrainian side."}, {"time": 6436, "text": "And so it could be that's what's left of the Russian army in the field begins to disintegrate."}, {"time": 6444, "text": "Even if the Ukrainians are not able to mount that counter offensive at scale, that combined arms operation, the Russian military in the field, which has taken horrendous casualties as far as we understand, something like a third of the original force, so you're talking about 50 to 60,000 that includes both dead and wounded to the point of being unable to return to the battlefield."}, {"time": 6471, "text": "Those are big numbers."}, {"time": 6473, "text": "Those were a lot of families, a lot of families affected."}, {"time": 6478, "text": "Their sons or their husbands or their fathers are either missing in action or the regime won't tell them that they're dead, as you know from the sinking of that flagship, Moskva, right, by the Ukrainians."}, {"time": 6495, "text": "And so a disintegration of the Russian military because there are orders that they either can't implement or don't wanna implement is also not excluded."}, {"time": 6506, "text": "And so you have these two big variables, the Ukrainian army in the field and its ability to move from defense to offense at scale, and we're gonna test that soon."}, {"time": 6517, "text": "And then the Russian ability in the field to hold together in a war of conquest and aggression where they're conscripts or they're fed dog food or they don't have any weapons anymore because there's no resupply, so the disintegration of the army can't be excluded."}, {"time": 6539, "text": "And then, of course, all bets are off on the Putin regime."}, {"time": 6542, "text": "More long term, there are these technology export controls."}, {"time": 6626, "text": "That's at the earliest a two year proposition to have domestic substitutes, and for some things like microelectronics, they've never had domestic substitutes going back to the Soviet times as you know well."}, {"time": 6640, "text": "And so there's that pressure on Russia from the technology export controls, which if you're in the security ministry or the defense ministry, if you're in that side of the regime, you're feeling that pain as we speak, and you're wondering about the strategy."}, {"time": 6661, "text": "Let me ask you about, again, the echoes of history, and it frustrates me in part when people draw these parallels, but maybe there is some deep insight about those parallels."}, {"time": 6674, "text": "So there's a song that goes, Dvata Teroviy Uniya Rovnovshchitya Chisa Kiev by Bitya Nama Bitya Shtanochilai Svaina."}, {"time": 6684, "text": "So Operation Barbarossa, the bombing of Kiev by Hitler, there is sort of an eerie parallel, and you have to be extremely careful drawing such parallels and such connections to this unexplainable war that is World War II."}, {"time": 6710, "text": "But is there elements of this that do echo in the actions of Vladimir Putin?"}, {"time": 6718, "text": "And more specifically, do you think that Vladimir Putin is a war criminal?"}, {"time": 6726, "text": "Can that label be assigned to the actions of this man?"}, {"time": 6730, "text": "A war criminal is a legal determination, and it requires evidence and due process and the ability to defend oneself."}, {"time": 6741, "text": "We don't just decide in the Twittersphere or on a podcast that somebody is a war criminal."}, {"time": 6748, "text": "They can be a suspected war criminal, and we can gather evidence to try to prosecute that case."}, {"time": 6756, "text": "And then the issue for us, Alexis, which court does it go to?"}, {"time": 6761, "text": "What's the appropriate place?"}, {"time": 6764, "text": "Does it happen in Ukraine because they're the victims?"}, {"time": 6766, "text": "Does it happen in the Hague because there's an international criminal court there?"}, {"time": 6771, "text": "Does it happen inside Russia because there's regime change at some point?"}, {"time": 6776, "text": "And some of these people become, let's say they get arrested by their own people inside Russia."}, {"time": 6785, "text": "So those are all important questions that have to be pursued with resources and with determination and by skilled people who are excellent at gathering that evidence."}, {"time": 6797, "text": "And that process is underway."}, {"time": 6798, "text": "And Ukraine has a trial underway now of one alleged war criminal who's pleaded guilty."}, {"time": 6806, "text": "And we'll see what the outcome of that trial inside Ukraine is of a lower level official, not obviously Vladimir Putin, but the commander of a tank group."}, {"time": 6818, "text": "So, yes, the names are eerily familiar."}, {"time": 6826, "text": "Izium, Kharkiv, Kiev, right?"}, {"time": 6831, "text": "Those are the names we know from the Nazi invasion and the Nazi occupation of Ukraine."}, {"time": 6840, "text": "And it's very deeply troubling to think that this could happen again."}, {"time": 6846, "text": "And there's a bizarre sense that the Russians claiming as Putin says to deNazify Ukraine have invaded the same places that the Nazis invaded back in 1941."}, {"time": 6861, "text": "As somebody who's working on volume three of your work on Stalin going through this period, is it eerie to you?"}, {"time": 6872, "text": "Yes, it is, Lex."}, {"time": 6873, "text": "That you're."}, {"time": 6874, "text": "I've written the chapters of volume three."}, {"time": 6877, "text": "I've drafted the chapters on the war."}, {"time": 6880, "text": "And as I said, the place names are very evocative, unfortunately."}, {"time": 6885, "text": "But, you know, the Nazis failed ultimately."}, {"time": 6892, "text": "They captured Ukraine for a time, but they were evicted from Ukraine."}, {"time": 6900, "text": "There was massive partisan or guerrilla warfare resistance behind Nazi lines the whole time that they were allegedly in control of Ukraine."}, {"time": 6913, "text": "If you look at the maps on cable TV, they show you the sign of, they show you the coloring, Russian control."}, {"time": 6919, "text": "And they draw a line and then it's colored in."}, {"time": 6922, "text": "But the word control is misplaced."}, {"time": 6925, "text": "They don't actually control it."}, {"time": 6927, "text": "It's Russian claimed or extent of farthest Russian troop advancement."}, {"time": 6934, "text": "Because behind the Russian lines in Ukraine, Crimea accepted, you have insurgencies."}, {"time": 6940, "text": "You have the armed insurgency."}, {"time": 6943, "text": "In Melitopol, for example, which is a place that you know in Southeastern Ukraine, there is a guerrilla war now underway to hurt the Russians who are in occupation of that city and region."}, {"time": 6960, "text": "And we're gonna see that continue even if the war becomes a stalemate, even if it stalemates more or less at the lines we're at now, which would mean that anticipated Ukrainian counteroffensive at scale proves unsuccessful."}, {"time": 6979, "text": "The Russian army doesn't disintegrate."}, {"time": 6982, "text": "And you end up with a stalemate where there could be a ceasefire or not a ceasefire, but neither side is attempting an offensive for the time being."}, {"time": 6992, "text": "There will be resistance behind those Russian lines and it will be fierce resistance."}, {"time": 6998, "text": "The kind of resistance we saw to the Nazi occupation."}, {"time": 7003, "text": "Ultimately, it took the Red Army reinvading the territory of Ukraine and succeeding at combined arms operations at scale."}, {"time": 7016, "text": "A massive counteroffensive, much larger than anything we're talking about today."}, {"time": 7021, "text": "Ultimately, it required that to evict the Nazis from Ukraine."}, {"time": 7025, "text": "But in the meantime, they did not have an easy occupation regime there."}, {"time": 7031, "text": "Ukrainian partisans, Soviet partisans killed Nazi officials, Wehrmacht soldiers, Wehrmacht officers blew up the infrastructure they were using, made them pay a price for their occupation."}, {"time": 7051, "text": "We could well see if unfortunately this ends in a stalemate for the time being, we could well see that type of insurgency gain momentum behind Russian lines and try to evict the Russians that way and then remount the counteroffensive at scale later on in the future if the first one doesn't succeed."}, {"time": 7077, "text": "So that would be further echoes of the World War II experience."}, {"time": 7083, "text": "The scale once again is much smaller."}, {"time": 7085, "text": "The size of the armies here, they're not in the many 800,000, 700,000, a million two, a million four."}, {"time": 7095, "text": "That's not what we're talking about today."}, {"time": 7098, "text": "But the weapons, the cruise missiles, artillery fire."}, {"time": 7104, "text": "Artillery fire used to be very inaccurate and it was like saturation."}, {"time": 7109, "text": "You would just fire towards the enemy lines and if you hit something, you hit something and if you didn't, you just kept firing."}, {"time": 7116, "text": "Now you have drones, Lex."}, {"time": 7119, "text": "And so artillery fire is now sniper fire because you can coordinate the direction of the artillery fire with the drones."}, {"time": 7129, "text": "The drones can take a picture and show you where the enemy is precisely located and you can align that artillery to hit them instead of just indiscriminately bombing an area, a territory."}, {"time": 7143, "text": "And the NATO supplied artillery goes really far and you can fire into Russian positions and yourself not be exposed to Russian fire because your artillery fires farther than theirs."}, {"time": 7160, "text": "So that's coming and we're gonna see that in action."}, {"time": 7164, "text": "And so the scale is not the same, but the weapons, the precision of some of the weapons and some of the NATO."}, {"time": 7171, "text": "We're not sending all of our stuff, but as I said, the dynamic is Russia commits atrocities, Russia bombs schools, Russia bombs hospitals, Russia kills civilians and more and heavier and more lethal Western weapons go to Ukraine."}, {"time": 7188, "text": "Their willingness to risk their lives is really so impressive and the reason that it's our duty, we're obliged to supply those weapons."}, {"time": 7200, "text": "And so the Russians don't have that resupply and the Ukrainians do."}, {"time": 7206, "text": "And so the Russians are now digging in Lex."}, {"time": 7209, "text": "They're digging in deeply in the areas that they've penetrated and they're trying to build unassailable positions for when the Ukrainians transition from mostly defense to full scale offense."}, {"time": 7226, "text": "And we'll see if that now, I mean, they're digging everywhere, as they say, Kapayut, Kapayut, right?"}, {"time": 7234, "text": "They're digging everywhere behind."}, {"time": 7236, "text": "Your Russian is beautiful."}, {"time": 7237, "text": "Digging in, I wish Lex, like yours."}, {"time": 7241, "text": "But so there are these things that we can't predict, but there are these things we're watching and watching closely."}, {"time": 7247, "text": "And on top of that, something that's not in World War II or for the most part is cyber attacks and cyber warfare, which is much less perhaps convertible into human words because it happens so quickly, it's such large scales, so difficult to trace and all those kinds of things."}, {"time": 7270, "text": "It's not bullets, it's electrical signals and that."}, {"time": 7274, "text": "Yeah, but those Ukrainian people, they're like you, Lex."}, {"time": 7278, "text": "They're young and they're technically really proficient."}, {"time": 7283, "text": "And they've been amazing."}, {"time": 7285, "text": "You know, they spent those teenage years in the basement playing video games."}, {"time": 7291, "text": "Turns out it's useful after all."}, {"time": 7292, "text": "It turns out it's more than useful."}, {"time": 7294, "text": "You can save your country that way."}, {"time": 7297, "text": "And so they're not alone, they're getting support and that support is important, but really predominantly it's Ukrainians on the cyber battlefield."}, {"time": 7308, "text": "And their skills have been very impressive and they've been preparing for this for a number of years."}, {"time": 7313, "text": "And they have a whole army of young people on the cyber side."}, {"time": 7318, "text": "It's their civilian population."}, {"time": 7320, "text": "These are not people conscripted into the military or volunteering wearing the uniform."}, {"time": 7325, "text": "And so even in cyber warfare, the Ukrainians have been extremely impressive."}, {"time": 7331, "text": "And so let's remember that all of these aspects of warfare, whether it's how far your cruise missiles go and how accurate they are, what size your cyber capabilities are."}, {"time": 7349, "text": "It's really ultimately about the people."}, {"time": 7351, "text": "It's about the human capital, right?"}, {"time": 7354, "text": "It's about their willingness, their skill level, but also their willingness to fight and to put their lives on the line."}, {"time": 7363, "text": "And there's no substitute for that."}, {"time": 7365, "text": "And so what's called morale or courage or bravery or valor, that's really the ultimately decisive provided you have enough sufficient arms, right?"}, {"time": 7379, "text": "To conduct the fight."}, {"time": 7381, "text": "And if you don't, you use a Molotov cocktail, right?"}, {"time": 7384, "text": "Grandma calls in the coordinates of the Russian tank on her iPhone and you have a Molotov cocktail that the people who used to work in the cafeteria are now stuffing flammable liquid into bottles and you carry one right up to the tank and you smash it against the tank or you drop it in one of the hatches in the tank, right?"}, {"time": 7410, "text": "There's no substitute for that kind of stuff, that level of resolve, willingness to die for your country."}, {"time": 7418, "text": "That's a really big lesson that we need to absorb in our own country."}, {"time": 7423, "text": "We've been going to war more frequently than we should."}, {"time": 7428, "text": "And like you said, without the justification all the time, and then like Henry Kissinger said, without understanding how this was gonna end."}, {"time": 7436, "text": "It's easy to start a war, it's very difficult to win a war, prevail in a war or end a war on terms that meet your original expectations, right?"}, {"time": 7448, "text": "We've been fighting wars, but we haven't been fighting wars as societies."}, {"time": 7453, "text": "We've been fighting wars as a small sliver of our population."}, {"time": 7458, "text": "Something like 1% of our population is involved with the military because we have an all volunteer force."}, {"time": 7465, "text": "And that means that it's easier for our politicians to go to war because they don't face conscription, they don't have the draft, which affects every family in the country."}, {"time": 7479, "text": "And because the number of people in the volunteer force is such a narrow stratum of the population."}, {"time": 7489, "text": "And so they've been getting away with this because the professional army is much better than the conscript army."}, {"time": 7496, "text": "And an all volunteer force is much preferable from a military point of view."}, {"time": 7501, "text": "But from a societal point of view, it enables you to go to war too easily as a politician."}, {"time": 7509, "text": "And it doesn't engage the society the same way that the Ukrainian society is completely engaged from those young hackers all the way up to those grandmothers."}, {"time": 7520, "text": "Let me ask you, you're a scholar of history, a scholar of geopolitics, and you're also a human being."}, {"time": 7528, "text": "You're also a human being."}, {"time": 7530, "text": "That's kind of you, Lex."}, {"time": 7531, "text": "I'll take that."}, {"time": 7533, "text": "What's the value, what's the hope, what's the power of conversation here?"}, {"time": 7539, "text": "If you could sit down with Vladimir Putin and have a conversation versus bullets, human exchange words, is there hope for those?"}, {"time": 7551, "text": "And if so, what would you talk about?"}, {"time": 7553, "text": "What would you ask him?"}, {"time": 7555, "text": "Well, Henry Kissinger, you alluded to his op ed, he's had many private meetings with President Putin over a long time."}, {"time": 7566, "text": "And President Biden, the previous presidents, secretaries of state, officials below secretary of state, the head of the CIA, evidently met with President Putin in the fall when he was massing the troops on the border before he invaded."}, {"time": 7590, "text": "And we sent the head of the CIA and Putin received him, somebody he evidently respects or was at least willing to meet, unlike other members of the administration."}, {"time": 7602, "text": "So a lot of people are talking to him in some form or another for the 22 years he's been in power."}, {"time": 7609, "text": "And I'm not sure it's had what I would call their desired effect."}, {"time": 7617, "text": "Well, the nature of the conversation is interesting too."}, {"time": 7620, "text": "And also the timing, which is post February 22nd, is a different time."}, {"time": 7625, "text": "And also another aspect, which Oliver Stone mentioned interestingly, that there's something about COVID and the pandemic that creates isolation, the distancing."}, {"time": 7677, "text": "And you're kind of reminded by that when you're sitting together."}, {"time": 7682, "text": "People who have sat across the table from him, whether at 30 yards or at three, have remarked upon this feeling of isolation that has affected him, the pandemic."}, {"time": 7698, "text": "I think there must be something to that if several people who've been in the room with him are remarking on it."}, {"time": 7707, "text": "Everybody that I know and I've been able to talk to who's had a meeting with him in the past 10 years, including Henry Kissinger, the former Secretary of State, has said that Putin spends a lot of time enumerating his grievances."}, {"time": 7729, "text": "He goes through a monologue of his grievances and then the West did this, and then the West lied to us about that, and then the West cheated us on this."}, {"time": 7740, "text": "And so it's not the conversation that you're encouraging of common humanity."}, {"time": 7746, "text": "It's that roiling resentment volcano that's just exploding and exploding."}, {"time": 7753, "text": "The resentment."}, {"time": 7754, "text": "And by the time he gets through the monologue of the grievances, the time of the meeting is expired or over time."}, {"time": 7765, "text": "That's a brilliant statement, but that's where the skill of conversation comes in."}, {"time": 7769, "text": "Like when you're facing a bull with a red cloth, you have to learn how to avoid the long list of grievances and get to the humanity."}, {"time": 7777, "text": "That's a really important skill."}, {"time": 7779, "text": "For sure it's a skill, and it's the highest level skill of a diplomat to be able to reach some type of common understanding when interests and worldviews clash so much."}, {"time": 7791, "text": "But here's your challenge, Lex."}, {"time": 7794, "text": "Your challenge is Russia wants to impose a closed sphere of influence on its neighbors."}, {"time": 7805, "text": "It wants to dictate what its neighbors can and can't do."}, {"time": 7810, "text": "It wants to exert influence, not by the power of its example, not by the freedom of its people, not by the dynamism of its diversified economy, but it wants to exert influence just because it deserves that, just because it's a great power, just because, and on and on and on."}, {"time": 7833, "text": "It's a civilization unto itself."}, {"time": 7836, "text": "And it wants that, and we can't give that."}, {"time": 7840, "text": "The reason that Russia was not integrated into the West was not for lack of trying."}, {"time": 7847, "text": "It was because Russia ultimately spurned the integration because it was about what terms the integration would come on."}, {"time": 7856, "text": "Would you come into the West and observe Western rules and be another country, meaning just another country?"}, {"time": 7866, "text": "There's Poland, and there's Austria, and there's little tiny Monaco, and there's Russia."}, {"time": 7876, "text": "And you're just one of those countries."}, {"time": 7879, "text": "And Russia's answer to that was no, we're not just one of those countries."}, {"time": 7884, "text": "We need special rules."}, {"time": 7886, "text": "We need special conditions."}, {"time": 7889, "text": "We'll integrate, but only as a special country, meaning like at the UN, where all countries are sovereign, all countries are members, but Russia has a veto on what countries can and can't do."}, {"time": 7904, "text": "Those were the terms on which they were willing to integrate."}, {"time": 7908, "text": "And those were the terms that no leader of a Western country or the United States or the G7 or fill in the blank can grant to Russia."}, {"time": 7920, "text": "It's very well known that Vladimir Putin was one of the first, maybe the first person, first leader, foreign leader to call President Bush after the 9 11 tragedy."}, {"time": 7933, "text": "They didn't connect right away."}, {"time": 7935, "text": "President Bush was not in Washington, but eventually they did speak."}, {"time": 7940, "text": "He condemned the terrorist attack."}, {"time": 7942, "text": "He offered Russian support, which he delivered on the use of some Russian logistics for our Afghanistan operations."}, {"time": 7953, "text": "And a lot of people point to that and they say, there it is."}, {"time": 7956, "text": "Russia wanted to cooperate and did cooperate and we spurned them or we failed to appreciate Russia's cooperation."}, {"time": 7967, "text": "And so therefore Russia was cheated or Russia was lied to or Russia's grievances are legitimate."}, {"time": 7974, "text": "But here's the problem with that argument, Lex."}, {"time": 7978, "text": "In exchange for that support, Vladimir Putin asked in return from President Bush for a free hand in the former Soviet space, that closed hierarchical sphere of influence where Russia would exert influence coercively over countries that were sovereign."}, {"time": 7999, "text": "And no American president could grant that."}, {"time": 8003, "text": "And President Bush was right."}, {"time": 8004, "text": "He said no."}, {"time": 8006, "text": "And so the attempted cooperation blew up."}, {"time": 8011, "text": "But who's at fault there?"}, {"time": 8015, "text": "Should there be a nonvoluntary sphere of influence?"}, {"time": 8020, "text": "Should that be granted or should you face up to attempts to do that?"}, {"time": 8027, "text": "You know, let's take a little detour here into China for a second."}, {"time": 8034, "text": "China had this brilliant grand strategy, which was sure, America is hostile because America is hegemonic."}, {"time": 8043, "text": "America wants to control the world."}, {"time": 8045, "text": "America will never let China rise."}, {"time": 8047, "text": "America will do everything it can to hold China down."}, {"time": 8051, "text": "So we're gonna have hostility from America."}, {"time": 8054, "text": "We don't wanna decouple because we need that high end technology transfer."}, {"time": 8060, "text": "Either we buy it or we steal it because America and the rest of the West has all the technology that we need."}, {"time": 8066, "text": "We have some of it domestically, more than before by a lot, but we're still dependent so we can't decouple."}, {"time": 8073, "text": "So we'll have the hostility, but there'll be a line we don't cross just so that we don't lose the technology transfer."}, {"time": 8080, "text": "Till Made in China 2035 is accomplished and we're self sufficient domestically in AI and every other area that's critical."}, {"time": 8092, "text": "But hostility from America."}, {"time": 8093, "text": "But we have an ace in the hole."}, {"time": 8095, "text": "Our ace in the hole is Europe."}, {"time": 8098, "text": "Europe hates conflict."}, {"time": 8100, "text": "They're all about trade."}, {"time": 8102, "text": "Doesn't matter how evil you are."}, {"time": 8104, "text": "They love to trade because Wandel durch Handel, change through trade."}, {"time": 8110, "text": "They have this illusion that you're gonna become a better country if they trade with you and you won't have conflict, war and hostilities if you trade."}, {"time": 8119, "text": "And so we have this European ace in the hole."}, {"time": 8122, "text": "We're hostile with the Americans."}, {"time": 8124, "text": "We're still buying or stealing their technology."}, {"time": 8127, "text": "And better than that even, the Europeans are not hostile to us at all."}, {"time": 8132, "text": "They love to trade with us and they wanna trade more and they're our biggest trading partner already."}, {"time": 8138, "text": "And lo and behold, Xi Jinping sides with Vladimir Putin in the aggression in Ukraine."}, {"time": 8145, "text": "He doesn't side with him providing military equipment."}, {"time": 8149, "text": "He doesn't provide technology transfer but he provides public support and massive pro Russian propaganda to the whole Chinese population."}, {"time": 8161, "text": "And the Europeans say, wait a minute, this is an invasion of a sovereign country in Europe."}, {"time": 8169, "text": "You're not condemning Vladimir Putin's invasion."}, {"time": 8172, "text": "And so that wedge that the Chinese had, that was the basis of their grand strategy, that wedge between the US and Europe when it came to China policy, that wedge is gone now."}, {"time": 8184, "text": "Xi Jinping destroyed it."}, {"time": 8187, "text": "And the Europeans and the Americans are coming close together on Ukraine and Russia policy for sure, but also more and more on China policy."}, {"time": 8198, "text": "And so that was a pretty big sacrifice for the Chinese leader to make."}, {"time": 8202, "text": "And what did he get in return?"}, {"time": 8205, "text": "He gets hydrocarbons from Russia at reduced prices."}, {"time": 8209, "text": "And the Chinese get hydrocarbons from a lot of countries."}, {"time": 8214, "text": "They have a completely diverse supply chain for their energy."}, {"time": 8219, "text": "So what do you think Xi Jinping is thinking now?"}, {"time": 8222, "text": "Was it a mistake or?"}, {"time": 8224, "text": "I'd like to know, Lex."}, {"time": 8226, "text": "I'd like you to be able to sit down with him across from this table here on your podcast and pose that same question to him because we have no idea."}, {"time": 8234, "text": "There's a language barrier that's fascinating."}, {"time": 8236, "text": "By the way, you as a scholar of Stalin, do you think we'll ever break through the language barrier to China?"}, {"time": 8244, "text": "Not ever, I apologize, in the next few years because there is a gigantic cultural and language barrier between the West and the Chinese."}, {"time": 8252, "text": "China's a great civilization."}, {"time": 8254, "text": "China predates the United States by millennia."}, {"time": 8259, "text": "China's accomplishments are breathtaking."}, {"time": 8262, "text": "But China's also led by, let's be honest, a Communist Party monopoly which engages in a lot of criminal behavior."}, {"time": 8272, "text": "Lex, Tibet is Ukraine."}, {"time": 8277, "text": "Xinjiang is Ukraine."}, {"time": 8279, "text": "Hong Kong is Ukraine, let alone support for Putin, Ukraine."}, {"time": 8287, "text": "This is before we've even discussed Taiwan."}, {"time": 8290, "text": "And so now the Europeans are coming to see this and the Americans are coming to understand this, that maybe trading with a regime like that, morally, politically, criminally, Tibet, Xinjiang, Hong Kong, how is that different from what Putin is doing in Ukraine?"}, {"time": 8311, "text": "I'd be hard pressed to differentiate that ultimately, even though the analogies are not exact."}, {"time": 8318, "text": "And so the Chinese, it's like that guy Leonov, the author of Licheletia, the great memoir of the late Soviet period, the end of the Soviet Union."}, {"time": 8332, "text": "You know that they spend all this time and all these resources blackening our image, but we supply them with endless material to blacken our image."}, {"time": 8342, "text": "That's where Xi Jinping's regime is right now, Lex."}, {"time": 8345, "text": "And so they have a big dilemma on their side."}, {"time": 8349, "text": "It's a Western world and they've united the Western world and reawoken the Western world to the fact that China is a threat to the values, the institutions and values of the West."}, {"time": 8367, "text": "And that trade is not transforming China quite the opposite."}, {"time": 8372, "text": "We'll see if this endures."}, {"time": 8374, "text": "Maybe it doesn't endure."}, {"time": 8375, "text": "Maybe it's a fleeting moment."}, {"time": 8376, "text": "Maybe this is not an inflection point."}, {"time": 8379, "text": "Maybe the war in Ukraine ends more quickly than we think."}, {"time": 8383, "text": "And maybe like you said, the Chinese and the Indians and the rest of them, the leaders there, they get their wish that it ends and the world moves on and forgets or says, let's try again to resume our mutual understanding, our mutually beneficial trade and everything else."}, {"time": 8404, "text": "Maybe it's a passing phase."}, {"time": 8406, "text": "We can't exclude that."}, {"time": 8407, "text": "I'm very poor at predicting the future."}, {"time": 8410, "text": "But the moment is not a good one for the Chinese regime, let alone the fact that he's trying to impose an unprecedented in the modern era third term for himself as president in the fall at the next party Congress, becoming president for life de facto, a Mao like figure."}, {"time": 8435, "text": "And he's now got to do that within this environment where he has damaged Chinese grand strategy and damaged the reputation of China and its relationships across the world."}, {"time": 8451, "text": "Maybe not permanently, but significantly, in addition to the problems they have at home, demography, as you know, a middle income trap, and then the regulatory insanity of Chinese communist rule that we've seen with the tech companies that you know well, where they've destroyed all of that value with the blow up of their property sector because it was a massive bubble and that's still playing out."}, {"time": 8481, "text": "And this time it's the same, meaning this time it's not different."}, {"time": 8487, "text": "When it comes to a property blowout, it has enormous effects on middle class balance sheets and their ability to remain consumers and drive the economy, which is the model that they have to share."}, {"time": 8500, "text": "So he's got a litany of challenges independent even of the fact that he sided with his pal Vladimir Putin and their bromance is costing China very, very significantly."}, {"time": 8515, "text": "If you close your eyes."}, {"time": 8519, "text": "And a hundred years ago in 1922 and you think about the future, I wonder if you can hear the drums of war predicting the 30s, predicting the great depression and the resentment that builds the economic resentment, the cultural resentment, the geopolitical resentment that builds and leads to World War II."}, {"time": 8546, "text": "At least to me, when I close my eyes, I can hear the drums of war that are still ahead of us."}, {"time": 8553, "text": "And it's possible that 2022 will materialize in a similar way as did 1922."}, {"time": 8565, "text": "I have my eyes closed, Lex."}, {"time": 8566, "text": "Do you hear anything?"}, {"time": 8568, "text": "And I sure hope that that's not what happens."}, {"time": 8571, "text": "But I'm looking in 1922, it's an epoch I know well and I don't see the future that unfolds."}, {"time": 8580, "text": "I would not have predicted it had I been alive then."}, {"time": 8582, "text": "I see the war behind us."}, {"time": 8586, "text": "I see a prosperity on the horizon."}, {"time": 8590, "text": "Yes, inflation in Germany and some many other difficult issues, but there are more democracies now than there were before the war and the old empires are gone."}, {"time": 8602, "text": "And there's a cultural efflorescence and there's modernism in the arts and there's women entering the public sphere and there's all this fantastic new technology like automobiles."}, {"time": 8613, "text": "And I'm looking at the future from 1922 and I'm not seeing the Great Depression and I'm not seeing World War II and I'm not seeing the Holocaust because I don't predict the future and nobody in 1922 could see that future, although I guess there were some clairvoyants who predicted it, but."}, {"time": 8636, "text": "But you're not one of them."}, {"time": 8637, "text": "I'm not one of them."}, {"time": 8639, "text": "But this is what I know, Lex, from studying history."}, {"time": 8643, "text": "What I know is stuff happens."}, {"time": 8645, "text": "In other words, in other words, Lex, we're watching Ukraine war right now and all of our attention is focused on that."}, {"time": 8656, "text": "And it's like the economists say in their textbooks when their powerful models are employed and there's this line that says all other factors held constant, comma, and then the model works."}, {"time": 8673, "text": "And you get this really great result."}, {"time": 8675, "text": "It's very powerful predictor and analysis, the model."}, {"time": 8680, "text": "And the whole game is all other factors held constant."}, {"time": 8685, "text": "So the Russia, Ukraine war that we've been discussing and this could happen and that could happen, but you know what stuff could happen, Lex."}, {"time": 8693, "text": "For example, the Israeli government could decide this summer that it's gonna bomb Iran because no Israeli government will tolerate Iran acquiring a nuclear weapon."}, {"time": 8705, "text": "And since President Trump exited, unilaterally exited from the multipower nuclear agreement, Iran is now much closer to the bomb than they were when they were still in, when the United States was still in that agreement."}, {"time": 8722, "text": "And you tell me the Israeli government that says, sure, it's fine, it's okay, Iran can get the bomb."}, {"time": 8728, "text": "And so maybe that happens."}, {"time": 8729, "text": "And maybe that happens as early as this summer as Iran gets closer and closer and closer to the bomb."}, {"time": 8735, "text": "Maybe that guy in North Korea decides it's his time just like his grandfather, right, in 1950 decided, you know, it's time, we're gonna quote reunify, unquote, the Korean peninsula, maybe, I don't know, Lex, fill in the blank, something's gonna happen."}, {"time": 8757, "text": "It's not gonna be what I predict."}, {"time": 8759, "text": "It's not gonna be what I'm watching."}, {"time": 8761, "text": "It's gonna be obvious only after it happens, not before."}, {"time": 8766, "text": "And then it's gonna upend the table."}, {"time": 8770, "text": "And all of a sudden."}, {"time": 8772, "text": "Everything changes."}, {"time": 8772, "text": "We're gonna be in a different environment, different circumstances, and is Ukraine still as central at that point as it seems to be right now?"}, {"time": 8784, "text": "Let me ask two rapid fire questions."}, {"time": 8788, "text": "You're only allowed to have one minute and it's about predicting the future."}, {"time": 8792, "text": "Okay, question one, Vladimir Putin, when will he no longer be in office?"}, {"time": 8799, "text": "And will he step down or be overthrown?"}, {"time": 8804, "text": "What's your prediction and a brief explanation of that prediction?"}, {"time": 8809, "text": "Now, nobody can predict the future, but what's your sense now?"}, {"time": 8813, "text": "Some people are saying the pressure is building."}, {"time": 8816, "text": "He's going to be overthrown or step down at the end of this year."}, {"time": 8821, "text": "And some people say surely he's going to last, outlast Stalin's rule of 30 plus years."}, {"time": 8829, "text": "No evidence of a coup yet, none whatsoever, yet."}, {"time": 8838, "text": "He's pretty much at life expectancy for a Russian male."}, {"time": 8843, "text": "Those are bad numbers."}, {"time": 8845, "text": "He's 69, gonna be 70."}, {"time": 8849, "text": "So he's lived the life of a Russian male already, but he's got better doctors than the majority of the Russian males in that, let's say comparison set."}, {"time": 8862, "text": "So he could live a very long time with good doctors."}, {"time": 8867, "text": "So there could be a coup at some point, but there's none today in evidence."}, {"time": 8874, "text": "He could go because he's reached the life expectancy or he could stay for a long time."}, {"time": 8880, "text": "The thing to watch about this is an organization that nobody pays attention to."}, {"time": 8888, "text": "The FSO, the Federalnaya Sluzhba Akhrani, which is the Praetorian Guard, the self standing bodyguard directorate, the only one, the only organization in Russia that has any access to him."}, {"time": 8904, "text": "We've seen no disloyalty, no breaking of ranks, no defections, nothing in the public realm and open sources about any divisions or problems in the FSO, in the Praetorian Guard."}, {"time": 8919, "text": "So if you can't break that, change that illicit defections there, you can't overturn him."}, {"time": 8930, "text": "Authoritarian regimes, Lex, they're terrible."}, {"time": 8932, "text": "They fail at everything."}, {"time": 8934, "text": "They can't feed their people."}, {"time": 8937, "text": "They have trouble achieving any goals."}, {"time": 8940, "text": "They only have to be good, however, at one thing."}, {"time": 8944, "text": "They only have to be good at the complete suppression of political alternatives."}, {"time": 8948, "text": "If you can suppress political alternatives, you can fail at everything else, but you can survive as an authoritarian regime."}, {"time": 8957, "text": "So you watch Navalny."}, {"time": 8959, "text": "He's still alive."}, {"time": 8961, "text": "Okay, Lex, you go for it."}, {"time": 8963, "text": "That's my second rapid fire question is what happens to Navalny?"}, {"time": 8968, "text": "What are the possible conclusions of what you said quite possibly the second most influential, powerful figure in Russia?"}, {"time": 8978, "text": "Is he going to die in jail?"}, {"time": 8981, "text": "Will he become the next president of Russia?"}, {"time": 8984, "text": "Well, what are the possible?"}, {"time": 8985, "text": "I wish I knew, Lex."}, {"time": 8987, "text": "I've been surprised that he's still alive."}, {"time": 8990, "text": "I've been worried that he will be killed in prison in a staged fight, some security officer, prison guard puts on a prison outfit, takes a lead pipe, goes into the cell."}, {"time": 9005, "text": "They have a quote fight and Navalny is killed."}, {"time": 9008, "text": "I've been afraid of that, but he's still alive even though he's serving a long sentence."}, {"time": 9014, "text": "So that leads me to guess that people inside the Putin regime and maybe President Putin himself understand that Navalny is their ticket to lift sanctions."}, {"time": 9029, "text": "That Navalny is even more popular outside of Russia than he is inside of Russia."}, {"time": 9035, "text": "He's the leader in many ways of the political opposition in the country, even while still in prison, his organization's been destroyed, but he doesn't have majority support in the population by any stretch of the imagination, but he's a big figure in the West, including here in the US."}, {"time": 9054, "text": "And so Navalny could be their ticket."}, {"time": 9057, "text": "They're kind of get out of jail card, meaning they release him from prison."}, {"time": 9062, "text": "He gets appointed, I don't know, prime minister even by the Putin regime if he were willing to accept such a position."}, {"time": 9069, "text": "And I have my doubts about that."}, {"time": 9071, "text": "And then that's how they lobby to remove the sanctions against them."}, {"time": 9077, "text": "So he's a card that President Putin could play."}, {"time": 9081, "text": "And so maybe that's the reason he's still alive, or maybe there are other reasons that we don't know."}, {"time": 9088, "text": "And so some alternative to Putin is more likely to arise inside his gang, Putin's Shika, as they say, right?"}, {"time": 9099, "text": "Inside his gang, where they tire of his mistakes, they tire of his self defeating actions."}, {"time": 9108, "text": "And they say, patriotically for Russia, we need to do something against, move against this guy because he's hurting our country and also because I could do better."}, {"time": 9121, "text": "I'm ambitious as well as patriotic."}, {"time": 9124, "text": "But once again, the problem there, Lex, is Putin is surrounded by this cocoon known as the FSO."}, {"time": 9131, "text": "He meets on Zoom, predominantly with the rest of the government, including with the defense and security officials."}, {"time": 9140, "text": "They don't have frequent access to his person."}, {"time": 9144, "text": "And as you were alluding earlier to the pandemic, they have to quarantine for two weeks before every meeting with him."}, {"time": 9151, "text": "And moreover, you know, Lex, they don't know where he is."}, {"time": 9156, "text": "You see, when they're on Zoom with him, and the room, it's the Valdai."}, {"time": 9164, "text": "His office in the Valdai region looks the same as his office in Sochi, or his office outside of Moscow in Novogorod."}, {"time": 9174, "text": "They're made up to look very similar on Zoom."}, {"time": 9178, "text": "And sure, some signs they're looking, where is it?"}, {"time": 9182, "text": "But maybe they don't know."}, {"time": 9185, "text": "And so they're not sure."}, {"time": 9186, "text": "Maybe they don't know, and so you're gonna move on him, and you're gonna jump him in his Kremlin, his dacha outside Moscow."}, {"time": 9197, "text": "And it turns out he's in Sochi, or vice versa."}, {"time": 9200, "text": "And it turns out the FSO is loyal to him and won't let you anyway."}, {"time": 9204, "text": "So Lex, we don't know, but we watch this FSO really closely, and we think that the elites, if not Putin, but maybe Putin too, understand Navalny as a really big potential political card that they could play."}, {"time": 9221, "text": "And one last question, the biggest question."}, {"time": 9226, "text": "You studied some of the darkest aspects of human history, human nature."}, {"time": 9232, "text": "Let me ask the why question."}, {"time": 9237, "text": "What's the meaning of our existence, our life here on Earth?"}, {"time": 9241, "text": "What are we humans trying to get at here?"}, {"time": 9244, "text": "I can't answer that question either, but I can say that having a purposeful life is actually not that hard."}, {"time": 9255, "text": "You can't, you're not Gandhi, right?"}, {"time": 9258, "text": "You're not President Roosevelt."}, {"time": 9261, "text": "You're not gonna transform a country or a civilization or become immortal because of your courage and your insight and your genius at critical moments."}, {"time": 9275, "text": "But you live in an environment, you're in a school, you're in a workplace, you're somewhere where you can affect other people in a positive way."}, {"time": 9286, "text": "It can be not just about yourself, but it can be about them."}, {"time": 9291, "text": "And you can have a positive impact on other people's lives through the work that you do, whether that's your employment or your charity or your spare time or your work time."}, {"time": 9303, "text": "It can be by modeling proper behavior, right?"}, {"time": 9307, "text": "Admitting your mistakes, hard to do, but necessary."}, {"time": 9312, "text": "Remembering that you don't know everything, you can't predict the future, but you don't even know everything in your areas of expertise."}, {"time": 9320, "text": "Painfully reminded of that humility at times, but remind yourself too."}, {"time": 9325, "text": "So you can lead a life that can show others what good values are, and you can lead a life that dedicates yourself not only to your own material wellbeing, but to the wellbeing and to the development of others around you."}, {"time": 9344, "text": "And it can be on a humble scale."}, {"time": 9347, "text": "It can be in a small classroom or a small workplace, a small work team, but it can be done."}, {"time": 9354, "text": "And you can be reminded that having a positive impact even on one other person gives far greater meaning to your own life."}, {"time": 9364, "text": "And it's profoundly satisfying, much more satisfying than the attention you might get, let's say on social media or awards you might receive."}, {"time": 9375, "text": "There's nothing wrong with pursuing those."}, {"time": 9377, "text": "People pursue them and it's a free society."}, {"time": 9381, "text": "But leading a purposeful life intentionally is possible."}]}]