[{"title": "François Chollet: Measures of Intelligence | Lex Fridman Podcast #120", "id": "PUAdj3w3wO4", "quotes": [{"time": 300, "text": "And now here's my conversation with Francois Chalet."}, {"time": 305, "text": "What philosophers, thinkers, or ideas had a big impact on you growing up and today?"}, {"time": 310, "text": "So one author that had a big impact on me when I read his books as a teenager was Jean Piaget, who is a Swiss psychologist, is considered to be the father of developmental psychology."}, {"time": 325, "text": "And he has a large body of work about basically how intelligence develops in children."}, {"time": 333, "text": "And so it's very old work, like most of it is from the 1930s, 1940s."}, {"time": 339, "text": "So it's not quite up to date."}, {"time": 340, "text": "It's actually superseded by many newer developments in developmental psychology."}, {"time": 345, "text": "But to me, it was very interesting, very striking, and actually shaped the early ways in which I started thinking about the mind and the development of intelligence as a teenager."}, {"time": 356, "text": "His actual ideas or the way he thought about it or just the fact that you could think about the developing mind at all?"}, {"time": 361, "text": "I guess both."}, {"time": 362, "text": "Jean Piaget is the author that really introduced me to the notion that intelligence and the mind is something that you construct throughout your life and that children construct it in stages."}, {"time": 375, "text": "And I thought that was a very interesting idea, which is, of course, very relevant to AI, to building artificial minds."}, {"time": 383, "text": "Another book that I read around the same time that had a big impact on me, and there was actually a little bit of overlap with Jean Piaget as well, and I read it around the same time, is Geoff Hawking's On Intelligence, which is a classic."}, {"time": 399, "text": "And he has this vision of the mind as a multi scale hierarchy of temporal prediction modules."}, {"time": 407, "text": "And these ideas really resonated with me, like the notion of a modular hierarchy of potentially compression functions or prediction functions."}, {"time": 421, "text": "I thought it was really, really interesting, and it shaped the way I started thinking about how to build minds."}, {"time": 429, "text": "The hierarchical nature, which aspect?"}, {"time": 433, "text": "Also, he's a neuroscientist, so he was thinking actual, he was basically talking about how our mind works."}, {"time": 440, "text": "Yeah, the notion that cognition is prediction was an idea that was kind of new to me at the time and that I really loved at the time."}, {"time": 447, "text": "And yeah, and the notion that there are multiple scales of processing in the brain."}, {"time": 455, "text": "The hierarchy."}, {"time": 457, "text": "This was before deep learning."}, {"time": 458, "text": "These ideas of hierarchies in AI have been around for a long time, even before on intelligence."}, {"time": 465, "text": "They've been around since the 1980s."}, {"time": 468, "text": "And yeah, that was before deep learning."}, {"time": 470, "text": "But of course, I think these ideas really found their practical implementation in deep learning."}, {"time": 478, "text": "What about the memory side of things?"}, {"time": 479, "text": "I think he was talking about knowledge representation."}, {"time": 482, "text": "Do you think about memory a lot?"}, {"time": 484, "text": "One way you can think of neural networks as a kind of memory, you're memorizing things, but it doesn't seem to be the kind of memory that's in our brains, or it doesn't have the same rich complexity, long term nature that's in our brains."}, {"time": 500, "text": "Yes, the brain is more of a sparse access memory so that you can actually retrieve very precisely like bits of your experience."}, {"time": 510, "text": "The retrieval aspect, you can like introspect, you can ask yourself questions."}, {"time": 515, "text": "I guess you can program your own memory and language is actually the tool you use to do that."}, {"time": 521, "text": "I think language is a kind of operating system for the mind and use language."}, {"time": 527, "text": "Well, one of the uses of language is as a query that you run over your own memory, use words as keys to retrieve specific experiences or specific concepts, specific thoughts."}, {"time": 540, "text": "Like language is a way you store thoughts, not just in writing, in the physical world, but also in your own mind."}, {"time": 546, "text": "And it's also how you retrieve them."}, {"time": 547, "text": "Like, imagine if you didn't have language, then you would have to, you would not really have a self, internally triggered way of retrieving past thoughts."}, {"time": 558, "text": "You would have to rely on external experiences."}, {"time": 561, "text": "For instance, you see a specific site, you smell a specific smell and that brings up memories, but you would not really have a way to deliberately access these memories without language."}, {"time": 572, "text": "Well, the interesting thing you mentioned is you can also program the memory."}, {"time": 577, "text": "You can change it probably with language."}, {"time": 579, "text": "Yeah, using language, yes."}, {"time": 581, "text": "Well, let me ask you a Chomsky question, which is like, first of all, do you think language is like fundamental, like there's turtles, what's at the bottom of the turtles?"}, {"time": 594, "text": "They don't go, it can't be turtles all the way down."}, {"time": 597, "text": "Is language at the bottom of cognition of everything?"}, {"time": 600, "text": "Is like language, the fundamental aspect of like what it means to be a thinking thing?"}, {"time": 612, "text": "I think language is."}, {"time": 612, "text": "You disagree with Norm Chomsky?"}, {"time": 614, "text": "Yes, I think language is a layer on top of cognition."}, {"time": 617, "text": "So it is fundamental to cognition in the sense that to use a computing metaphor, I see language as the operating system of the brain, of the human mind."}, {"time": 629, "text": "And the operating system is a layer on top of the computer."}, {"time": 633, "text": "The computer exists before the operating system, but the operating system is how you make it truly useful."}, {"time": 639, "text": "And the operating system is most likely Windows, not Linux, because language is messy."}, {"time": 645, "text": "Yeah, it's messy and it's pretty difficult to inspect it, introspect it."}, {"time": 653, "text": "How do you think about language?"}, {"time": 655, "text": "Like we use actually sort of human interpretable language, but is there something like a deeper, that's closer to like logical type of statements?"}, {"time": 668, "text": "Like, yeah, what is the nature of language, do you think?"}, {"time": 676, "text": "Like is there something deeper than like the syntactic rules we construct?"}, {"time": 679, "text": "Is there something that doesn't require utterances or writing or so on?"}, {"time": 685, "text": "Are you asking about the possibility that there could exist languages for thinking that are not made of words?"}, {"time": 694, "text": "I think, so the mind is layers, right?"}, {"time": 698, "text": "And language is almost like the outermost, the uppermost layer."}, {"time": 704, "text": "But before we think in words, I think we think in terms of emotion in space and we think in terms of physical actions."}, {"time": 714, "text": "And I think babies in particular, probably expresses thoughts in terms of the actions that they've seen or that they can perform and in terms of motions of objects in their environment before they start thinking in terms of words."}, {"time": 730, "text": "It's amazing to think about that as the building blocks of language."}, {"time": 736, "text": "So like the kind of actions and ways the babies see the world as like more fundamental than the beautiful Shakespearean language you construct on top of it."}, {"time": 748, "text": "And we probably don't have any idea what that looks like, right?"}, {"time": 751, "text": "Like what, because it's important for them trying to engineer it into AI systems."}, {"time": 758, "text": "I think visual analogies and motion is a fundamental building block of the mind."}, {"time": 765, "text": "And you actually see it reflected in language."}, {"time": 768, "text": "Like language is full of special metaphors."}, {"time": 771, "text": "And when you think about things, I consider myself very much as a visual thinker."}, {"time": 777, "text": "You often express these thoughts by using things like visualizing concepts in 2D space or like you solve problems by imagining yourself navigating a concept space."}, {"time": 794, "text": "So I don't know if you have this sort of experience."}, {"time": 797, "text": "You said visualizing concept space."}, {"time": 799, "text": "So like, so I certainly think about, I certainly visualize mathematical concepts, but you mean like in concept space, visually you're embedding ideas into a three dimensional space you can explore with your mind essentially?"}, {"time": 818, "text": "You should be more like 2D, but yeah."}, {"time": 820, "text": "2D?"}, {"time": 822, "text": "You're a flatlander."}, {"time": 823, "text": "You're, okay."}, {"time": 825, "text": "No, I do not."}, {"time": 829, "text": "I always have to, before I jump from concept to concept, I have to put it back down on paper."}, {"time": 837, "text": "It has to be on paper."}, {"time": 838, "text": "I can only travel on 2D paper, not inside my mind."}, {"time": 843, "text": "You're able to move inside your mind."}, {"time": 845, "text": "But even if you're writing like a paper, for instance, don't you have like a spatial representation of your paper?"}, {"time": 851, "text": "Like you visualize where ideas lie topologically in relationship to other ideas, kind of like a subway map of the ideas in your paper."}, {"time": 863, "text": "I mean, there is, in papers, I don't know about you, but it feels like there's a destination."}, {"time": 872, "text": "There's a key idea that you want to arrive at."}, {"time": 876, "text": "And a lot of it is in the fog and you're trying to kind of, it's almost like, what's that called when you do a path planning search from both directions, from the start and from the end."}, {"time": 892, "text": "And then you find, you do like shortest path, but like, you know, in game playing, you do this with like A star from both sides."}, {"time": 901, "text": "And you see where we're on the join."}, {"time": 903, "text": "Yeah, so you kind of do, at least for me, I think like, first of all, just exploring from the start from like first principles, what do I know, what can I start proving from that, right?"}, {"time": 915, "text": "And then from the destination, if you start backtracking, like if I want to show some kind of sets of ideas, what would it take to show them and you kind of backtrack, but like, yeah, I don't think I'm doing all that in my mind though."}, {"time": 931, "text": "Like I'm putting it down on paper."}, {"time": 933, "text": "Do you use mind maps to organize your ideas?"}, {"time": 935, "text": "Yeah, I like mind maps."}, {"time": 937, "text": "Let's get into this, because I've been so jealous of people."}, {"time": 941, "text": "I haven't really tried it."}, {"time": 942, "text": "I've been jealous of people that seem to like, they get like this fire of passion in their eyes because everything starts making sense."}, {"time": 950, "text": "It's like Tom Cruise in the movie was like moving stuff around."}, {"time": 953, "text": "Some of the most brilliant people I know use mind maps."}, {"time": 955, "text": "I haven't tried really."}, {"time": 957, "text": "Can you explain what the hell a mind map is?"}, {"time": 961, "text": "I guess mind map is a way to make kind of like the mess inside your mind to just put it on paper so that you gain more control over it."}, {"time": 970, "text": "It's a way to organize things on paper and as kind of like a consequence of organizing things on paper, they start being more organized inside your own mind."}, {"time": 980, "text": "So what does that look like?"}, {"time": 981, "text": "You put, like, do you have an example?"}, {"time": 983, "text": "Like what's the first thing you write on paper?"}, {"time": 987, "text": "What's the second thing you write?"}, {"time": 988, "text": "I mean, typically you draw a mind map to organize the way you think about a topic."}, {"time": 994, "text": "So you would start by writing down like the key concept about that topic."}, {"time": 999, "text": "Like you would write intelligence or something, and then you would start adding associative connections."}, {"time": 1005, "text": "Like what do you think about when you think about intelligence?"}, {"time": 1008, "text": "What do you think are the key elements of intelligence?"}, {"time": 1010, "text": "So maybe you would have language, for instance, and you'd have motion."}, {"time": 1013, "text": "And so you would start drawing notes with these things."}, {"time": 1015, "text": "And then you would see what do you think about when you think about motion and so on."}, {"time": 1019, "text": "And you would go like that, like a tree."}, {"time": 1020, "text": "Is it a tree mostly or is it a graph too, like a tree?"}, {"time": 1025, "text": "Oh, it's more of a graph than a tree."}, {"time": 1027, "text": "And it's not limited to just writing down words."}, {"time": 1033, "text": "You can also draw things."}, {"time": 1035, "text": "And it's not supposed to be purely hierarchical, right?"}, {"time": 1041, "text": "The point is that once you start writing it down, you can start reorganizing it so that it makes more sense, so that it's connected in a more effective way."}, {"time": 1049, "text": "See, but I'm so OCD that you just mentioned intelligence and language and motion."}, {"time": 1057, "text": "I would start becoming paranoid that the categorization isn't perfect."}, {"time": 1061, "text": "Like that I would become paralyzed with the mind map that like this may not be."}, {"time": 1069, "text": "So like the, even though you're just doing associative kind of connections, there's an implied hierarchy that's emerging."}, {"time": 1078, "text": "And I would start becoming paranoid that it's not the proper hierarchy."}, {"time": 1082, "text": "So you're not just, one way to see mind maps is you're putting thoughts on paper."}, {"time": 1087, "text": "It's like a stream of consciousness, but then you can also start getting paranoid."}, {"time": 1092, "text": "Well, is this the right hierarchy?"}, {"time": 1095, "text": "Sure, which it's mind maps, your mind map."}, {"time": 1097, "text": "You're free to draw anything you want."}, {"time": 1099, "text": "You're free to draw any connection you want."}, {"time": 1100, "text": "And you can just make a different mind map if you think the central node is not the right node."}, {"time": 1106, "text": "Yeah, I suppose there's a fear of being wrong."}, {"time": 1109, "text": "If you want to organize your ideas by writing down what you think, which I think is very effective."}, {"time": 1117, "text": "Like how do you know what you think about something if you don't write it down, right?"}, {"time": 1122, "text": "If you do that, the thing is that it imposes much more syntactic structure over your ideas, which is not required with mind maps."}, {"time": 1131, "text": "So mind map is kind of like a lower level, more freehand way of organizing your thoughts."}, {"time": 1137, "text": "And once you've drawn it, then you can start actually voicing your thoughts in terms of, you know, paragraphs."}, {"time": 1145, "text": "It's a two dimensional aspect of layout too, right?"}, {"time": 1149, "text": "It's a kind of flower, I guess, you start."}, {"time": 1152, "text": "There's usually, you want to start with a central concept?"}, {"time": 1156, "text": "Then you move out."}, {"time": 1157, "text": "Typically it ends up more like a subway map."}, {"time": 1159, "text": "So it ends up more like a graph, a topological graph without a root node."}, {"time": 1163, "text": "Yeah, so like in a subway map, there are some nodes that are more connected than others."}, {"time": 1167, "text": "And there are some nodes that are more important than others."}, {"time": 1170, "text": "So there are destinations, but it's not going to be purely like a tree, for instance."}, {"time": 1176, "text": "Yeah, it's fascinating to think that if there's something to that about the way our mind thinks."}, {"time": 1182, "text": "By the way, I just kind of remembered obvious thing that I have probably thousands of documents in Google Doc at this point, that are bullet point lists, which is, you can probably map a mind map to a bullet point list."}, {"time": 1201, "text": "It's the same, it's a, no, it's not, it's a tree."}, {"time": 1205, "text": "It's a tree, yeah."}, {"time": 1206, "text": "So I create trees, but also they don't have the visual element."}, {"time": 1210, "text": "Like, I guess I'm comfortable with the structure."}, {"time": 1213, "text": "It feels like the narrowness, the constraints feel more comforting."}, {"time": 1218, "text": "If you have thousands of documents with your own thoughts in Google Docs, why don't you write some kind of search engine, like maybe a mind map, a piece of software, mind mapping software, where you write down a concept and then it gives you sentences or paragraphs from your thousand Google Docs document that match this concept."}, {"time": 1241, "text": "The problem is it's so deeply, unlike mind maps, it's so deeply rooted in natural language."}, {"time": 1248, "text": "So it's not, it's not semantically searchable, I would say, because the categories are very, you kind of mentioned intelligence, language, and motion."}, {"time": 1260, "text": "They're very strong, semantic."}, {"time": 1262, "text": "Like, it feels like the mind map forces you to be semantically clear and specific."}, {"time": 1269, "text": "The bullet points list I have are sparse, desperate thoughts that poetically represent a category like motion, as opposed to saying motion."}, {"time": 1285, "text": "So unfortunately, that's the same problem with the internet."}, {"time": 1288, "text": "That's why the idea of semantic web is difficult to get."}, {"time": 1292, "text": "It's, most language on the internet is a giant mess of natural language that's hard to interpret, which, so do you think there's something to mind maps as, you actually originally brought it up as we were talking about kind of cognition and language."}, {"time": 1313, "text": "Do you think there's something to mind maps about how our brain actually deals, like think reasons about things?"}, {"time": 1322, "text": "I think it's reasonable to assume that there is some level of topological processing in the brain, that the brain is very associative in nature."}, {"time": 1335, "text": "And I also believe that a topological space is a better medium to encode thoughts than a geometric space."}, {"time": 1347, "text": "So I think... What's the difference in a topological and a geometric space?"}, {"time": 1351, "text": "Well, if you're talking about topologies, then points are either connected or not."}, {"time": 1356, "text": "So a topology is more like a subway map."}, {"time": 1358, "text": "And geometry is when you're interested in the distance between things."}, {"time": 1363, "text": "And in a subway map, you don't really have the concept of distance."}, {"time": 1366, "text": "You only have the concept of whether there is a train going from station A to station B."}, {"time": 1372, "text": "And what we do in deep learning is that we're actually dealing with geometric spaces."}, {"time": 1377, "text": "We are dealing with concept vectors, word vectors, that have a distance between them to express in terms of that product."}, {"time": 1385, "text": "So we are not really building topological models usually."}, {"time": 1391, "text": "Like distance is a fundamental importance in deep learning."}, {"time": 1396, "text": "I mean, it's the continuous aspect of it."}, {"time": 1399, "text": "Yes, because everything is a vector and everything has to be a vector because everything has to be differentiable."}, {"time": 1404, "text": "If your space is discrete, it's no longer differentiable."}, {"time": 1406, "text": "You cannot do deep learning in it anymore."}, {"time": 1409, "text": "Well, you could, but you can only do it by embedding it in a bigger continuous space."}, {"time": 1415, "text": "So if you do topology in the context of deep learning, you have to do it by embedding your topology in the geometry."}, {"time": 1422, "text": "Well, let me zoom out for a second."}, {"time": 1426, "text": "Let's get into your paper on the measure of intelligence that you put out in 2019."}, {"time": 1437, "text": "Yeah, remember 2019?"}, {"time": 1439, "text": "That was a different time."}, {"time": 1441, "text": "Yeah, I remember."}, {"time": 1442, "text": "I still remember."}, {"time": 1446, "text": "It feels like a different world."}, {"time": 1449, "text": "You could travel, you could actually go outside and see friends."}, {"time": 1456, "text": "Let me ask the most absurd question."}, {"time": 1458, "text": "I think there's some nonzero probability there'll be a textbook one day, like 200 years from now on artificial intelligence, or it'll be called like just intelligence cause humans will already be gone."}, {"time": 1472, "text": "It'll be your picture with a quote."}, {"time": 1475, "text": "This is, you know, one of the early biological systems would consider the nature of intelligence and there'll be like a definition of how they thought about intelligence."}, {"time": 1485, "text": "Which is one of the things you do in your paper on measure intelligence is to ask like, well, what is intelligence and how to test for intelligence and so on."}, {"time": 1495, "text": "So is there a spiffy quote about what is intelligence?"}, {"time": 1501, "text": "What is the definition of intelligence according to Francois Chollet?"}, {"time": 1506, "text": "Yeah, so do you think the super intelligent AIs of the future will want to remember us the way we remember humans from the past?"}, {"time": 1516, "text": "And do you think they will be, you know, they won't be ashamed of having a biological origin?"}, {"time": 1522, "text": "No, I think it would be a niche topic."}, {"time": 1524, "text": "It won't be that interesting, but it'll be like the people that study in certain contexts like historical civilization that no longer exists, the Aztecs and so on."}, {"time": 1536, "text": "That's how it'll be seen."}, {"time": 1538, "text": "And it'll be study in also the context on social media."}, {"time": 1542, "text": "There'll be hashtags about the atrocity committed to human beings when the robots finally got rid of them."}, {"time": 1552, "text": "Like it was a mistake."}, {"time": 1555, "text": "You'll be seen as a giant mistake, but ultimately in the name of progress and it created a better world because humans were over consuming the resources and they were not very rational and were destructive in the end in terms of productivity and putting more love in the world."}, {"time": 1573, "text": "And so within that context, there'll be a chapter about these biological systems."}, {"time": 1577, "text": "It seems to have a very detailed vision of that hit here."}, {"time": 1580, "text": "You should write a sci fi novel about it."}, {"time": 1582, "text": "I'm working on a sci fi novel currently, yes."}, {"time": 1588, "text": "Self published, yeah."}, {"time": 1589, "text": "The definition of intelligence."}, {"time": 1590, "text": "So intelligence is the efficiency with which you acquire new skills at tasks that you did not previously know about, that you did not prepare for, right?"}, {"time": 1604, "text": "So intelligence is not skill itself."}, {"time": 1607, "text": "It's not what you know, it's not what you can do."}, {"time": 1610, "text": "It's how well and how efficiently you can learn new things."}, {"time": 1614, "text": "New things."}, {"time": 1616, "text": "The idea of newness there seems to be fundamentally important."}, {"time": 1622, "text": "So you would see intelligence on display, for instance."}, {"time": 1625, "text": "Whenever you see a human being or an AI creature adapt to a new environment that it does not see before, that its creators did not anticipate."}, {"time": 1636, "text": "When you see adaptation, when you see improvisation, when you see generalization, that's intelligence."}, {"time": 1642, "text": "In reverse, if you have a system that when you put it in a slightly new environment, it cannot adapt, it cannot improvise, it cannot deviate from what it's hard coded to do or what it has been trained to do, that is a system that is not intelligent."}, {"time": 1661, "text": "There's actually a quote from Einstein that captures this idea, which is, the measure of intelligence is the ability to change."}, {"time": 1670, "text": "I like that quote."}, {"time": 1671, "text": "I think it captures at least part of this idea."}, {"time": 1674, "text": "You know, there might be something interesting about the difference between your definition and Einstein's."}, {"time": 1679, "text": "I mean, he's just being Einstein and clever, but acquisition of new ability to deal with new things versus ability to just change."}, {"time": 1694, "text": "What's the difference between those two things?"}, {"time": 1696, "text": "So just change in itself."}, {"time": 1699, "text": "Do you think there's something to that?"}, {"time": 1701, "text": "Just being able to change."}, {"time": 1703, "text": "Yes, being able to adapt."}, {"time": 1705, "text": "So not change, but certainly change its direction."}, {"time": 1710, "text": "Being able to adapt yourself to your environment."}, {"time": 1714, "text": "Whatever the environment is."}, {"time": 1715, "text": "That's a big part of intelligence."}, {"time": 1717, "text": "And intelligence is more precisely, you know, how efficiently you're able to adapt, how efficiently you're able to basically master your environment, how efficiently you can acquire new skills."}, {"time": 1729, "text": "And I think there's a big distinction to be drawn between intelligence, which is a process, and the output of that process, which is skill."}, {"time": 1741, "text": "So for instance, if you have a very smart human brain, so for instance, if you have a very smart human programmer that considers the game of chess, and that writes down a static program that can play chess, then the intelligence is the process of developing that program."}, {"time": 1760, "text": "But the program itself is just encoding the output artifact of that process."}, {"time": 1768, "text": "The program itself is not intelligent."}, {"time": 1770, "text": "And the way you tell it's not intelligent is that if you put it in a different context, you ask it to play Go or something, it's not going to be able to perform well without human involvement, because the source of intelligence, the entity that is capable of that process is the human programmer."}, {"time": 1784, "text": "So we should be able to tell the difference between the process and its output."}, {"time": 1790, "text": "We should not confuse the output and the process."}, {"time": 1793, "text": "It's the same as, you know, do not confuse a road building company and one specific road, because one specific road takes you from point A to point B, but a road building company can take you from, can make a path from anywhere to anywhere else."}, {"time": 1808, "text": "Yeah, that's beautifully put, but it's also to play devil's advocate a little bit."}, {"time": 1815, "text": "You know, it's possible that there's something more fundamental than us humans."}, {"time": 1821, "text": "So you kind of said the programmer creates the difference between the choir, the skill and the skill itself."}, {"time": 1831, "text": "There could be something like, you could argue the universe is more intelligent."}, {"time": 1836, "text": "Like the base intelligence that we should be trying to measure is something that created humans."}, {"time": 1846, "text": "We should be measuring God or the source of the universe as opposed to, like there could be a deeper intelligence."}, {"time": 1855, "text": "There's always deeper intelligence, I guess."}, {"time": 1857, "text": "You can argue that, but that does not take anything away from the fact that humans are intelligent."}, {"time": 1861, "text": "And you can tell that because they are capable of adaptation and generality."}, {"time": 1867, "text": "And you see that in particular in the fact that humans are capable of handling situations and tasks that are quite different from anything that any of our evolutionary ancestors has ever encountered."}, {"time": 1884, "text": "So we are capable of generalizing very much out of distribution, if you consider our evolutionary history as being in a way our training data."}, {"time": 1893, "text": "Of course, evolutionary biologists would argue that we're not going too far out of the distribution."}, {"time": 1897, "text": "We're like mapping the skills we've learned previously, desperately trying to like jam them into like these new situations."}, {"time": 1907, "text": "I mean, there's definitely a little bit of that, but it's pretty clear to me that we're able to, most of the things we do any given day in our modern civilization are things that are very, very different from what our ancestors a million years ago would have been doing in a given day."}, {"time": 1925, "text": "And your environment is very different."}, {"time": 1927, "text": "So I agree that everything we do, we do it with cognitive building blocks that we acquired over the course of evolution, right?"}, {"time": 1937, "text": "And that anchors our cognition to a certain context, which is the human condition very much."}, {"time": 1945, "text": "But still our mind is capable of a pretty remarkable degree of generality far beyond anything we can create in artificial systems today."}, {"time": 1954, "text": "Like the degree in which the mind can generalize from its evolutionary history, can generalize away from its evolutionary history is much greater than the degree to which a deep learning system today can generalize away from its training data."}, {"time": 1971, "text": "And like the key point you're making, which I think is quite beautiful is like, we shouldn't measure, if we're talking about measurement, we shouldn't measure the skill."}, {"time": 1981, "text": "We should measure like the creation of the new skill, the ability to create that new skill."}, {"time": 1986, "text": "But it's tempting, like it's weird because the skill is a little bit of a small window into the system."}, {"time": 1996, "text": "So whenever you have a lot of skills, it's tempting to measure the skills."}, {"time": 2001, "text": "I mean, the skill is the only thing you can objectively measure, but yeah."}, {"time": 2007, "text": "So the thing to keep in mind is that when you see skill in the human, it gives you a strong signal that that human is intelligent because you know they weren't born with that skill typically."}, {"time": 2022, "text": "Like you see a very strong chess player, maybe you're a very strong chess player yourself."}, {"time": 2027, "text": "I think you're saying that because I'm Russian and now you're prejudiced, you assume."}, {"time": 2033, "text": "All Russians are good at chess."}, {"time": 2034, "text": "I'm biased, exactly."}, {"time": 2035, "text": "I'm biased, yeah."}, {"time": 2036, "text": "Well, you're definitely biased."}, {"time": 2040, "text": "So if you see a very strong chess player, you know they weren't born knowing how to play chess."}, {"time": 2045, "text": "So they had to acquire that skill with their limited resources, with their limited lifetime."}, {"time": 2050, "text": "And they did that because they are generally intelligent."}, {"time": 2055, "text": "And so they may as well have acquired any other skill."}, {"time": 2058, "text": "You know they have this potential."}, {"time": 2061, "text": "And on the other hand, if you see a computer playing chess, you cannot make the same assumptions because you cannot just assume the computer is generally intelligent."}, {"time": 2070, "text": "The computer may be born knowing how to play chess in the sense that it may have been programmed by a human that has understood chess for the computer and that has just encoded the output of that understanding in a static program."}, {"time": 2086, "text": "And that program is not intelligent."}, {"time": 2089, "text": "So let's zoom out just for a second and say like, what is the goal on the measure of intelligence paper?"}, {"time": 2097, "text": "Like what do you hope to achieve with it?"}, {"time": 2099, "text": "So the goal of the paper is to clear up some longstanding misunderstandings about the way we've been conceptualizing intelligence in the AI community and in the way we've been evaluating progress in AI."}, {"time": 2116, "text": "There's been a lot of progress recently in machine learning and people are extrapolating from that progress that we are about to solve general intelligence."}, {"time": 2126, "text": "And if you want to be able to evaluate these statements, you need to precisely define what you're talking about when you're talking about general intelligence."}, {"time": 2135, "text": "And you need a formal way, a reliable way to measure how much intelligence, how much general intelligence a system processes."}, {"time": 2145, "text": "And ideally this measure of intelligence should be actionable."}, {"time": 2150, "text": "So it should not just describe what intelligence is."}, {"time": 2154, "text": "It should not just be a binary indicator that tells you the system is intelligent or it isn't."}, {"time": 2161, "text": "It should be actionable."}, {"time": 2163, "text": "It should have explanatory power, right?"}, {"time": 2165, "text": "So you could use it as a feedback signal."}, {"time": 2168, "text": "It would show you the way towards building more intelligent systems."}, {"time": 2173, "text": "So at the first level, you draw a distinction between two divergent views of intelligence."}, {"time": 2181, "text": "As we just talked about, intelligence is a collection of task specific skills and a general learning ability."}, {"time": 2189, "text": "So what's the difference between kind of this memorization of skills and a general learning ability?"}, {"time": 2197, "text": "We've talked about it a little bit, but can you try to linger on this topic for a bit?"}, {"time": 2203, "text": "Yeah, so the first part of the paper is an assessment of the different ways we've been thinking about intelligence and the different ways we've been evaluating progress in AI."}, {"time": 2214, "text": "And this tree of cognitive sciences has been shaped by two views of the human mind."}, {"time": 2221, "text": "And one view is the evolutionary psychology view in which the mind is a collection of fairly static special purpose ad hoc mechanisms that have been hard coded by evolution over our history as a species for a very long time."}, {"time": 2242, "text": "And early AI researchers, people like Marvin Minsky, for instance, they clearly subscribed to this view."}, {"time": 2253, "text": "And they saw the mind as a kind of collection of static programs similar to the programs they would run on like mainframe computers."}, {"time": 2263, "text": "And in fact, I think they very much understood the mind through the metaphor of the mainframe computer because that was the tool they were working with, right?"}, {"time": 2273, "text": "And so you had these static programs, this collection of very different static programs operating over a database like memory."}, {"time": 2280, "text": "And in this picture, learning was not very important."}, {"time": 2283, "text": "Learning was considered to be just memorization."}, {"time": 2285, "text": "And in fact, learning is basically not featured in AI textbooks until the 1980s with the rise of machine learning."}, {"time": 2296, "text": "It's kind of fun to think about that learning was the outcast."}, {"time": 2301, "text": "Like the weird people working on learning, like the mainstream AI world was, I mean, I don't know what the best term is, but it's non learning."}, {"time": 2313, "text": "It was seen as like reasoning would not be learning based."}, {"time": 2317, "text": "Yes, it was considered that the mind was a collection of programs that were primarily logical in nature."}, {"time": 2326, "text": "And that's all you needed to do to create a mind was to write down these programs and they would operate over knowledge, which would be stored in some kind of database."}, {"time": 2335, "text": "And as long as your database would encompass, you know, everything about the world and your logical rules were comprehensive, then you would have a mind."}, {"time": 2344, "text": "So the other view of the mind is the brain as a sort of blank slate, right?"}, {"time": 2351, "text": "This is a very old idea."}, {"time": 2353, "text": "You find it in John Locke's writings."}, {"time": 2356, "text": "This is the tabula rasa."}, {"time": 2359, "text": "And this is this idea that the mind is some kind of like information sponge that starts empty, that starts blank."}, {"time": 2367, "text": "And that absorbs knowledge and skills from experience, right?"}, {"time": 2374, "text": "So it's a sponge that reflects the complexity of the world, the complexity of your life experience, essentially."}, {"time": 2381, "text": "That everything you know and everything you can do is a reflection of something you found in the outside world, essentially."}, {"time": 2389, "text": "So this is an idea that's very old."}, {"time": 2391, "text": "That was not very popular, for instance, in the 1970s."}, {"time": 2396, "text": "But that gained a lot of vitality recently with the rise of connectionism, in particular deep learning."}, {"time": 2402, "text": "And so today, deep learning is the dominant paradigm in AI."}, {"time": 2406, "text": "And I feel like lots of AI researchers are conceptualizing the mind via a deep learning metaphor."}, {"time": 2414, "text": "Like they see the mind as a kind of randomly initialized neural network that starts blank when you're born."}, {"time": 2422, "text": "And then that gets trained via exposure to trained data that acquires knowledge and skills via exposure to trained data."}, {"time": 2429, "text": "By the way, it's a small tangent."}, {"time": 2432, "text": "I feel like people who are thinking about intelligence are not conceptualizing it that way."}, {"time": 2439, "text": "I actually haven't met too many people who believe that a neural network will be able to reason, who seriously think that rigorously."}, {"time": 2451, "text": "Because I think it's actually an interesting worldview."}, {"time": 2454, "text": "And we'll talk about it more, but it's been impressive what neural networks have been able to accomplish."}, {"time": 2462, "text": "And to me, I don't know, you might disagree, but it's an open question whether like scaling size eventually might lead to incredible results to us mere humans will appear as if it's general."}, {"time": 2477, "text": "I mean, if you ask people who are seriously thinking about intelligence, they will definitely not say that all you need to do is, like the mind is just a neural network."}, {"time": 2487, "text": "However, it's actually a view that's very popular, I think, in the deep learning community that many people are kind of conceptually intellectually lazy about it."}, {"time": 2497, "text": "Right, it's a, but I guess what I'm saying exactly right, it's, I mean, I haven't met many people and I think it would be interesting to meet a person who is not intellectually lazy about this particular topic and still believes that neural networks will go all the way."}, {"time": 2514, "text": "I think Yama is probably closest to that with self supervised."}, {"time": 2517, "text": "There are definitely people who argue that current deep learning techniques are already the way to general artificial intelligence."}, {"time": 2526, "text": "And that all you need to do is to scale it up to all the available trained data."}, {"time": 2532, "text": "And that's, if you look at the waves that OpenAI's GPT3 model has made, you see echoes of this idea."}, {"time": 2542, "text": "So on that topic, GPT3, similar to GPT2 actually, have captivated some part of the imagination of the public."}, {"time": 2553, "text": "There's just a bunch of hype of different kind."}, {"time": 2555, "text": "That's, I would say it's emergent."}, {"time": 2557, "text": "It's not artificially manufactured."}, {"time": 2559, "text": "It's just like people just get excited for some strange reason."}, {"time": 2563, "text": "And in the case of GPT3, which is funny, that there's, I believe, a couple months delay from release to hype."}, {"time": 2571, "text": "Maybe I'm not historically correct on that, but it feels like there was a little bit of a lack of hype and then there's a phase shift into hype."}, {"time": 2584, "text": "But nevertheless, there's a bunch of cool applications that seem to captivate the imagination of the public about what this language model that's trained in unsupervised way without any fine tuning is able to achieve."}, {"time": 2599, "text": "So what do you make of that?"}, {"time": 2600, "text": "What are your thoughts about GPT3?"}, {"time": 2602, "text": "Yeah, so I think what's interesting about GPT3 is the idea that it may be able to learn new tasks after just being shown a few examples."}, {"time": 2613, "text": "So I think if it's actually capable of doing that, that's novel and that's very interesting and that's something we should investigate."}, {"time": 2619, "text": "That said, I must say, I'm not entirely convinced that we have shown it's capable of doing that."}, {"time": 2627, "text": "It's very likely, given the amount of data that the model is trained on, that what it's actually doing is pattern matching a new task you give it with a task that it's been exposed to in its trained data."}, {"time": 2640, "text": "It's just recognizing the task instead of just developing a model of the task, right?"}, {"time": 2645, "text": "But there's, sorry to interrupt, there's a parallel as to what you said before, which is it's possible to see GPT3 as like the prompts it's given as a kind of SQL query into this thing that it's learned, similar to what you said before, which is language is used to query the memory."}, {"time": 2664, "text": "So is it possible that neural network is a giant memorization thing, but then if it gets sufficiently giant, it'll memorize sufficiently large amounts of things in the world or it becomes, or intelligence becomes a querying machine?"}, {"time": 2680, "text": "I think it's possible that a significant chunk of intelligence is this giant associative memory."}, {"time": 2688, "text": "I definitely don't believe that intelligence is just a giant associative memory, but it may well be a big component."}, {"time": 2697, "text": "So do you think GPT3, 4, 5, GPT10 will eventually, like, what do you think, where's the ceiling?"}, {"time": 2708, "text": "Do you think you'll be able to reason?"}, {"time": 2711, "text": "No, that's a bad question."}, {"time": 2714, "text": "Like, what is the ceiling is the better question."}, {"time": 2717, "text": "How well is it gonna scale?"}, {"time": 2718, "text": "How good is GPTN going to be?"}, {"time": 2722, "text": "So I believe GPTN is gonna."}, {"time": 2725, "text": "GPTN."}, {"time": 2726, "text": "Is gonna improve on the strength of GPT2 and 3, which is it will be able to generate, you know, ever more plausible text in context."}, {"time": 2737, "text": "Just monotonically increasing performance."}, {"time": 2741, "text": "Yes, if you train a bigger model on more data, then your text will be increasingly more context aware and increasingly more plausible in the same way that GPT3 is much better at generating plausible text compared to GPT2."}, {"time": 2757, "text": "But that said, I don't think just scaling up the model to more transformer layers and more trained data is gonna address the flaws of GPT3, which is that it can generate plausible text, but that text is not constrained by anything else other than plausibility."}, {"time": 2775, "text": "So in particular, it's not constrained by factualness or even consistency, which is why it's very easy to get GPT3 to generate statements that are factually untrue."}, {"time": 2786, "text": "Or to generate statements that are even self contradictory."}, {"time": 2790, "text": "Because it's only goal is plausibility, and it has no other constraints."}, {"time": 2797, "text": "It's not constrained to be self consistent, for instance."}, {"time": 2801, "text": "And so for this reason, one thing that I thought was very interesting with GPT3 is that you can predetermine the answer it will give you by asking the question in a specific way, because it's very responsive to the way you ask the question."}, {"time": 2815, "text": "Since it has no understanding of the content of the question."}, {"time": 2821, "text": "And if you have the same question in two different ways that are basically adversarially engineered to produce certain answer, you will get two different answers, two contradictory answers."}, {"time": 2834, "text": "It's very susceptible to adversarial attacks, essentially."}, {"time": 2837, "text": "So in general, the problem with these models, these generative models, is that they are very good at generating plausible text, but that's just not enough."}, {"time": 2853, "text": "I think one avenue that would be very interesting to make progress is to make it possible to write programs over the latent space that these models operate on."}, {"time": 2865, "text": "That you would rely on these self supervised models to generate a sort of like pool of knowledge and concepts and common sense."}, {"time": 2875, "text": "And then you would be able to write explicit reasoning programs over it."}, {"time": 2881, "text": "Because the current problem with GPT3 is that it can be quite difficult to get it to do what you want to do."}, {"time": 2889, "text": "If you want to turn GPT3 into products, you need to put constraints on it."}, {"time": 2894, "text": "You need to force it to obey certain rules."}, {"time": 2899, "text": "So you need a way to program it explicitly."}, {"time": 2902, "text": "Yeah, so if you look at its ability to do program synthesis, it generates, like you said, something that's plausible."}, {"time": 2909, "text": "Yeah, so if you try to make it generate programs, it will perform well for any program that it has seen in its training data."}, {"time": 2918, "text": "But because program space is not interpretive, right?"}, {"time": 2922, "text": "It's not going to be able to generalize to problems it hasn't seen before."}, {"time": 2928, "text": "Now that's currently, do you think sort of an absurd, but I think useful, I guess, intuition builder is, you know, the GPT3 has 175 billion parameters."}, {"time": 2947, "text": "Human brain has 100, has about a thousand times that or more in terms of number of synapses."}, {"time": 2956, "text": "Do you think, obviously, very different kinds of things, but there is some degree of similarity."}, {"time": 2966, "text": "Do you think, what do you think GPT will look like when it has 100 trillion parameters?"}, {"time": 2974, "text": "You think our conversation might be in nature different?"}, {"time": 2979, "text": "Like, because you've criticized GPT3 very effectively now."}, {"time": 2986, "text": "So to begin with, the bottleneck with scaling up GPT3, GPT models, generative pre trained transformer models, is not going to be the size of the model or how long it takes to train it."}, {"time": 2999, "text": "The bottleneck is going to be the trained data because OpenAI is already training GPT3 on a core of basically the entire web, right?"}, {"time": 3008, "text": "And that's a lot of data."}, {"time": 3009, "text": "So you could imagine training on more data than that, like Google could train on more data than that, but it would still be only incrementally more data."}, {"time": 3017, "text": "And I don't recall exactly how much more data GPT3 was trained on compared to GPT2, but it's probably at least like a hundred, maybe even a thousand X. I don't have the exact number."}, {"time": 3028, "text": "You're not going to be able to train a model on a hundred more data than what you're already doing."}, {"time": 3035, "text": "So it's easier to think of compute as a bottleneck and then arguing that we can remove that bottleneck."}, {"time": 3041, "text": "But we can remove the compute bottleneck."}, {"time": 3043, "text": "I don't think it's a big problem."}, {"time": 3044, "text": "If you look at the pace at which we've improved the efficiency of deep learning models in the past few years, I'm not worried about train time bottlenecks or model size bottlenecks."}, {"time": 3059, "text": "The bottleneck in the case of these generative transformer models is absolutely the trained data."}, {"time": 3065, "text": "What about the quality of the data?"}, {"time": 3068, "text": "So the quality of the data is an interesting point."}, {"time": 3070, "text": "The thing is, if you're going to want to use these models in real products, then you want to feed them data that's as high quality, as factual, I would say as unbiased as possible, that there's not really such a thing as unbiased data in the first place."}, {"time": 3090, "text": "But you probably don't want to train it on Reddit, for instance."}, {"time": 3094, "text": "It sounds like a bad plan."}, {"time": 3097, "text": "So from my personal experience, working with large scale deep learning models."}, {"time": 3102, "text": "So at some point I was working on a model at Google that's trained on 350 million labeled images."}, {"time": 3112, "text": "It's an image classification model."}, {"time": 3113, "text": "That's a lot of images."}, {"time": 3114, "text": "That's like probably most publicly available images on the web at the time."}, {"time": 3120, "text": "And it was a very noisy data set because the labels were not originally annotated by hand, by humans."}, {"time": 3128, "text": "They were automatically derived from like tags on social media, or just keywords in the same page as the image was found and so on."}, {"time": 3138, "text": "So it was very noisy."}, {"time": 3139, "text": "And it turned out that you could easily get a better model, not just by training, like if you train on more of the noisy data, you get an incrementally better model, but you very quickly hit diminishing returns."}, {"time": 3155, "text": "On the other hand, if you train on smaller data set with higher quality annotations, quality annotations that are actually made by humans, you get a better model."}, {"time": 3167, "text": "And it also takes less time to train it."}, {"time": 3171, "text": "It's the self supervised learning."}, {"time": 3173, "text": "There's a way to get better doing the automated labeling."}, {"time": 3178, "text": "Yeah, so you can enrich or refine your labels in an automated way."}, {"time": 3187, "text": "Do you have a hope for, I don't know if you're familiar with the idea of a semantic web."}, {"time": 3191, "text": "Is a semantic web just for people who are not familiar and is the idea of being able to convert the internet or be able to attach like semantic meaning to the words on the internet, the sentences, the paragraphs, to be able to convert information on the internet or some fraction of the internet into something that's interpretable by machines."}, {"time": 3219, "text": "That was kind of a dream for, I think the semantic web papers in the nineties, it's kind of the dream that, you know, the internet is full of rich, exciting information."}, {"time": 3232, "text": "Even just looking at Wikipedia, we should be able to use that as data for machines."}, {"time": 3237, "text": "And so far it's not, it's not really in a format that's available to machines."}, {"time": 3241, "text": "So no, I don't think the semantic web will ever work simply because it would be a lot of work, right?"}, {"time": 3248, "text": "To make, to provide that information in structured form."}, {"time": 3252, "text": "And there is not really any incentive for anyone to provide that work."}, {"time": 3256, "text": "So I think the way forward to make the knowledge on the web available to machines is actually something closer to unsupervised deep learning."}, {"time": 3269, "text": "So GPT3 is actually a bigger step in the direction of making the knowledge of the web available to machines than the semantic web was."}, {"time": 3276, "text": "Yeah, perhaps in a human centric sense, it feels like GPT3 hasn't learned anything that could be used to reason."}, {"time": 3290, "text": "But that might be just the early days."}, {"time": 3292, "text": "Yeah, I think that's correct."}, {"time": 3294, "text": "I think the forms of reasoning that you see it perform are basically just reproducing patterns that it has seen in string data."}, {"time": 3302, "text": "So of course, if you're trained on the entire web, then you can produce an illusion of reasoning in many different situations."}, {"time": 3310, "text": "But it will break down if it's presented with a novel situation."}, {"time": 3315, "text": "That's the open question between the illusion of reasoning and actual reasoning, yeah."}, {"time": 3319, "text": "The power to adapt to something that is genuinely new."}, {"time": 3322, "text": "Because the thing is, even imagine you had, you could train on every bit of data ever generated in the history of humanity."}, {"time": 3335, "text": "It remains, that model would be capable of anticipating many different possible situations."}, {"time": 3343, "text": "But it remains that the future is going to be something different."}, {"time": 3348, "text": "For instance, if you train a GPT3 model on data from the year 2002, for instance, and then use it today, it's going to be missing many things."}, {"time": 3358, "text": "It's going to be missing many common sense facts about the world."}, {"time": 3362, "text": "It's even going to be missing vocabulary and so on."}, {"time": 3365, "text": "Yeah, it's interesting that GPT3 even doesn't have, I think, any information about the coronavirus."}, {"time": 3374, "text": "Which is why a system that's, you tell that the system is intelligent when it's capable to adapt."}, {"time": 3382, "text": "So intelligence is going to require some amount of continuous learning."}, {"time": 3388, "text": "It's also going to require some amount of improvisation."}, {"time": 3391, "text": "It's not enough to assume that what you're going to be asked to do is something that you've seen before, or something that is a simple interpolation of things you've seen before."}, {"time": 3403, "text": "In fact, that model breaks down for even very tasks that look relatively simple from a distance, like L5 self driving, for instance."}, {"time": 3415, "text": "Google had a paper a couple of years back showing that something like 30 million different road situations were actually completely insufficient to train a driving model."}, {"time": 3429, "text": "It wasn't even L2, right?"}, {"time": 3432, "text": "That's a lot more data than the 20 or 30 hours of driving that a human needs to learn to drive, given the knowledge they've already accumulated."}, {"time": 3441, "text": "Well, let me ask you on that topic."}, {"time": 3445, "text": "Elon Musk, Tesla Autopilot, one of the only companies, I believe, is really pushing for a learning based approach."}, {"time": 3454, "text": "Are you skeptical that that kind of network can achieve level 4?"}, {"time": 3459, "text": "L4 is probably achievable."}, {"time": 3462, "text": "L5 probably not."}, {"time": 3464, "text": "What's the distinction there?"}, {"time": 3465, "text": "Is L5 is completely you can just fall asleep?"}, {"time": 3469, "text": "Yeah, L5 is basically human level."}, {"time": 3471, "text": "Well, with driving, we have to be careful saying human level, because that's the most of the drivers."}, {"time": 3477, "text": "Yeah, that's the clearest example of cars will most likely be much safer than humans in many situations where humans fail."}, {"time": 3486, "text": "It's the vice versa question."}, {"time": 3489, "text": "I'll tell you, the thing is the amount of trained data you would need to anticipate for pretty much every possible situation you learn content in the real world is such that it's not entirely unrealistic to think that at some point in the future, we'll develop a system that's trained on enough data, especially provided that we can simulate a lot of that data."}, {"time": 3512, "text": "We don't necessarily need actual cars on the road for everything."}, {"time": 3517, "text": "But it's a massive effort."}, {"time": 3519, "text": "And it turns out you can create a system that's much more adaptive, that can generalize much better if you just add explicit models of the surroundings of the car."}, {"time": 3533, "text": "And if you use deep learning for what it's good at, which is to provide perceptive information."}, {"time": 3539, "text": "So in general, deep learning is a way to encode perception and a way to encode intuition."}, {"time": 3545, "text": "But it is not a good medium for any sort of explicit reasoning."}, {"time": 3551, "text": "And in AI systems today, strong generalization tends to come from explicit models, tend to come from abstractions in the human mind that are encoded in program form by a human engineer."}, {"time": 3569, "text": "These are the abstractions you can actually generalize, not the sort of weak abstraction that is learned by a neural network."}, {"time": 3574, "text": "Yeah, and the question is how much reasoning, how much strong abstractions are required to solve particular tasks like driving."}, {"time": 3586, "text": "Or human life existence."}, {"time": 3588, "text": "How much strong abstractions does existence require?"}, {"time": 3593, "text": "But more specifically on driving, that seems to be a coupled question about intelligence."}, {"time": 3602, "text": "How much intelligence, how do you build an intelligent system?"}, {"time": 3607, "text": "And the coupled problem, how hard is this problem?"}, {"time": 3611, "text": "How much intelligence does this problem actually require?"}, {"time": 3614, "text": "So we get to cheat because we get to look at the problem."}, {"time": 3620, "text": "It's not like you get to close our eyes and completely new to driving."}, {"time": 3624, "text": "We get to do what we do as human beings, which is for the majority of our life before we ever learn, quote unquote, to drive."}, {"time": 3632, "text": "We get to watch other cars and other people drive."}, {"time": 3635, "text": "We get to be in cars."}, {"time": 3636, "text": "We get to watch."}, {"time": 3637, "text": "We get to see movies about cars."}, {"time": 3639, "text": "We get to observe all this stuff."}, {"time": 3642, "text": "And that's similar to what neural networks are doing."}, {"time": 3645, "text": "It's getting a lot of data, and the question is, yeah, how many leaps of reasoning genius is required to be able to actually effectively drive?"}, {"time": 3659, "text": "I think it's a good example of driving."}, {"time": 3661, "text": "I mean, sure, you've seen a lot of cars in your life before you learned to drive."}, {"time": 3667, "text": "But let's say you've learned to drive in Silicon Valley, and now you rent a car in Tokyo."}, {"time": 3674, "text": "Well, now everyone is driving on the other side of the road, and the signs are different, and the roads are more narrow and so on."}, {"time": 3680, "text": "So it's a very, very different environment."}, {"time": 3682, "text": "And a smart human, even an average human, should be able to just zero shot it, to just be operational in this very different environment right away, despite having had no contact with the novel complexity that is contained in this environment."}, {"time": 3704, "text": "And that novel complexity is not just an interpolation over the situations that you've encountered previously, like learning to drive in the US."}, {"time": 3715, "text": "I would say the reason I ask is one of the most interesting tests of intelligence we have today actively, which is driving, in terms of having an impact on the world."}, {"time": 3726, "text": "When do you think we'll pass that test of intelligence?"}, {"time": 3729, "text": "So I don't think driving is that much of a test of intelligence, because again, there is no task for which skill at that task demonstrates intelligence, unless it's a kind of meta task that involves acquiring new skills."}, {"time": 3746, "text": "So I don't think, I think you can actually solve driving without having any real amount of intelligence."}, {"time": 3755, "text": "For instance, if you did have infinite trained data, you could just literally train an end to end deep learning model that does driving, provided infinite trained data."}, {"time": 3765, "text": "The only problem with the whole idea is collecting a data set that's sufficiently comprehensive, that covers the very long tail of possible situations you might encounter."}, {"time": 3777, "text": "And it's really just a scale problem."}, {"time": 3779, "text": "So I think there's nothing fundamentally wrong with this plan, with this idea."}, {"time": 3786, "text": "It's just that it strikes me as a fairly inefficient thing to do, because you run into this scaling issue with diminishing returns."}, {"time": 3797, "text": "Whereas if instead you took a more manual engineering approach, where you use deep learning modules in combination with engineering an explicit model of the surrounding of the cars, and you bridge the two in a clever way, your model will actually start generalizing much earlier and more effectively than the end to end deep learning model."}, {"time": 3822, "text": "So why would you not go with the more manual engineering oriented approach?"}, {"time": 3827, "text": "Even if you created that system, either the end to end deep learning model system that's running infinite data, or the slightly more human system, I don't think achieving L5 would demonstrate general intelligence or intelligence of any generality at all."}, {"time": 3845, "text": "Again, the only possible test of generality in AI would be a test that looks at skill acquisition over unknown tasks."}, {"time": 3854, "text": "For instance, you could take your L5 driver and ask it to learn to pilot a commercial airplane, for instance."}, {"time": 3862, "text": "And then you would look at how much human involvement is required and how much strength data is required for the system to learn to pilot an airplane."}, {"time": 3869, "text": "And that gives you a measure of how intelligent that system really is."}, {"time": 3875, "text": "Yeah, well, I mean, that's a big leap."}, {"time": 3877, "text": "I get you."}, {"time": 3878, "text": "But I'm more interested, as a problem, I would see, to me, driving is a black box that can generate novel situations at some rate, what people call edge cases."}, {"time": 3893, "text": "So it does have newness that keeps being like, we're confronted, let's say, once a month."}, {"time": 3899, "text": "It is a very long tail, yes."}, {"time": 3900, "text": "It's a long tail."}, {"time": 3901, "text": "That doesn't mean you cannot solve it just by training a statistical model and a lot of data."}, {"time": 3908, "text": "Huge amount of data."}, {"time": 3909, "text": "It's really a matter of scale."}, {"time": 3911, "text": "But I guess what I'm saying is if you have a vehicle that achieves level 5, it is going to be able to deal with new situations."}, {"time": 3923, "text": "Or, I mean, the data is so large that the rate of new situations is very low."}, {"time": 3933, "text": "That's not intelligent."}, {"time": 3934, "text": "So if we go back to your kind of definition of intelligence, it's the efficiency."}, {"time": 3939, "text": "With which you can adapt to new situations, to truly new situations, not situations you've seen before."}, {"time": 3945, "text": "Not situations that could be anticipated by your creators, by the creators of the system, but truly new situations."}, {"time": 3951, "text": "The efficiency with which you acquire new skills."}, {"time": 3954, "text": "If you require, if in order to pick up a new skill, you require a very extensive training data set of most possible situations that can occur in the practice of that skill, then the system is not intelligent."}, {"time": 3970, "text": "It is mostly just a lookup table."}, {"time": 3976, "text": "Well, likewise, if in order to acquire a skill, you need a human engineer to write down a bunch of rules that cover most or every possible situation."}, {"time": 3986, "text": "Likewise, the system is not intelligent."}, {"time": 3989, "text": "The system is merely the output artifact of a process that happens in the minds of the engineers that are creating it."}, {"time": 4000, "text": "It is encoding an abstraction that's produced by the human mind."}, {"time": 4006, "text": "And intelligence would actually be the process of autonomously producing this abstraction."}, {"time": 4017, "text": "Not like if you take an abstraction and you encode it on a piece of paper or in a computer program, the abstraction itself is not intelligent."}, {"time": 4025, "text": "What's intelligent is the agent that's capable of producing these abstractions."}, {"time": 4031, "text": "Yeah, it feels like there's a little bit of a gray area."}, {"time": 4036, "text": "Because you're basically saying that deep learning forms abstractions, too."}, {"time": 4041, "text": "But those abstractions do not seem to be effective for generalizing far outside of the things that it's already seen."}, {"time": 4050, "text": "But generalize a little bit."}, {"time": 4052, "text": "No, deep learning does generalize a little bit."}, {"time": 4054, "text": "Generalization is not binary."}, {"time": 4056, "text": "It's more like a spectrum."}, {"time": 4058, "text": "And there's a certain point, it's a gray area, but there's a certain point where there's an impressive degree of generalization that happens."}, {"time": 4067, "text": "No, I guess exactly what you were saying is intelligence is how efficiently you're able to generalize far outside of the distribution of things you've seen already."}, {"time": 4083, "text": "So it's both the distance of how far you can, how new, how radically new something is, and how efficiently you're able to deal with that."}, {"time": 4092, "text": "So you can think of intelligence as a measure of an information conversion ratio."}, {"time": 4099, "text": "Imagine a space of possible situations."}, {"time": 4103, "text": "And you've covered some of them."}, {"time": 4107, "text": "So you have some amount of information about your space of possible situations that's provided by the situations you already know."}, {"time": 4114, "text": "And that's, on the other hand, also provided by the prior knowledge that the system brings to the table, the prior knowledge embedded in the system."}, {"time": 4123, "text": "So the system starts with some information about the problem, about the task."}, {"time": 4128, "text": "And it's about going from that information to a program, what we would call a skill program, a behavioral program, that can cover a large area of possible situation space."}, {"time": 4141, "text": "And essentially, the ratio between that area and the amount of information you start with is intelligence."}, {"time": 4149, "text": "So a very smart agent can make efficient use of very little information about a new problem and very little prior knowledge as well to cover a very large area of potential situations in that problem without knowing what these future new situations are going to be."}, {"time": 4171, "text": "So one of the other big things you talk about in the paper, we've talked about a little bit already, but let's talk about it some more, is the actual tests of intelligence."}, {"time": 4181, "text": "So if we look at human and machine intelligence, do you think tests of intelligence should be different for humans and machines, or how we think about testing of intelligence?"}, {"time": 4194, "text": "Are these fundamentally the same kind of intelligences that we're after, and therefore, the tests should be similar?"}, {"time": 4203, "text": "So if your goal is to create AIs that are more humanlike, then it would be super valuable, obviously, to have a test that's universal, that applies to both AIs and humans, so that you could establish a comparison between the two, that you could tell exactly how intelligent, in terms of human intelligence, a given system is."}, {"time": 4230, "text": "So that said, the constraints that apply to artificial intelligence and to human intelligence are very different."}, {"time": 4239, "text": "And your test should account for this difference."}, {"time": 4244, "text": "Because if you look at artificial systems, it's always possible for an experimenter to buy arbitrary levels of skill at arbitrary tasks, either by injecting hardcoded prior knowledge into the system via rules and so on that come from the human mind, from the minds of the programmers, and also buying higher levels of skill just by training on more data."}, {"time": 4275, "text": "For instance, you could generate an infinity of different Go games, and you could train a Go playing system that way, but you could not directly compare it to human Go playing skills."}, {"time": 4288, "text": "Because a human that plays Go had to develop that skill in a very constrained environment."}, {"time": 4294, "text": "They had a limited amount of time."}, {"time": 4296, "text": "They had a limited amount of energy."}, {"time": 4298, "text": "And of course, this started from a different set of priors."}, {"time": 4302, "text": "This started from innate human priors."}, {"time": 4308, "text": "So I think if you want to compare the intelligence of two systems, like the intelligence of an AI and the intelligence of a human, you have to control for priors."}, {"time": 4319, "text": "You have to start from the same set of knowledge priors about the task, and you have to control for experience, that is to say, for training data."}, {"time": 4331, "text": "So what's priors?"}, {"time": 4334, "text": "So prior is whatever information you have about a given task before you start learning about this task."}, {"time": 4343, "text": "And how's that different from experience?"}, {"time": 4345, "text": "Well, experience is acquired."}, {"time": 4348, "text": "So for instance, if you're trying to play Go, your experience with Go is all the Go games you've played, or you've seen, or you've simulated in your mind, let's say."}, {"time": 4358, "text": "And your priors are things like, well, Go is a game on the 2D grid."}, {"time": 4365, "text": "And we have lots of hardcoded priors about the organization of 2D space."}, {"time": 4373, "text": "And the rules of how the dynamics of the physics of this game in this 2D space?"}, {"time": 4380, "text": "And the idea that you have what winning is."}, {"time": 4385, "text": "And other board games can also share some similarities with Go."}, {"time": 4389, "text": "And if you've played these board games, then, with respect to the game of Go, that would be part of your priors about the game."}, {"time": 4396, "text": "Well, it's interesting to think about the game of Go is how many priors are actually brought to the table."}, {"time": 4402, "text": "When you look at self play, reinforcement learning based mechanisms that do learning, it seems like the number of priors is pretty low."}, {"time": 4411, "text": "But you're saying you should be expec..."}, {"time": 4412, "text": "There is a 2D special priors in the carbonate."}, {"time": 4416, "text": "But you should be clear at making those priors explicit."}, {"time": 4421, "text": "So in particular, I think if your goal is to measure a humanlike form of intelligence, then you should clearly establish that you want the AI you're testing to start from the same set of priors that humans start with."}, {"time": 4438, "text": "So I mean, to me personally, but I think to a lot of people, the human side of things is very interesting."}, {"time": 4445, "text": "So testing intelligence for humans."}, {"time": 4448, "text": "What do you think is a good test of human intelligence?"}, {"time": 4454, "text": "Well, that's the question that psychometrics is interested in."}, {"time": 4459, "text": "There's an entire subfield of psychology that deals with this question."}, {"time": 4463, "text": "So what's psychometrics?"}, {"time": 4465, "text": "The psychometrics is the subfield of psychology that tries to measure, quantify aspects of the human mind."}, {"time": 4473, "text": "So in particular, our cognitive abilities, intelligence, and personality traits as well."}, {"time": 4479, "text": "So what are, it might be a weird question, but what are the first principles of psychometrics this operates on?"}, {"time": 4492, "text": "What are the priors it brings to the table?"}, {"time": 4495, "text": "So it's a field with a fairly long history."}, {"time": 4501, "text": "So psychology sometimes gets a bad reputation for not having very reproducible results."}, {"time": 4509, "text": "And psychometrics has actually some fairly solidly reproducible results."}, {"time": 4514, "text": "So the ideal goals of the field is a test should be reliable, which is a notion tied to reproducibility."}, {"time": 4523, "text": "It should be valid, meaning that it should actually measure what you say it measures."}, {"time": 4530, "text": "So for instance, if you're saying that you're measuring intelligence, then your test results should be correlated with things that you expect to be correlated with intelligence like success in school or success in the workplace and so on."}, {"time": 4543, "text": "Should be standardized, meaning that you can administer your tests to many different people in some conditions."}, {"time": 4550, "text": "And it should be free from bias."}, {"time": 4552, "text": "Meaning that, for instance, if your test involves the English language, then you have to be aware that this creates a bias against people who have English as their second language or people who can't speak English at all."}, {"time": 4567, "text": "So of course, these principles for creating psychometric tests are very much an ideal."}, {"time": 4573, "text": "I don't think every psychometric test is really either reliable, valid, or free from bias."}, {"time": 4582, "text": "But at least the field is aware of these weaknesses and is trying to address them."}, {"time": 4587, "text": "So it's kind of interesting."}, {"time": 4590, "text": "Ultimately, you're only able to measure, like you said previously, the skill."}, {"time": 4594, "text": "But you're trying to do a bunch of measures of different skills that correlate, as you mentioned, strongly with some general concept of cognitive ability."}, {"time": 4604, "text": "So what's the G factor?"}, {"time": 4606, "text": "So right, there are many different kinds of tests of intelligence."}, {"time": 4610, "text": "And each of them is interesting in different aspects of intelligence."}, {"time": 4616, "text": "Some of them will deal with language."}, {"time": 4617, "text": "Some of them will deal with spatial vision, maybe mental rotations, numbers, and so on."}, {"time": 4624, "text": "When you run these very different tests at scale, what you start seeing is that there are clusters of correlations among test results."}, {"time": 4634, "text": "So for instance, if you look at homework at school, you will see that people who do well at math are also likely statistically to do well in physics."}, {"time": 4645, "text": "And what's more, people who do well at math and physics are also statistically likely to do well in things that sound completely unrelated, like writing an English essay, for instance."}, {"time": 4658, "text": "And so when you see clusters of correlations in statistical terms, you would explain them with the latent variable."}, {"time": 4667, "text": "And the latent variable that would, for instance, explain the relationship between being good at math and being good at physics would be cognitive ability."}, {"time": 4677, "text": "And the G factor is the latent variable that explains the fact that every test of intelligence that you can come up with results on this test end up being correlated."}, {"time": 4690, "text": "So there is some single unique variable that explains these correlations."}, {"time": 4697, "text": "That's the G factor."}, {"time": 4698, "text": "So it's a statistical construct."}, {"time": 4700, "text": "It's not really something you can directly measure, for instance, in a person."}, {"time": 4705, "text": "But it's there."}, {"time": 4707, "text": "It's there at scale."}, {"time": 4708, "text": "And that's also one thing I want to mention about psychometrics."}, {"time": 4713, "text": "Like when you talk about measuring intelligence in humans, for instance, some people get a little bit worried."}, {"time": 4720, "text": "They will say, that sounds dangerous."}, {"time": 4721, "text": "Maybe that sounds potentially discriminatory, and so on."}, {"time": 4724, "text": "And they're not wrong."}, {"time": 4726, "text": "And the thing is, personally, I'm not interested in psychometrics as a way to characterize one individual person."}, {"time": 4734, "text": "Like if I get your psychometric personality assessments or your IQ, I don't think that actually tells me much about you as a person."}, {"time": 4745, "text": "I think psychometrics is most useful as a statistical tool."}, {"time": 4750, "text": "So it's most useful at scale."}, {"time": 4752, "text": "It's most useful when you start getting test results for a large number of people."}, {"time": 4757, "text": "And you start cross correlating these test results."}, {"time": 4760, "text": "Because that gives you information about the structure of the human mind, in particular about the structure of human cognitive abilities."}, {"time": 4769, "text": "So at scale, psychometrics paints a certain picture of the human mind."}, {"time": 4777, "text": "And that's what's relevant to AI, the structure of human cognitive abilities."}, {"time": 4781, "text": "Yeah, it gives you an insight into it."}, {"time": 4782, "text": "I mean, to me, I remember when I learned about G factor, it seemed like it would be impossible for it to be real, even as a statistical variable."}, {"time": 4795, "text": "Like it felt kind of like astrology."}, {"time": 4799, "text": "Like it's like wishful thinking among psychologists."}, {"time": 4801, "text": "But the more I learned, I realized that there's some."}, {"time": 4805, "text": "I mean, I'm not sure what to make about human beings, the fact that the G factor is a thing."}, {"time": 4810, "text": "There's a commonality across all of human species, that there does seem to be a strong correlation between cognitive abilities."}, {"time": 4817, "text": "That's kind of fascinating, actually."}, {"time": 4819, "text": "So human cognitive abilities have a structure."}, {"time": 4822, "text": "Like the most mainstream theory of the structure of cognitive abilities is called CHC theory."}, {"time": 4828, "text": "It's Cattell, Horn, Carroll."}, {"time": 4830, "text": "It's named after the three psychologists who contributed key pieces of it."}, {"time": 4835, "text": "And it describes cognitive abilities as a hierarchy with three levels."}, {"time": 4841, "text": "And at the top, you have the G factor."}, {"time": 4843, "text": "Then you have broad cognitive abilities, for instance fluid intelligence, that encompass a broad set of possible kinds of tasks that are all related."}, {"time": 4857, "text": "And then you have narrow cognitive abilities at the last level, which is closer to task specific skill."}, {"time": 4864, "text": "And there are actually different theories of the structure of cognitive abilities that just emerge from different statistical analysis of IQ test results."}, {"time": 4874, "text": "But they all describe a hierarchy with a kind of G factor at the top."}, {"time": 4881, "text": "And you're right that the G factor, it's not quite real in the sense that it's not something you can observe and measure, like your height, for instance."}, {"time": 4890, "text": "But it's real in the sense that you see it in a statistical analysis of the data."}, {"time": 4897, "text": "One thing I want to mention is that the fact that there is a G factor does not really mean that human intelligence is general in a strong sense."}, {"time": 4905, "text": "It does not mean human intelligence can be applied to any problem at all, and that someone who has a high IQ is going to be able to solve any problem at all."}, {"time": 4914, "text": "That's not quite what it means."}, {"time": 4915, "text": "I think one popular analogy to understand it is the sports analogy."}, {"time": 4923, "text": "If you consider the concept of physical fitness, it's a concept that's very similar to intelligence because it's a useful concept."}, {"time": 4931, "text": "It's something you can intuitively understand."}, {"time": 4934, "text": "Some people are fit, maybe like you."}, {"time": 4937, "text": "Some people are not as fit, maybe like me."}, {"time": 4940, "text": "But none of us can fly."}, {"time": 4943, "text": "It's constrained to a specific set of skills."}, {"time": 4945, "text": "Even if you're very fit, that doesn't mean you can do anything at all in any environment."}, {"time": 4951, "text": "You obviously cannot fly."}, {"time": 4952, "text": "You cannot survive at the bottom of the ocean and so on."}, {"time": 4956, "text": "And if you were a scientist and you wanted to precisely define and measure physical fitness in humans, then you would come up with a battery of tests."}, {"time": 4967, "text": "You would have running 100 meter, playing soccer, playing table tennis, swimming, and so on."}, {"time": 4974, "text": "And if you ran these tests over many different people, you would start seeing correlations in test results."}, {"time": 4981, "text": "For instance, people who are good at soccer are also good at sprinting."}, {"time": 4985, "text": "And you would explain these correlations with physical abilities that are strictly analogous to cognitive abilities."}, {"time": 4994, "text": "And then you would start also observing correlations between biological characteristics, like maybe lung volume is correlated with being a fast runner, for instance, in the same way that there are neurophysical correlates of cognitive abilities."}, {"time": 5013, "text": "And at the top of the hierarchy of physical abilities that you would be able to observe, you would have a G factor, a physical G factor, which would map to physical fitness."}, {"time": 5025, "text": "And as you just said, that doesn't mean that people with high physical fitness can't fly."}, {"time": 5031, "text": "It doesn't mean human morphology and human physiology is universal."}, {"time": 5035, "text": "It's actually super specialized."}, {"time": 5037, "text": "We can only do the things that we were evolved to do."}, {"time": 5044, "text": "We are not appropriate to, you could not exist on Venus or Mars or in the void of space or the bottom of the ocean."}, {"time": 5052, "text": "So that said, one thing that's really striking and remarkable is that our morphology generalizes far beyond the environments that we evolved for."}, {"time": 5067, "text": "Like in a way, you could say we evolved to run after prey in the savanna, right?"}, {"time": 5072, "text": "That's very much where our human morphology comes from."}, {"time": 5076, "text": "And that said, we can do a lot of things that are completely unrelated to that."}, {"time": 5082, "text": "We can climb mountains."}, {"time": 5084, "text": "We can swim across lakes."}, {"time": 5087, "text": "We can play table tennis."}, {"time": 5088, "text": "I mean, table tennis is very different from what we were evolved to do, right?"}, {"time": 5093, "text": "So our morphology, our bodies, our sense and motor affordances have a degree of generality that is absolutely remarkable, right?"}, {"time": 5102, "text": "And I think cognition is very similar to that."}, {"time": 5105, "text": "Our cognitive abilities have a degree of generality that goes far beyond what the mind was initially supposed to do, which is why we can play music and write novels and go to Mars and do all kinds of crazy things."}, {"time": 5118, "text": "But it's not universal in the same way that human morphology and our body is not appropriate for actually most of the universe by volume."}, {"time": 5127, "text": "In the same way, you could say that the human mind is not really appropriate for most of problem space, potential problem space by volume."}, {"time": 5135, "text": "So we have very strong cognitive biases, actually, that mean that there are certain types of problems that we handle very well and certain types of problems that we are completely in adapted for."}, {"time": 5148, "text": "So that's really how we'd interpret the G factor."}, {"time": 5152, "text": "It's not a sign of strong generality."}, {"time": 5156, "text": "It's really just the broadest cognitive ability."}, {"time": 5161, "text": "But our abilities, whether we are talking about sensory motor abilities or cognitive abilities, they still remain very specialized in the human condition, right?"}, {"time": 5172, "text": "Within the constraints of the human cognition, they're general."}, {"time": 5179, "text": "But the constraints, as you're saying, are very limited."}, {"time": 5182, "text": "I think what's limiting."}, {"time": 5183, "text": "So we evolved our cognition and our body evolved in very specific environments."}, {"time": 5189, "text": "Because our environment was so variable, fast changing, and so unpredictable, part of the constraints that drove our evolution is generality itself."}, {"time": 5199, "text": "So we were, in a way, evolved to be able to improvise in all kinds of physical or cognitive environments."}, {"time": 5207, "text": "And for this reason, it turns out that the minds and bodies that we ended up with can be applied to much, much broader scope than what they were evolved for."}, {"time": 5220, "text": "And that's truly remarkable."}, {"time": 5221, "text": "And that's a degree of generalization that is far beyond anything you can see in artificial systems today."}, {"time": 5230, "text": "That said, it does not mean that human intelligence is anywhere universal."}, {"time": 5236, "text": "Yeah, it's not general."}, {"time": 5238, "text": "It's a kind of exciting topic for people, even outside of artificial intelligence, is IQ tests."}, {"time": 5247, "text": "I think it's Mensa, whatever."}, {"time": 5249, "text": "There's different degrees of difficulty for questions."}, {"time": 5252, "text": "We talked about this offline a little bit, too, about difficult questions."}, {"time": 5257, "text": "What makes a question on an IQ test more difficult or less difficult, do you think?"}, {"time": 5263, "text": "So the thing to keep in mind is that there's no such thing as a question that's intrinsically difficult."}, {"time": 5271, "text": "It has to be difficult to suspect to the things you already know and the things you can already do, right?"}, {"time": 5278, "text": "So in terms of an IQ test question, typically it would be structured, for instance, as a set of demonstration input and output pairs, right?"}, {"time": 5291, "text": "And then you would be given a test input, a prompt, and you would need to recognize or produce the corresponding output."}, {"time": 5300, "text": "And in that narrow context, you could say a difficult question is a question where the input prompt is very surprising and unexpected, given the training examples."}, {"time": 5316, "text": "Just even the nature of the patterns that you're observing in the input prompt."}, {"time": 5320, "text": "For instance, let's say you have a rotation problem."}, {"time": 5323, "text": "You must relate the shape by 90 degrees."}, {"time": 5326, "text": "If I give you two examples and then I give you one prompt, which is actually one of the two training examples, then there is zero generalization difficulty for the task."}, {"time": 5336, "text": "It's actually a trivial task."}, {"time": 5337, "text": "You just recognize that it's one of the training examples, and you produce the same answer."}, {"time": 5342, "text": "Now, if it's a more complex shape, there is a little bit more generalization, but it remains that you are still doing the same thing at this time, as you were being demonstrated at training time."}, {"time": 5355, "text": "A difficult task starts to require some amount of test time adaptation, some amount of improvisation, right?"}, {"time": 5365, "text": "So consider, I don't know, you're teaching a class on quantum physics or something."}, {"time": 5374, "text": "If you wanted to test the understanding that students have of the material, you would come up with an exam that's very different from anything they've seen on the internet when they were cramming."}, {"time": 5391, "text": "On the other hand, if you wanted to make it easy, you would just give them something that's very similar to the mock exams that they've taken, something that's just a simple interpolation of questions that they've already seen."}, {"time": 5407, "text": "And so that would be an easy exam."}, {"time": 5409, "text": "It's very similar to what you've been trained on."}, {"time": 5411, "text": "And a difficult exam is one that really probes your understanding because it forces you to improvise."}, {"time": 5418, "text": "It forces you to do things that are different from what you were exposed to before."}, {"time": 5424, "text": "So that said, it doesn't mean that the exam that requires improvisation is intrinsically hard, right?"}, {"time": 5432, "text": "Because maybe you're a quantum physics expert."}, {"time": 5435, "text": "So when you take the exam, this is actually stuff that, despite being new to the students, it's not new to you, right?"}, {"time": 5442, "text": "So it can only be difficult with respect to what the test taker already knows and with respect to the information that the test taker has about the task."}, {"time": 5454, "text": "So that's what I mean by controlling for priors what the information you bring to the table."}, {"time": 5459, "text": "And the experience."}, {"time": 5460, "text": "And the experience, which is to train data."}, {"time": 5462, "text": "So in the case of the quantum physics exam, that would be all the course material itself and all the mock exams that students might have taken online."}, {"time": 5472, "text": "Yeah, it's interesting because I've also sent you an email."}, {"time": 5477, "text": "I asked you, I've been in just this curious question of what's a really hard IQ test question."}, {"time": 5487, "text": "And I've been talking to also people who have designed IQ tests."}, {"time": 5492, "text": "There's a few folks on the internet, it's like a thing."}, {"time": 5494, "text": "People are really curious about it."}, {"time": 5496, "text": "First of all, most of the IQ tests they designed, they like religiously protect against the correct answers."}, {"time": 5505, "text": "Like you can't find the correct answers anywhere."}, {"time": 5508, "text": "In fact, the question is ruined once you know, even like the approach you're supposed to take."}, {"time": 5513, "text": "So they're very... That said, the approach is implicit in the training examples."}, {"time": 5518, "text": "So if you release the training examples, it's over."}, {"time": 5522, "text": "Which is why in Arc, for instance, there is a test set that is private and no one has seen it."}, {"time": 5529, "text": "No, for really tough IQ questions, it's not obvious."}, {"time": 5533, "text": "It's not because the ambiguity."}, {"time": 5537, "text": "Like it's, I mean, we'll have to look through them, but like some number sequences and so on, it's not completely clear."}, {"time": 5545, "text": "So like you can get a sense, but there's like some, you know, when you look at a number sequence, I don't know, like your Fibonacci number sequence, if you look at the first few numbers, that sequence could be completed in a lot of different ways."}, {"time": 5562, "text": "And you know, some are, if you think deeply, are more correct than others."}, {"time": 5566, "text": "Like there's a kind of intuitive simplicity and elegance to the correct solution."}, {"time": 5573, "text": "I am personally not a fan of ambiguity in test questions actually, but I think you can have difficulty without requiring ambiguity simply by making the test require a lot of extrapolation over the training examples."}, {"time": 5589, "text": "But the beautiful question is difficult, but gives away everything when you give the training example."}, {"time": 5598, "text": "Meaning that, so the tests I'm interested in creating are not necessarily difficult for humans because human intelligence is the benchmark."}, {"time": 5611, "text": "They're supposed to be difficult for machines in ways that are easy for humans."}, {"time": 5616, "text": "Like I think an ideal test of human and machine intelligence is a test that is actionable, that highlights the need for progress, and that highlights the direction in which you should be making progress."}, {"time": 5631, "text": "I think we'll talk about the ARC challenge and the test you've constructed and you have these elegant examples."}, {"time": 5638, "text": "I think that highlight, like this is really easy for us humans, but it's really hard for machines."}, {"time": 5644, "text": "But on the, you know, the designing an IQ test for IQs of like higher than 160 and so on, you have to say, you have to take that and put it on steroids, right?"}, {"time": 5656, "text": "You have to think like, what is hard for humans?"}, {"time": 5659, "text": "And that's a fascinating exercise in itself, I think."}, {"time": 5665, "text": "And it was an interesting question of what it takes to create a really hard question for humans because you again have to do the same process as you mentioned, which is, you know, something basically where the experience that you have likely to have encountered throughout your whole life, even if you've prepared for IQ tests, which is a big challenge, that this will still be novel for you."}, {"time": 5695, "text": "Yeah, I mean, novelty is a requirement."}, {"time": 5698, "text": "You should not be able to practice for the questions that you're gonna be tested on."}, {"time": 5703, "text": "That's important because otherwise what you're doing is not exhibiting intelligence."}, {"time": 5708, "text": "What you're doing is just retrieving what you've been exposed before."}, {"time": 5712, "text": "It's the same thing as deep learning model."}, {"time": 5714, "text": "If you train a deep learning model on all the possible answers, then it will ace your test in the same way that, you know, a stupid student can still ace the test if they cram for it."}, {"time": 5730, "text": "They memorize, you know, a hundred different possible mock exams."}, {"time": 5734, "text": "And then they hope that the actual exam will be a very simple interpolation of the mock exams."}, {"time": 5741, "text": "And that student could just be a deep learning model at that point."}, {"time": 5744, "text": "But you can actually do that without any understanding of the material."}, {"time": 5748, "text": "And in fact, many students pass their exams in exactly this way."}, {"time": 5751, "text": "And if you want to avoid that, you need an exam that's unlike anything they've seen that really probes their understanding."}, {"time": 5760, "text": "So how do we design an IQ test for machines, an intelligent test for machines?"}, {"time": 5767, "text": "All right, so in the paper I outline a number of requirements that you expect of such a test."}, {"time": 5774, "text": "And in particular, we should start by acknowledging the priors that we expect to be required in order to perform the test."}, {"time": 5785, "text": "So we should be explicit about the priors, right?"}, {"time": 5788, "text": "And if the goal is to compare machine intelligence and human intelligence, then we should assume human cognitive priors, right?"}, {"time": 5796, "text": "And secondly, we should make sure that we are testing for skill acquisition ability, skill acquisition efficiency in particular, and not for skill itself."}, {"time": 5808, "text": "Meaning that every task featured in your test should be novel and should not be something that you can anticipate."}, {"time": 5815, "text": "So for instance, it should not be possible to brute force the space of possible questions, right?"}, {"time": 5822, "text": "To pre generate every possible question and answer."}, {"time": 5826, "text": "So it should be tasks that cannot be anticipated, not just by the system itself, but by the creators of the system, right?"}, {"time": 5835, "text": "Yeah, you know what's fascinating?"}, {"time": 5837, "text": "I mean, one of my favorite aspects of the paper and the work you do with the ARC challenge is the process of making priors explicit."}, {"time": 5848, "text": "Just even that act alone is a really powerful one of like, what are, it's a really powerful question asked of us humans."}, {"time": 5860, "text": "What are the priors that we bring to the table?"}, {"time": 5864, "text": "So the next step is like, once you have those priors, how do you use them to solve a novel task?"}, {"time": 5870, "text": "But like, just even making the priors explicit is a really difficult and really powerful step."}, {"time": 5876, "text": "And that's like visually beautiful and conceptually philosophically beautiful part of the work you did with, and I guess continue to do probably with the paper and the ARC challenge."}, {"time": 5888, "text": "Can you talk about some of the priors that we're talking about here?"}, {"time": 5892, "text": "Yes, so a researcher has done a lot of work on what exactly are the knowledge priors that are innate to humans is Elizabeth Spelke from Harvard."}, {"time": 5906, "text": "So she developed the core knowledge theory, which outlines four different core knowledge systems."}, {"time": 5916, "text": "So systems of knowledge that we are basically either born with or that we are hardwired to acquire very early on in our development."}, {"time": 5927, "text": "And there's no strong distinction between the two."}, {"time": 5932, "text": "Like if you are primed to acquire a certain type of knowledge in just a few weeks, you might as well just be born with it."}, {"time": 5943, "text": "It's just part of who you are."}, {"time": 5946, "text": "And so there are four different core knowledge systems."}, {"time": 5949, "text": "Like the first one is the notion of objectness and basic physics."}, {"time": 5956, "text": "Like you recognize that something that moves coherently, for instance, is an object."}, {"time": 5963, "text": "So we intuitively, naturally, innately divide the world into objects based on this notion of coherence, physical coherence."}, {"time": 5972, "text": "And in terms of elementary physics, there's the fact that objects can bump against each other and the fact that they can occlude each other."}, {"time": 5984, "text": "So these are things that we are essentially born with or at least that we are going to be acquiring extremely early because we're really hardwired to acquire them."}, {"time": 5995, "text": "So a bunch of points, pixels that move together on objects are partly the same object."}, {"time": 6007, "text": "I don't smoke weed, but if I did, that's something I could sit all night and just think about, remember what I wrote in your paper, just objectness, I wasn't self aware, I guess, of that particular prior."}, {"time": 6023, "text": "That's such a fascinating prior that like... That's the most basic one, but actually... Objectness, just identity, just objectness."}, {"time": 6034, "text": "It's very basic, I suppose, but it's so fundamental."}, {"time": 6039, "text": "It is fundamental to human cognition."}, {"time": 6042, "text": "The second prior that's also fundamental is agentness, which is not a real world, a real world, so agentness."}, {"time": 6050, "text": "The fact that some of these objects that you segment your environment into, some of these objects are agents."}, {"time": 6058, "text": "So what's an agent?"}, {"time": 6060, "text": "It's basically, it's an object that has goals."}, {"time": 6065, "text": "That has what?"}, {"time": 6066, "text": "That has goals, that is capable of pursuing goals."}, {"time": 6069, "text": "So for instance, if you see two dots moving in roughly synchronized fashion, you will intuitively infer that one of the dots is pursuing the other."}, {"time": 6081, "text": "So that one of the dots is... And one of the dots is an agent and its goal is to avoid the other dot."}, {"time": 6089, "text": "And one of the dots, the other dot is also an agent and its goal is to catch the first dot."}, {"time": 6095, "text": "Belke has shown that babies as young as three months identify agentness and goal directedness in their environment."}, {"time": 6106, "text": "Another prior is basic geometry and topology, like the notion of distance, the ability to navigate in your environment and so on."}, {"time": 6117, "text": "This is something that is fundamentally hardwired into our brain."}, {"time": 6122, "text": "It's in fact backed by very specific neural mechanisms, like for instance, grid cells and place cells."}, {"time": 6130, "text": "So it's something that's literally hard coded at the neural level in our hippocampus."}, {"time": 6139, "text": "And the last prior would be the notion of numbers."}, {"time": 6143, "text": "Like numbers are not actually a cultural construct."}, {"time": 6146, "text": "We are intuitively, innately able to do some basic counting and to compare quantities."}, {"time": 6154, "text": "So it doesn't mean we can do arbitrary arithmetic."}, {"time": 6157, "text": "Counting, the actual counting."}, {"time": 6159, "text": "Counting, like counting one, two, three ish, then maybe more than three."}, {"time": 6163, "text": "You can also compare quantities."}, {"time": 6165, "text": "If I give you three dots and five dots, you can tell the side with five dots has more dots."}, {"time": 6172, "text": "So this is actually an innate prior."}, {"time": 6176, "text": "So that said, the list may not be exhaustive."}, {"time": 6180, "text": "So SpellKey is still, you know, passing the potential existence of new knowledge systems."}, {"time": 6188, "text": "For instance, knowledge systems that we deal with social relationships."}, {"time": 6195, "text": "Yeah, I mean, and there could be..."}, {"time": 6197, "text": "Which is much less relevant to something like ARC or IQ test and so on."}, {"time": 6203, "text": "There could be stuff that's like you said, rotation, symmetry, is there like... Symmetry is really interesting."}, {"time": 6211, "text": "It's very likely that there is, speaking about rotation, that there is in the brain, a hard coded system that is capable of performing rotations."}, {"time": 6222, "text": "One famous experiment that people did in the..."}, {"time": 6225, "text": "I don't remember which was exactly, but in the 70s was that people found that if you asked people, if you give them two different shapes and one of the shapes is a rotated version of the first shape, and you ask them, is that shape a rotated version of the first shape or not?"}, {"time": 6247, "text": "What you see is that the time it takes people to answer is linearly proportional, right, to the angle of rotation."}, {"time": 6256, "text": "So it's almost like you have somewhere in your brain like a turntable with a fixed speed."}, {"time": 6264, "text": "And if you want to know if two objects are a rotated version of each other, you put the object on the turntable, you let it move around a little bit, and then you stop when you have a match."}, {"time": 6277, "text": "And that's really interesting."}, {"time": 6280, "text": "So what's the ARC challenge?"}, {"time": 6282, "text": "So in the paper, I outline all these principles that a good test of machine intelligence and human intelligence should follow."}, {"time": 6291, "text": "And the ARC challenge is one attempt to embody as many of these principles as possible."}, {"time": 6298, "text": "So I don't think it's anywhere near a perfect attempt, right?"}, {"time": 6303, "text": "It does not actually follow every principle, but it is what I was able to do given the constraints."}, {"time": 6310, "text": "So the format of ARC is very similar to classic IQ tests, in particular Raven's Progressive Metrices."}, {"time": 6318, "text": "Raven's?"}, {"time": 6318, "text": "Yeah, Raven's Progressive Metrices."}, {"time": 6320, "text": "I mean, if you've done IQ tests in the past, you know what that is, probably."}, {"time": 6324, "text": "Or at least you've seen it, even if you don't know what it's called."}, {"time": 6326, "text": "And so you have a set of tasks, that's what they're called."}, {"time": 6332, "text": "And for each task, you have training data, which is a set of input and output pairs."}, {"time": 6340, "text": "So an input or output pair is a grid of colors, basically."}, {"time": 6345, "text": "The grid, the size of the grid is variables."}, {"time": 6348, "text": "The size of the grid is variable."}, {"time": 6351, "text": "And you're given an input, and you must transform it into the proper output."}, {"time": 6359, "text": "And so you're shown a few demonstrations of a task in the form of existing input output pairs, and then you're given a new input."}, {"time": 6366, "text": "And you must provide, you must produce the correct output."}, {"time": 6372, "text": "And the assumptions in Arc is that every task should only require core knowledge priors, should not require any outside knowledge."}, {"time": 6390, "text": "So for instance, no language, no English, nothing like this."}, {"time": 6396, "text": "No concepts taken from our human experience, like trees, dogs, cats, and so on."}, {"time": 6404, "text": "So only reasoning tasks that are built on top of core knowledge priors."}, {"time": 6412, "text": "And some of the tasks are actually explicitly trying to probe specific forms of abstraction."}, {"time": 6422, "text": "Part of the reason why I wanted to create Arc is I'm a big believer in when you're faced with a problem as murky as understanding how to autonomously generate abstraction in a machine, you have to coevolve the solution and the problem."}, {"time": 6447, "text": "And so part of the reason why I designed Arc was to clarify my ideas about the nature of abstraction."}, {"time": 6454, "text": "And some of the tasks are actually designed to probe bits of that theory."}, {"time": 6459, "text": "And there are things that turn out to be very easy for humans to perform, including young kids, but turn out to be near impossible for machines."}, {"time": 6470, "text": "So what have you learned from the nature of abstraction from designing that?"}, {"time": 6479, "text": "One of the things you wanted to try to understand was this idea of abstraction."}, {"time": 6486, "text": "Yes, so clarifying my own ideas about abstraction by forcing myself to produce tasks that would require the ability to produce that form of abstraction in order to solve them."}, {"time": 6500, "text": "OK, so and by the way, just the people should check out."}, {"time": 6504, "text": "I'll probably overlay if you're watching the video part."}, {"time": 6506, "text": "But the grid input output with the different colors on the grid, that's it."}, {"time": 6514, "text": "I mean, it's a very simple world, but it's kind of beautiful."}, {"time": 6517, "text": "It's very similar to classic IQ tests."}, {"time": 6519, "text": "It's not very original in that sense."}, {"time": 6521, "text": "The main difference with IQ tests is that we make the priors explicit, which is not usually the case in IQ tests."}, {"time": 6528, "text": "So you make it explicit that everything should only be built on top of core knowledge priors."}, {"time": 6533, "text": "I also think it's generally more diverse than IQ tests in general."}, {"time": 6540, "text": "And it perhaps requires a bit more manual work to produce solutions, because you have to click around on a grid for a while."}, {"time": 6548, "text": "Sometimes the grids can be as large as 30 by 30 cells."}, {"time": 6552, "text": "So how did you come up, if you can reveal, with the questions?"}, {"time": 6558, "text": "What's the process of the questions?"}, {"time": 6559, "text": "Was it mostly you that came up with the questions?"}, {"time": 6563, "text": "How difficult is it to come up with a question?"}, {"time": 6565, "text": "Is this scalable to a much larger number?"}, {"time": 6570, "text": "If we think, with IQ tests, you might not necessarily want it to or need it to be scalable."}, {"time": 6576, "text": "With machines, it's possible, you could argue, that it needs to be scalable."}, {"time": 6581, "text": "So there are 1,000 questions, 1,000 tasks, including the test set, the prior test set."}, {"time": 6589, "text": "I think it's fairly difficult in the sense that a big requirement is that every task should be novel and unique and unpredictable."}, {"time": 6600, "text": "You don't want to create your own little world that is simple enough that it would be possible for a human to reverse and generate and write down an algorithm that could generate every possible arc task and their solution."}, {"time": 6617, "text": "So that would completely invalidate the test."}, {"time": 6619, "text": "So you're constantly coming up with new stuff."}, {"time": 6621, "text": "Yeah, you need a source of novelty, of unfakeable novelty."}, {"time": 6627, "text": "And one thing I found is that, as a human, you are not a very good source of unfakeable novelty."}, {"time": 6636, "text": "And so you have to base the creation of these tasks quite a bit."}, {"time": 6641, "text": "There are only so many unique tasks that you can do in a given day."}, {"time": 6645, "text": "So that means coming up with truly original new ideas."}, {"time": 6649, "text": "Did psychedelics help you at all?"}, {"time": 6652, "text": "No, I'm just kidding."}, {"time": 6653, "text": "But I mean, that's fascinating to think about."}, {"time": 6655, "text": "So you would be walking or something like that."}, {"time": 6658, "text": "Are you constantly thinking of something totally new?"}, {"time": 6666, "text": "This is hard."}, {"time": 6667, "text": "Yeah, I mean, I'm not saying you've done anywhere near a perfect job at it."}, {"time": 6672, "text": "There is some amount of redundancy, and there are many imperfections in ARC."}, {"time": 6676, "text": "So that said, you should consider ARC as a work in progress."}, {"time": 6679, "text": "It is not the definitive state."}, {"time": 6685, "text": "The ARC tasks today are not the definitive state of the test."}, {"time": 6689, "text": "I want to keep refining it in the future."}, {"time": 6692, "text": "I also think it should be possible to open up the creation of tasks to a broad audience to do crowdsourcing."}, {"time": 6700, "text": "That would involve several levels of filtering, obviously."}, {"time": 6704, "text": "But I think it's possible to apply crowdsourcing to develop a much bigger and much more diverse ARC data set."}, {"time": 6711, "text": "That would also be free of potentially some of my own personal biases."}, {"time": 6716, "text": "Is there always need to be a part of ARC that the test is hidden?"}, {"time": 6724, "text": "It is imperative that the tests that you're using to actually benchmark algorithms is not accessible to the people developing these algorithms."}, {"time": 6735, "text": "Because otherwise, what's going to happen is that the human engineers are just going to solve the tasks themselves and encode their solution in program form."}, {"time": 6744, "text": "But that, again, what you're seeing here is the process of intelligence happening in the mind of the human."}, {"time": 6751, "text": "And then you're just capturing its crystallized output."}, {"time": 6755, "text": "But that crystallized output is not the same thing as the process it generated."}, {"time": 6760, "text": "It's not intelligent in itself."}, {"time": 6761, "text": "So what, by the way, the idea of crowdsourcing it is fascinating."}, {"time": 6765, "text": "I think the creation of questions is really exciting for people."}, {"time": 6771, "text": "I think there's a lot of really brilliant people out there that love to create these kinds of stuff."}, {"time": 6776, "text": "Yeah, one thing that kind of surprised me that I wasn't expecting is that lots of people seem to actually enjoy ARC as a kind of game."}, {"time": 6785, "text": "And I was releasing it as a test, as a benchmark of fluid general intelligence."}, {"time": 6794, "text": "And lots of people just, including kids, just started enjoying it as a game."}, {"time": 6798, "text": "So I think that's encouraging."}, {"time": 6800, "text": "Yeah, I'm fascinated by it."}, {"time": 6802, "text": "There's a world of people who create IQ questions."}, {"time": 6805, "text": "I think that's a cool activity for machines and for humans."}, {"time": 6812, "text": "And humans are themselves fascinated by taking the questions, like measuring their own intelligence."}, {"time": 6822, "text": "I mean, that's just really compelling."}, {"time": 6824, "text": "It's really interesting to me, too."}, {"time": 6827, "text": "One of the cool things about ARC, you said, is kind of inspired by IQ tests or whatever follows a similar process."}, {"time": 6833, "text": "But because of its nature, because of the context in which it lives, it immediately forces you to think about the nature of intelligence as opposed to just the test of your own."}, {"time": 6844, "text": "It forces you to really think."}, {"time": 6846, "text": "I don't know if it's within the question, inherent in the question, or just the fact that it lives in the test that's supposed to be a test of machine intelligence."}, {"time": 6855, "text": "As you solve ARC tasks as a human, you will be forced to basically introspect how you come up with solutions."}, {"time": 6867, "text": "And that forces you to reflect on the human problem solving process."}, {"time": 6873, "text": "And the way your own mind generates abstract representations of the problems it's exposed to."}, {"time": 6884, "text": "I think it's due to the fact that the set of core knowledge priors that ARC is built upon is so small."}, {"time": 6892, "text": "It's all a recombination of a very, very small set of assumptions."}, {"time": 6900, "text": "OK, so what's the future of ARC?"}, {"time": 6902, "text": "So you held ARC as a challenge, as part of like a Kaggle competition."}, {"time": 6907, "text": "Kaggle competition."}, {"time": 6908, "text": "And what do you think?"}, {"time": 6911, "text": "Do you think that's something that continues for five years, 10 years, like just continues growing?"}, {"time": 6918, "text": "So ARC itself will keep evolving."}, {"time": 6921, "text": "So I've talked about crowdsourcing."}, {"time": 6922, "text": "I think that's a good avenue."}, {"time": 6926, "text": "Another thing I'm starting is I'll be collaborating with folks from the psychology department at NYU to do human testing on ARC."}, {"time": 6936, "text": "And I think there are lots of interesting questions you can start asking, especially as you start correlating machine solutions to ARC tasks and the human characteristics of solutions."}, {"time": 6950, "text": "Like for instance, you can try to see if there's a relationship between the human perceived difficulty of a task and the machine perceived."}, {"time": 6959, "text": "Yes, and exactly some measure of machine perceived difficulty."}, {"time": 6962, "text": "Yeah, it's a nice playground in which to explore this very difference."}, {"time": 6966, "text": "It's the same thing as we talked about the autonomous vehicles."}, {"time": 6969, "text": "The things that could be difficult for humans might be very different than the things that are difficult."}, {"time": 6973, "text": "And formalizing or making explicit that difference in difficulty may teach us something fundamental about intelligence."}, {"time": 6982, "text": "So one thing I think we did well with ARC is that it's proving to be a very actionable test in the sense that machine performance on ARC started at very much zero initially, while humans found actually the task very easy."}, {"time": 7003, "text": "And that alone was like a big red flashing light saying that something is going on and that we are missing something."}, {"time": 7012, "text": "And at the same time, machine performance did not stay at zero for very long."}, {"time": 7017, "text": "Actually, within two weeks of the Kaggle competition, we started having a nonzero number."}, {"time": 7023, "text": "And now the state of the art is around 20% of the test set solved."}, {"time": 7030, "text": "And so ARC is actually a challenge where our capabilities start at zero, which indicates the need for progress."}, {"time": 7038, "text": "But it's also not an impossible challenge."}, {"time": 7040, "text": "It's not accessible."}, {"time": 7041, "text": "You can start making progress basically right away."}, {"time": 7045, "text": "At the same time, we are still very far from having solved it."}, {"time": 7049, "text": "And that's actually a very positive outcome of the competition is that the competition has proven that there was no obvious shortcut to solve these tasks."}, {"time": 7061, "text": "Yeah, so the test held up."}, {"time": 7064, "text": "That was the primary reason to use the Kaggle competition is to check if some clever person was going to hack the benchmark that did not happen."}, {"time": 7076, "text": "People who are solving the task are essentially doing it."}, {"time": 7081, "text": "Well, in a way, they're actually exploring some flaws of ARC that we will need to address in the future, especially they're essentially anticipating what sort of tasks may be contained in the test set."}, {"time": 7093, "text": "Right, which is kind of, yeah, that's the kind of hacking."}, {"time": 7098, "text": "It's human hacking of the test."}, {"time": 7100, "text": "Yes, that said, with the state of the art, it's like 20% we're still very, very far from human level, which is closer to 100%."}, {"time": 7110, "text": "And I do believe that it will take a while until we reach human parity on ARC."}, {"time": 7120, "text": "And that by the time we have human parity, we will have AI systems that are probably pretty close to human level in terms of general fluid intelligence, which is, I mean, they are not going to be necessarily human like."}, {"time": 7134, "text": "They're not necessarily, you would not necessarily recognize them as being an AGI."}, {"time": 7141, "text": "But they would be capable of a degree of generalization that matches the generalization performed by human fluid intelligence."}, {"time": 7151, "text": "I mean, this is a good point in terms of general fluid intelligence to mention in your paper."}, {"time": 7157, "text": "You describe different kinds of generalizations, local, broad, extreme."}, {"time": 7163, "text": "And there's a kind of a hierarchy that you form."}, {"time": 7165, "text": "So when we say generalizations, what are we talking about?"}, {"time": 7171, "text": "What kinds are there?"}, {"time": 7173, "text": "Right, so generalization is a very old idea."}, {"time": 7177, "text": "I mean, it's even older than machine learning."}, {"time": 7179, "text": "In the context of machine learning, you say a system generalizes if it can make sense of an input it has not yet seen."}, {"time": 7189, "text": "And that's what I would call system centric generalization, generalization with respect to novelty for the specific system you're considering."}, {"time": 7202, "text": "So I think a good test of intelligence should actually deal with developer aware generalization, which is slightly stronger than system centric generalization."}, {"time": 7213, "text": "So developer aware generalization would be the ability to generalize to novelty or uncertainty that not only the system itself has not access to, but the developer of the system could not have access to either."}, {"time": 7229, "text": "That's a fascinating meta definition."}, {"time": 7232, "text": "So the system is basically the edge case thing we're talking about with autonomous vehicles."}, {"time": 7239, "text": "Neither the developer nor the system know about the edge cases in my encounter."}, {"time": 7244, "text": "So it's up to the system should be able to generalize the thing that nobody expected, neither the designer of the training data, nor obviously the contents of the training data."}, {"time": 7259, "text": "That's a fascinating definition."}, {"time": 7260, "text": "So you can see degrees of generalization as a spectrum."}, {"time": 7264, "text": "And the lowest level is what machine learning is trying to do is the assumption that any new situation is going to be sampled from a static distribution of possible situations and that you already have a representative sample of the distribution."}, {"time": 7282, "text": "That's your training data."}, {"time": 7283, "text": "And so in machine learning, you generalize to a new sample from a known distribution."}, {"time": 7288, "text": "And the ways in which your new sample will be new or different are ways that are already understood by the developers of the system."}, {"time": 7299, "text": "So you are generalizing to known unknowns for one specific task."}, {"time": 7305, "text": "That's what you would call robustness."}, {"time": 7307, "text": "You are robust to things like noise, small variations, and so on for one fixed known distribution that you know through your training data."}, {"time": 7319, "text": "And the higher degree would be flexibility in machine intelligence."}, {"time": 7326, "text": "So flexibility would be something like an L5 cell driving car or maybe a robot that can pass the coffee cup test, which is the notion that you'd be given a random kitchen somewhere in the country."}, {"time": 7342, "text": "And you would have to go make a cup of coffee in that kitchen."}, {"time": 7348, "text": "So flexibility would be the ability to deal with unknown unknowns, so things that could not, dimensions of viability that could not have been possibly foreseen by the creators of the system within one specific task."}, {"time": 7362, "text": "So generalizing to the long tail of situations in self driving, for instance, would be flexibility."}, {"time": 7368, "text": "So you have robustness, flexibility, and finally, you would have extreme generalization, which is basically flexibility, but instead of just considering one specific domain, like driving or domestic robotics, you're considering an open ended range of possible domains."}, {"time": 7387, "text": "So a robot would be capable of extreme generalization if, let's say, it's designed and trained for cooking, for instance."}, {"time": 7399, "text": "And if I buy the robot and if it's able to teach itself gardening in a couple of weeks, it would be capable of extreme generalization, for instance."}, {"time": 7412, "text": "So the ultimate goal is extreme generalization."}, {"time": 7414, "text": "So creating a system that is so general that it could essentially achieve human skill parity over arbitrary tasks and arbitrary domains with the same level of improvisation and adaptation power as humans when it encounters new situations."}, {"time": 7435, "text": "And it would do so over basically the same range of possible domains and tasks as humans and using essentially the same amount of training experience of practice as humans would require."}, {"time": 7447, "text": "That would be human level extreme generalization."}, {"time": 7450, "text": "So I don't actually think humans are anywhere near the optimal intelligence bounds if there is such a thing."}, {"time": 7461, "text": "So I think for humans or in general?"}, {"time": 7465, "text": "I think it's quite likely that there is a hard limit to how intelligent any system can be."}, {"time": 7473, "text": "But at the same time, I don't think humans are anywhere near that limit."}, {"time": 7479, "text": "Yeah, last time I think we talked, I think you had this idea that we're only as intelligent as the problems we face."}, {"time": 7486, "text": "Sort of we are bounded by the problems."}, {"time": 7491, "text": "We are bounded by our environments, and we are bounded by the problems we try to solve."}, {"time": 7499, "text": "What do you make of Neuralink and outsourcing some of the brain power, like brain computer interfaces?"}, {"time": 7507, "text": "Do you think we can expand or augment our intelligence?"}, {"time": 7513, "text": "I am fairly skeptical of neural interfaces because they are trying to fix one specific bottleneck in human machine cognition, which is the bandwidth bottleneck, input and output of information in the brain."}, {"time": 7531, "text": "And my perception of the problem is that bandwidth is not at this time a bottleneck at all."}, {"time": 7541, "text": "Meaning that we already have sensors that enable us to take in far more information than what we can actually process."}, {"time": 7550, "text": "Well, to push back on that a little bit, to sort of play devil's advocate a little bit, is if you look at the internet, Wikipedia, let's say Wikipedia, I would say that humans, after the advent of Wikipedia, are much more intelligent."}, {"time": 7565, "text": "Yes, I think that's a good one."}, {"time": 7567, "text": "But that's also not about, that's about externalizing our intelligence via information processing systems, external information processing systems, which is very different from brain computer interfaces."}, {"time": 7583, "text": "Right, but the question is whether if we have direct access, if our brain has direct access to Wikipedia without Your brain already has direct access to Wikipedia."}, {"time": 7594, "text": "It's on your phone."}, {"time": 7595, "text": "And you have your hands and your eyes and your ears and so on to access that information."}, {"time": 7602, "text": "And the speed at which you can access it Is bottlenecked by the cognition."}, {"time": 7605, "text": "I think it's already close, fairly close to optimal, which is why speed reading, for instance, does not work."}, {"time": 7613, "text": "The faster you read, the less you understand."}, {"time": 7615, "text": "But maybe it's because it uses the eyes."}, {"time": 7620, "text": "So I don't believe so."}, {"time": 7621, "text": "I think the brain is very slow."}, {"time": 7624, "text": "It typically operates, you know, the fastest things that happen in the brain are at the level of 50 milliseconds."}, {"time": 7631, "text": "Forming a conscious thought can potentially take entire seconds, right?"}, {"time": 7636, "text": "And you can already read pretty fast."}, {"time": 7639, "text": "So I think the speed at which you can take information in and even the speed at which you can output information can only be very incrementally improved."}, {"time": 7649, "text": "Maybe there's a question."}, {"time": 7651, "text": "If you're a very fast typer, if you're a very trained typer, the speed at which you can express your thoughts is already the speed at which you can form your thoughts."}, {"time": 7660, "text": "Right, so that's kind of an idea that there are fundamental bottlenecks to the human mind."}, {"time": 7667, "text": "But it's possible that everything we have in the human mind is just to be able to survive in the environment."}, {"time": 7674, "text": "And there's a lot more to expand."}, {"time": 7678, "text": "Maybe, you know, you said the speed of the thought."}, {"time": 7682, "text": "So I think augmenting human intelligence is a very valid and very powerful avenue, right?"}, {"time": 7689, "text": "And that's what computers are about."}, {"time": 7692, "text": "In fact, that's what all of culture and civilization is about."}, {"time": 7696, "text": "Our culture is externalized cognition and we rely on culture to think constantly."}, {"time": 7703, "text": "Yeah, I mean, that's another, yeah."}, {"time": 7706, "text": "Not just computers, not just phones and the internet."}, {"time": 7709, "text": "I mean, all of culture, like language, for instance, is a form of externalized cognition."}, {"time": 7714, "text": "Books are obviously externalized cognition."}, {"time": 7717, "text": "Yeah, that's a good point."}, {"time": 7718, "text": "And you can scale that externalized cognition far beyond the capability of the human brain."}, {"time": 7725, "text": "And you could see civilization itself is it has capabilities that are far beyond any individual brain and will keep scaling it because it's not rebound by individual brains."}, {"time": 7739, "text": "It's a different kind of system."}, {"time": 7741, "text": "Yeah, and that system includes nonhuman, nonhumans."}, {"time": 7746, "text": "First of all, it includes all the other biological systems, which are probably contributing to the overall intelligence of the organism."}, {"time": 7752, "text": "And then computers are part of it."}, {"time": 7754, "text": "Nonhuman systems are probably not contributing much, but AIs are definitely contributing to that."}, {"time": 7759, "text": "Like Google search, for instance, is a big part of it."}, {"time": 7764, "text": "Yeah, yeah, a huge part, a part that we can't probably introspect."}, {"time": 7771, "text": "Like how the world has changed in the past 20 years, it's probably very difficult for us to be able to understand until, of course, whoever created the simulation we're in is probably doing metrics, measuring the progress."}, {"time": 7784, "text": "There was probably a big spike in performance."}, {"time": 7788, "text": "They're enjoying this."}, {"time": 7791, "text": "So what are your thoughts on the Turing test and the Lobner Prize, which is one of the most famous attempts at the test of artificial intelligence by doing a natural language open dialogue test that's judged by humans as far as how well the machine did?"}, {"time": 7818, "text": "So I'm not a fan of the Turing test."}, {"time": 7821, "text": "Itself or any of its variants for two reasons."}, {"time": 7825, "text": "So first of all, it's really coping out of trying to define and measure intelligence because it's entirely outsourcing that to a panel of human judges."}, {"time": 7843, "text": "And these human judges, they may not themselves have any proper methodology."}, {"time": 7849, "text": "They may not themselves have any proper definition of intelligence."}, {"time": 7853, "text": "They may not be reliable."}, {"time": 7854, "text": "So the Turing test is already failing one of the core psychometrics principles, which is reliability because you have biased human judges."}, {"time": 7864, "text": "It's also violating the standardization requirement and the freedom from bias requirement."}, {"time": 7870, "text": "And so it's really a cope out because you are outsourcing everything that matters, which is precisely describing intelligence and finding a standalone test to measure it."}, {"time": 7882, "text": "You're outsourcing everything to people."}, {"time": 7885, "text": "So it's really a cope out."}, {"time": 7886, "text": "And by the way, we should keep in mind that when Turing proposed the imitation game, it was not meaning for the imitation game to be an actual goal for the field of AI and actual test of intelligence."}, {"time": 7902, "text": "It was using the imitation game as a thought experiment in a philosophical discussion in his 1950 paper."}, {"time": 7913, "text": "He was trying to argue that theoretically, it should be possible for something very much like the human mind, indistinguishable from the human mind, to be encoded in a Turing machine."}, {"time": 7928, "text": "And at the time, that was a very daring idea."}, {"time": 7934, "text": "It was stretching credulity."}, {"time": 7936, "text": "But nowadays, I think it's fairly well accepted that the mind is an information processing system and that you could probably encode it into a computer."}, {"time": 7945, "text": "So another reason why I'm not a fan of this type of test is that the incentives that it creates are incentives that are not conducive to proper scientific research."}, {"time": 7960, "text": "If your goal is to trick, to convince a panel of human judges that they are talking to a human, then you have an incentive to rely on tricks and prestidigitation."}, {"time": 7976, "text": "In the same way that, let's say, you're doing physics and you want to solve teleportation."}, {"time": 7981, "text": "And what if the test that you set out to pass is you need to convince a panel of judges that teleportation took place?"}, {"time": 7989, "text": "And they're just sitting there and watching what you're doing."}, {"time": 7992, "text": "And that is something that you can achieve with David Copperfield could achieve it in his show at Vegas."}, {"time": 8002, "text": "And what he's doing is very elaborate."}, {"time": 8005, "text": "But it's not physics."}, {"time": 8009, "text": "It's not making any progress in our understanding of the universe."}, {"time": 8012, "text": "To push back on that is possible."}, {"time": 8014, "text": "That's the hope with these kinds of subjective evaluations is that it's easier to solve it generally than it is to come up with tricks that convince a large number of judges."}, {"time": 8027, "text": "In practice, it turns out that it's very easy to deceive people in the same way that you can do magic in Vegas."}, {"time": 8034, "text": "You can actually very easily convince people that they're talking to a human when they're actually talking to an algorithm."}, {"time": 8040, "text": "I just disagree."}, {"time": 8042, "text": "I think it's easy."}, {"time": 8043, "text": "I would push."}, {"time": 8045, "text": "No, it's not easy."}, {"time": 8048, "text": "It's very easy because we are biased."}, {"time": 8052, "text": "We have theory of mind."}, {"time": 8053, "text": "We are constantly projecting emotions, intentions, agentness."}, {"time": 8061, "text": "Agentness is one of our core innate priors."}, {"time": 8064, "text": "We are projecting these things on everything around us."}, {"time": 8066, "text": "Like if you paint a smiley on a rock, the rock becomes happy in our eyes."}, {"time": 8073, "text": "And because we have this extreme bias that permits everything we see around us, it's actually pretty easy to trick people."}, {"time": 8084, "text": "I so totally disagree with that."}, {"time": 8085, "text": "You brilliantly put as a huge, the anthropomorphization that we naturally do, the agentness of that word."}, {"time": 8093, "text": "Is that a real word?"}, {"time": 8093, "text": "No, it's not a real word."}, {"time": 8096, "text": "But it's a useful word."}, {"time": 8097, "text": "It's a useful word."}, {"time": 8098, "text": "Let's make it real."}, {"time": 8099, "text": "It's a huge help."}, {"time": 8101, "text": "But I still think it's really difficult to convince."}, {"time": 8104, "text": "If you do like the Alexa Prize formulation, where you talk for an hour, there's formulations of the test you can create, where it's very difficult."}, {"time": 8113, "text": "So I like the Alexa Prize better because it's more pragmatic."}, {"time": 8118, "text": "It's more practical."}, {"time": 8119, "text": "It's actually incentivizing developers to create something that's useful as a human machine interface."}, {"time": 8129, "text": "So that's slightly better than just the imitation."}, {"time": 8131, "text": "So I like it."}, {"time": 8134, "text": "Your idea is like a test which hopefully help us in creating intelligent systems as a result."}, {"time": 8139, "text": "Like if you create a system that passes it, it'll be useful for creating further intelligent systems."}, {"time": 8144, "text": "Yes, at least."}, {"time": 8147, "text": "Just to kind of comment, I'm a little bit surprised how little inspiration people draw from the Turing test today."}, {"time": 8157, "text": "The media and the popular press might write about it every once in a while."}, {"time": 8160, "text": "The philosophers might talk about it."}, {"time": 8163, "text": "But most engineers are not really inspired by it."}, {"time": 8167, "text": "And I know you don't like the Turing test, but we'll have this argument another time."}, {"time": 8175, "text": "There's something inspiring about it, I think."}, {"time": 8178, "text": "As a philosophical device in a physical discussion, I think there is something very interesting about it."}, {"time": 8183, "text": "I don't think it is in practical terms."}, {"time": 8186, "text": "I don't think it's conducive to progress."}, {"time": 8189, "text": "And one of the reasons why is that I think being very human like, being indistinguishable from a human is actually the very last step in the creation of machine intelligence."}, {"time": 8201, "text": "That the first ARs that will show strong generalization that will actually implement human like broad cognitive abilities, they will not actually behave or look anything like humans."}, {"time": 8218, "text": "Human likeness is the very last step in that process."}, {"time": 8221, "text": "And so a good test is a test that points you towards the first step on the ladder, not towards the top of the ladder."}, {"time": 8228, "text": "So to push back on that, I usually agree with you on most things."}, {"time": 8233, "text": "I remember you, I think at some point, tweeting something about the Turing test not being being counterproductive or something like that."}, {"time": 8240, "text": "And I think a lot of very smart people agree with that."}, {"time": 8243, "text": "I, a computation speaking, not very smart person, disagree with that."}, {"time": 8252, "text": "Because I think there's some magic to the interactivity with other humans."}, {"time": 8289, "text": "So in the ARC challenge, for example, you're an observer."}, {"time": 8292, "text": "You can't scare the test into changing."}, {"time": 8297, "text": "You can't talk to the test."}, {"time": 8299, "text": "You can't play with it."}, {"time": 8301, "text": "So there's some aspect of that interactivity that becomes highly subjective, but it feels like it could be conducive to generalizability."}, {"time": 8309, "text": "I think you make a great point."}, {"time": 8311, "text": "The interactivity is a very good setting to force a system to show adaptation, to show generalization."}, {"time": 8319, "text": "That said, at the same time, it's not something very scalable, because you rely on human judges."}, {"time": 8326, "text": "It's not something reliable, because the human judges may not, may not."}, {"time": 8329, "text": "So you don't like human judges."}, {"time": 8331, "text": "And I think so."}, {"time": 8332, "text": "I love the idea of interactivity."}, {"time": 8368, "text": "It would be amazing if you could also, even higher level than that, measure the quality of your attempts, which, of course, is impossible."}, {"time": 8376, "text": "But again, that gets subjective."}, {"time": 8378, "text": "How good was your thinking?"}, {"time": 8381, "text": "How efficient was?"}, {"time": 8383, "text": "So one thing that's interesting about this notion of scoring you as how many attempts you need is that you can start producing tasks that are way more ambiguous, right?"}, {"time": 8396, "text": "Because with the different attempts, you can actually probe that ambiguity, right?"}, {"time": 8404, "text": "So that's, in a sense, which is how good can you adapt to the uncertainty and reduce the uncertainty?"}, {"time": 8415, "text": "Yes, it's half fast."}, {"time": 8418, "text": "It's the efficiency with which you reduce uncertainty in program space, exactly."}, {"time": 8422, "text": "Very difficult to come up with that kind of test, though."}, {"time": 8424, "text": "Yeah, so I would love to be able to create something like this."}, {"time": 8428, "text": "In practice, it would be very, very difficult, but yes."}, {"time": 8433, "text": "I mean, what you're doing, what you've done with the ARC challenge is brilliant."}, {"time": 8437, "text": "I'm also not surprised that it's not more popular, but I think it's picking up."}, {"time": 8442, "text": "It does its niche."}, {"time": 8442, "text": "It does its niche, yeah."}, {"time": 8444, "text": "What are your thoughts about another test?"}, {"time": 8447, "text": "I talked with Marcus Hutter."}, {"time": 8448, "text": "He has the Hutter Prize for compression of human knowledge."}, {"time": 8451, "text": "And the idea is really sort of quantify and reduce the test of intelligence purely to just the ability to compress."}, {"time": 8459, "text": "What's your thoughts about this intelligence as compression?"}, {"time": 8464, "text": "I mean, it's a very fun test because it's such a simple idea, like you're given Wikipedia, basic English Wikipedia, and you must compress it."}, {"time": 8475, "text": "And so it stems from the idea that cognition is compression, that the brain is basically a compression algorithm."}, {"time": 8485, "text": "It's a very, I think, striking and beautiful idea."}, {"time": 8490, "text": "I used to believe it."}, {"time": 8492, "text": "I eventually had to realize that it was very much a flawed idea."}, {"time": 8496, "text": "So I no longer believe that cognition is compression."}, {"time": 8501, "text": "But I can tell you what's the difference."}, {"time": 8504, "text": "So it's very easy to believe that cognition and compression are the same thing."}, {"time": 8511, "text": "So Jeff Hawkins, for instance, says that cognition is prediction."}, {"time": 8514, "text": "And of course, prediction is basically the same thing as compression."}, {"time": 8518, "text": "It's just including the temporal axis."}, {"time": 8523, "text": "And it's very easy to believe this because compression is something that we do all the time very naturally."}, {"time": 8529, "text": "We are constantly compressing information."}, {"time": 8532, "text": "We are constantly trying."}, {"time": 8535, "text": "We have this bias towards simplicity."}, {"time": 8537, "text": "We are constantly trying to organize things in our mind and around us to be more regular."}, {"time": 8544, "text": "So it's a beautiful idea."}, {"time": 8546, "text": "It's very easy to believe."}, {"time": 8548, "text": "There is a big difference between what we do with our brains and compression."}, {"time": 8553, "text": "So compression is actually kind of a tool in the human cognitive toolkit that is used in many ways."}, {"time": 8562, "text": "But it's just a tool."}, {"time": 8564, "text": "It is a tool for cognition."}, {"time": 8565, "text": "It is not cognition itself."}, {"time": 8567, "text": "And the big fundamental difference is that cognition is about being able to operate in future situations that include fundamental uncertainty and novelty."}, {"time": 8582, "text": "So for instance, consider a child at age 10."}, {"time": 8586, "text": "And so they have 10 years of life experience."}, {"time": 8590, "text": "They've gotten pain, pleasure, rewards, and punishment in a period of time."}, {"time": 8634, "text": "So in the models we build of the world, we are not trying to make them actually optimally compressed."}, {"time": 8643, "text": "We are using compression as a tool to promote simplicity and efficiency in our models."}, {"time": 8650, "text": "But they are not perfectly compressed because they need to include things that are seemingly useless today, that have seemingly been useless so far."}, {"time": 8660, "text": "But that may turn out to be useful in the future because you just don't know the future."}, {"time": 8665, "text": "And that's the fundamental principle that cognition, that intelligence arises from is that you need to be able to run appropriate behavioral programs except you have absolutely no idea what sort of context, environment, situation they are going to be running in."}, {"time": 8682, "text": "And you have to deal with that uncertainty, with that future anomaly."}, {"time": 8686, "text": "So an analogy that you can make is with investing, for instance."}, {"time": 8694, "text": "If I look at the past 20 years of stock market data, and I use a compression algorithm to figure out the best trading strategy, it's going to be you buy Apple stock, then maybe the past few years you buy Tesla stock or something."}, {"time": 8710, "text": "But is that strategy still going to be true for the next 20 years?"}, {"time": 8714, "text": "Well, actually, probably not, which is why if you're a smart investor, you're not just going to be following the strategy that corresponds to compression of the past."}, {"time": 8728, "text": "You're going to be following, you're going to have a balanced portfolio, right?"}, {"time": 8734, "text": "Because you just don't know what's going to happen."}, {"time": 8738, "text": "I mean, I guess in that same sense, the compression is analogous to what you talked about, which is local or robust generalization versus extreme generalization."}, {"time": 8747, "text": "It's much closer to that side of being able to generalize in the local sense."}, {"time": 8753, "text": "That's why as humans, when we are children, in our education, so a lot of it is driven by play, driven by curiosity."}, {"time": 8764, "text": "We are not efficiently compressing things."}, {"time": 8767, "text": "We're actually exploring."}, {"time": 8769, "text": "We are retaining all kinds of things from our environment that seem to be completely useless."}, {"time": 8779, "text": "Because they might turn out to be eventually useful, right?"}, {"time": 8784, "text": "And that's what cognition is really about."}, {"time": 8786, "text": "And what makes it antagonistic to compression is that it is about hedging for future uncertainty."}, {"time": 8793, "text": "And that's antagonistic to compression."}, {"time": 8796, "text": "Officially hedging."}, {"time": 8798, "text": "Cognition leverages compression as a tool to promote efficiency and simplicity in our models."}, {"time": 8807, "text": "It's like Einstein said, make it simpler, but not, however that quote goes, but not too simple."}, {"time": 8814, "text": "So compression simplifies things, but you don't want to make it too simple."}, {"time": 8820, "text": "So a good model of the world is going to include all kinds of things that are completely useless, actually, just in case."}, {"time": 8828, "text": "Because you need diversity in the same way that in your portfolio."}, {"time": 8831, "text": "You need all kinds of stocks that may not have performed well so far, but you need diversity."}, {"time": 8835, "text": "And the reason you need diversity is because fundamentally you don't know what you're doing."}, {"time": 8839, "text": "And the same is true of the human mind, is that it needs to behave appropriately in the future."}, {"time": 8846, "text": "And it has no idea what the future is going to be like."}, {"time": 8849, "text": "But it's not going to be like the past."}, {"time": 8851, "text": "So compressing the past is not appropriate, because the past is not, it's not predictive of the future."}, {"time": 8860, "text": "Yeah, history repeats itself, but not perfectly."}, {"time": 8864, "text": "I don't think I asked you last time the most inappropriately absurd question."}, {"time": 8871, "text": "We've talked a lot about intelligence, but the bigger question from intelligence is of meaning."}, {"time": 8880, "text": "Intelligence systems are kind of goal oriented."}, {"time": 8882, "text": "They're always optimizing for a goal."}, {"time": 8885, "text": "If you look at the Hutter Prize, actually, I mean, there's always a clean formulation of a goal."}]}]