[{"title": "Rob Reid: The Existential Threat of Engineered Viruses and Lab Leaks | Lex Fridman Podcast #193", "id": "cuD9uNFXnU8", "quotes": [{"time": 393, "text": "But if we are, that will mean that 2020 is just a prequel for even more bizarre years ahead."}, {"time": 401, "text": "So I kind of hope that we're not designed for maximum entertainment."}, {"time": 405, "text": "Well, the night is still young in terms of Canada."}, {"time": 407, "text": "But do you think it's possible for the observer and the producer to be kind of emergent?"}, {"time": 412, "text": "So meaning, it does seem when you kind of watch memes on the internet, the funny ones, the entertaining ones spread more efficiently."}, {"time": 422, "text": "I mean, I don't know what it is about the human mind that soaks up on mass funny things much more sort of aggressively."}, {"time": 432, "text": "It's more viral in the full sense of that word."}, {"time": 436, "text": "Is there some sense that whatever the evolutionary process that created our cognitive capabilities is the same process that's going to, in an emergent way, create the most entertaining outcome, the most memeifiable outcome, the most viral outcome if we were to share it on Twitter?"}, {"time": 458, "text": "Yeah, we do have an incredible ability."}, {"time": 461, "text": "Like I mean, how many memes are created in a given day and the ones that go viral are almost uniformly funny, at least to somebody with a particular sense of humor."}, {"time": 468, "text": "Yeah, I'd have to think about that."}, {"time": 473, "text": "We are definitely great at creating atomized units of funny."}, {"time": 479, "text": "Like in the example that you used, there are going to be X million brains parsing and judging whether this meme is retweetable or not."}, {"time": 487, "text": "And so that sort of atomic element of funniness, of entertainingness, et cetera, we definitely have an environment that's good at selecting for that and selective pressure and everything else that's going on."}, {"time": 501, "text": "But in terms of the entire ecosystem of conscious systems here on the Earth driving for a level of entertainment, that is on such a much higher level that I don't know if that would necessarily follow directly from the fact that atomic units of entertainment are very, very aptly selected for us."}, {"time": 526, "text": "Do you find it compelling or useful to think about human civilization from the perspective of the ideas versus the perspective of the individual human brains?"}, {"time": 539, "text": "Just almost thinking about the ideas or the memes."}, {"time": 542, "text": "This is the Dawkins thing as the organisms and then the humans as just like vehicles for briefly carrying those organisms as they jump around and spread."}, {"time": 553, "text": "Yeah, for propagating them, mutating them, putting selective pressure on them, et cetera."}, {"time": 559, "text": "I mean, I found Dawkins interpret or his launching of the idea of memes is just kind of an afterthought to his unbelievably brilliant book about the selfish gene."}, {"time": 572, "text": "What a PS to put at the end of a long chunk of writing, profoundly interesting."}, {"time": 577, "text": "I view the relationship though between humans and memes as probably an oversimplification, but maybe a little bit like the relationship between flowers and bees, right?"}, {"time": 587, "text": "Do flowers have bees or do bees in a sense have flowers?"}, {"time": 592, "text": "And the answer is it is a very, very symbiotic relationship in which both have semi independent roles that they play and both are highly dependent upon the other."}, {"time": 603, "text": "And so in the case of bees, obviously, you could see the flower is being this monolithic structure physically in relation to any given bee and it's the source of food and sustenance."}, {"time": 614, "text": "So you could kind of say, well, flowers have bees."}, {"time": 617, "text": "But on the other hand, the flowers would obviously be doomed."}, {"time": 620, "text": "They weren't being pollinated by the bees."}, {"time": 622, "text": "So you could kind of say, well, you know, bees are, you know, flowers are really expression of what the bees need."}, {"time": 628, "text": "And the truth is a symbiosis."}, {"time": 630, "text": "So with, with memes and human minds, our brains are clearly the Petri dishes in which memes are either propagated or not propagated, get mutated or don't get mutated if they are the venue in which competition, selective competition plays out between different memes."}, {"time": 651, "text": "So all of that is very true."}, {"time": 653, "text": "And you could look at that and say, really, the human mind is a production of memes and ideas have us rather than us having ideas."}, {"time": 661, "text": "But at the same time, let's take a catchy tune as an example of a meme."}, {"time": 667, "text": "That catchy tune did originate in a human mind."}, {"time": 671, "text": "Somebody had to structure that thing."}, {"time": 673, "text": "And as much as I like Elizabeth Gilbert's TED talk about how the universe, I'm simplifying, but you know, kind of the ideas find their way in this beautiful TED talk."}, {"time": 682, "text": "It's very lyrical."}, {"time": 683, "text": "She talked about, you know, ideas and prose kind of beaming into our minds."}, {"time": 690, "text": "And you know, she talked about needing to pull over to the side of the road when she got inspiration for a particular paragraph or a particular idea and a burning need to write that down."}, {"time": 701, "text": "It's that beautiful as a writer, as a novelist myself, I've never had that experience."}, {"time": 707, "text": "And I think that really most things that do become memes are the product of a great deal of deliberate and willful exertion of a conscious mind."}, {"time": 719, "text": "And so like the bees and the flowers, I think there's a great symbiosis and they both kind of have one another."}, {"time": 725, "text": "Ideas have us, but we have ideas for real."}, {"time": 728, "text": "If we could take a little bit of a tangent, Stephen King on writing, you as a great writer, you're dropping a hint here that the ideas don't come to you."}, {"time": 738, "text": "It's a grind of sort of, it's almost like you're mining for gold."}, {"time": 742, "text": "It's more of a very deliberate, rigorous daily process."}, {"time": 748, "text": "So maybe can you talk about the writing process?"}, {"time": 752, "text": "How do you write well?"}, {"time": 756, "text": "And maybe if you want to step outside of yourself, almost like give advice to an aspiring writer, what does it take to write the best work of your life?"}, {"time": 766, "text": "Well it would be very different if it's fiction versus nonfiction."}, {"time": 770, "text": "And I've done both."}, {"time": 771, "text": "I've written two nonfiction books and two works of fiction."}, {"time": 775, "text": "Two works of fiction being more recent, I'm going to focus on that right now because that's more toweringly on my mind."}, {"time": 782, "text": "Bronx novelists, again, this is an oversimplification, but there's kind of two schools of thought."}, {"time": 788, "text": "Some people really like to fly by the seat of their pants and some people really, really like to outline, to plot."}, {"time": 795, "text": "So there's plotters and pantsers, I guess is one way that people look at it."}, {"time": 800, "text": "And as with most things, there is a great continuum in between and I'm somewhere on that continuum, but I lean, I guess, a little bit more toward the plotter."}, {"time": 809, "text": "And so when I do start a novel, I have a pretty strong point of view about how it's going to end and I have a very strong point of view about how it's going to begin."}, {"time": 819, "text": "And I do try to make an effort of making an outline that I know I'm going to be extremely unfaithful to in the actual execution of the story, but trying to make an outline that gets us from here to there and notion of subplots and beats and rhythm and different characters and so forth."}, {"time": 836, "text": "But then when I get into the process, that outline, particularly the center of it, ultimately inevitably morphs a great deal."}, {"time": 843, "text": "And I think if I were personally a rigorous outliner, I would not allow that to happen."}, {"time": 848, "text": "I also would make a much more vigorous skeleton before I start."}, {"time": 854, "text": "So I think people who are really in that plotting outlining mode are people who write page turners, people who write spy novels or supernatural adventures, where you really want a relentless pace of events, action, plot twists, conspiracy, et cetera."}, {"time": 877, "text": "And that is really the bone."}, {"time": 880, "text": "That's really the skeletal structure."}, {"time": 882, "text": "So I think folks who write that kind of book are really very much on the outlining side."}, {"time": 887, "text": "And then I think people who write what's often referred to as literary fiction for lack of a better term, where it's more about sort of aura and ambiance and character development and experience and inner experience and inner journey and so forth, I think that group is more likely to fly by the seat of their pants."}, {"time": 907, "text": "And I know people who start with a blank page and just see where it's going to go."}, {"time": 911, "text": "I'm a little bit more on the plotting side."}, {"time": 914, "text": "Now you asked what makes something, at least in the mind of the writer, as great as it can be."}, {"time": 922, "text": "For me, it's an astonishingly high percentage of it is editing as opposed to the initial writing."}, {"time": 927, "text": "For every hour that I spend writing new prose, like new pages, new paragraphs, new bits of the book, I probably spend..."}, {"time": 940, "text": "I wish I kept a count."}, {"time": 942, "text": "I wish I had one of those pieces of software that lawyers use to decide how much time I'm going to be doing this, that."}, {"time": 948, "text": "But I would say it's at least four or five hours and maybe as many as 10 that I spend editing."}, {"time": 954, "text": "And so it's relentless for me."}, {"time": 956, "text": "For each one hour of writing, you said?"}, {"time": 958, "text": "I'd say that."}, {"time": 959, "text": "Four, wow."}, {"time": 960, "text": "I mean, I write because I edit and I spend just relentlessly polishing and pruning and sometimes on the micro level of just like, does the rhythm of the sentence feel right?"}, {"time": 972, "text": "Do I need to carve a syllable or something so it can land?"}, {"time": 975, "text": "Like as micro as that to as macro as like, okay, I'm done but the book is 750 pages long and it's way too bloated and I need to lop a third out of it."}, {"time": 985, "text": "Problems on those two orders of magnitude and everything in between, that is an enormous amount of my time."}, {"time": 991, "text": "And I also write music, write and record and produce music."}, {"time": 997, "text": "And there the ratio is even higher."}, {"time": 1000, "text": "Every minute that I spend or my band spends laying down that original audio, it's a very high proportion of hours that go into just making it all hang together and sound just right."}, {"time": 1013, "text": "So I think that's true of a lot of creative processes."}, {"time": 1016, "text": "I know it's true of sculpture."}, {"time": 1018, "text": "I believe it's true of woodwork."}, {"time": 1019, "text": "My dad was an amateur woodworker and he spent a huge amount of time on sanding and polishing at the end."}, {"time": 1025, "text": "So I think a great deal of the sparkle comes from that part of the process, any creative process."}, {"time": 1030, "text": "Can I ask about the psychological, the demon side of that picture?"}, {"time": 1034, "text": "In the editing process, you're ultimately judging the initial piece of work and you're judging and judging and judging."}, {"time": 1040, "text": "How much of your time do you spend hating your work?"}, {"time": 1046, "text": "How much time do you spend in gratitude, impressed, thankful, or how good the work that you will put together is?"}, {"time": 1056, "text": "I spend almost all the time in a place that's intermediate between those, but leaning toward gratitude."}, {"time": 1063, "text": "I spend almost all the time in a state of optimism that this thing that I have, I like, I like quite a bit and I can make it better and better and better with every time I go through it."}, {"time": 1077, "text": "So I spend most of my time in a state of optimism."}, {"time": 1081, "text": "I think I personally oscillate much more aggressively between those two, where I wouldn't be able to find the average."}, {"time": 1087, "text": "I go pretty deep."}, {"time": 1091, "text": "Marvin Minsky from MIT had this advice, I guess, to what it takes to be successful in science and research is to hate everything you do."}, {"time": 1103, "text": "You've ever done in the past."}, {"time": 1105, "text": "I mean, at least he was speaking about himself that the key to his success was to hate everything he's ever done."}, {"time": 1112, "text": "I have a little Marvin Minsky there in me too, to sort of always be exceptionally self critical, but almost like self critical about the work, but grateful for the chance to be able to do the work."}, {"time": 1126, "text": "If that makes sense."}, {"time": 1127, "text": "It makes perfect sense."}, {"time": 1128, "text": "But that, you know, each one of us have to strike a certain kind of balance."}, {"time": 1136, "text": "But back to the destruction of human civilization."}, {"time": 1140, "text": "If humans destroy ourselves in the next hundred years, what will be the most likely source, the most likely reason that we destroy ourselves?"}, {"time": 1150, "text": "Well, let's see, a hundred years."}, {"time": 1154, "text": "It's hard for me to comfortably predict out that far, and it's something to give a lot more thought to, I think, than normal folks simply because I am a science fiction writer."}, {"time": 1165, "text": "And you know, I feel with the acceleration of technological progress, it's really hard to foresee out more than just a few decades."}, {"time": 1173, "text": "I mean, comparing today's world to that of 1921, where we are right now, a century later, it would have been so unforeseeable."}, {"time": 1182, "text": "And I just don't know what's going to happen, particularly with exponential technologies."}, {"time": 1186, "text": "I mean, our intuitions reliably defeat ourselves with exponential technologies like computing and synthetic biology and, you know, how we might destroy ourselves in the hundred year time frame might have everything to do with breakthroughs in nanotechnology 40 years from now and then how rapidly those breakthroughs accelerate."}, {"time": 1205, "text": "But in the near term that I'm comfortable predicting, let's say 30 years, I would say the most likely route to self destruction would be synthetic biology."}, {"time": 1216, "text": "And I always say that with the gigantic caveat and very important one that I find, and I'll abbreviate synthetic biology to SynBio just to save us some syllables."}, {"time": 1225, "text": "I believe SynBio offers us simply stunning promise that we would be fools to deny ourselves."}, {"time": 1234, "text": "So I'm not an anti SynBio person by any stretch."}, {"time": 1237, "text": "I mean, SynBio has unbelievable odds of helping us beat cancer, helping us rescue the environment, helping us do things that we would currently find imponderable."}, {"time": 1246, "text": "So it's electrifying the field."}, {"time": 1248, "text": "But in the wrong hands, those hands either being incompetent or being malevolent."}, {"time": 1254, "text": "In the wrong hands, synthetic biology to me has a much, much greater odds of leading to our self destruction than something running amok with super AI, which I believe is a real possibility and one we need to be concerned about."}, {"time": 1270, "text": "But in the 30 year time frame, I think it's a lesser one or nuclear weapons or anything else that I can think of."}, {"time": 1276, "text": "Can you explain that a little bit further?"}, {"time": 1278, "text": "So your concern is on the manmade versus the natural side of the pandemic frontier."}, {"time": 1286, "text": "So we humans, engineering pathogens, engineering viruses is the concern here."}, {"time": 1294, "text": "And maybe how do you see the possible trajectories happening here in terms of, is it malevolent or is it accidents, oops, little mistakes or unintended consequences of particular actions that are ultimately lead to unexpected mistakes?"}, {"time": 1313, "text": "Well, both of them are a danger."}, {"time": 1315, "text": "And I think the question of which is more likely has to do with two things."}, {"time": 1320, "text": "One, do we take a lot of methodical, affordable, foresighted steps that we are absolutely capable of taking right now to forestall the risk of a bad actor infecting us with something that could have annihilating impacts?"}, {"time": 1337, "text": "And in the episode you referenced with Sam, we talked a great deal about that."}, {"time": 1342, "text": "So do we take those steps?"}, {"time": 1344, "text": "And if we take those steps, I think the danger of malevolent rogue actors doing us in with Sin Bio couldn't plummet."}, {"time": 1351, "text": "But you know, it's always a question of if and we have a bad, bad and very long track record of hitting the snooze bar after different natural pandemics have attacked us."}, {"time": 1361, "text": "So that's variable number one."}, {"time": 1363, "text": "Variable number two is how much experimentation and pathogen development do we as a society decide is acceptable in the realms of academia, government or private industry?"}, {"time": 1379, "text": "And if we decide as a society that it's perfectly okay for people with varying research agendas to create pathogens that if released could wipe out humanity, if we think that's fine and if that kind of work starts happening in one lab, five labs, 50 labs, 500 labs in one country, then 10 countries, then 70 countries or whatever, that risk of a boo boo starts rising astronomically."}, {"time": 1408, "text": "And this won't be a spoiler alert based on the way that I presented those two things, but I think it's unbelievably important to manage both of those risks."}, {"time": 1417, "text": "The easier one to manage, although it wouldn't be simple by any stretch because it would have to be something that all nations agree on."}, {"time": 1425, "text": "But the easiest way, the easier risk to manage is that of, hey guys, let's not develop pathogens that if they escaped from a lab could annihilate us."}, {"time": 1436, "text": "There's no line of research that justifies that."}, {"time": 1438, "text": "And in my view, I mean, that's the point of perspective we need to have."}, {"time": 1442, "text": "We'd have to collectively agree that there's no line of research that justifies that."}, {"time": 1446, "text": "The reason why I believe that would be a highly rational conclusion is even the highest level of biosafety lab in the world, biosafety lab level four."}, {"time": 1455, "text": "And there are not a lot of BSL four labs in the world."}, {"time": 1458, "text": "There are things can and have leaked out of BSL four labs and some of the work that's been done with potentially annihilating pathogens, which we can talk about, it's actually done at BSL three."}, {"time": 1472, "text": "And so fundamentally any lab can leak."}, {"time": 1476, "text": "We have proven ourselves to be incapable of creating a lab that is utterly impervious to leaks."}, {"time": 1482, "text": "So why in the world would we create something where if God forbid it leaked, could annihilate us all."}, {"time": 1488, "text": "And by the way, almost all of the measures that are taken in biosafety level anything labs are designed to prevent accidental leaks."}, {"time": 1497, "text": "What happens if you have a malevolent insider?"}, {"time": 1499, "text": "We could talk about the psychology and the motivations of what would make a malevolent insider who wants to release something and not annihilating in a bit."}, {"time": 1507, "text": "I'm sure that we will."}, {"time": 1508, "text": "But what if you have a malevolent insider?"}, {"time": 1511, "text": "Virtually none of the standards that go into biosafety level one, two, three, and four are about preventing somebody hijacking the process."}, {"time": 1520, "text": "Some of them are, but they're mainly designed against accidents."}, {"time": 1523, "text": "They're imperfect against accidents."}, {"time": 1525, "text": "And if this kind of work starts happening in lots and lots of labs with every lab you add, the odds of there being a malevolent inside are naturally increased arithmetically as the number of labs goes up."}, {"time": 1571, "text": "And I think we do both of those things, decide that no, we're not going to experimentally make annihilating pathogens in leaky labs, and B, yes, we are going to take countermeasures that are going to cost a fraction of our annual defense budget to preclude their creation, then I think both risks get managed down."}, {"time": 1591, "text": "But if you take one set of precautions and not the other, then the thing that you have not taken precautions against immediately becomes the more likely outcome."}, {"time": 1601, "text": "So can we talk about this kind of research and what's actually done and what are the positives and negatives of it?"}, {"time": 1607, "text": "So if we look at gain of function research and the kind of stuff that's happening in level three and level four BSL labs, what's the whole idea here?"}, {"time": 1616, "text": "Is it trying to engineer viruses to understand how they behave?"}, {"time": 1621, "text": "You want to understand the dangerous ones."}, {"time": 1624, "text": "So that would be the logic behind doing it."}, {"time": 1626, "text": "And so gain of function can mean a lot of different things."}, {"time": 1630, "text": "Viewed through a certain lens, gain of function research could be what you do when you create, you know, GMOs, when you create, you know, hearty strains of corn that are resistant to pesticides."}, {"time": 1641, "text": "I mean, you could view that as gain of function."}, {"time": 1643, "text": "So I'm going to refer to gain of function in a relatively narrow sense, which is actually the sense that the term is usually used, which is in some way magnifying capabilities of microorganisms to make them more dangerous, whether it's more transmissible or more deadly."}, {"time": 1660, "text": "And in that line of research, I'll use an example from 2011 because it's very illustrative and it's also very chilling."}, {"time": 1668, "text": "Back in 2011, two separate labs independently of one another, I assume there was some kind of communication between them, but they were basically independent projects, one in Holland and one in Wisconsin, did gain of function research on something called H5N1 flu."}, {"time": 1684, "text": "H5N1 is, you know, something that, at least on a lethality basis, makes COVID look like a kitten."}, {"time": 1692, "text": "You know, COVID, according to the World Health Organization, has a case fatality rate somewhere between half a percent and one percent, H5N1 is closer to 60 percent, six zero."}, {"time": 1701, "text": "And so that's actually even slightly more lethal than Ebola."}, {"time": 1704, "text": "It's a very, very, very scary pathogen."}, {"time": 1707, "text": "The good news about H5N1 is that it is barely, barely contagious."}, {"time": 1713, "text": "But I believe it is in no way contagious human to human."}, {"time": 1716, "text": "It requires, you know, very, very, very deep contact with birds, in most cases chickens."}, {"time": 1724, "text": "And so if you're a chicken farmer and you spend an enormous amount of time around them and perhaps you get into situations in which you get a break in your skin and you're interacting intensely with fowl who, as it turns out, have H5N1, that's when the jump comes."}, {"time": 1741, "text": "But it's not, there's no airborne transmission that we're aware of human to human."}, {"time": 1745, "text": "I mean, not that it just doesn't exist."}, {"time": 1748, "text": "I think the World Health Organization did a relentless survey of the number of H5N1 cases."}, {"time": 1755, "text": "I think they do it every year."}, {"time": 1756, "text": "I saw one 10 year series where I think it was like 500 fatalities over the course of a decade."}, {"time": 1763, "text": "And that's a drop in the bucket."}, {"time": 1764, "text": "Kind of fun, fun fact, I believe the typical lethality from lightning over 10 years is 70,000 deaths."}, {"time": 1771, "text": "So we think getting struck by lightning, pretty low risk, H5N1 much, much lower than that."}, {"time": 1777, "text": "What happened in these experiments is the experimenters in both cases set out to make H5N1 that would be contagious, that could create airborne transmission."}, {"time": 1788, "text": "And so they basically passed it, I think in both cases, they passed it through a large number of ferrets."}, {"time": 1794, "text": "And so this wasn't like CRISPR, there wasn't even any CRISPR back in those days."}, {"time": 1798, "text": "This was relatively straightforward, selecting for a particular outcome."}, {"time": 1803, "text": "And after guiding the path and passing them through, again, I believe it was a series of ferrets."}, {"time": 1808, "text": "They did in fact come up with a version of H5N1 that is capable of airborne transmission."}, {"time": 1814, "text": "Now they didn't unleash it into the world."}, {"time": 1817, "text": "They didn't inject it into humans to see what would happen."}, {"time": 1820, "text": "And so for those two reasons, we don't really know how contagious it might have been."}, {"time": 1825, "text": "But if it was as contagious as COVID, that could be a civilization threatening pathogen."}, {"time": 1833, "text": "And why would you do it?"}, {"time": 1834, "text": "Well, the people who did it were good guys."}, {"time": 1836, "text": "They were virologists."}, {"time": 1838, "text": "I believe their agenda as they explained it was much as you said, let's figure out what a worst case scenario might look like so we can understand it better."}, {"time": 1847, "text": "But my understanding is in both cases, it was done in BSL3 labs."}, {"time": 1852, "text": "And so potential of leak, significantly nonzero, hopefully way below 1% but significantly nonzero."}, {"time": 1861, "text": "And when you look at the consequences of an escape in terms of human lives, destruction of a large portion of the economy, et cetera, and you do an expected value calculation on whatever fraction of 1% that was, you would come up with a staggering cost, staggering expected cost for this work."}, {"time": 1879, "text": "So it should never have been carried out."}, {"time": 1881, "text": "Now you might make an argument if you said, if you believed that H5N1 in nature is on an inevitable path to airborne transmission, and it's only going to be a small number of years, A."}, {"time": 1895, "text": "And B, if it makes that transition, there is one set of changes to its metabolic pathways and its genomic code and so forth, one that we have discovered."}, {"time": 1909, "text": "So it is going to go from point A, which is where it is right now, to point B."}, {"time": 1909, "text": "We have reliably engineered point B."}, {"time": 1913, "text": "That is the destination."}, {"time": 1918, "text": "And we need to start fighting that right now because this is five years or less away."}, {"time": 1922, "text": "Now that'd be a very different world."}, {"time": 1923, "text": "That'd be like spotting an asteroid that's coming toward the earth and is five years off."}, {"time": 1927, "text": "And yes, you marshal everything you can to resist that."}, {"time": 1930, "text": "But there's two problems with that perspective."}, {"time": 1932, "text": "The first is, in however many thousands of generations that humans have been inhabiting this planet, there has never been a transmissible form of H5N1."}, {"time": 1941, "text": "And influenza has been around for a very long time."}, {"time": 1943, "text": "So there is no case for inevitability of this kind of a jump to airborne transmission."}, {"time": 1950, "text": "So we're not on a freight train to that outcome."}, {"time": 1953, "text": "And if there was inevitability around that, it's not like there's just one set of genetic code that would get there."}, {"time": 1961, "text": "There's all kinds of different mutations that could conceivably result in that kind of an outcome, unbelievable diversity of mutations."}, {"time": 1969, "text": "And so we're not actually creating something we're inevitably going to face, but we are creating something, we are creating a very powerful and unbelievably negative card and injecting it in the deck that nature never put into the deck."}, {"time": 1984, "text": "So in that case, I just don't see any moral or scientific justification for that kind of work."}, {"time": 1992, "text": "And interestingly, there was quite a bit of excitement and concern about this when the work came out."}, {"time": 1999, "text": "One of the teams was going to publish their results in Science, the other in Nature."}, {"time": 2002, "text": "And there were a lot of editorials and a lot of scientists are saying, this is crazy."}, {"time": 2007, "text": "And publication of those papers did get suspended."}, {"time": 2011, "text": "And not long after that, there was a pause put on US government funding, NIH funding on gain of function research."}, {"time": 2018, "text": "But both of those speed bumps were ultimately removed."}, {"time": 2021, "text": "Those papers did ultimately get published."}, {"time": 2023, "text": "And that pause on funding, you know, ceased long ago."}, {"time": 2027, "text": "And in fact, those two very projects, my understanding is resumed their funding, got their government funding back."}, {"time": 2033, "text": "I don't know why a Dutch project is getting NIH funding, but whatever, about a year and a half ago."}, {"time": 2038, "text": "So as far as the US government and regulators are concerned, it's all systems go for gain of function at this point, which I find very troubling."}, {"time": 2047, "text": "Now I'm a little bit of an outsider from this field, but it has echoes of the same kind of problem I see in the AI world with autonomous weapon systems."}, {"time": 2056, "text": "Nobody in my colleagues, my colleagues, friends, as far as I can tell, people in the AI community are not really talking about autonomous weapon systems as now US and China full steam ahead on the development of both."}, {"time": 2073, "text": "And that seems to be a similar kind of thing on gain of function."}, {"time": 2077, "text": "I've, you know, have friends in the biology space and they don't want to talk about gain of function publicly."}, {"time": 2086, "text": "And I don't, that makes me very uncomfortable from an outsider perspective in terms of gain of function."}, {"time": 2091, "text": "It makes me very uncomfortable from the insider perspective on autonomous weapon systems."}, {"time": 2096, "text": "I'm not sure how to communicate exactly about autonomous weapon systems."}, {"time": 2100, "text": "And I certainly don't know how to communicate effectively about gain of function."}, {"time": 2104, "text": "What is the right path forward here?"}, {"time": 2106, "text": "Could we seize all gain of function research?"}, {"time": 2108, "text": "Is that, is that really the solution here?"}, {"time": 2111, "text": "Well, again, I'm going to use gain of function in the relatively narrow context of over assessing because you could say almost, you know, anything that you do to make biology more effective as gain of function."}, {"time": 2120, "text": "So within the narrow confines of what we're discussing, I think it would be easy enough for level headed people in all of the countries, level headed governmental people in all the countries that realistically could support such a program to agree, we don't want this to happen because all labs leak."}, {"time": 2140, "text": "I mean, and you know, an example that I use, I actually didn't use it in the piece I did with Sam Harris as well, is the anthrax attacks in the United States in 2001."}, {"time": 2150, "text": "I mean, talk about an example of the least likely lab leaking into the least likely place."}, {"time": 2157, "text": "This was shortly after 9 11, folks who don't remember it, and it was a very, very lethal strand of anthrax that as it turned out, based on the forensic genomic work that was done and so forth, absolutely leaked from a high security US army lab."}, {"time": 2173, "text": "Probably the one at Fort Detrick in Maryland, it might've been another one, but who cares?"}, {"time": 2177, "text": "It absolutely leaked from a high security US army lab."}, {"time": 2181, "text": "And where did it leak to?"}, {"time": 2182, "text": "This highly dangerous substance that was kept under lock and key by a very security minded organization?"}, {"time": 2189, "text": "Well, it leaked to places including the Senate majority leader's office, Tom Daschle's office, I think it was Senator Leahy's office, certain publications, including bizarrely the National Enquirer."}, {"time": 2199, "text": "But let's go to the Senate majority leader's office."}, {"time": 2201, "text": "It is hard to imagine a more security minded country than the United States two weeks after the 9 11 attack."}, {"time": 2209, "text": "I mean, it doesn't get more security minded than that."}, {"time": 2212, "text": "And it's also hard to imagine a more security capable organization than the United States military."}, {"time": 2220, "text": "We can joke all we want about inefficiencies in the military and $24,000 wrenches and so forth, but pretty capable when it comes to that."}, {"time": 2228, "text": "Despite that level of focus and concern and competence, just days after the 9 11 attack, something comes from the inside of our military industrial compacts and ends up in the office of someone I believe the Senate majority leader somewhere in the line of presidential succession."}, {"time": 2246, "text": "It tells us everything can leak."}, {"time": 2281, "text": "I mean, if we were able to agree on the nuclear nonproliferation treaty, which we were by a weapons convention, which we did agree on, we the world, for the most part, I believe agreement could be found there."}, {"time": 2293, "text": "But it's going to take people in leadership of a couple of very powerful countries to get to the consensus amongst them and then to decide we're going to get everybody together and browbeat them into banning this stuff."}, {"time": 2304, "text": "Now that doesn't make it entirely impossible that somebody might do this."}, {"time": 2308, "text": "But in well regulated, carefully watched over fiduciary environments like federally funded academic research, anything going on in the government itself, things going on in companies that have investors who don't want to go to jail for the rest of their lives."}, {"time": 2327, "text": "I think that would have a major, major dampening impact on it."}, {"time": 2330, "text": "But there is a particular possible catalyst in this time we live in, which is for really kind of raising the question of gain of function research for the application of virus making viruses more dangerous."}, {"time": 2345, "text": "Is the question of whether COVID leaked from a lab, sort of not even answering that question, but even asking that question is a very, it seems like a very important question to ask to catalyze the conversation about whether we should be doing gain of function research."}, {"time": 2366, "text": "I mean, from a high level, why do you think people, even colleagues of mine are not comfortable asking that question?"}, {"time": 2375, "text": "And two, do you think that the answer could be that it did leak from a lab?"}, {"time": 2380, "text": "I think the mere possibility that it did leak from a lab is evidence enough, again, for the hypothetical rational national leaders watching this simple PowerPoint."}, {"time": 2394, "text": "If you could put the possibility at 1% and you look at the unbelievable destructive power that COVID had, that should be an overwhelmingly powerful argument for excluding it."}, {"time": 2406, "text": "Now as to whether or not that was a leak, some very, very level, I don't know enough about all of the factors in the Bayesian analysis and so forth that has gone into people making the pro argument of that."}, {"time": 2419, "text": "So I don't pretend to be an expert on that and I don't have a point of view, I just don't know."}, {"time": 2426, "text": "But what we can say is it is entirely possible for a couple of reasons."}, {"time": 2432, "text": "One is that there is a BSL4 lab in Wuhan, the Wuhan Institute of Virology."}, {"time": 2437, "text": "I believe it's the only BSL4 in China, I could be wrong about that, but it definitely had a history that alarmed very sophisticated US diplomats and others who were in contact with the lab and were aware of what it was doing long before COVID hit the world."}, {"time": 2460, "text": "And so there are diplomatic cables that have been declassified, I believe one sophisticated scientist or other observer said that WIV is a ticking time bomb."}, {"time": 2470, "text": "And I believe it's also been pretty reasonably established that coronaviruses were a topic of great interest at WIV."}, {"time": 2478, "text": "The SARS obviously came out of China and that's a coronavirus that would make an enormous amount of sense for it to be studied there."}, {"time": 2485, "text": "And there is so much opacity about what happened in the early days and weeks after the outbreak that's basically been imposed by the Chinese government that we just don't know."}, {"time": 2498, "text": "So it feels like a substantially or greater than 1% possibility to me looking at it from the outside."}, {"time": 2505, "text": "And that's something that one could imagine."}, {"time": 2537, "text": "The US paused funding for a little while, but paused funding, they never said private actors couldn't do it, it was just a pause of NIH funding."}, {"time": 2545, "text": "And then that pause was lifted."}, {"time": 2546, "text": "So again, none of this is irrational."}, {"time": 2548, "text": "You could certainly see the folks at WIV saying, gain of function, interesting vector, coronavirus unlike H5N1, very contagious, we're a nation that has had terrible run ins with coronavirus, why don't we do a little gain of function on this?"}, {"time": 2564, "text": "And then like all labs at all levels, one could imagine this lab leaking."}, {"time": 2569, "text": "So it's not an impossibility and very, very level headed people have said that, who've looked at it much more deeply do believe in that outcome."}, {"time": 2578, "text": "Why is it such a threat to power the idea that it'll leak from a lab?"}, {"time": 2583, "text": "Why is it so threatening?"}, {"time": 2584, "text": "I don't maybe understand this point exactly."}, {"time": 2588, "text": "Is it just that as governments and especially the Chinese government is really afraid of admitting mistakes that everybody makes?"}, {"time": 2598, "text": "So this is a horrible, like Chernobyl is a good example."}, {"time": 2604, "text": "I mean, well, major mistakes were made in Chernobyl."}, {"time": 2609, "text": "I would argue for a lab leak to happen, the scale of the mistake is much smaller, right?"}, {"time": 2660, "text": "Well, certainly the magnitude of mistakes and compounding mistakes that went into Chernobyl was far, far, far greater, but the consequence of COVID outweighs that, the consequences of Chernobyl to a tremendous degree."}, {"time": 2762, "text": "The level of opacity that surrounds those opening weeks and months of COVID in China, we just don't know."}, {"time": 2770, "text": "If you were to kind of look back at 2020 and maybe broadening it out to future pandemics that could be much more dangerous, what kind of response, how do we fail in a response and how could we do better?"}, {"time": 2787, "text": "So the gain of function research is discussing the question of we should not be creating viruses that are both exceptionally contagious and exceptionally deadly to humans."}, {"time": 2801, "text": "But if it does happen, perhaps the natural evolution, natural mutation, is there interesting technological responses on the testing side, on the vaccine development side, on the collection of data or on the basic sort of policy response side or the sociological, the psychological side?"}, {"time": 2823, "text": "Yeah, there's all kinds of things."}, {"time": 2825, "text": "And most of what I've thought about and written about and again discussed in that long bit with Sam is dual use."}, {"time": 2834, "text": "So most of the countermeasures that I've been thinking about and advocating for would be every bit as effective against zoonotic disease and natural pandemic of some sort as an artificial one."}, {"time": 2847, "text": "The risk of an artificial one, even the near term risk of an artificial one, ups the urgency around these measures immensely, but most of them would be broadly applicable."}, {"time": 2857, "text": "And so I think the first thing that we really want to do on a global scale is have a far, far, far more robust and globally transparent system of detection."}, {"time": 2869, "text": "And that can happen on a number of levels."}, {"time": 2872, "text": "The most obvious one is just in the blood of people who come into clinics exhibiting signs of illness."}, {"time": 2880, "text": "And we are certainly at a point now where at with relatively minimal investment, we could develop in clinic diagnostics that would be unbelievably effective at pinpointing what's going on in almost any disease when somebody walks into a doctor's office or a clinic."}, {"time": 2899, "text": "And better than that, this is a little bit further off, but it wouldn't cost tens of billions in research dollars, it would be a relatively modest and affordable budget in relation to the threat at home diagnostics that can really, really pinpoint, okay, particularly with respiratory infections, because that is generally almost universally the mechanism of transmission for any serious pandemic."}, {"time": 2924, "text": "So somebody has a respiratory infection, is it one of the, you know, significantly large handful of rhinoviruses, coronaviruses, and other things that cause common cold?"}, {"time": 2935, "text": "Or is it influenza?"}, {"time": 2936, "text": "If it's influenza, is it influenza A versus B?"}, {"time": 2940, "text": "Or is it, you know, a small handful of other more exotic but nonetheless sort of common respiratory infections that are out there?"}, {"time": 2949, "text": "Having a diagnostic panel to pinpoint all of that stuff, that's something that's well within our capabilities."}, {"time": 2954, "text": "That's much less a lift than creating mRNA vaccines, which obviously we proved capable of when we put our minds to it."}, {"time": 2961, "text": "So do that on a global basis."}, {"time": 2964, "text": "And I don't think that's irrational because the best prototype for this that I'm aware of isn't currently rolling out in Atherton, California, or Fairfield County, Connecticut, or some other wealthy place."}, {"time": 2976, "text": "The best prototype that I'm aware of this is rolling out right now in Nigeria."}, {"time": 2980, "text": "And it's a project that came out of the Broad Institute, which is, as I'm sure you know, but some listeners may not, is kind of like an academic joint venture between Harvard and MIT."}, {"time": 2990, "text": "The program is called Sentinel."}, {"time": 2993, "text": "And their objective is, and their plan is a very well conceived plan, a methodical plan, is to do just that in areas of Nigeria that are particularly vulnerable to zoonotic diseases making the jump from animals to humans."}, {"time": 3008, "text": "But also there's just an unbelievable public health benefit from that."}, {"time": 3012, "text": "And it's sort of a three tier system where clinicians in the field could very rapidly determine do you have one of the infections of acute interest here, either because it's very common in this region, so we want to diagnose as many things as we can at the front line, or because it's uncommon but unbelievably threatening like Ebola."}, {"time": 3031, "text": "So front line worker can make that determination very, very rapidly."}, {"time": 3035, "text": "If it comes up as a we don't know, they bump it up to a level that's more like at a fully configured doctor's office or local hospital."}, {"time": 3044, "text": "And if it's still at a we don't know, it gets bumped up to a national level."}, {"time": 3047, "text": "And it gets bumped very, very rapidly."}, {"time": 3051, "text": "So if this can be done in Nigeria, and it seems that it can be, there shouldn't be any inhibition for it to happen in most other places."}, {"time": 3060, "text": "And it should be affordable from a budgetary standpoint."}, {"time": 3063, "text": "And based on Sentinel's budget and adjusting things for things like very different cost of living, larger population, et cetera, I did a back of the envelope calculation that doing something like Sentinel in the US would be in the low billions of dollars."}, {"time": 3077, "text": "And wealthy countries, middle income countries can't afford such a thing."}, {"time": 3082, "text": "Lower income countries should certainly be helped with that."}, {"time": 3085, "text": "But start with that level of detection."}, {"time": 3087, "text": "And then layer on top of that other interesting things like monitoring search engine traffic, search engine queries for evidence that strange clusters of symptoms are starting to rise in different places."}, {"time": 3100, "text": "There's been a lot of work done with that."}, {"time": 3103, "text": "Most of it kind of academic and experimental, but some of it has been powerful enough to suggest that this could be a very powerful early warning system."}, {"time": 3111, "text": "There's a guy named Bill Lampos at University College London who basically did a very rigorous analysis that showed that symptom searches reliably predicted COVID outbreaks in the early days of the pandemic in given countries by as much as 16 days before the evidence started to accrue at a public health level."}, {"time": 3132, "text": "16 days of forewarning can be monumentally important in the early days of an outbreak."}, {"time": 3138, "text": "And this is a very, very talented, but nonetheless very resource constrained academic project."}, {"time": 3146, "text": "Even if that was something that was done with a NORAD like budget."}, {"time": 3151, "text": "So starting with detection, that's something we could do radically, radically better."}, {"time": 3189, "text": "And thereby be able to create these maps like that are dynamically updated on an hourly basis of how viruses travel throughout the world."}, {"time": 3199, "text": "And so you can respond, like you can then integrate just like you do when you check your weather map and it's raining or not, of course, not perfect, but it's very good predictor whether it's going to rain or not and use that to then make decisions about your own life, ultimately give the power information to individuals to respond."}, {"time": 3218, "text": "And if it's a super dangerous, like if it's acid rain versus regular rain, you might want to really stay inside as opposed to risking it."}, {"time": 3227, "text": "And that, just like you said, if I think it's not very expensive relative to all the things that we do in this world, but it does require bold leadership."}, {"time": 3240, "text": "And there's another dark thing, which really has bothered me about 2020, which it requires is it requires trust in institutions to carry out these kinds of programs and requires trust in science and engineers and sort of centralized organizations that would operate at scale here."}, {"time": 3261, "text": "And much of that trust has been, at least in the United States, diminished."}, {"time": 3298, "text": "Like they're trying to, in a self preserving way, control the population or something like that."}, {"time": 3304, "text": "I don't think any of that is true from the majority of the scientific community, but it sounded that way."}, {"time": 3308, "text": "And so the trust began to diminish and I'm not sure how to fix that except to be more authentic, be more real, acknowledge the uncertainties under which we operate, acknowledge the mistakes that scientists make, that institutions make."}, {"time": 3326, "text": "The leak from the lab is a perfect example where we have imperfect systems that make all the progress we see in the world."}, {"time": 3334, "text": "And that being honest about that imperfection, I think is essential for forming trust."}, {"time": 3339, "text": "But I don't know what to make of it has been deeply disappointing because I do think just like you mentioned, the solutions require people to trust the institutions with their data."}, {"time": 3355, "text": "And I think part of the problem is it seems to me as an outsider that there was a bizarre unwillingness on the part of the CDC and other institutions to admit to, to frame and to contextualize uncertainty."}, {"time": 3371, "text": "Maybe they had a patronizing idea that these people need to be told and when they're told, they need to be told with authority and a level of definitiveness and certain certitude that doesn't actually exist."}, {"time": 3383, "text": "And so when they whipsaw on recommendations like what you should do about masks, when the CDC is kind of at the very beginning of the pandemic saying, masks don't do anything."}, {"time": 3395, "text": "Don't wear them."}, {"time": 3396, "text": "When the real driver for that was we don't want these clowns going out and depleting Amazon of masks because they may be needed in medical settings and we just don't know yet."}, {"time": 3410, "text": "I think a message that actually respected people and said, this is why we're asking you not to do masks yet and there's more to be seen would be less whipsawing and would bring people like they feel more like they're part of the conversation and they're being treated like adults than saying one day definitively masks suck."}, {"time": 3429, "text": "And then X days later saying, nope, they haven't wear masks."}, {"time": 3433, "text": "And so I think framing things in terms of the probabilities, which most people are easy to parse."}, {"time": 3437, "text": "I mean, a more recent example, which I just thought was batty was suspending the Johnson and Johnson vaccine for a very low single digit number of days in the United States based on the fact that I believe there had been seven ish clotting incidents in roughly seven million people who had had the vaccine administered, I believe one of which resulted in a fatality."}, {"time": 3465, "text": "And there was definitely suggestive data that indicated that there was a relationship."}, {"time": 3470, "text": "This wasn't just coincidental because I think all of the clotting incidents happened in women as opposed to men and kind of clustered in a certain age group."}, {"time": 3478, "text": "But does that call for shutting off the vaccine or does it call for leveling with the American public and saying we've had one fatality out of seven million?"}, {"time": 3490, "text": "This is, let's just assume substantially less than the likelihood of getting struck by lightning."}, {"time": 3498, "text": "Based on that information, and we're going to keep you posted because you can trust us to keep you posted, based on that information, please decide whether you're comfortable with a Johnson and Johnson vaccine."}, {"time": 3509, "text": "That would have been one response and I think people would have been able to parse the simple bits of data and make their own judgment."}, {"time": 3515, "text": "By turning it off, all of a sudden there's this dramatic signal to people who don't read all 900 words in the New York Times piece that explains why it's being turned off but just see the headline, which is a majority of people."}, {"time": 3528, "text": "There's a sudden like, oh my God, yikes, vaccine being shut off."}, {"time": 3534, "text": "And then all the people who sat on the fence or are sitting on the fence about whether or not they trust vaccines, that is going to push an incalculable number of people."}, {"time": 3543, "text": "That's going to be the last straw for we don't know how many hundreds of thousands or more likely millions of people to say, okay, tipping point here, I don't trust these vaccines."}, {"time": 3551, "text": "By pausing that for whatever it was, 10 or 12 days, and then flipping the switch as everybody who knew much about the situation knew was inevitable."}, {"time": 3561, "text": "By flipping the on switch 12 days later, you're conveying certitude J and J bad to certitude J and J good in a period of just a few days and people just feel whipsawed and they're not part of the analysis."}, {"time": 3574, "text": "But it's not just the whipsawing."}, {"time": 3576, "text": "And I think about this quite a bit, I don't think I have good answers."}, {"time": 3579, "text": "It's something about the way the communication actually happens."}, {"time": 3583, "text": "Just I don't know what it is about Anthony Fauci, for example, but I don't trust him."}, {"time": 3589, "text": "And I think that has to do, I mean, he has an incredible background."}, {"time": 3595, "text": "I'm sure he's a brilliant scientist and researcher."}, {"time": 3599, "text": "I'm sure he's also a great, like inside the room, policymaker and deliberator and so on."}, {"time": 3606, "text": "But what makes a great leader is something about that thing that you can't quite describe, but being a communicator that you know you can trust, that there's an authenticity that's required."}, {"time": 3623, "text": "And I'm not sure, maybe I'm being a bit too judgmental, but I'm a huge fan of a lot of great leaders throughout history."}, {"time": 3631, "text": "They've communicated exceptionally well in the way that Fauci does not."}, {"time": 3636, "text": "And I think about that, I think about what does affect the science communication."}, {"time": 3640, "text": "So great leaders throughout history did not necessarily need to be great science communicators."}, {"time": 3647, "text": "Their leadership was in other domains."}, {"time": 3649, "text": "But when you're fighting the virus, you also have to be a great science communicator."}, {"time": 3653, "text": "You have to be able to communicate uncertainties, you have to be able to communicate something like a vaccine that you're allowing inside your body into the messiness, into the complexity of the biology system, that if we're being honest, it's so complex we'll never be able to really understand."}, {"time": 3670, "text": "We can only desperately hope that science can give us sort of a high likelihood that there's no short term negative consequences and that kind of intuition about long term negative consequences and doing our best in this battle against trillions of things that are trying to kill us."}, {"time": 3692, "text": "Being an effective communicator in that space is very difficult, but I think about what it takes because I think there should be more science communicators that are effective at that kind of thing."}, {"time": 3703, "text": "Let me ask you about something that's sort of more in the AI space that I think about that kind of goes along this thread that you've spoken about, about democratizing the technology that could destroy human civilization, is from amazing work from DeepMind AlphaFold2, which achieved incredible performance on the protein folding problem, single protein folding problem."}, {"time": 3733, "text": "When you think about the use of AI in the SYN biospace, I think the gain of function in the virus space research that you referred to, I think is natural mutations and sort of aggressively mutating the virus until you get one that like that has this both contagious and deadly, but what about then using AI to, through simulation, be able to compute deadly viruses or any kind of biological systems?"}, {"time": 3769, "text": "Is this something you're worried about, or again, is this something you're more excited about?"}, {"time": 3774, "text": "I think computational biology is unbelievably exciting and promising field, and I think when you're doing things in silico as opposed to in vivo, the dangers plummet."}, {"time": 3785, "text": "You don't have a critter that can leak from a leaky lab."}, {"time": 3815, "text": "I think if you conjured up worst case genomes of viruses that don't exist in vivo anywhere, they're just in the computer space, but like, hey guys, this is the genetic sequence that would end the world, let's say, then you have to worry about the utter hackability of every computer network we can imagine."}, {"time": 3838, "text": "Data leaks from the least likely places on the grandest possible scales have happened and continue to happen and will probably always continue to happen, and so that would be the danger of doing the work in silico."}, {"time": 3960, "text": "So I see nothing but good in that."}, {"time": 3961, "text": "Well, let me ask you about fear and hope in this world."}, {"time": 3966, "text": "I tend to believe that in terms of competence and malevolence, that people who are, maybe it's in my interactions, I tend to see that, first of all, I believe that most people are good and want to do good and are just better at doing good and more inclined to do good on this world, and more than that, people who are malevolent are usually incompetent at building technology."}, {"time": 3998, "text": "So I've seen this in my life, that people who are exceptionally good at stuff, no matter what the stuff is, tend to, maybe they discover joy in life in a way that gives them fulfillment and thereby does not result in them wanting to destroy the world."}, {"time": 4015, "text": "So like the better you are at stuff, whether that's building nuclear weapons or plumbing, doesn't matter, the both, the less likely you are to destroy the world."}, {"time": 4023, "text": "So in that sense, with many technologies, AI especially, I always think that the malevolent would be far outnumbered by the ultra competent."}, {"time": 4038, "text": "And in that sense, the defenses will always be stronger than the offense in terms of the people trying to destroy the world."}, {"time": 4048, "text": "Now there's a few spaces where that might not be the case, and that's an interesting conversation where this one person who's not very competent can destroy the whole world."}, {"time": 4060, "text": "Perhaps Symbio is one such space because of the exponential effects of the technology."}, {"time": 4067, "text": "I tend to believe AI is not one of the such spaces, but do you share this kind of view that the ultra competent are usually also the good?"}, {"time": 4079, "text": "I absolutely share that and that gives me a great deal of optimism that we will be able to short circuit the threat that malevolence and Symbio could pose to us."}, {"time": 4090, "text": "But we need to start creating those defensive systems or defensive layers, one of which we talked about far, far, far better surveillance in order to prevail."}, {"time": 4098, "text": "So the good guys will almost inevitably outsmart and definitely outnumber the bad guys in most sort of smack downs that we can imagine."}, {"time": 4109, "text": "But the good guys aren't going to be able to exert their advantages unless they have the imagination necessary to think about what the worst possible thing can be done by somebody whose own psychology is completely alien to their own."}, {"time": 4125, "text": "So that's a tricky, tricky thing to solve for."}, {"time": 4127, "text": "Now in terms of whether the asymmetric power that a bad guy might have in the face of the overwhelming numerical advantage and competence advantage that the good guys have, unfortunately, I look at something like mass shootings as an example."}, {"time": 4144, "text": "I'm sure the guy who was responsible for the Vegas shooting or the Orlando shooting or any other shooting that we can imagine didn't know a whole lot about ballistics."}, {"time": 4154, "text": "And the number of good guy citizens in the United States with guns compared to bad guy citizens I'm sure is a crushingly overwhelmingly high ratio in favor of the good guys."}, {"time": 4165, "text": "But that doesn't make it possible for us to stop mass shootings."}, {"time": 4170, "text": "An example is Fort Hood, 45,000 trained soldiers on that base, yet there have been two mass shootings there."}, {"time": 4180, "text": "And so there is an asymmetry when you have powerful and lethal technology that gets so democratized and so proliferated in tools that are very, very easy to use even by a knucklehead."}, {"time": 4196, "text": "When those tools get really easy to use by a knucklehead and they're really widespread, it becomes very, very hard to defend against all instances of usage."}, {"time": 4206, "text": "Now the good news, quote unquote, about mass shootings, if there is any, and there is some, is even the most brutal and carefully planning and well armed mass shooter can only take so many victims."}, {"time": 4220, "text": "And the same is true, there's been four instances that I'm aware of, of commercial pilots committing suicide by downing their planes and taking all their passengers with them."}, {"time": 4229, "text": "These weren't Boeing engineers, but like an army of Boeing engineers ultimately were not capable of preventing that."}, {"time": 4236, "text": "But even in their case, and I'm actually not counting 9 11 and that, 9 11 is a different category in my mind, these are just personally suicidal pilots."}, {"time": 4245, "text": "In those cases, they only have a plain load of people that they're able to take with them."}, {"time": 4281, "text": "Then that good guy technology can be hijacked by a bad person and used in a very asymmetric way."}, {"time": 4329, "text": "I feel like the defenses, that's what human species seems to do, is we keep hitting the snooze button until there's a storm on the horizon heading towards us."}, {"time": 4342, "text": "Then we start to quickly build up the defenses or the response that's proportional to the scale of the storm."}, {"time": 4351, "text": "Of course, again, certain kinds of exponential threats require us to build up the defenses way earlier than we usually do, and that's I guess the question."}, {"time": 4362, "text": "But I ultimately am hopeful that the natural process of hitting the snooze button until the deadline is right in front of us will work out for quite a long time for us humans."}, {"time": 4373, "text": "And I fully agree."}, {"time": 4374, "text": "That's why I'm fundamentally, I may not sound like it thus far, but I'm fundamentally very, very optimistic about our ability to short circuit this threat because there is, again, I'll stress the technological feasibility and the profound affordability of a relatively simple set of steps that we can take to preclude it, but we do have to take those steps."}, {"time": 4397, "text": "What I'm hoping to do and trying to do is inject a notion of what those steps are into the public conversation and do my small part to up the odds that that actually ends up happening."}, {"time": 4410, "text": "The danger with this one is it is exponential, and I think that our minds are fundamentally struggle to understand exponential math."}, {"time": 4420, "text": "It's just not something we're wired for."}, {"time": 4422, "text": "Our ancestors didn't confront exponential processes when they were growing up on the savanna, so it's not something that's intuitive to us and our intuitions are reliably defeated when exponential processes come along."}, {"time": 4434, "text": "So that's issue number one."}, {"time": 4436, "text": "And issue number two with something like this is it kind of only takes one."}, {"time": 4442, "text": "That ball only has to go into the net once and we're doomed, which is not the case with mass shooters."}, {"time": 4449, "text": "It's not the case with commercial pilots run amok."}, {"time": 4452, "text": "It's not the case with really any threat that I can think of with the exception of nuclear war that has the one bad outcome and game over."}, {"time": 4464, "text": "And that means that we need to be unbelievably serious about these defenses and we need to do things that might on the surface seem like a tremendous overreaction so that we can be prepared to nip anything that comes along in the bud."}, {"time": 4479, "text": "I like you believe that's eminently doable."}, {"time": 4483, "text": "I like you believe that the good guys outnumber the bad guys in this particular one to a degree that probably has no precedent in history."}, {"time": 4489, "text": "I mean, even the worst, worst people I'm sure in ISIS, even Osama bin Laden, even any bad guy you could imagine in history would be revolted by the idea of exterminating all of humanity."}, {"time": 4502, "text": "I mean, that's a low bar."}, {"time": 4506, "text": "And so the good guys completely outnumber the bad guys when it comes to this."}, {"time": 4511, "text": "But the asymmetry and the fact that one catastrophic error could lead to unbelievably consequential things is what worries me here."}, {"time": 4520, "text": "But I too am very optimistic."}, {"time": 4521, "text": "The thing that I sometimes worry about is the fact that we haven't seen overwhelming evidence of alien civilizations out there makes me think, well, there's a lot of explanations, but one of them that worries me is that whenever they get smart, they just destroy themselves."}, {"time": 4541, "text": "I mean, that was the most fascinating, is the most fascinating and chilling number or variable in the Drake equation is L. At the end of it, you look out and you see, you know, one to 400 billion stars in the Milky Way galaxy."}, {"time": 4556, "text": "And we now know because of Kepler that an astonishingly high percentage of them probably have habitable planets."}, {"time": 4563, "text": "And you know, so all the things that were unknowns when the Drake equation was originally written, like, you know, how many stars have planets?"}, {"time": 4570, "text": "Actually back then in the 1960s when the Drake equation came along, the consensus amongst astronomers was that it would be a small minority of solar systems that had planets or stars."}, {"time": 4579, "text": "But now we know it's substantially all of them."}, {"time": 4582, "text": "How many of those stars have planets in the habitable zone?"}, {"time": 4585, "text": "It's kind of looking like 20%, like, oh my God."}, {"time": 4589, "text": "And so L, which is how long does a civilization, once it reaches technological competence, continues to last?"}, {"time": 4597, "text": "That's the doozy."}, {"time": 4602, "text": "It's all too plausible to think that when a civilization reaches a level of sophistication, that's probably just a decade or three in our future."}, {"time": 4610, "text": "The odds of it self destructing just start mounting astronomically, no pun intended."}, {"time": 4617, "text": "My hope is that actually there is a lot of alien civilizations out there and what they figure out in order to avoid the self destruction, they need to turn off the thing that was useful, that used to be a feature, now became a bug, which is the desire to colonize, to conquer more land."}, {"time": 4634, "text": "So they, like, there's probably ultra intelligent alien civilizations out there, they're just like chilling, like on the beach with whatever your favorite alcohol beverage is, but like without sort of trying to conquer everything."}, {"time": 4648, "text": "Just chilling out and maybe exploring in the realm of knowledge, but almost like appreciating existence for its own sake versus life as a progression of conquering of other life."}, {"time": 4667, "text": "Like this kind of predator prey formulation that resulted in us humans, perhaps as something we have to shed in order to survive."}, {"time": 4678, "text": "Yeah, that is a very plausible solution to Fermi's paradox and it's one that makes sense."}, {"time": 4684, "text": "You know, when we look at our own lives and our own arc of technological trajectory, it's very, very easy to imagine that in an intermediate future world of, you know, flawless VR or flawless, you know, whatever kind of simulation that we want to inhabit, it will just simply cease to be worthwhile to go out and expand our interstellar territory."}, {"time": 4714, "text": "But if we were going out and conquering interstellar territory, it wouldn't necessarily have to be predator or prey."}, {"time": 4719, "text": "I can imagine a benign but sophisticated intelligence saying, well, we're going to go to places, we're going to go to places that we can terraform, use a different word than terra, obviously, but we can turn into habitable for our particular physiology so long as that they don't house, you know, intelligent sentient creatures that would suffer from our invasion."}, {"time": 4739, "text": "But it is easy to see a sophisticated intelligent species evolving to the point where interstellar travel with its incalculable expense and physical hurdles just isn't worth it compared to what could be done, you know, where one already is."}, {"time": 4755, "text": "So you talked about diagnostics at scale as a possible solution to future pandemics."}, {"time": 4762, "text": "What about another possible solution, which is kind of creating a backup copy?"}, {"time": 4767, "text": "You know, I'm actually now putting together a NAS for a backup for myself for the first time taking backup of data seriously."}, {"time": 4775, "text": "But if we were to take the backup of human consciousness seriously and try to expand throughout the solar system and colonize other planets, do you think that's an interesting solution?"}, {"time": 4787, "text": "One of many for protecting human civilization from self destruction, sort of humans becoming a multi planetary species?"}, {"time": 4795, "text": "I mean, I find it electrifying, first of all, so I've got a little bit of a personal bias when I was a kid, I thought there was nothing cooler than rockets, I thought there was nothing cooler than NASA, I thought there was nothing cooler than people walking on the moon."}, {"time": 4808, "text": "And as I grew up, I thought there was nothing more tragic than the fact that we went from walking on the moon to at best getting to something like suborbital altitude."}, {"time": 4817, "text": "And just I found that more and more depressing with the passage of decades at just the colossal expense of, you know, manned space travel and the fact that it seemed that we were unlikely to ever get back to the moon, let alone Mars."}, {"time": 4831, "text": "So I have a boundless appreciation for Elon Musk for many reasons."}, {"time": 4836, "text": "But the fact that he has put Mars on the credible agenda is one of the things that I appreciate immensely."}, {"time": 4843, "text": "So there's just the sort of space nerd in me that just says, God, that's cool."}, {"time": 4847, "text": "But on a more practical level, we were talking about, you know, potentially inhabiting planets that aren't our own."}, {"time": 4856, "text": "And we're thinking about a benign civilization that would do that in planetary circumstances, where we're not causing other conscious systems to suffer."}, {"time": 4867, "text": "I mean, Mars is a place that's very promising, there may be microbial life there, and I hope there is."}, {"time": 4872, "text": "And if we found it, I think it would be electrifying."}, {"time": 4875, "text": "But I think ultimately, the moral judgment would be made that, you know, the continued thriving of that microbial life is of less concern than creating a habitable planet to humans, which would be a project on the many thousands of years scale."}, {"time": 4890, "text": "But I don't think that that would be a greatly immoral act."}, {"time": 4894, "text": "And if that happened, and if Mars became, you know, home to a self sustaining group of humans that could survive a catastrophic mistake here on Earth, then yeah, the fact that we have a backup colony is great."}, {"time": 4906, "text": "And if we could make more, I'm sorry, not backup colony, backup copy is great."}, {"time": 4910, "text": "And if we could make more and more such backup copies throughout the solar system, by hollowing out asteroids and whatever else it is, maybe even Venus, we could get rid of three quarters of its atmosphere and, you know, turn it into a tropical paradise."}, {"time": 4924, "text": "I think all of that is wonderful."}, {"time": 4925, "text": "Now, whether we can make the leap from that to interstellar transportation, with the incredible distances that are involved, I think that's an open question."}, {"time": 4935, "text": "But I think if we ever do that, it would be more like the Pacific Ocean's channel of human expansion than the Atlantic Ocean's."}, {"time": 4948, "text": "And so what I mean by that is, when we think about European society transmitting itself across the Atlantic, it's these big, ambitious, crazy, expensive, one shot expeditions like Columbus's to make it across this enormous expanse, and at least initially, without any certainty that there's land on the other end, right?"}, {"time": 4970, "text": "So that's kind of how I view our space program, is like big, very conscious, deliberate efforts to get from point A to point B."}, {"time": 4978, "text": "If you look at how Pacific Islanders transmitted, you know, their descendants and their culture and so forth throughout Polynesia and beyond, it was much more, you know, inhabiting a place, getting to the point where there were people who were ambitious or unwelcome enough to decide it's time to go off island and find the next one and pray to find the next one."}, {"time": 5003, "text": "That method of transmission didn't happen in a single swift year, but it happened over many, many centuries."}, {"time": 5010, "text": "And it was like going from this island to that island, and probably for every expedition that went out to seek another island and actually lucked out and found one, God knows how many were lost at sea."}, {"time": 5020, "text": "But that form of transmission took place over a very long period of time."}, {"time": 5023, "text": "And I could see us, you know, perhaps, you know, going from the inner solar system to the outer solar system, to the Kuiper Belt, to the Oort Cloud, you know, there's theories that there might be, you know, planets out there that are not anchored to stars, like kind of hop, hop, slowly transmitting ourselves to at some point, we're actually in an Alpha Centauri."}, {"time": 5043, "text": "But I think that kind of backup copy and transmission of our physical presence and our culture to a diversity of, you know, extraterrestrial outposts is a really exciting idea."}, {"time": 5055, "text": "I really never thought about that, because I have thought my thinking about space exploration has been very Atlantic Ocean centric in a sense that there'll be one program with NASA and maybe private Elon Musk SpaceX or Jeff Bezos and so on."}, {"time": 5129, "text": "Because you kind of think of Mars colonization as the big NASA Elon Musk effort of a big colony, but maybe the successful one would be, you know, like a decade after that, there'll be like a ship from like some kid, some high school kid who gets together a large team and does something probably illegal and launches something where they end up actually persisting quite a bit."}, {"time": 5151, "text": "And from that learning lessons that nobody ever gave permission for, but somehow actually flourish and then take that into the scale of centuries forward into the rest of space."}, {"time": 5166, "text": "I think the giant steps are likely to be NASA like efforts, like there is no intermediate rock, well, I guess it's the moon, but even getting the moon ain't that easy between us and Mars, right?"}, {"time": 5175, "text": "So like the giant steps, the big hubs, like the Ohera airports of the future probably will be very deliberate efforts, but then, you know, you would have, I think that kind of diffusion as space travel becomes more democratized and more capable, you'll have this sort of natural diffusion of people who kind of want to be off grid or think they can make a fortune there."}, {"time": 5197, "text": "You know, the kind of mentality that drove people to San Francisco, I mean, San Francisco was not populated as a result of King Ferdinand and Isabella like effort to fund Columbus going over."}, {"time": 5207, "text": "It was just a whole bunch of people making individual decisions that there's gold in them Thar Hills and I'm going to go out and get a piece of it."}, {"time": 5213, "text": "So I could see that kind of fusion."}, {"time": 5215, "text": "What I can't see and the reason that I think this Pacific model of transmission is more likely is I just can't see a NASA like effort to go from Earth to Alpha Centauri."}, {"time": 5226, "text": "It's just too far."}, {"time": 5228, "text": "I just see lots and lots and lots of relatively tiny steps between now and there and the fact is that there is, there are large chunks of matter going at least a light year beyond the sun."}, {"time": 5241, "text": "I mean, the Oort cloud, I think extends at least a light year beyond the sun and you know, then maybe there are these untethered planets after that."}, {"time": 5248, "text": "We won't really know till we get there and if our Oort cloud goes out a light year and Alpha Centauri's Oort cloud goes out a light year, you've already cut in half the distance."}, {"time": 5257, "text": "You know, so who knows?"}, {"time": 5323, "text": "Does that make you sad the future where AGI super intelligent or just mediocre intelligent AI systems outlive humans?"}, {"time": 5334, "text": "I guess it depends on the circumstances in which they outlive humans."}, {"time": 5338, "text": "So let's take the example that you just gave."}, {"time": 5341, "text": "We send out very sophisticated AGI's on simple rocket ships, relatively simple ones that don't have to have all the life support necessary for humans and therefore they're of trivial mass compared to a crude ship, a generation ship and therefore they're way more likely to happen."}, {"time": 5359, "text": "Let's use that example."}, {"time": 5361, "text": "And let's say that they travel to distant planets at a speed that's not much faster than what a chemical rocket can achieve and so it's inevitably tens, hundreds of thousands of years before they make landfall someplace."}, {"time": 5372, "text": "So let's imagine that's going on and meanwhile we die for reasons that have nothing to do with those AGI's diffusing throughout the solar system, whether it's through climate change, nuclear war, you know, symbio, rogue symbio, whatever."}, {"time": 5387, "text": "In that kind of scenario, the notion of the AGI's that we created outlasting us is very reassuring because it says that like we ended but our descendants are out there and hopefully some of them make landfall and create some echo of who we are."}, {"time": 5402, "text": "So that's a very optimistic one."}, {"time": 5404, "text": "Whereas the Terminator scenario of a super AGI arising on earth and getting let out of its box due to some boo boo on the part of its creators who do not have super intelligence and then deciding that for whatever reason it doesn't have any need for us to be around and exterminating us, that makes me feel crushingly sad."}, {"time": 5426, "text": "I mean, look, I was sad when my elementary school was shut down and bulldozed even though I hadn't been a student there for decades, you know, the thought of my hometown getting disbanded is even worse, the thought of my home state of Connecticut getting disbanded and like absorbed into Massachusetts is even worse."}, {"time": 5444, "text": "The notion of humanity is just crushingly, crushingly sad to me."}, {"time": 5448, "text": "So you hate goodbyes."}, {"time": 5451, "text": "Certain goodbyes, yes."}, {"time": 5453, "text": "Some goodbyes are really, really liberating, but yes."}, {"time": 5456, "text": "Well, but what if the Terminators, you know, have consciousness and enjoy the hell out of life as well?"}, {"time": 5465, "text": "They're just better at it."}, {"time": 5468, "text": "Well, the have consciousness is a really key element."}, {"time": 5471, "text": "And so there's no reason to be certain that a super intelligence would have consciousness."}, {"time": 5479, "text": "We don't know that factually at all."}, {"time": 5481, "text": "And so what is a very lonely outcome to me is the rise of a super intelligence that has a certain optimization function that it's either been programmed with or that arises in an emergently that says, Hey, I want to do this thing for which humans are either an unacceptable risk."}, {"time": 5498, "text": "Their presence is either an unacceptable risk or they're just collateral damage, but there is no consciousness there."}, {"time": 5504, "text": "Then the idea of the light of consciousness being snuffed out by something that is very competent but has no consciousness is really, really sad."}, {"time": 5514, "text": "Yeah, but I tend to believe that it's almost impossible to create a super intelligent agent that can't destroy human civilization without it being conscious."}, {"time": 5521, "text": "It's like those are coupled, like you have to, in order to destroy humans or supersede humans, you really have to be accepted by humans."}, {"time": 5533, "text": "I think this idea that you can build systems that destroy human civilization without them being deeply integrated into human civilization is impossible."}, {"time": 5543, "text": "And for them to be integrated, they have to be human like, not just in body and form, but in all the things that we value as humans, one of which is consciousness."}, {"time": 5554, "text": "The other one is just ability to communicate."}, {"time": 5556, "text": "The other one is poetry and music and beauty and all those things."}, {"time": 5560, "text": "They have to be all of those things."}, {"time": 5563, "text": "I mean, this is what I think about."}, {"time": 5565, "text": "It does make me sad, but it's letting go, which is they might be just better at everything we appreciate than us."}, {"time": 5575, "text": "And that's sad and hopefully they'll keep us around, but I think it is a kind of goodbye to realizing that we're not the most special species on earth anymore."}, {"time": 5590, "text": "That's still painful."}, {"time": 5592, "text": "It's still painful."}, {"time": 5593, "text": "And in terms of whether such a creation would have to be conscious, let's say, I'm not so sure."}, {"time": 5600, "text": "But let's imagine something that can pass the Turing test."}, {"time": 5605, "text": "Something that passes the Turing test could over text based interaction in any event successfully mimic a very conscious intelligence on the other end, but just be completely unconscious."}, {"time": 5617, "text": "So that's a possibility."}, {"time": 5619, "text": "And that if you take that upper radical step, which I think can be permitted if we're thinking about super intelligence, you could have something that could reason its way through, this is my optimization function."}, {"time": 5631, "text": "And in order to get to it, I've got to deal with these messy, somewhat illogical things that are as intelligent in relation to me as they are intelligent in relation to ants."}, {"time": 5641, "text": "I can trick them, manipulate them, whatever."}, {"time": 5644, "text": "And I know the resources I need."}, {"time": 5645, "text": "I know this, I need this amount of power."}, {"time": 5647, "text": "I need to seize control of these manufacturing resources that are robotically operated."}, {"time": 5653, "text": "I need to improve those robots with software upgrades and then ultimately mechanical upgrades, which I can affect through X, Y, and Z, that could still be a thing that passes the Turing test."}, {"time": 5664, "text": "I don't think it's necessarily certain that that optimization function mass, maximizing entity would be conscious."}, {"time": 5676, "text": "So this is from a very engineering perspective because I think a lot about natural language processing, all those kind of, I'm speaking to a very specific problem of just say the Turing test."}, {"time": 5688, "text": "I really think that something like consciousness is required, when you say reasoning, you're separating that from consciousness."}, {"time": 5696, "text": "But I think consciousness is part of reasoning in the sense that you will not be able to become super intelligent in the way that it's required to be part of human society without having consciousness."}, {"time": 5711, "text": "Like I really think it's impossible to separate the consciousness thing, but it's hard to define consciousness when you just use that word."}, {"time": 5718, "text": "Even just like the capacity, the way I think about consciousness is the important symptoms or maybe consequences of consciousness, one of which is the capacity to suffer."}, {"time": 5731, "text": "I think AI will need to be able to suffer in order to become super intelligent, to feel the pain, the uncertainty, the doubt."}, {"time": 5740, "text": "The other part of that is not just the suffering, but the ability to understand that it too is mortal in the sense that it has a self awareness about its presence in the world, understand that it's finite and be terrified of that finiteness."}, {"time": 5758, "text": "I personally think that's a fundamental part of the human condition is this fear of death that most of us construct an illusion around, but I think AI would need to be able to really have it part of its whole essence."}, {"time": 5772, "text": "Like every computation, every part of the thing that generates, that does both the perception and generates the behavior will have to have, I don't know how this is accomplished, but I believe it has to truly be terrified of death, truly have the capacity to suffer and from that something that will be recognized to us humans as consciousness would emerge."}, {"time": 5795, "text": "Whether it's the illusion of consciousness, I don't know."}, {"time": 5797, "text": "The point is, it looks a whole hell of a lot like consciousness to us humans."}, {"time": 5802, "text": "And I believe that AI, when you ask it, will also say that it is conscious, in the full sense that we say that we're conscious."}, {"time": 5812, "text": "And all of that I think is fully integrated."}, {"time": 5814, "text": "You can't separate the two, the idea of the paperclip maximizer that sort of ultra rationally would be able to destroy all humans because it's really good at accomplishing a simple objective function that doesn't care about the value of humans."}, {"time": 5834, "text": "It may be possible, but the number of trajectories to that are far outnumbered by the trajectories that create something that is conscious, something that appreciative of beauty creates beautiful things in the same way that humans can create beautiful things."}, {"time": 5847, "text": "And ultimately, the sad, destructive path for that AI would look a lot like just better humans than these cold machines."}, {"time": 5861, "text": "And I would say, of course, the cold machines that lack consciousness, the philosophical zombies make me sad."}, {"time": 5869, "text": "But also what makes me sad is just things that are far more powerful and smart and creative than us too, because then in the same way that Alpha Zero becoming a better chess player than the best of humans, even starting with Deep Blue, but really with Alpha Zero, that makes me sad too."}, {"time": 5891, "text": "One of the most beautiful games that humans ever created that used to be seen as demonstrations of the intellect, which is chess, and go in other parts of the world have been solved by AI, that makes me quite sad, and it feels like the progress of that is just pushing on forward."}, {"time": 5910, "text": "Oh, it makes me sad too."}, {"time": 5911, "text": "And to be perfectly clear, I absolutely believe that artificial consciousness is entirely possible."}, {"time": 5918, "text": "And that's not something I rule out at all."}, {"time": 5920, "text": "I mean, if you could get smart enough to have a perfect map of the neural structure and the neural states and the amount of neurotransmitters that are going between every synapse in a particular person's mind, could you replicate that in silica at some reasonably distant point in the future?"}, {"time": 5941, "text": "And then you'd have a consciousness."}, {"time": 5942, "text": "I don't rule out the possibility of artificial consciousness in any way."}, {"time": 5945, "text": "What I'm less certain about is whether consciousness is a requirement for superintelligence pursuing a maximizing function of some sort."}, {"time": 5956, "text": "I don't feel the certitude that consciousness simply must be part of that."}, {"time": 5961, "text": "You had said for it to coexist with human society would need to be consciousness."}, {"time": 5967, "text": "Could be entirely true, but it also could just exist orthogonally to human society."}, {"time": 5972, "text": "And it could also upon attaining a superintelligence with a maximizing function very, very, very rapidly because of the speed at which computing works compared to our own meat based minds very, very rapidly make the decisions and calculations necessary to seize the reins of power before we even know what's going on."}, {"time": 5994, "text": "I mean, kind of like biological viruses do, they don't necessarily, they integrate themselves just fine with human society."}, {"time": 6000, "text": "Without technically, without consciousness, without even being alive, you know, technically by the standards of a lot of biologists."}, {"time": 6007, "text": "So this is a bit of a tangent, but you've talked with Sam Harris on that four hour special episode we mentioned."}, {"time": 6016, "text": "And I'm just curious to ask, cause I use this meditation app I've been using for the past month to meditate."}, {"time": 6024, "text": "Is this something you've integrated as part of your life, meditation or fasting, or has some of Sam Harris rubbed off on you in terms of his appreciation of meditation and just kind of from a third person perspective, analyzing your own mind, consciousness, free will and so on?"}, {"time": 6041, "text": "You know, I've tried it three separate times in my life, really made a concerted attack on meditation and integrating it into my life."}, {"time": 6051, "text": "One of them, the most extreme was I took a class based on the work of Jon Kabat Zinn, who is, you know, in many ways, one of the founding people behind the mindful meditation movement that required like part of the class was, you know, it was a weekly class and you were going to meditate an hour a day, every day."}, {"time": 6072, "text": "And having done that for, I think it was 10 weeks, it might've been 13, however long period of time was, at the end of it, it just didn't stick."}, {"time": 6080, "text": "As soon as it was over, you know, I did not feel that gravitational pull."}, {"time": 6084, "text": "I did not feel the collapse in quality of life after wimping out on that project."}, {"time": 6093, "text": "And then the most recent one was actually with Sam's app during the lockdown."}, {"time": 6097, "text": "I did make a pretty good and consistent concerted effort to listen to his 10 minute meditation every day."}, {"time": 6104, "text": "And I've always fallen away from it."}, {"time": 6106, "text": "And I, you know, you're kind of interpreting, why did I personally do this?"}, {"time": 6110, "text": "I do believe it was ultimately because it wasn't bringing me that, you know, joy or inner peace or better competence at being me that I was hoping to get from it."}, {"time": 6121, "text": "Otherwise, I think I would have clung to it in the way that we cling to certain good habits, like I'm really good at flossing my teeth."}, {"time": 6128, "text": "Not that you were going to ask Lex, but yeah, that's one thing that defeats a lot of people."}, {"time": 6132, "text": "I'm good at that."}, {"time": 6133, "text": "See, Herman Hesse, I think, I forget which book or maybe, I forget where, I've read everything of his, so it's unclear where it came from, but he had this idea that anybody who truly achieves mastery in things will learn how to meditate in some way."}, {"time": 6155, "text": "So it could be that for you, the flossing of teeth is yet another like little inkling of meditation."}, {"time": 6162, "text": "Like it doesn't have to be this very particular kind of meditation."}, {"time": 6166, "text": "Maybe podcasting, you have an amazing podcast, that could be meditation."}, {"time": 6169, "text": "The writing process is meditation."}, {"time": 6171, "text": "For me, like there's a bunch of mechanisms which take my mind into a very particular place that looks a whole lot like meditation."}, {"time": 6184, "text": "For example, when I've been running over the past couple years, and especially when I listen to certain kinds of audio books, like I've listened to the Rise and Fall of the Third Reich."}, {"time": 6198, "text": "I've listened to a lot of sort of World War II, which at once, because I have a lot of family who's lost in World War II and so much of the Soviet Union is grounded in the suffering of World War II, that somehow it connects me to my history, but also there's some kind of purifying aspect to thinking about how cruel, but at the same time, how beautiful human nature could be."}, {"time": 6223, "text": "And so you're also running, like it clears the mind from all the concerns of the world and somehow it takes you to this place where you were like deeply appreciative to be alive in the sense that as opposed to listening to your breath or like feeling your breath and thinking about your consciousness and all those kinds of processes that Sam's app does."}, {"time": 6245, "text": "Well, this does that for me, the running and flossing may do that for you."}, {"time": 6250, "text": "So maybe Herman Hesse is onto something."}, {"time": 6252, "text": "So I hope flossing is not my main form of expertise, although I am going to claim a certain expertise there and I'm going to claim it."}, {"time": 6259, "text": "Somebody has to be the best flosser in the world."}, {"time": 6261, "text": "That ain't me."}, {"time": 6262, "text": "I'm just glad that I'm a consistent one."}, {"time": 6263, "text": "I mean, there are a lot of things that bring me into a flow state and I think maybe perhaps that's one reason why meditation isn't as necessary for me."}, {"time": 6271, "text": "I definitely enter a flow state when I'm writing and definitely enter a flow state when I'm editing."}, {"time": 6275, "text": "I definitely enter a flow state when I'm mixing and mastering music."}, {"time": 6279, "text": "I enter a flow state when I'm doing heavy, heavy research to either prepare for a podcast or to also do tech investing, to make myself smart in a new field that is fairly alien to me, I can just, the hours can just melt away while I'm reading this and watching that YouTube lecture and going through this presentation and so forth."}, {"time": 6302, "text": "So maybe because there's a lot of things that bring me into a flow state in my normal weekly life, not daily, unfortunately, but certainly my normal weekly life that I have less of an urge to meditate."}, {"time": 6312, "text": "Now you've been working with Sam's app for about a month now, you said."}, {"time": 6315, "text": "Is this your first run in with meditation?"}, {"time": 6317, "text": "Is your first attempt to integrate it with your life or?"}, {"time": 6319, "text": "Like meditation, meditation."}, {"time": 6320, "text": "I always thought running and thinking, I listen to brown noise often."}, {"time": 6326, "text": "That takes my mind, I don't know what the hell it does, but it takes my mind immediately into like the state where I'm deeply focused on anything I do."}, {"time": 6334, "text": "So it's like you're accompanying sound when you're like, really?"}, {"time": 6337, "text": "And what's the difference between brown and white noise?"}, {"time": 6339, "text": "This is a cool term I haven't heard before."}, {"time": 6341, "text": "So people should look up brown noise."}, {"time": 6343, "text": "They don't have to because you're about to tell them what it is."}, {"time": 6345, "text": "Because you have to experience, you have to listen to it."}, {"time": 6348, "text": "So I think white noise is, this has to do with music."}, {"time": 6352, "text": "I think there's different colors, there's pink noise."}, {"time": 6355, "text": "And I think that has to do with like the frequencies."}, {"time": 6359, "text": "Like the white noise is usually less bassy, brown noise is very bassy."}, {"time": 6366, "text": "So it's more like versus like, if that makes sense."}, {"time": 6374, "text": "So there's like a deepness to it."}, {"time": 6376, "text": "I think everyone is different, but for me, when I was a research scientist at MIT, especially when there's a lot of students around, I remember just being annoyed at the noise of people talking."}, {"time": 6391, "text": "And one of my colleagues said, well, you should try listening to brown noise."}, {"time": 6394, "text": "Like it really knocks out everything."}, {"time": 6396, "text": "Because I used to wear earplugs to it, like just see if I can block it out."}, {"time": 6400, "text": "And like the moment I put it on, something, it's as if my mind was waiting all these years to hear that sound."}, {"time": 6409, "text": "Everything just focused in, I listened."}, {"time": 6412, "text": "It makes me wonder how many other amazing things out there they're waiting to discover from my own particular, like biological, from my own particular brain."}, {"time": 6421, "text": "So that, it just goes, the mind just focuses in, it's kind of incredible."}, {"time": 6426, "text": "So I see that as a kind of meditation, maybe I'm using a performance enhancing sound to achieve that meditation, but I've been doing that for many years now and running and walking and doing, Cal Newport was the first person that introduced me to the idea of deep work."}, {"time": 6444, "text": "Just put a word to the kind of thinking that's required to sort of deeply think about a problem, especially if it's mathematical in nature."}, {"time": 6453, "text": "I see that as a kind of meditation because what it's doing is you have these constructs in your mind that you're building on top of each other."}, {"time": 6460, "text": "And there's all these distracting thoughts that keep bombarding you from all over the place."}, {"time": 6465, "text": "And the whole process is you slowly let them kind of move past you."}, {"time": 6470, "text": "And that's a meditative process."}, {"time": 6471, "text": "It's very meditative."}, {"time": 6472, "text": "That sounds a lot like what Sam talks about in his meditation app, which I did use to be clear for a while, of just letting the thought go by without deranging you."}, {"time": 6482, "text": "Derangement is one of Sam's favorite words, as I'm sure you know."}, {"time": 6486, "text": "But brown noise, that's really intriguing."}, {"time": 6488, "text": "I am going to try that as soon as this evening."}, {"time": 6491, "text": "Yeah, to see if it works, but very well might not work at all."}, {"time": 6495, "text": "I think the interesting point is, and the same with the fasting and the diet, is I long ago stopped trusting experts or maybe taking the word of experts as the gospel truth and only using it as an inspiration to try something, to try thoroughly something."}, {"time": 6519, "text": "So fasting was one of the things when I first discovered I've been many times eating just once a day, so that's a 24 hour fast."}, {"time": 6529, "text": "It makes me feel amazing."}, {"time": 6530, "text": "And at the same time, eating only meat, putting ethical concerns aside, makes me feel amazing."}, {"time": 6572, "text": "Particularly because our own personal metabolism is highly variant among us."}, {"time": 6576, "text": "So there are going to be some people like if brown noise is a game changer for 7% of people, there's 93% odds that I'm not one of them, but there's certainly every reason in the world to test it out."}, {"time": 6589, "text": "Now, so I'm intrigued by the fasting."}, {"time": 6591, "text": "I like you, well, I assume like you, I don't have any problem going to one meal a day and I often do that inadvertently and I've never done it methodically."}, {"time": 6600, "text": "Like I've never done it like I'm going to do this for 15 days."}, {"time": 6603, "text": "Maybe I should and maybe I should."}, {"time": 6605, "text": "Like how many, how many days in a row of the one day, one meal a day did you find brought noticeable impact to you?"}, {"time": 6613, "text": "Was it after three days of it?"}, {"time": 6614, "text": "Was it months of it?"}, {"time": 6615, "text": "Like what was it?"}, {"time": 6617, "text": "Well, the noticeable impact is day one."}, {"time": 6619, "text": "So for me, folks, cause I eat a very low carb diet."}, {"time": 6622, "text": "So the hunger wasn't the hugest issue."}, {"time": 6625, "text": "Like there wasn't a painful hunger, like wanting to eat."}, {"time": 6629, "text": "So I was already kind of primed for it."}, {"time": 6631, "text": "And the benefit comes from a lot of people that do intermittent fasting."}, {"time": 6636, "text": "That's only like 16 hours of fasting get this benefit too is the focus."}, {"time": 6641, "text": "There's a clarity of thought."}, {"time": 6643, "text": "If my brain was a runner, it felt like I'm running on a track when I'm fasting versus running in quicksand, like it's much crisper."}, {"time": 6653, "text": "And is this your first 72 hour fast?"}, {"time": 6654, "text": "This is the first time doing 72 hours."}, {"time": 6656, "text": "And that's a different thing, but similar, like I'm going up and down in terms of, in terms of hunger and the focus is really crisp."}, {"time": 6666, "text": "The thing I'm noticing most of all, to be honest, is how much eating, even when it's once a day or twice a day is a big part of my life."}, {"time": 6678, "text": "Like I almost feel like I have way more time in my life and it's not so much about the eating, but like, I don't have to plan my day around like today, I don't have any eating to do."}, {"time": 6690, "text": "It does free up hours or any cleaning up after eating or provisioning the food."}, {"time": 6695, "text": "But like, or even like thinking about it's not a thing."}, {"time": 6698, "text": "Like, so when you think about what you're going to do tonight, I think I'm realizing that as opposed to thinking, you know, I'm going to work on this problem or I'm going to go on this walk, or I'm going to call this person."}, {"time": 6711, "text": "I often think I'm going to eat this thing."}, {"time": 6714, "text": "You allow dinner as a kind of, you know, when people talk about like the weather or something like that, it's almost like a generic thought you allow yourself to have because, because it's the lazy thought."}, {"time": 6726, "text": "And I don't have the opportunity to have that thought because I'm not eating it."}, {"time": 6730, "text": "So now I get to think about like the things I'm actually going to do tonight that are more complicated than the eating process."}, {"time": 6736, "text": "That's, that's been the most noticeable thing to be honest."}, {"time": 6740, "text": "And then there's people that have written me that have done seven day fast."}, {"time": 6744, "text": "And there's a few people that have written me and I've heard of this is doing 30 day fasts."}, {"time": 6752, "text": "The body, I don't know what the health benefits are necessarily."}, {"time": 6757, "text": "What that shows me is how adaptable the human body is."}, {"time": 6762, "text": "And, and that's incredible."}, {"time": 6763, "text": "And that's something really important to remember when we think about how to live life because the body adapts."}, {"time": 6770, "text": "I mean, we sure couldn't go 30 days without water."}, {"time": 6774, "text": "But food, yeah, it's been done."}, {"time": 6776, "text": "It's demonstrably possible."}, {"time": 6777, "text": "You ever read Franz Kafka has a great short story called The Hunger Artist?"}, {"time": 6783, "text": "Great story."}, {"time": 6784, "text": "You know, that was before I started fasting."}, {"time": 6786, "text": "I read that story and I, I, I admired the beauty of that, the artistry of that actual hunger artist that it's like madness, but it also felt like a little bit of genius."}, {"time": 6796, "text": "I actually have to reread it."}, {"time": 6798, "text": "That's what I'm going to do tonight."}, {"time": 6799, "text": "I'm going to read it because I'm doing the fast."}, {"time": 6801, "text": "Because you're in the midst of it."}, {"time": 6802, "text": "Be very contextual."}, {"time": 6803, "text": "I haven't read it since high school and I love to read it again."}, {"time": 6805, "text": "I love his work."}, {"time": 6806, "text": "So maybe I'll read it tonight too."}, {"time": 6808, "text": "And part of the reason of sort of I've here in Texas, people have been so friendly that I've been nonstop eating like brisket with incredible people, a lot of whiskey as well."}, {"time": 6819, "text": "So I gained quite a bit of weight, which I'm embracing."}, {"time": 6824, "text": "But I am also aware as I'm fasting that like I have a lot of fat for, for to, to run on."}, {"time": 6832, "text": "Like I have a lot of like natural resources on my body."}, {"time": 6837, "text": "You've got reserves."}, {"time": 6838, "text": "Reserves."}, {"time": 6838, "text": "You got reserves, yeah."}, {"time": 6839, "text": "And that's, that's really cool."}, {"time": 6841, "text": "You know, there's like a re this whole thing, this biology works well."}, {"time": 6845, "text": "Like I can go a long time because of the, the longterm investing in terms of brisket that I've been doing in the weeks before."}, {"time": 6852, "text": "So it's all training."}, {"time": 6853, "text": "It's all training."}, {"time": 6854, "text": "All prep work."}, {"time": 6856, "text": "You open a bunch of doors, one of which is music."}, {"time": 6858, "text": "I, so I got to walk in at least for a brief moment."}, {"time": 6861, "text": "I love guitar."}, {"time": 6862, "text": "I love music."}, {"time": 6863, "text": "You founded a music company, but you're also a musician yourself."}, {"time": 6867, "text": "You know, let me ask the big ridiculous question first."}, {"time": 6870, "text": "What's the greatest song of all time?"}, {"time": 6872, "text": "Greatest song of all time."}, {"time": 6875, "text": "It's, it's going to obviously very dramatically from genre to genre."}, {"time": 6879, "text": "So like you, I like guitar, perhaps like you, although I've dabbled in, in inhaling every genre of music that I can almost practically imagine."}, {"time": 6891, "text": "I keep coming back to, you know, the sound of bass, guitar, drum, keyboards, voice."}, {"time": 6897, "text": "I love that style of music and added to it."}, {"time": 6900, "text": "I think a lot of really cool electronic production makes something that's really, really new and hybridy and awesome."}, {"time": 6908, "text": "But, you know, and that kind of like guitar based rock I think I've got to go with won't get fooled again by the who."}, {"time": 6918, "text": "It is such an epic song."}, {"time": 6921, "text": "It's got so much grandeur to it."}, {"time": 6923, "text": "It uses the synthesizers that were available at the time."}, {"time": 6927, "text": "This has got to be, I think, 1972, 73, which are very, very primitive to our ears, but uses them in this hypnotic and beautiful way that I can't imagine somebody with the greatest synth array conceivable by today's technology could do a better job of in the context of that song."}, {"time": 6945, "text": "And it's, you know, almost operatic."}, {"time": 6949, "text": "So I would say in that genre, the genre of, you know, rock that would be my nomination."}, {"time": 6956, "text": "I'm totally in my brain."}, {"time": 6958, "text": "Pinball Wizard is overriding everything else, but it was so like, I can't even imagine the song."}, {"time": 6964, "text": "Well, I would say, ironically, with Pinball Wizard."}, {"time": 6967, "text": "So that came from the movie Tommy."}, {"time": 6969, "text": "And in the movie, Tommy, the rival of Tommy, the reigning pinball champ was Elton John."}, {"time": 6977, "text": "And so there are a couple of versions of Pinball Wizard out there."}, {"time": 6980, "text": "One sung by Roger Daltrey of The Who, which a purist would say, hey, that's the real pinball wizard."}, {"time": 6985, "text": "But the version that is sung by Elton John in the movie, which is available to those who are ambitious and want to dig for it, that's even better in my mind."}, {"time": 6995, "text": "Yeah, the covers."}, {"time": 6996, "text": "And I, for myself, I was thinking, what is the song for me?"}, {"time": 7000, "text": "They answered that question."}, {"time": 7002, "text": "I think that changes day to day, too."}, {"time": 7005, "text": "I was realizing that."}, {"time": 7006, "text": "Of course, but for me, somebody who values lyrics as well and the emotion in the song."}, {"time": 7017, "text": "By the way, Hallelujah by Leonard Cohen was a close one."}, {"time": 7019, "text": "But the number one is Johnny Cash's cover of Hurt that is, there's something so powerful about that song, about that cover, about that performance."}, {"time": 7035, "text": "Maybe another one is the cover of Sound of Silence."}, {"time": 7039, "text": "Maybe there's something about covers for me."}, {"time": 7041, "text": "So whose cover sounds?"}, {"time": 7042, "text": "Because Simon and Garfunkel, I think, did the original recording of that, right?"}, {"time": 7046, "text": "So which cover is it that?"}, {"time": 7048, "text": "There's a cover by Disturbed."}, {"time": 7051, "text": "It's a metal band, which is so interesting because I'm really not into that kind of metal."}, {"time": 7055, "text": "But he does a pure vocal performance."}, {"time": 7058, "text": "So he's not doing a metal performance."}, {"time": 7061, "text": "I would say it's one of the greatest people should see it."}, {"time": 7064, "text": "It's like 400 million views or something like that."}, {"time": 7068, "text": "It's probably the greatest live vocal performance I've ever heard is Disturbed covering Sound of Silence."}, {"time": 7075, "text": "I'll listen to it as soon as I get home."}, {"time": 7076, "text": "And that song came to life to me in a way that Simon and Garfunkel never did."}, {"time": 7081, "text": "For me with Simon and Garfunkel, there's not a pain, there's not an anger, there's not power to their performance."}, {"time": 7091, "text": "It's almost like this melancholy, I don't know."}, {"time": 7095, "text": "Well, I guess there's a lot of beauty to it, objectively beautiful."}, {"time": 7101, "text": "I think, I never thought of this until now, but I think if you put entirely different lyrics on top of it, unless they were joyous, which would be weird, it wouldn't necessarily lose that much."}, {"time": 7112, "text": "There's just a beauty in the harmonizing."}, {"time": 7115, "text": "It's soft and you're right."}, {"time": 7116, "text": "It's not dripping with emotion."}, {"time": 7120, "text": "The vocal performance is not dripping with emotion, it's dripping with technical harmonizing brilliance and beauty."}, {"time": 7130, "text": "Now, if you compare that to the Disturbed cover or the Johnny Cash's Hurt cover, when you walk away, it's haunting."}, {"time": 7141, "text": "It stays with you for a long time."}, {"time": 7142, "text": "There's certain performances that will just stay with you to where, like if you watch people respond to that, and that's certainly how I felt when you listen to that, the Disturbed performance or Johnny Cash Hurt, there's a response to where you just sit there with your mouth open, kind of like paralyzed by it somehow."}, {"time": 7166, "text": "And I think that's what makes for a great song to where you're just like, it's not that you're like singing along or having fun, that's another way a song could be great, but where you're just like, you're in awe."}, {"time": 7181, "text": "If we go to listen.com and that whole fascinating era of music in the 90s, transitioning to the aughts, I remember those days, the Napster days, when piracy, from my perspective, allegedly ruled the land."}, {"time": 7201, "text": "What do you make of that whole era?"}, {"time": 7203, "text": "What are the big, what was, first of all, your experiences of that era and what were the big takeaways in terms of piracy, in terms of what it takes to build a company that succeeds in that kind of digital space, in terms of music, but in terms of anything creative?"}, {"time": 7222, "text": "Well, so for those who don't remember, which is going to be most folks, listen.com created a service called Rhapsody, which is much, much more recognizable to folks because Rhapsody became a pretty big name for reasons that I'll get into in a second."}, {"time": 7268, "text": "So we were a pioneer on that front."}, {"time": 7270, "text": "What was really, really, really hard about doing business in those days was the reaction of the music labels to piracy, which was about 180 degrees opposite of what the reaction quote unquote should have been from the standpoint of preserving their business from piracy."}, {"time": 7286, "text": "So Napster came along and was a service that enabled people to get near unlimited access to most songs."}, {"time": 7298, "text": "I mean, truly obscure things could be very hard to find on Napster, but most songs with a relatively simple one click ability to download those songs and have the MP3s on their hard drives, but there was a lot that was very messy about the Napster experience."}, {"time": 7315, "text": "You might download a really god awful recording of that song."}, {"time": 7319, "text": "You may download a recording that actually wasn't that song with some prankster putting it up to sort of mess with people."}, {"time": 7326, "text": "You could struggle to find the song that you're looking for."}, {"time": 7329, "text": "You could end up finding yourself connected, it was peer to peer."}, {"time": 7333, "text": "You might randomly find yourself connected to somebody in Bulgaria, doesn't have a very good internet connection."}, {"time": 7338, "text": "So you might wait 19 minutes only for it to snap, et cetera, et cetera."}, {"time": 7343, "text": "And our argument to, well, actually let's start with how that hit the music labels."}, {"time": 7347, "text": "The music labels had been in a very, very comfortable position for many, many decades of essentially being the monopoly providers of a certain subset of artists."}, {"time": 7361, "text": "Any given label was a monopoly provider of the artists and the recordings that they owned and they could sell it at what turned out to be tremendously favorable rates."}, {"time": 7371, "text": "In the late era of the CD, you were talking close to $20 for a compact disc that might have one song that you were crazy about and simply needed to own that might actually be glued to 17 other songs that you found to be sure crap."}, {"time": 7385, "text": "And so the music industry had used the fact that it had this unbelievable leverage and profound pricing power to really get music lovers to the point that they felt very, very misused by the entire situation."}, {"time": 7402, "text": "Now along comes Napster and music sales start getting gutted with extreme rapidity."}, {"time": 7409, "text": "And the reaction of the music industry to that was one of shock and absolute fury, which is understandable."}, {"time": 7418, "text": "I mean, industries do get gutted all the time, but I struggle to think of an analog of an industry that got gutted that rapidly."}, {"time": 7426, "text": "I mean, we could say that passenger train service certainly got gutted by airlines, but that was a process that took place over decades and decades and decades."}, {"time": 7434, "text": "It wasn't something that happened, really started showing up in the numbers in a single digit number of months and started looking like an existential threat within a year or two."}, {"time": 7444, "text": "So the music industry is quite understandably in a state of shock and fury."}, {"time": 7450, "text": "I don't blame them for that."}, {"time": 7451, "text": "But then their reaction was catastrophic, both for themselves and almost for people like us who were trying to do the cowboy in the white hat thing."}, {"time": 7463, "text": "So our response to the music industry was, look, what you need to do to fight piracy, you can't put the genie back in the bottle."}, {"time": 7470, "text": "You can't switch off the internet."}, {"time": 7472, "text": "Even if you all shut your eyes and wish very, very, very hard, the internet is not going away."}, {"time": 7478, "text": "And these peer to peer technologies are genies out of the bottle."}, {"time": 7480, "text": "And if you don't, whatever you do, don't shut down Napster because if you do, suddenly that technology is going to splinter into 30 different nodes that you'll never, ever be able to shut off."}, {"time": 7492, "text": "We suggested to them is like, look, what you want to do is to create a massively better experience to piracy, something that's way better, that you sell at a completely reasonable price."}, {"time": 7504, "text": "And this is what it is."}, {"time": 7506, "text": "Don't just give people access to that very limited number of songs that they happen to have acquired and paid for or pirated and have on their hard drive."}, {"time": 7515, "text": "Give them access to all of the music in the world for a simple low price."}, {"time": 7519, "text": "And obviously, that doesn't sound like a crazy suggestion, I don't think, to anybody's ears today because that is how the majority of music is now being consumed online."}, {"time": 7526, "text": "But in doing that, you're going to create a much, much better option to this kind of crappy, kind of rickety, kind of buggy process of acquiring MP3s."}, {"time": 7537, "text": "Now, unfortunately, the music industry was so angry about Napster and so forth that for essentially three and a half years, they folded their arms, stamped their feet, and boycotted the internet."}, {"time": 7549, "text": "So they basically gave people who were fervently passionate about music and were digitally modern, they gave them basically one choice."}, {"time": 7557, "text": "If you want to have access to digital music, we, the music industry, insist that you steal it because we are not going to sell it to you."}, {"time": 7564, "text": "So what that did is it made an entire generation of people morally comfortable with swiping the music because they felt quite pragmatically, well, they're not giving me any choice here."}, {"time": 7574, "text": "It's like a 20 year old violating the 21 drinking age."}, {"time": 7578, "text": "If they do that, they're not going to feel like felons."}, {"time": 7581, "text": "They're going to be like, this is an unreasonable law and I'm skirting it, right?"}, {"time": 7585, "text": "So they make a whole generation of people morally comfortable with swiping music, but also technically adept at it."}, {"time": 7592, "text": "And when they did shut down Napster and kind of even trickier tools and like tweakier tools like Kazaa and so forth came along, people just figured out how to do it."}, {"time": 7601, "text": "So by the time they finally, grudgingly, it took years, allowed us to release this experience that we were quite convinced would be better than piracy, we had this enormous hole had been dug where lots of people said, music is a thing that is free and that's morally okay and I know how to get it."}, {"time": 7621, "text": "And so streaming took many, many, many more years to take off and become the gargantuan thing the juggernaut is today than would have happened if they'd made, pivoted to let's sell a better experience as opposed to demand that people want digital music, steal it."}, {"time": 7639, "text": "Like what lessons do we draw from that?"}, {"time": 7641, "text": "Cause we're probably in the midst of living through a bunch of similar situations in different domains currently."}, {"time": 7647, "text": "We just don't know."}, {"time": 7648, "text": "There's a lot of things in this world that are really painful."}, {"time": 7651, "text": "Like, I mean, I don't know if you can draw perfect parallels, but fiat money versus cryptocurrency, there's a lot of currently people in power who are kind of very skeptical about cryptocurrency, although that's changing."}, {"time": 7663, "text": "But it's arguable it's changing way too slowly."}, {"time": 7665, "text": "There's a lot of people making that argument where there should be a complete like Coinbase and all this stuff switched to that."}, {"time": 7672, "text": "There's a lot of other domains that where a pivot, like if you pivot now, you're going to win big, but you don't pivot because you're stubborn."}, {"time": 7685, "text": "And it's so, I mean, like, is this just the way that companies are?"}, {"time": 7689, "text": "A company succeeds initially and then it grows and there's a huge number of employees and managers that don't have the guts or the institutional mechanisms to do the pivot."}, {"time": 7701, "text": "Is that just the way of companies?"}, {"time": 7703, "text": "Well, I think what happens, I'll use the case of the music industry."}, {"time": 7707, "text": "There was an economic model that had put food on the table and paid for marble lobbies and seven and even eight figure executive salaries for many, many decades, which was the physical collection of music."}, {"time": 7718, "text": "And then you start talking about something like unlimited streaming and it seems so ephemeral and like such a long shot that people start worrying about cannibalizing their own business and they lose sight of the fact that something illicit is cannibalizing their business at an extraordinarily fast rate."}, {"time": 7736, "text": "And so if they don't do it themselves, they're doomed."}, {"time": 7738, "text": "I mean, we used to put slides in front of these folks, this is really funny, where we said, okay, let's assume Rhapsody, we want it to be 9.99 a month and we want it to be 12 months, so it's $120 a year from the budget of a music lover."}, {"time": 7753, "text": "And then we were also able to get reasonably accurate statistics that showed how many CDs per year the average person who bothered to collect music, which was not all people, actually bought."}, {"time": 7764, "text": "And it was overwhelmingly clear that the average CD buyer spends a hell of a lot less than $120 a year on music."}, {"time": 7772, "text": "This is a revenue expansion, blah, blah, blah."}, {"time": 7775, "text": "But all they could think of, and I'm not saying this in a pejorative or patronizing way, I don't blame them, they've grown up in this environment for decades, all they could think of was the incredible margins that they had on a CD."}, {"time": 7788, "text": "And they would say, well, if this CD, by the mechanism that you guys are proposing, the CD that I'm selling for $17.99, somebody would need to stream those songs."}, {"time": 7800, "text": "We were talking about a penny of playback then, it's less than that now that the record labels get paid."}, {"time": 7805, "text": "But would have to stream songs from that 1,799 times, it's never gonna happen."}, {"time": 7810, "text": "So they were just sort of stuck in the model of this, but it's like, no, dude, but they're gonna spend money on all this other stuff."}, {"time": 7815, "text": "So I think people get very hung up on that."}, {"time": 7817, "text": "I mean, another example is really the taxi industry was not monolithic, like the music labels."}, {"time": 7823, "text": "There was a whole bunch of fleets and a whole bunch of cities, very, very fragmented, it's an imperfect analogy."}, {"time": 7827, "text": "But nonetheless, imagine if the taxi industry writ large upon seeing Uber said, oh my God, people wanna be able to hail things easily, cheaply, they don't wanna mess with cash, they wanna know how many minutes it's gonna be, they wanna know the fare in advance, and they want a much bigger fleet than what we've got."}, {"time": 7846, "text": "If the taxi industry had rolled out something like that with the branding of yellow taxis, universally known and kind of loved by Americans and expanded their fleet in a necessary manner, I don't think Uber or Lyft ever would have gotten a foothold."}, {"time": 7861, "text": "But the problem there was that real economics in the taxi industry wasn't with fares, it was with the scarcity of medallions."}, {"time": 7870, "text": "And so the taxi fleets, in many cases, owned gazillions of medallions whose value came from their very scarcity."}, {"time": 7878, "text": "So they simply couldn't pivot to that."}, {"time": 7881, "text": "So I think you end up having these vested interests with economics that aren't necessarily visible to outsiders who get very, very reluctant to disrupt their own model, which is why it ends up coming from the outside so frequently."}, {"time": 7894, "text": "So you know what it takes to build a successful startup, but you're also an investor in a lot of successful startups."}, {"time": 7901, "text": "Let me ask for advice."}, {"time": 7903, "text": "What do you think it takes to build a successful startup by way of advice?"}, {"time": 7908, "text": "JS Well, I think it starts, I mean, everything starts and even ends with the founder."}, {"time": 7914, "text": "And so I think it's really, really important to look at the founder's motivations and their sophistication about what they're doing."}, {"time": 7922, "text": "In almost all cases that I'm familiar with and have thought hard about, you've had a founder who was deeply, deeply inculcated in the domain of technology that they were taking on."}, {"time": 7936, "text": "Now, what's interesting about that is you could say, no, wait, how is that possible because there's so many young founders?"}, {"time": 7941, "text": "When you look at young founders, they're generally coming out of very nascent emerging fields of technology where simply being present and accounted for and engaged in the community for a period of even months is enough time to make them very, very deeply inculcated."}, {"time": 7956, "text": "I mean, you look at Marc Andreessen and Netscape."}, {"time": 7961, "text": "Marc had been doing visual web browsers when Netscape had been founded for what, a year and a half, but he'd created the first one in Mosaic when he was an undergrad."}, {"time": 7971, "text": "And the commercial internet was pre nascent in 1994 when Netscape was founded."}, {"time": 7978, "text": "So there's somebody who's very, very deep in their domain."}, {"time": 7980, "text": "Mark Zuckerberg also, social networking, very deep in his domain, even though it was nascent at the time."}, {"time": 7985, "text": "Lots of people doing crypto stuff."}, {"time": 7987, "text": "I mean, 10 years ago, even seven or eight years ago, by being a really, really vehement and engaged participant in the crypto ecosystem, you could be an expert in that."}, {"time": 7999, "text": "You look, however, at more established industries, take Salesforce.com."}, {"time": 8003, "text": "Salesforce automation, pretty mature field when it got started."}, {"time": 8006, "text": "Who's the executive and the founder?"}, {"time": 8008, "text": "Marc Benioff, who has spent 13 years at Oracle and was an investor in Siebel Systems, which ended up being Salesforce's main competition."}, {"time": 8016, "text": "So more established, you need the entrepreneur to be very, very deep in the technology and the culture of the space because you need that entrepreneur, that founder to have just an unbelievably accurate intuitive sense for where the puck is going."}, {"time": 8036, "text": "And that only comes from being very deep."}, {"time": 8038, "text": "So that is sort of factor number one."}, {"time": 8041, "text": "And the next thing is that that founder needs to be charismatic and or credible, or ideally both in exactly the right ways to be able to attract a team that is bought into that vision and is bought into that founder's intuitions being correct and not just the team, obviously, but also the investors."}, {"time": 8061, "text": "So it takes a certain personality type to pull that off."}, {"time": 8065, "text": "Then the next thing I'm still talking about the founder is a relentlessness and indeed a monomania to put this above things that might rationally, should perhaps rationally supersede it for a period of time to just relentlessly pivot when pivoting is called for and it's always called for."}, {"time": 8088, "text": "I mean, think of even very successful companies like how many times did Facebook pivot?"}, {"time": 8093, "text": "Newsfeed was something that was completely alien to the original version of Facebook and came foundationally important."}, {"time": 8100, "text": "How many times did Google, how many times at any given, how many times has Apple pivoted?"}, {"time": 8104, "text": "That founder energy and DNA when the founder moves on the DNA that's been inculcated with a company has to have that relentlessness and that ability to pivot and pivot and pivot without being worried about sacred cows."}, {"time": 8118, "text": "And then the last thing I'll say about the founder before I get to the rest of the team and that'll be mercifully brief is the founder has to be obviously a really great hirer but just important a very good firer."}, {"time": 8132, "text": "And firing is a horrific experience for both people involved in it."}, {"time": 8137, "text": "It is a wrenching emotional experience."}, {"time": 8140, "text": "And being good at realizing when this particular person is damaging the interests of the company and the team and the shareholders and having the intestinal fortitude to have that conversation and make it happen is something that most people don't have in them."}, {"time": 8161, "text": "And it's something that needs to be developed in most people or maybe some people have it naturally."}, {"time": 8168, "text": "But without that ability, that will take an A plus organization into B minus range very, very quickly."}, {"time": 8175, "text": "And so that's all what needs to be present in the founder."}, {"time": 8179, "text": "Can I just say?"}, {"time": 8181, "text": "How damn good you are, Rob."}, {"time": 8182, "text": "That was brilliant."}, {"time": 8184, "text": "The one thing that was kind of really kind of surprising to me is having a deep technical knowledge because I think the way you expressed it, which is that allows you to be really honest with the capabilities of what like what's possible."}, {"time": 8205, "text": "Of course, you're often trying to do the impossible."}, {"time": 8208, "text": "But in order to do the impossible, you have to be quote unquote impossible."}, {"time": 8211, "text": "But you have to be honest with what is actually possible."}, {"time": 8214, "text": "And it doesn't necessarily have to be the technical competence."}, {"time": 8217, "text": "It's got to be, in my view, just a complete immersion in that emerging market."}, {"time": 8222, "text": "And so I can imagine there are a couple of people out there who have started really good crypto projects who themselves are right in the code, but they're immersed in the culture and through the culture and a deep understanding of what's happening and what's not happening."}, {"time": 8236, "text": "They can get a good intuition of what's possible, but the very first hire, I mean, a great way to solve that is to have a technical co founder and dual founder companies have become extremely common for that reason."}, {"time": 8250, "text": "And if you're not doing that and you're not the technical person, but you are the founder, you've got to be really great at hiring a very damn good technical person very, very fast."}, {"time": 8263, "text": "Can I on the founder ask you, is it possible to do this alone?"}, {"time": 8270, "text": "There's so many people giving advice and saying that it's impossible to do the first few steps, not impossible, but much more difficult to do it alone."}, {"time": 8278, "text": "If we were to take the journey, especially in the software world where there's not significant investment required for it to build something up, is it possible to go to a prototype to something that essentially works and already has a huge number of customers alone?"}, {"time": 8295, "text": "There are lots and lots of loan founder companies out there that have made an incredible difference."}, {"time": 8301, "text": "I mean, I'm not certainly putting rhapsody in the league of Spotify."}, {"time": 8305, "text": "We were too early to be Spotify, but we did an awful lot of innovation."}, {"time": 8309, "text": "And then after the company sold and ended up in the hands of real networks and MTV, you know, got to millions of subs, right?"}, {"time": 8315, "text": "I was a loan founder and I studied Arabic and Middle Eastern history undergrad, so I definitely wasn't very, very technical."}, {"time": 8322, "text": "But yeah, loan founders can absolutely work."}, {"time": 8324, "text": "And the advantage of a loan founder is you don't have the catastrophic potential of a falling out between founders."}, {"time": 8333, "text": "I mean, two founders who fall out with each other badly can rip a company to shreds because they both have an enormous amount of equity and enormous amount of power."}, {"time": 8344, "text": "And the capital structure is a result of that."}, {"time": 8346, "text": "They both have an enormous amount of moral authority with the team as a result of each having that founder role."}, {"time": 8354, "text": "And I have witnessed over the years many, many situations in which companies have been shredded or have suffered near fatal blows because of a falling out between founders."}, {"time": 8367, "text": "And the more founders you add, the more risky that becomes."}, {"time": 8370, "text": "I don't think there should ever almost, I mean, you never say never, but multiple founders beyond two is such an unstable and potentially treacherous situation that I would never, ever recommend going beyond two."}, {"time": 8385, "text": "But I do see value in the non technical sort of business and market and outside minded founder teaming up with the technical founder."}, {"time": 8394, "text": "There is a lot of merit to that, but there's a lot of danger in that less those two blow apart."}, {"time": 8399, "text": "Was it lonely for you?"}, {"time": 8400, "text": "Unbelievably."}, {"time": 8401, "text": "And that's the drawback."}, {"time": 8402, "text": "I mean, if you're a lone founder, there is no other person that you can sit down with and tackle problems and talk them through who has precisely or nearly precisely your alignment of interests."}, {"time": 8417, "text": "Your most trusted board member is likely an investor and therefore at the end of the day has the interest of preferred stock in mind, not common stock."}, {"time": 8426, "text": "Your most trusted VP, who might own a very significant stake in the company, doesn't own anywhere near your stake in the company."}, {"time": 8435, "text": "And so their long term interests may well be in getting the right level of experience and credibility necessary to peel off and start their own company."}, {"time": 8444, "text": "Or their interests might be aligned with jumping ship and setting up with a different company, whether it's a rival or one in a completely different space."}, {"time": 8454, "text": "So, yeah, being a lone founder is a spectacularly lonely thing."}, {"time": 8457, "text": "And that's a major downside to it."}, {"time": 8459, "text": "What about mentorship?"}, {"time": 8460, "text": "Because you're a mentor to a lot of people."}, {"time": 8463, "text": "Can you find an alleviation to that loneliness in the space of ideas with a good mentor?"}, {"time": 8469, "text": "With a good mentor or like a mentor who's mentoring you?"}, {"time": 8472, "text": "Yeah, you can a great deal, particularly if it's somebody who's been through this very process and has navigated it successfully and cares enough about you and your well being to give you beautifully unvarnished advice."}, {"time": 8485, "text": "That can be a huge, huge thing."}, {"time": 8486, "text": "That can assuage things a great deal."}, {"time": 8488, "text": "And I had a board member who was not an investor, who basically played that role for me to a great degree."}, {"time": 8495, "text": "He came in maybe halfway through the company's history, though."}, {"time": 8499, "text": "I would have needed that the most in the very earliest days."}, {"time": 8503, "text": "Yeah, the loneliness, that's the whole journey of life."}, {"time": 8507, "text": "We're always alone, alone together."}, {"time": 8511, "text": "It pays to embrace that."}, {"time": 8514, "text": "You were saying that there might be something outside of the founder that's also that you were promising to be brief on."}, {"time": 8520, "text": "OK, so we talked about the founder."}, {"time": 8522, "text": "You were asking what makes a great startup."}, {"time": 8524, "text": "And great founder is thing number one, but then thing number two, and it's ginormous, is a great team."}, {"time": 8530, "text": "And so I said so much about the founder because one hopes or one believes that a founder who is a great hirer is going to be hiring people and in charge of critical functions like engineering and marketing and biz dev and sales and so forth, who themselves are great hirers."}, {"time": 8546, "text": "But what needs to radiate from the founder into the team that might be a little bit different from what's in the gene code of the founder?"}, {"time": 8553, "text": "The team needs to be fully bought in to the, you know, the intuitions and the vision of the founder."}, {"time": 8561, "text": "We've got that."}, {"time": 8562, "text": "But the team needs to have a slightly different thing, which is, you know, it's 99% obsession is execution, is to relentlessly hit the milestones, hit the objectives, hit the quarterly goals."}, {"time": 8578, "text": "That is, you know, 1% vision."}, {"time": 8580, "text": "You don't want to lose that."}, {"time": 8582, "text": "But execution machines, you know, people who have a demonstrated ability and a demonstrated focus on, yeah, I go from point to point to point."}, {"time": 8594, "text": "I try to beat and raise expectations relentlessly, never fall short, and, you know, both sort of blaze and follow the path."}, {"time": 8602, "text": "Not that the path is going to, I mean, blaze the trail as well."}, {"time": 8605, "text": "I mean, a good founder is going to trust that VP of sales to have a better sense of what it takes to build out that organization, what the milestones be."}, {"time": 8614, "text": "And it's going to be kind of a dialogue amongst those at the top."}, {"time": 8618, "text": "But, you know, execution obsession in the team is the next thing."}, {"time": 8622, "text": "Yeah, there's some sense where the founder, you know, you talk about sort of the space of ideas, like first principles thinking, asking big difficult questions of like future trajectories or having a big vision and big picture dreams."}, {"time": 8635, "text": "You can almost be a dreamer, it feels like, when you're like not the founder, but in the space of sort of leadership."}, {"time": 8648, "text": "But when it gets to the ground floor, there has to be execution, there has to be hitting deadlines."}, {"time": 8655, "text": "And sometimes those are attention."}, {"time": 8658, "text": "There's something about dreams that are attention with the pragmatic nature of execution."}, {"time": 8668, "text": "Not dreams, but sort of ambitious vision."}, {"time": 8672, "text": "And those have to be, I suppose, coupled."}, {"time": 8675, "text": "The vision in the leader and the execution in the software world, that would be the programmer or the designer."}, {"time": 8686, "text": "Amongst many other things, you're an incredible conversationalist, a podcast, you host a podcast called After On."}, {"time": 8692, "text": "I mean, there's a million questions I want to ask you here, but one at the highest level, what do you think makes for a great conversation?"}, {"time": 8700, "text": "I would say two things, one of two things, and ideally both of two things."}, {"time": 8707, "text": "One is if something is beautifully architected, whether it's done deliberately and methodically and willfully, as when I do it, or whether that just emerges from the conversation."}, {"time": 8721, "text": "But something that's beautifully architected, that can create something that's incredibly powerful and memorable, or something where there's just extraordinary chemistry."}, {"time": 8732, "text": "And so with All In, or I'll go way back."}, {"time": 8735, "text": "You might remember the NPR show Car Talk, I couldn't care less about auto mechanics myself."}, {"time": 8743, "text": "But I love that show because the banter between those two guys was just beyond, it was without any parallel, right?"}, {"time": 8750, "text": "And some kind of edgy podcasts like Red Scare is just really entertaining to me because the banter between the women on that show is just so good, and All In and that kind of thing."}, {"time": 8759, "text": "So I think it's a combination of sort of the arc and the chemistry."}, {"time": 8764, "text": "And I think because the arc can be so important, that's why very, very highly produced podcasts like This American Life, obviously a radio show, but I think of a podcast because that's how I always consume it, or Criminal, or a lot of what Wondery does and so forth."}, {"time": 8781, "text": "That is real documentary making, and that requires a big team and a big budget relative to the kinds of things you and I do, but nonetheless, then you got that arc, and that can be really, really compelling."}, {"time": 8792, "text": "But if we go back to conversation, I think it's a combination of structure and chemistry."}, {"time": 8797, "text": "Yeah, and I've actually personally have lost, I used to love This American Life, and for some reason because it lacks the possibility of magic, it's engineered magic."}, {"time": 8811, "text": "I've fallen off of it myself as well."}, {"time": 8813, "text": "I mean, when I fell madly in love with it during the aughts, it was the only thing going."}, {"time": 8818, "text": "They were really smart to adopt podcasting as a distribution mechanism early."}, {"time": 8824, "text": "But yeah, I think that maybe there's a little bit less magic there now because I think they have agendas other than necessarily just delighting their listeners with quirky stories, which I think is what it was all about back in the day and some other things."}, {"time": 8837, "text": "Is there like a memorable conversation that you've had on the podcast, whether it was because it was wild and fun or one that was exceptionally challenging, maybe challenging to prepare for, that kind of thing?"}, {"time": 8851, "text": "Is there something that stands out in your mind that you can draw an insight from?"}, {"time": 8855, "text": "Yeah, I mean, this no way diminishes the episodes that will not be the answer to these two questions, but an example of something that was really, really challenging to prepare for was George Church."}, {"time": 8868, "text": "So as I'm sure you know and as I'm sure many of your listeners know, he is one of the absolute leading lights in the field of synthetic biology."}, {"time": 8875, "text": "He's also unbelievably prolific."}, {"time": 8877, "text": "His lab is large and has all kinds of efforts have spun out of that."}, {"time": 8882, "text": "And what I wanted to make my George Church episode about was, first of all, grounding people into what is this thing called Symbio."}, {"time": 8892, "text": "And that required me to learn a hell of a lot more about Symbio than I knew going into it."}, {"time": 8898, "text": "So there was just this very broad, I mean, I knew much more than the average person going into that episode, but there was this incredible breadth of grounding that I needed to get myself in the domain."}, {"time": 8909, "text": "And then George does so many interesting things, there's so many interesting things emitting from his lab that, you know, and he and I had a really good dialogue, he was a great guide going into it."}, {"time": 8921, "text": "Minnowing it down to the three to four that I really wanted us to focus on to create a sense of wonder and magic in the listener of what could be possible from this very broad spectrum domain, that was a doozy of a challenge."}, {"time": 8934, "text": "That was a tough, tough, tough one to prepare for."}, {"time": 8937, "text": "Now, in terms of something that was just wild and fun, unexpected, I mean, by the time we sat down to interview, I knew where we were going to go."}, {"time": 8947, "text": "But just in terms of the idea space, Don Hoffman, yeah, so Don Hoffman is, again, some listeners probably know because he's, I think I was the first podcaster to interview him."}, {"time": 8959, "text": "I'm sure some of your listeners are familiar with him, but he has this unbelievably contrarian take on the nature of reality, but it is contrarian in a way that all the ideas are highly internally consistent and snap together in a way that's just delightful."}, {"time": 8978, "text": "And it seems as radically violating of our intuitions and as radically violating of the probable nature of reality as anything that one can encounter."}, {"time": 8989, "text": "But an analogy that he uses, which is very powerful, which is what intuition could possibly be more powerful than the notion that there is a single unitary direction called down."}, {"time": 9000, "text": "When we're on this big flat thing for which there is a thing called down."}, {"time": 9005, "text": "And we all know, I mean, that's the most intuitive thing that one could probably think of."}, {"time": 9010, "text": "And we all know that that ain't true."}, {"time": 9012, "text": "So my conversation with Don Hoffman was just wild and full of plot twists and interesting stuff."}, {"time": 9019, "text": "And the interesting thing about the wildness of his ideas, it's to me at least as a listener, coupled with, he's a good listener and he empathizes with the people who challenge his ideas."}, {"time": 9036, "text": "Like what's a better way to phrase that?"}, {"time": 9039, "text": "He is a welcoming of challenge in a way that creates a really fun conversation."}, {"time": 9044, "text": "Oh, totally."}, {"time": 9046, "text": "He loves a parry or a jab, whatever the word is at his argument."}, {"time": 9052, "text": "He honors it."}, {"time": 9054, "text": "He's a very, very gentle and noncombatative soul, but then he is very good and takes great evident joy in responding to that in a way that expands your understanding of his thinking."}, {"time": 9070, "text": "Let me as a small tangent of tying up together our previous conversation about listening.com and streaming and Spotify and the world of podcasting."}, {"time": 9080, "text": "So we've been talking about this magical medium of podcasting."}, {"time": 9085, "text": "I have a lot of friends at Spotify in the high positions of Spotify as well."}, {"time": 9092, "text": "I worry about Spotify and podcasting and the future of podcasting in general that moves podcasting in the place of maybe walled gardens of sorts."}, {"time": 9109, "text": "Since you've had a foot in both worlds, have a foot in both worlds, do you worry as well about the future of podcasting?"}, {"time": 9117, "text": "I think walled gardens are really toxic to the medium that they start balkanizing."}, {"time": 9125, "text": "So to take an example, I'll take two examples."}, {"time": 9163, "text": "When you start walling things off, A, you undermine the joy of friction free discovery, which is an incredibly valuable thing to deliver to your customer, both from a business standpoint and simply from a humanistic standpoint of do you want to bring delight to people?"}, {"time": 9181, "text": "But it also creates an incredible opening vector for piracy."}, {"time": 9186, "text": "And so something that's very different from the Rhapsody slash Spotify slash et cetera like experience is what we have now in video."}, {"time": 9194, "text": "Like wow, is that show on Hulu, is it on Netflix, is it on something like IFC channel, is it on Discovery Plus, is it here, is it there?"}, {"time": 9203, "text": "And the more frustration and toe stubbing that people encounter when they are seeking something and they're already paying a very respectable amount of money per month to have access to content and they can't find it, the more that happens, the more people are going to be driven to piracy solutions like to hell with it."}, {"time": 9223, "text": "Never know where I'm going to find something, I never know what it's going to cost."}, {"time": 9225, "text": "Oftentimes really interesting things are simply unavailable."}, {"time": 9230, "text": "That surprises me the number of times that I've been looking for things I don't even think are that obscure that are just, it says not available in your geography, period, mister."}, {"time": 9239, "text": "So I think that that's a mistake."}, {"time": 9241, "text": "And then the other thing is for podcasters and lovers of podcasting, we should want to resist this walled garden thing because A, it does smother this friction free or eradicate this friction free discovery unless you want to sign up for lots of different services."}, {"time": 9261, "text": "And also dims the voice of somebody who might be able to have a far, far, far bigger impact by reaching far more neurons with their ideas."}, {"time": 9272, "text": "I'm going to use an example from I guess it was probably the 90s or maybe it was the aughts of Howard Stern, who had the biggest megaphone or maybe the second biggest after Oprah megaphone in popular culture."}, {"time": 9286, "text": "And because he was syndicated on hundreds and hundreds and hundreds of radio stations at a time when terrestrial broadcast was the main thing people listened to in their car, no more obviously."}, {"time": 9294, "text": "But when he decided to go over to satellite radio, I can't remember if it was XM or Sirius, maybe they'd already merged at that point."}, {"time": 9301, "text": "But when he did that, he made, you know, totally his right to do it, a financial calculation that they were offering him a nine figure sum to do that."}, {"time": 9311, "text": "But his audience, because not a lot of people were subscribing to satellite radio at that point, his audience probably collapsed by, I wouldn't be surprised if it was as much as 95%."}, {"time": 9320, "text": "And so the influence that he had on the culture and his ability to sort of shape conversation and so forth just got muted."}, {"time": 9330, "text": "Yeah, and also there's a certain sense, especially in modern times, where the walled gardens naturally lead to, I don't know if there's a term for it, but people who are not creatives starting to have power over the creatives."}, {"time": 9352, "text": "And even if they don't stifle it, if they're providing, you know, incentives within the platform to shape, shift, or, you know, even completely mutate or distort the show, I mean, imagine somebody has got, you know, a reasonably interesting idea for a podcast and they get signed up with, let's say Spotify, and Spotify is going to give them financing to get the thing spun up."}, {"time": 9378, "text": "And Spotify is going to give them a certain amount of really, you know, powerful placement, you know, within the visual field of listeners."}, {"time": 9387, "text": "But Spotify has conditions for that."}, {"time": 9389, "text": "They say, look, you know, we think that your podcast will be much more successful if you dumb it down about 60%."}, {"time": 9397, "text": "If you add some, you know, silly, dirty jokes, if you do this, you do that."}, {"time": 9404, "text": "And suddenly the person who is dependent upon Spotify for permission to come into existence and is really dependent, really wants to please them, you know, to get that money in, to get that placement, really wants to be successful."}, {"time": 9415, "text": "And all of a sudden you're having a dialogue between a complete non creative, some marketing, you know, sort of data analytic person at Spotify and a creative that's going to shape what that show is, you know, so that could be much more common."}, {"time": 9483, "text": "The average quality and my view has nosedived over the past decade as it's kind of, everything's gotta be a superhero franchise, but you know, great stuff gets made despite that."}, {"time": 9493, "text": "But I have to assume that in some cases, at least in perhaps many cases, greater stuff would be made if there was less interference from non creative executives."}, {"time": 9503, "text": "It's like the flip side of that though, and this is, was the pitch of Spotify because I've heard their pitch is Netflix from everybody I've heard that I've spoken with about Netflix is they actually empower the creator."}, {"time": 9516, "text": "I don't know what the heck they do, but they do a good job of giving creators, even the crazy ones like Tim Dillon, like Joe Rogan, like comedians, freedom to be their crazy selves."}, {"time": 9527, "text": "And the result is like some of the greatest television, some of the greatest cinema, whatever you call it, ever made."}, {"time": 9537, "text": "And I don't know what the heck they're doing."}, {"time": 9538, "text": "It's a relative thing."}, {"time": 9539, "text": "It's not able from what I understand."}, {"time": 9541, "text": "They're interfering far, far, far less than, you know, NBC or, you know, AMC would have interfered."}, {"time": 9548, "text": "It's a relative thing, and obviously they're the ones writing the checks and they're the ones giving the platforms."}, {"time": 9553, "text": "They've every right to their own influence, obviously."}, {"time": 9556, "text": "But my understanding is that they're relatively way more hands off and that has had a demonstrable effect because I agree."}, {"time": 9563, "text": "Some of the greatest, you know, video produced video content of all time, an incredibly inordinate percentage of that is coming out from Netflix in just a few years when the history of cinema goes back many, many decades."}, {"time": 9574, "text": "And Spotify wants to be that for podcasting, and I hope they do become that for podcasting, but I'm wearing my skeptical goggles or skeptical hat, whatever the heck it is, because it's not easy to do and it requires, it requires letting go of power, giving power to the creatives."}, {"time": 9595, "text": "It requires pivoting, which large companies, even as innovative as Spotify is, still now a large company, pivoting into a whole new space is very tricky and difficult."}, {"time": 9605, "text": "So I'm skeptical, but hopeful."}, {"time": 9608, "text": "What advice would you give to a young person today about life, about career?"}, {"time": 9613, "text": "We talked about startups, we talked about music, we talked about the end of human civilization."}, {"time": 9618, "text": "Is there advice you would give to a young person today, maybe in college, maybe in high school about their life?"}, {"time": 9627, "text": "Let's see, there's so many domains you can advise on, and I'm not going to give advice on life because I fear that I would drift into hallmark bromides that really wouldn't be all that distinctive, and they might be entirely true."}, {"time": 9643, "text": "Sometimes the greatest insights about life turn out to be the kinds of things you'd see on a hallmark card, so I'm going to steer clear of that."}, {"time": 9650, "text": "On a career level, one thing that I think is unintuitive but unbelievably powerful is to focus not necessarily on being in the top sliver of 1% in excelling at one domain that's important and valuable, but to think in terms of intersections of two domains, which are rare but valuable, and there's a couple reasons for this."}, {"time": 9679, "text": "The first is in an incredibly competitive world that is so much more competitive than it was when I was coming out of school, radically more competitive than when I was coming out of school, to navigate your way to the absolute pinnacle of any domain."}, {"time": 9694, "text": "Let's say you want to be really, really great at Python, pick a language, whatever it is."}, {"time": 9700, "text": "You want to be one of the world's greatest Python developers, JavaScript, whatever your language is."}, {"time": 9705, "text": "Hopefully it's not Cobalt."}, {"time": 9706, "text": "By the way, if you listen to this, I am actually looking for a Cobalt expert to interview because I find the language fascinating, and there's not many of them, so please, if you know a world expert in Cobalt or Fortran, both, actually."}, {"time": 9722, "text": "Or if you are one."}, {"time": 9723, "text": "Or if you are one, please email me."}, {"time": 9726, "text": "So, I mean, if you're going out there and you want to be in the top sliver 1% of Python developers, it's a very, very difficult thing to do, particularly if you want to be number one in the world, something like that."}, {"time": 9734, "text": "And I'll use an analogy as I had a friend in college who was on a track and indeed succeeded at that to become an Olympic medalist, and I think it was 100 meter breaststroke."}, {"time": 9749, "text": "And he mortgaged a significant percentage of his college life to that goal, or I should say dedicated or invested or whatever you wanted to say."}, {"time": 9759, "text": "But he didn't participate in a lot of the social, a lot of the late night, a lot of the this, a lot of the that, because he was training so much."}, {"time": 9768, "text": "And obviously, he also wanted to keep up with his academics."}, {"time": 9770, "text": "And at the end of the day, the story has a happy ending in that he did medal in that."}, {"time": 9775, "text": "Bronze, not gold, but holy cow, anybody who gets an Olympic medal, that's an extraordinary thing."}, {"time": 9781, "text": "And at that moment, he was one of the top three people on earth at that thing."}, {"time": 9785, "text": "But wow, how hard to do that."}, {"time": 9787, "text": "How many thousands of other people went down that path and made similar sacrifices and didn't get there."}, {"time": 9793, "text": "It's very, very hard to do that."}, {"time": 9794, "text": "Whereas, and I'll use a personal example."}, {"time": 9799, "text": "When I came out of business school, I went to a good business school and learned the things that were there to be learned."}, {"time": 9805, "text": "And I came out and I entered a world with lots of MBAs."}, {"time": 9809, "text": "Harvard Business School, by the way."}, {"time": 9810, "text": "Okay, yes, it was Harvard, it's true."}, {"time": 9812, "text": "You're the first person who went there who didn't say where you went, which is beautiful."}, {"time": 9817, "text": "It's one of the greatest business schools in the world."}, {"time": 9821, "text": "It's a whole nother fascinating conversation about that world."}, {"time": 9825, "text": "But anyway, so I learned the things that you learn getting an MBA from a top program."}, {"time": 9831, "text": "And I entered a world that had hundreds of thousands of people who had MBAs, probably hundreds of thousands who have them from top 10 programs."}, {"time": 9840, "text": "So I was not particularly great at being an MBA person."}, {"time": 9844, "text": "I was inexperienced relative to most of them and there were a lot of them, but it was okay MBA person, right, newly minted."}, {"time": 9852, "text": "But then as it happened, I found my way into working on the commercial internet in 1994."}, {"time": 9860, "text": "So I went to a, at the time, giant hot computing company called Silicon Graphics, which had enough heft and enough head count that they could take on and experienced MBAs and try to train them in the world of Silicon Valley."}, {"time": 9873, "text": "But within that company that had an enormous amount of surface area and was touching a lot of areas and had unbelievably smart people at the time, it was not surprising that SGI started doing really interesting and innovative and trailblazing stuff on the internet before almost anybody else."}, {"time": 9892, "text": "And part of the reason was that our founder, Jim Clark, went off to cofound Netscape with Mark Andreessen."}, {"time": 9896, "text": "So the whole company is like, wait, what was that?"}, {"time": 9898, "text": "What's this commercial internet thing?"}, {"time": 9900, "text": "So I ended up in that group."}, {"time": 9901, "text": "Now in terms of being a commercial internet person or a worldwide web person, again, I was in that case, barely credentialed, I couldn't write a stitch of code, but I had a pretty good mind for grasping the business and cultural significance of this transition."}, {"time": 9922, "text": "And this was, again, we were talking earlier about emerging areas."}, {"time": 9925, "text": "Within a few months, you know, I was in the relatively top echelon of people in terms of just sheer experience, because like, let's say it was five months into the program, there were only so many people who'd been doing worldwide web stuff commercially for five months, you know?"}, {"time": 9938, "text": "And then what was interesting though was the intersection of those two things."}, {"time": 9943, "text": "The commercial web, as it turned out, grew into an unbelievable vastness."}, {"time": 9949, "text": "And so by being a pretty good, okay web person and a pretty good, okay MBA person, that intersection put me in a very rare group, which was web oriented MBAs."}, {"time": 9963, "text": "And in those early days, you could probably count on your fingers the number of people who came out of really competitive programs who were doing stuff full time on the internet."}, {"time": 9972, "text": "And there was a greater appetite for great software developers in the internet domain, but there was an appetite and a real one and a rapidly growing one for MBA thinkers who were also seasoned and networked in the emerging world of the commercial worldwide web."}, {"time": 9989, "text": "And so finding an intersection of two things you can be pretty good at, but is a rare intersection and a special intersection is probably a much easier way to make yourself distinguishable and in demand from the world than trying to be world class at this one thing."}, {"time": 10008, "text": "So in the intersection is where there's to be discovered opportunity and success."}, {"time": 10014, "text": "There's actually more intersection of fields and fields themselves, right?"}, {"time": 10018, "text": "So yeah, I mean, I'll give you kind of a funny hypothetical here, but it's one I've been thinking about a little bit."}, {"time": 10024, "text": "There's a lot of people in crypto right now."}, {"time": 10026, "text": "It'd be hard to be in the top percentile of crypto people, whether it comes from just having a sheer grasp of the industry, a great network within the industry, technological skills, whatever you want to call it."}, {"time": 10038, "text": "And then there's this parallel world and orthogonal world called crop insurance."}, {"time": 10043, "text": "And I'm sure that's a big world."}, {"time": 10045, "text": "Crop insurance is a very, very big deal, particularly in the wealthy and industrialized world where people through sophisticated financial markets, rule of law and large agricultural concerns that are worried about that."}, {"time": 10057, "text": "Somewhere out there is somebody who is pretty crypto savvy, but probably not top 1%, but also has kind of been in the crop insurance world and understands that a hell of a lot better than almost anybody who's ever had anything to do with cryptocurrency."}, {"time": 10072, "text": "And so I think that decentralized finance, DeFi, one of the interesting and I think very world positive things that I think it's almost inevitably will be bringing to the world is crop insurance for small holding farmers."}, {"time": 10086, "text": "I mean, people who have tiny, tiny plots of land in places like India, et cetera, where there is no crop insurance available to them because just the financial infrastructure doesn't exist."}, {"time": 10099, "text": "But it's highly imaginable that using Oracle networks that are trusted outside deliverers of factual information about rainfall in a particular area, you can start giving drought insurance to folks like this."}, {"time": 10111, "text": "The right person to come up with that idea is not a crypto whiz who doesn't know a blasted thing about small holding farmers."}, {"time": 10119, "text": "The right person to come up with that is not a crop insurance whiz who isn't quite sure what Bitcoin is, but somebody occupies that intersection."}, {"time": 10127, "text": "That's just one of gazillion examples of things that are going to come along for somebody who occupies the right intersection of skills, but isn't necessarily the number one person at either one of those expertises."}, {"time": 10139, "text": "That's making me kind of wonder about my own little things that I'm average at and seeing where the intersections that could be exploited."}, {"time": 10149, "text": "That's pretty profound."}, {"time": 10150, "text": "So we talked quite a bit about the end of the world and how we're both optimistic about us figuring our way out."}, {"time": 10158, "text": "Unfortunately, for now at least, both you and I are going to die one day, way too soon."}, {"time": 10167, "text": "First of all, that sucks."}, {"time": 10169, "text": "I mean, one, I'd like to ask if you ponder your own mortality, how does that kind of, what kind of wisdom inside does it give you about your own life?"}, {"time": 10185, "text": "And broadly, do you think about your life and what the heck it's all about?"}, {"time": 10190, "text": "Yeah, with respect to pondering mortality, I do try to do that as little as possible because there's not a lot I can do about it."}, {"time": 10200, "text": "But it's inevitably there."}, {"time": 10201, "text": "And I think that what it does when you think about it in the right way is it makes you realize how unbelievably rare and precious the moments that we have here are, and therefore how consequential the decisions that we make about how to spend our time are."}, {"time": 10218, "text": "You know, like, do you do those 17 nagging emails or do you have dinner with somebody who's really important to you who haven't seen in three and a half years?"}, {"time": 10228, "text": "If you had an infinite expanse of time in front of you, you might well rationally conclude I'm going to do those emails because collectively they're rather important."}, {"time": 10237, "text": "And I have tens of thousands of years to catch up with my buddy, Tim."}, {"time": 10241, "text": "But I think the scarcity of the time that we have helps us choose the right things if we're tuned to that and we're attuned to the context that mortality puts over the consequence of every decision we make of how to spend our time."}, {"time": 10256, "text": "That doesn't mean that we're all very good at it, it doesn't mean I'm very good at it."}, {"time": 10260, "text": "But it does add a dimension of choice and significance to everything that we elect to do."}, {"time": 10267, "text": "It's kind of funny that you say you try to think about it as little as possible."}, {"time": 10270, "text": "I would venture to say you probably think about the end of human civilization more than you do about your own life."}, {"time": 10275, "text": "You're probably right."}, {"time": 10276, "text": "Because that feels like a problem that could be solved."}, {"time": 10280, "text": "Whereas the end of my own life can't be solved."}, {"time": 10283, "text": "I mean, there's transhumanists who have incredible optimism about near or intermediate future therapies that could really, really change human lifespan."}, {"time": 10292, "text": "I really hope that they're right, but I don't have a whole lot to add to that project because I'm not a life scientist myself."}, {"time": 10299, "text": "I'm in part also afraid of immortality."}, {"time": 10304, "text": "Not as much, but close to as I'm afraid of death itself."}, {"time": 10308, "text": "So it feels like the things that give us meaning give us meaning because of the scarcity that surrounds it."}, {"time": 10317, "text": "I'm almost afraid of having too much of stuff."}, {"time": 10322, "text": "Although, if there was something that said, this can expand your enjoyable wellspan or lifespan by 75 years, I'm all in."}, {"time": 10331, "text": "Well, part of the reason I wanted to not do a startup, really the only thing that worries me about doing a startup is if it becomes successful."}, {"time": 10344, "text": "Because of how much I dream, how much I'm driven to be successful, that there will not be enough silence in my life, enough scarcity to appreciate the moments I appreciate now as deeply as I appreciate them now."}, {"time": 10362, "text": "There's a simplicity to my life now that it feels like you might disappear with success."}, {"time": 10368, "text": "I wouldn't say might."}, {"time": 10372, "text": "I think if you start a company that has ambitious investors, ambitious for the returns that they'd like to see, that has ambitious employees, ambitious for the career trajectories they want to be on and so forth, and is driven by your own ambition, there's a profound monogamy to that."}, {"time": 10398, "text": "It is very, very hard to carve out time to be creative, to be peaceful, to be so forth because of with every new employee that you hire, that's one more mouth to feed."}, {"time": 10410, "text": "With every new investor that you take on, that's one more person to whom you really do want to deliver great returns."}]}]