[{"title": "Noam Chomsky: Putin, Ukraine, China, and Nuclear War | Lex Fridman Podcast #316", "id": "7uHGlfeCBbE", "quotes": [{"time": 437, "text": "Putin objected."}, {"time": 437, "text": "Other Russian leaders objected."}, {"time": 437, "text": "They're unified on this, but didn't do much."}, {"time": 446, "text": "They continued with the proposals that Ukraine be excluded from NATO, and that there be some form of autonomy for the Donbass region."}, {"time": 463, "text": "Meanwhile, in reaction to the uprising, the Maidan Uprising 2014, Russia moved in and took over Crimea, protecting its warm water base and major naval base."}, {"time": 481, "text": "The US objected and recognised it, but things continued without notable conflict."}, {"time": 489, "text": "I won't go through all the details."}, {"time": 489, "text": "When Joe Biden came in, he expanded the program of what US military journals call a defective integration of Ukraine within NATO, proposed September 2021, proposed enhanced program of preparation for NATO mission, extended with a formal statement in November."}, {"time": 520, "text": "We're now practically up to the invasion."}, {"time": 528, "text": "Putin's position hardened."}, {"time": 528, "text": "France, mainly France, to an extent Germany, did make some moves towards possible negotiations."}, {"time": 535, "text": "Putin dismissed them, moved on to the direct invasion."}, {"time": 544, "text": "What are his, to get back to your question, what motivates him?"}, {"time": 556, "text": "I presume what he's been saying all along, namely establishing his legacy as a leader who overcame the extensive destruction of Russia, massive weakening over it, restored his position as a world power, prevented Ukraine from entering NATO."}, {"time": 582, "text": "It may have further ambitions as to dominating and controlling Ukraine, very likely."}, {"time": 590, "text": "There is a theory in the West that he suddenly became a total madman who wants to restore the great Russian empire."}, {"time": 602, "text": "This is combined with the gloating over the fact that the Russian military is a paper tiger that can't even conquer cities a couple of kilometers from the border, but defended not even by a regular army."}, {"time": 623, "text": "But somehow along with this, he's planning to attack NATO powers, conquer Europe, who knows what."}, {"time": 632, "text": "It's impossible to put all these concepts together."}, {"time": 632, "text": "They're totally internally contradictory."}, {"time": 639, "text": "So what's my judgment?"}, {"time": 639, "text": "I think what motivates him is what he's been demonstrating in his actions."}, {"time": 648, "text": "Restore Russia as a great power, restore its economy, control it as a total dictatorship, enrich himself and his cronies, establish a legacy as a major figure in Russian history, make sure that Ukraine does not join NATO, and probably by now he's hardened the position, maintain Crimea and the southeastern corridor to Russia, and some ambiguous agreements about the Donbass region."}, {"time": 692, "text": "That looks like his motivation."}, {"time": 692, "text": "There's much speculation that goes beyond this, but it's very hard to reconcile with the assessment of the real world by the same people who are making the grandiose speculations."}, {"time": 714, "text": "I don't think anything's changed."}, {"time": 724, "text": "It seems to me his policies are about the same as what they were."}, {"time": 724, "text": "They've changed in response to changed circumstances."}, {"time": 734, "text": "So very recently, right before the invasion, a few weeks before, for the first time, Putin announced recognition of the independence of the Donbass region."}, {"time": 742, "text": "That's a stronger position than before, much stronger."}, {"time": 754, "text": "Up till then, he had pretty much kept to the longstanding position of some kind of accommodation within a federal structure in which the Donbass region would have considerable autonomy."}, {"time": 765, "text": "So that's a harshening of the position."}, {"time": 773, "text": "So even the human mind of Vladimir Putin, the man?"}, {"time": 777, "text": "I can't read his mind."}, {"time": 777, "text": "I can only see the policies that he's pursued and the statements that he's made."}, {"time": 784, "text": "There are many people speculating about his mind."}, {"time": 784, "text": "And as I say, these speculations are, first of all, not based on anything."}, {"time": 795, "text": "Never said anything about trying to conquer NATO."}, {"time": 795, "text": "But more importantly, they are totally inconsistent with the analyses of Russian power by the same people who are making the speculations."}, {"time": 811, "text": "So we see the same individual speculating about Putin's grandiose plans to become Peter the Great and conquer, start attacking NATO powers, on the one hand saying that, on the other hand gloating over the fact that his military powers so minuscule he can't even conquer towns a couple miles from the border."}, {"time": 843, "text": "Well, it's impossible to make sense of that position."}, {"time": 847, "text": "Why did Russia invade Ukraine on February 24th?"}, {"time": 847, "text": "Who do you think is to blame?"}, {"time": 847, "text": "Who do you place the blame on?"}, {"time": 857, "text": "Well, who's to blame?"}, {"time": 857, "text": "Any power that commits aggression is to blame."}, {"time": 857, "text": "So I continue to say, as I have been for many months, that Putin's invasion of Ukraine is on a par with such acts of aggression as the U.S. invasion of Iraq, the Stalin, Hitler invasion of Poland, other acts of supreme international crime under international law."}, {"time": 895, "text": "Of course he's to blame."}, {"time": 898, "text": "The U.S. committed $6.9 billion in military assistance to Ukraine since the Russian invasion."}, {"time": 904, "text": "Should U.S. keep up with this support?"}, {"time": 908, "text": "There are two questions."}, {"time": 908, "text": "One has to do with providing support for defense against the invasion, which is certainly legitimate."}, {"time": 918, "text": "The other is seeking ways to end the crime before even worse disasters arise."}, {"time": 928, "text": "Now that second part is not discussed in the West, barely discussed."}, {"time": 933, "text": "Anyone who dares to discuss it is immediately subjected to a flood of invective and hysterical condemnation."}, {"time": 943, "text": "But if you're serious about Ukraine, there are two things you ask."}, {"time": 948, "text": "One, what can we do to support Ukraine in defense against aggression?"}, {"time": 954, "text": "Second, how can we move to end the war before it leads to even worse destruction of Ukraine, more starvation worldwide, reversing the limited efforts to deal with global warming, possibly moving up an escalation out of the war, the nuclear war."}, {"time": 977, "text": "That's the second half of the borrow, a phrase attributed to Winston Churchill."}, {"time": 987, "text": "There's a lot of war, war, but no joy, joy, joy."}, {"time": 993, "text": "And there ought to be joy, joy if you care about Ukraine and the rest of the world."}, {"time": 999, "text": "Can it be done?"}, {"time": 1001, "text": "Official U.S. policy is to reject a diplomatic settlement, to move to weaken Russia severely so that it cannot carry out further aggression, but not do anything on the joy, joy side, not think of how to bring the crimes and atrocities to an end."}, {"time": 1027, "text": "That's the second part of the question."}, {"time": 1030, "text": "So, yes, the U.S. should continue with the kind of calibrated support that's been given."}, {"time": 1040, "text": "The Pentagon wisely has vetoed initiatives to go well beyond support for defense up to attack on Russia."}, {"time": 1054, "text": "So far, the Pentagon, which seems to be the dovish component in the U.S. administration, has vetoed plans which very likely would lead on to nuclear war, which would destroy everything."}, {"time": 1069, "text": "So calibrated provision of weapons to blunt the offensive, allow Ukraine to defend itself, if sensible, combined with efforts to see if something can be done to bring the crimes and atrocities to an end and avert the much worse consequences that are in store, that would be instead the U.S. only dealing with the first."}, {"time": 1101, "text": "And all of our discussions limit themselves to the first in the United States and in Britain, not in Europe."}, {"time": 1109, "text": "Do you worry about nuclear war in the 21st century?"}, {"time": 1109, "text": "How do we avoid it?"}, {"time": 1115, "text": "Anyone who doesn't worry about nuclear war doesn't have a gray cell functioning."}, {"time": 1121, "text": "Of course, everyone is worried about nuclear war, or should be."}, {"time": 1126, "text": "It's very easy to see how steps could be taken, even been recommended, that would lead to nuclear war."}, {"time": 1134, "text": "So you can read articles even by liberal commentators who say we should drop all the pretenses, just go to war against Russia."}, {"time": 1145, "text": "They have to be destroyed."}, {"time": 1148, "text": "You can see proposals coming from Congress, the leading figures, saying we should establish a no fly zone."}, {"time": 1159, "text": "Pentagon objects."}, {"time": 1159, "text": "They point out correctly that to establish a no fly zone, you have to have control of the air, which means destroying Russian air defense systems, which happen to be inside Russia."}, {"time": 1177, "text": "We don't know that Russia won't react."}, {"time": 1181, "text": "Even the call, now almost universal, to ensure that Ukraine wins, drives out all the Russians, drives them out of the country, sounds nice on paper, but notice the assumption."}, {"time": 1198, "text": "The assumption is that Vladimir Putin, this madman who just seeks power and is out of control, will sit there quietly, accept defeat, slink away, not use the military means that of course he has to destroy Ukraine."}, {"time": 1220, "text": "One of the interesting comments that came out in today's long article, I think Washington Post reviewing a lot of leaks, actually not leaks, actually presented by U.S. intelligence and U.S. leaders about the long build up to the war."}, {"time": 1241, "text": "One of the points it made was surprised on the part of British and U.S. leaders about Putin's strategy and his failure to adopt, to fight the war the way the U.S. and Britain would, with real shock and awe, destruction of communication facilities, of energy facilities and so on."}, {"time": 1264, "text": "They can't understand why he hasn't done all that."}, {"time": 1267, "text": "If you want to make it very likely that that will happen, then insist on fighting until somehow Russia faces total defeat."}, {"time": 1281, "text": "Then it's a gamble, but if he's as crazy and insane as you claim, presumably will use weapons that he hasn't used yet to destroy Ukraine."}, {"time": 1295, "text": "So the West is taking an extraordinary gamble with the fate of Ukraine."}, {"time": 1301, "text": "Gambling that the madman, lunatic, mad Vlad won't use the weapons he has to destroy Ukraine and set the stage for escalation of the latter which might lead to nuclear war."}, {"time": 1318, "text": "It's quite a gamble."}, {"time": 1320, "text": "How much propaganda is there in the world today in Russia, in Ukraine, in the West?"}, {"time": 1326, "text": "It's extraordinary."}, {"time": 1328, "text": "In Russia, of course, it's total."}, {"time": 1332, "text": "Ukraine is a different story."}, {"time": 1334, "text": "They're at war."}, {"time": 1335, "text": "They expect propaganda."}, {"time": 1337, "text": "In the West, let me quote Graham Fuller, very highly placed in U.S. intelligence, one of the top officials for decades dealing mostly with Russia and Central Asia."}, {"time": 1356, "text": "He recently said that in all the years of the Cold War, he's never seen any extreme Russia phobia to the extent that he sees today."}, {"time": 1369, "text": "I think that's pretty accurate."}, {"time": 1373, "text": "I mean, the U.S. has even canceled Russian outlets, which means if you want to find out what Sergei Lavrov or other Russian officials are saying, you can't look it up on their own outlets."}, {"time": 1394, "text": "You have to go through Al Jazeera, Indian state television or someplace where they still allow Russian positions to be expressed."}, {"time": 1407, "text": "And of course, the propaganda is just outlandish."}, {"time": 1411, "text": "I think Fuller is quite correct on this."}, {"time": 1414, "text": "In Russia, of course, you expect total propaganda."}, {"time": 1418, "text": "There's nothing, any independent outlets such as there were have been crushed."}, {"time": 1426, "text": "If the media is a source of inaccuracies and even lies, then how do we find the truth?"}, {"time": 1434, "text": "I don't regard the media as a source of inaccuracies and lies."}, {"time": 1441, "text": "They do exist."}, {"time": 1443, "text": "But by and large, media reporting is reasonably accurate."}, {"time": 1449, "text": "Reporters, the journalists themselves, as in the past, do courageous, honest work."}, {"time": 1459, "text": "I've written about this for 50 years."}, {"time": 1463, "text": "My opinion hasn't changed."}, {"time": 1466, "text": "But they do pick certain things and not other things."}, {"time": 1471, "text": "There's selection, there's framing, there's ways of presenting things."}, {"time": 1477, "text": "All of that forms a kind of propaganda system, which you have to work your way through."}, {"time": 1485, "text": "But it's rarely a matter of straight, outright lying."}, {"time": 1490, "text": "So there's a difference between propaganda and lying?"}, {"time": 1494, "text": "Of course, a propaganda system shapes and limits the material that's presented."}, {"time": 1502, "text": "It may tell the truth within that framework."}, {"time": 1505, "text": "So let me give you a concrete example, which I wrote about extensively."}, {"time": 1512, "text": "I have a book called Manufacturing Consent jointly with Edward Herman."}, {"time": 1519, "text": "It's about his term, which I had accepted a propaganda model of the media."}, {"time": 1526, "text": "A large part of the book is defense of the media."}, {"time": 1530, "text": "Defense of the media against harsh attacks by Freedom House."}, {"time": 1536, "text": "Several volumes they published attacking the media, charging that the media were so adversarial and dishonest that they lost the war in Vietnam."}, {"time": 1547, "text": "Well, it took the trouble of reading through the two volumes."}, {"time": 1552, "text": "One volume is charges, the next volume is evidence."}, {"time": 1557, "text": "Turns out that all of the evidence is lies."}, {"time": 1561, "text": "They had no evidence."}, {"time": 1563, "text": "They were just lying."}, {"time": 1565, "text": "The media, in fact, the journalists were doing honest, courageous work."}, {"time": 1571, "text": "But within a certain framework."}, {"time": 1576, "text": "A framework of assuming that the American cause was basically just, basically honorable, making mistakes, doing bad things."}, {"time": 1588, "text": "But the idea of questioning that the United States was engaged in a major war crime."}, {"time": 1598, "text": "That's off the record."}, {"time": 1600, "text": "So unfortunately, there was this crime and that crime which harmed their effort to do good and so on."}, {"time": 1610, "text": "Well, that's not lying, it's propaganda."}, {"time": 1613, "text": "So how do we find the truth?"}, {"time": 1615, "text": "How do we find the truth?"}, {"time": 1618, "text": "That's what you have a brain for."}, {"time": 1621, "text": "It's not deep."}, {"time": 1623, "text": "It's quite shallow."}, {"time": 1625, "text": "It's not quantum physics."}, {"time": 1627, "text": "Put a little effort into it."}, {"time": 1629, "text": "Think about, look for other sources."}, {"time": 1633, "text": "Think a little about history."}, {"time": 1635, "text": "Look at the documentary record."}, {"time": 1638, "text": "They're all pretty well fools together and you can get a reasonable understanding of what's happening."}, {"time": 1645, "text": "If you could sit down with Vladimir Putin and ask him a question or talk to him about an idea, what would you say?"}, {"time": 1655, "text": "I would walk out of the room, just as with almost any other leader."}, {"time": 1660, "text": "I know what he's going to say."}, {"time": 1662, "text": "I read the party line."}, {"time": 1663, "text": "I read his pronouncements."}, {"time": 1665, "text": "Doesn't want to hear from me."}, {"time": 1667, "text": "Am I going to say, why did you carry out a crime that's comparable to the US invasion of Iraq and the Stalin Hitler invasion of Poland?"}, {"time": 1679, "text": "Am I going to ask that question?"}, {"time": 1682, "text": "If I met with John F. Kennedy today, would I ask, why did you radically escalate the war in Vietnam, launch the US Air Force, start authorized napalm, drive launch programs to drive villagers who you know are supporting the National Liberation Front, drive them into concentration camps to separate them from the forces they're defending?"}, {"time": 1712, "text": "Would I have asked him that?"}, {"time": 1716, "text": "Do you think the people who led us into the war in Vietnam, the war in Afghanistan and Iraq, the war in Ukraine are evil?"}, {"time": 1730, "text": "I mean, it's very hard to be in a position of leadership of a violent, aggressive power without carrying out evil acts."}, {"time": 1743, "text": "Are the people evil?"}, {"time": 1746, "text": "I mean, I'm not their moral advisors."}, {"time": 1753, "text": "I look at their actions, their statements, their policies, evaluate those."}, {"time": 1759, "text": "Their families can evaluate their personalities."}, {"time": 1764, "text": "Will there be a war between US and China in the 21st century?"}, {"time": 1769, "text": "If there is, we're finished."}, {"time": 1773, "text": "A war between the US and China would destroy the possibilities of organized life on Earth."}, {"time": 1783, "text": "In fact, we can put it differently."}, {"time": 1783, "text": "Unless the US and China reach an accommodation and work together and cooperatively, it's very unlikely that organized human society will survive."}, {"time": 1800, "text": "We are facing enormous problems, problems, destruction of the environment, endemics, threat of nuclear war."}, {"time": 1814, "text": "None of these decline of democratic functioning of an arena for rational discourse."}, {"time": 1823, "text": "None of these things have boundaries."}, {"time": 1826, "text": "We either work together to overcome them, which we can do, or we'll all sink together."}, {"time": 1834, "text": "That's the real question we should be asking."}, {"time": 1837, "text": "What the United States is doing is not helping."}, {"time": 1842, "text": "So the current US policy, which is perfectly open, nothing secret about it, is to what's called encircle China with sentinel states, South Korea, Japan, Australia, which will be heavily armed, provided by Biden with precision weapons aimed at China, backed by major naval operations, huge naval operations just took place in the Pacific."}, {"time": 1883, "text": "Many nations participating, RIMPAC didn't get reported here, as far as I know, but an enormous operation threatening China."}, {"time": 1892, "text": "All of this to encircle China, to continue with policies like that."}, {"time": 1901, "text": "Somebody like Pelosi, just to probably make her look more, I don't know what her motives are, taking a highly provocative, stupid act, opposed by the military, opposed by the White House."}, {"time": 1922, "text": "Yes, acts like that, which of course called for the response of highly dangerous."}, {"time": 1929, "text": "We don't have to do that."}, {"time": 1929, "text": "We don't have to increase the threat."}, {"time": 1934, "text": "I mean, right now, the last NATO summit, take a look at it."}, {"time": 1940, "text": "For the first time, it invited to attend countries that are in the sentinel states surrounding China and circling China from the east."}, {"time": 1953, "text": "And it, in fact, extended the range of NATO to what's called the Indo Pacific region."}, {"time": 1961, "text": "So all of us by now, the North Atlantic includes the whole Indo Pacific region to try to ensure that we can overcome the so called China threat."}, {"time": 1975, "text": "Certainly, we might ask exactly what the China threat is."}, {"time": 1975, "text": "It's done sometimes."}, {"time": 1983, "text": "So former prime minister of Australia, Paul Keating, well known international diplomat, had an article a while ago in the Australian press."}, {"time": 1996, "text": "That's right in the claws of the dragon asking, going through what the China threat is."}, {"time": 2002, "text": "He ran through the various claims, finally concluded the China threat is that China exists."}, {"time": 2010, "text": "It exists."}, {"time": 2010, "text": "It does not follow U.S. orders."}, {"time": 2010, "text": "It's not like Europe."}, {"time": 2016, "text": "Europe does what the United States tells it to do, even if it doesn't like it."}, {"time": 2022, "text": "China just ignores what the U.S. says."}, {"time": 2022, "text": "There's a formal way of describing this."}, {"time": 2029, "text": "There are two versions of the international order."}, {"time": 2034, "text": "One version is the U.N. based international order, which theoretically we subscribe to, but we don't accept."}, {"time": 2044, "text": "The U.N. based international order is unacceptable to the United States because it bans U.S. foreign policy."}, {"time": 2054, "text": "Literally, it explicitly bans the threat or use of force in international affairs, except under circumstances that almost never arise."}, {"time": 2067, "text": "Well, that's U.S. foreign policy."}, {"time": 2067, "text": "Try to find a president who isn't engaged in the threat or use of force in international affairs."}, {"time": 2076, "text": "So obviously we can't accept the U.N. based international system, even though under the Constitution, that's the supreme law of the land."}, {"time": 2088, "text": "So the United States has what's called a rule based international order."}, {"time": 2096, "text": "That's acceptable because it's the United States that sets the rules."}, {"time": 2102, "text": "So we want a rule based international order where the U.S. sets the rules."}, {"time": 2108, "text": "In commentary in the United States, even in scholarship, almost 100 percent calling for a rule based international order."}, {"time": 2120, "text": "Is that false?"}, {"time": 2120, "text": "Is it propaganda?"}, {"time": 2120, "text": "Of course it's propaganda because of what's not said and because of what's presupposed."}, {"time": 2131, "text": "An answer to an earlier question."}, {"time": 2131, "text": "Well, China does not accept the rule based international order."}, {"time": 2139, "text": "So when the U.S. imposes demands, Europe may not like them, but they follow them."}, {"time": 2147, "text": "China ignores them."}, {"time": 2147, "text": "So take, for example, the U.S. sanctions on Iran."}, {"time": 2155, "text": "The U.S. has to punish Iran because the United States pulled out of the, unilaterally pulled out of the Iran nuclear agreements."}, {"time": 2168, "text": "So in order to punish Iran for wrecking the agreements in violation of Security Council orders, we impose very harsh sanctions."}, {"time": 2179, "text": "Europe strongly opposes the sanctions, condemn them harshly, but it adheres to them because you don't disobey U.S. orders."}, {"time": 2195, "text": "That's too dangerous."}, {"time": 2195, "text": "They're not keeping to the rule based international order."}, {"time": 2203, "text": "Well, that's unacceptable."}, {"time": 2203, "text": "In fact, it's said pretty openly."}, {"time": 2203, "text": "You can hear the Secretary of State and others saying China is challenging our global hegemony."}, {"time": 2218, "text": "Yes, they are."}, {"time": 2218, "text": "They don't accept U.S. global hegemony, especially in the waters off China."}, {"time": 2225, "text": "They do a lot of rotten things, China."}, {"time": 2225, "text": "I mean, internally, there's all kind of repression, violence and so on."}, {"time": 2236, "text": "But first of all, that's not a threat to us."}, {"time": 2236, "text": "And second, the U.S. doesn't care about it because it easily accepts and supports comparable crimes and atrocities internal to allies."}, {"time": 2249, "text": "So, yes, we should protest it, but without hypocrisy."}, {"time": 2249, "text": "We have no standing to protest it."}, {"time": 2249, "text": "We support comparable things in all sorts of other places."}, {"time": 2261, "text": "Just take a look at the U.S. foreign aid."}, {"time": 2261, "text": "The leading recipient of U.S. foreign aid is Israel, which is engaged in constant terror, violence and repression, constant, almost daily."}, {"time": 2277, "text": "Second leading recipient is Egypt, one of the worst dictatorships in Egypt's history."}, {"time": 2285, "text": "About 60,000 people in jail, political prisoners tortured and so on."}, {"time": 2285, "text": "Do we care?"}, {"time": 2293, "text": "Second leading recipient."}, {"time": 2293, "text": "I mean, what are we talking about?"}, {"time": 2293, "text": "That's why most of the world just laughs at us."}, {"time": 2301, "text": "There's a lot of failure to understand here about why the global South doesn't join us in our proxy war against Russia, fighting Russia until it's severely weakened."}, {"time": 2318, "text": "They don't join us."}, {"time": 2318, "text": "Here, the question is, what's wrong with them?"}, {"time": 2323, "text": "They look into their minds to figure out what's wrong."}, {"time": 2323, "text": "They have a different attitude."}, {"time": 2323, "text": "They say, yes, we oppose the invasion of Ukraine, terrible crime."}, {"time": 2336, "text": "But what are you talking about?"}, {"time": 2336, "text": "This is what you do to us all the time."}, {"time": 2336, "text": "You don't care about crimes like this."}, {"time": 2336, "text": "That's most of the global South."}, {"time": 2346, "text": "We can't comprehend that because we're so insulated that we are just obviously right and everyone who doesn't go along must be wrong."}, {"time": 2357, "text": "Do you think the United States as a global leader, as an empire, may collapse in this century?"}, {"time": 2357, "text": "Why and how will it happen and how can we avoid it?"}, {"time": 2369, "text": "The United States can certainly harm itself severely."}, {"time": 2369, "text": "That's what we're doing right now."}, {"time": 2369, "text": "Right now, the greatest threat to the United States is internal countries tearing itself apart."}, {"time": 2389, "text": "I really don't have to run through it with you."}, {"time": 2389, "text": "Take a look at something as elementary as mortality."}, {"time": 2389, "text": "The United States is the only country outside of war, life expectancy is declining, mortality is increasing."}, {"time": 2412, "text": "It doesn't happen anywhere."}, {"time": 2412, "text": "You take a look at health outcomes generally."}, {"time": 2412, "text": "They're among the worst among the developed societies and health spending is about twice as high as the developed societies."}, {"time": 2428, "text": "You look at the charts, all of this starts around the late 1970s, early 80s."}, {"time": 2428, "text": "If you go back to that point, the United States was pretty much a normal developed country in terms of mortality, incarceration, health expenses, other measures."}, {"time": 2450, "text": "Since then, the United States has fallen off the chart."}, {"time": 2450, "text": "It's gone way off the chart."}, {"time": 2450, "text": "Well, that's the neoliberal assault of the last 40 years."}, {"time": 2450, "text": "It's had a major effect on the United States."}, {"time": 2465, "text": "It's left a lot of anger, resentment, violence."}, {"time": 2465, "text": "Meanwhile, the Republican Party has simply drifted off the spectrum."}]}]