[{"title": "François Chollet: Keras, Deep Learning, and the Progress of AI | Lex Fridman Podcast #38", "id": "Bo8MY4JpiXE", "quotes": [{"time": 337, "text": "I don't think their brain and the performance of their brain is the bottleneck to their expressed intelligence, to their achievements."}, {"time": 346, "text": "You cannot just tweak one part of this system, like of this brain, body, environment system and expect that capabilities like what emerges out of this system to just explode exponentially."}, {"time": 360, "text": "Because anytime you improve one part of a system with many interdependencies like this, there's a new bottleneck that arises, right?"}, {"time": 369, "text": "And I don't think even today for very smart people, their brain is not the bottleneck to the sort of problems they can solve, right?"}, {"time": 377, "text": "In fact, many very smart people today, you know, they are not actually solving any big scientific problems, they're not Einstein."}, {"time": 384, "text": "They're like Einstein, but you know, the patent clerk days."}, {"time": 389, "text": "Like Einstein became Einstein because this was a meeting of a genius with a big problem at the right time, right?"}, {"time": 399, "text": "But maybe this meeting could have never happened and then Einstein would have just been a patent clerk, right?"}, {"time": 404, "text": "And in fact, many people today are probably like genius level smart, but you wouldn't know because they're not really expressing any of that."}, {"time": 415, "text": "So we can think of the world, Earth, but also the universe as just as a space of problems."}, {"time": 422, "text": "So all these problems and tasks are roaming it of various difficulty."}, {"time": 426, "text": "And there's agents, creatures like ourselves and animals and so on that are also roaming it."}, {"time": 433, "text": "And then you get coupled with a problem and then you solve it."}, {"time": 437, "text": "But without that coupling, you can't demonstrate your quote unquote intelligence."}, {"time": 442, "text": "Exactly, intelligence is the meeting of great problem solving capabilities with a great problem."}, {"time": 448, "text": "And if you don't have the problem, you don't really express any intelligence."}, {"time": 452, "text": "All you're left with is potential intelligence, like the performance of your brain or how high your IQ is, which in itself is just a number, right?"}, {"time": 462, "text": "So you mentioned problem solving capacity."}, {"time": 467, "text": "What do you think of as problem solving capacity?"}, {"time": 471, "text": "Can you try to define intelligence?"}, {"time": 476, "text": "Like what does it mean to be more or less intelligent?"}, {"time": 480, "text": "Is it completely coupled to a particular problem or is there something a little bit more universal?"}, {"time": 485, "text": "Yeah, I do believe all intelligence is specialized intelligence."}, {"time": 489, "text": "Even human intelligence has some degree of generality."}, {"time": 492, "text": "Well, all intelligent systems have some degree of generality but they're always specialized in one category of problems."}, {"time": 499, "text": "So the human intelligence is specialized in the human experience."}, {"time": 503, "text": "And that shows at various levels, that shows in some prior knowledge that's innate that we have at birth."}, {"time": 512, "text": "Knowledge about things like agents, goal driven behavior, visual priors about what makes an object, priors about time and so on."}, {"time": 523, "text": "That shows also in the way we learn."}, {"time": 525, "text": "For instance, it's very, very easy for us to pick up language."}, {"time": 529, "text": "It's very, very easy for us to learn certain things because we are basically hard coded to learn them."}, {"time": 534, "text": "And we are specialized in solving certain kinds of problem and we are quite useless when it comes to other kinds of problems."}, {"time": 541, "text": "For instance, we are not really designed to handle very long term problems."}, {"time": 548, "text": "We have no capability of seeing the very long term."}, {"time": 552, "text": "We don't have very much working memory."}, {"time": 558, "text": "So how do you think about long term?"}, {"time": 560, "text": "Do you think long term planning, are we talking about scale of years, millennia?"}, {"time": 564, "text": "What do you mean by long term?"}, {"time": 566, "text": "We're not very good."}, {"time": 568, "text": "Well, human intelligence is specialized in the human experience."}, {"time": 570, "text": "And human experience is very short."}, {"time": 572, "text": "One lifetime is short."}, {"time": 574, "text": "Even within one lifetime, we have a very hard time envisioning things on a scale of years."}, {"time": 581, "text": "It's very difficult to project yourself at a scale of five years, at a scale of 10 years and so on."}, {"time": 586, "text": "We can solve only fairly narrowly scoped problems."}, {"time": 590, "text": "So when it comes to solving bigger problems, larger scale problems, we are not actually doing it on an individual level."}, {"time": 596, "text": "So it's not actually our brain doing it."}, {"time": 599, "text": "We have this thing called civilization, right?"}, {"time": 603, "text": "Which is itself a sort of problem solving system, a sort of artificially intelligent system, right?"}, {"time": 610, "text": "And it's not running on one brain, it's running on a network of brains."}, {"time": 614, "text": "In fact, it's running on much more than a network of brains."}, {"time": 616, "text": "It's running on a lot of infrastructure, like books and computers and the internet and human institutions and so on."}, {"time": 625, "text": "And that is capable of handling problems on a much greater scale than any individual human."}, {"time": 633, "text": "If you look at computer science, for instance, that's an institution that solves problems and it is superhuman, right?"}, {"time": 642, "text": "It operates on a greater scale."}, {"time": 644, "text": "It can solve much bigger problems than an individual human could."}, {"time": 649, "text": "And science itself, science as a system, as an institution, is a kind of artificially intelligent problem solving algorithm that is superhuman."}, {"time": 659, "text": "Yeah, it's, at least computer science is like a theorem prover at a scale of thousands, maybe hundreds of thousands of human beings."}, {"time": 670, "text": "At that scale, what do you think is an intelligent agent?"}, {"time": 674, "text": "So there's us humans at the individual level, there is millions, maybe billions of bacteria in our skin."}, {"time": 683, "text": "There is, that's at the smaller scale."}, {"time": 686, "text": "You can even go to the particle level as systems that behave, you can say intelligently in some ways."}, {"time": 695, "text": "And then you can look at the earth as a single organism, you can look at our galaxy and even the universe as a single organism."}, {"time": 702, "text": "Do you think, how do you think about scale in defining intelligent systems?"}, {"time": 706, "text": "And we're here at Google, there is millions of devices doing computation just in a distributed way."}, {"time": 713, "text": "How do you think about intelligence versus scale?"}, {"time": 715, "text": "You can always characterize anything as a system."}, {"time": 720, "text": "I think people who talk about things like intelligence explosion, tend to focus on one agent is basically one brain, like one brain considered in isolation, like a brain, a jaw that's controlling a body in a very like top to bottom kind of fashion."}, {"time": 736, "text": "And that body is pursuing goals into an environment."}, {"time": 739, "text": "So it's a very hierarchical view."}, {"time": 740, "text": "You have the brain at the top of the pyramid, then you have the body just plainly receiving orders."}, {"time": 745, "text": "And then the body is manipulating objects in the environment and so on."}, {"time": 748, "text": "So everything is subordinate to this one thing, this epicenter, which is the brain."}, {"time": 754, "text": "But in real life, intelligent agents don't really work like this, right?"}, {"time": 759, "text": "There is no strong delimitation between the brain and the body to start with."}, {"time": 763, "text": "You have to look not just at the brain, but at the nervous system."}, {"time": 766, "text": "But then the nervous system and the body are naturally two separate entities."}, {"time": 770, "text": "So you have to look at an entire animal as one agent."}, {"time": 773, "text": "But then you start realizing as you observe an animal over any length of time, that a lot of the intelligence of an animal is actually externalized."}, {"time": 784, "text": "That's especially true for humans."}, {"time": 786, "text": "A lot of our intelligence is externalized."}, {"time": 788, "text": "When you write down some notes, that is externalized intelligence."}, {"time": 791, "text": "When you write a computer program, you are externalizing cognition."}, {"time": 796, "text": "So it's externalizing books, it's externalized in computers, the internet, in other humans."}, {"time": 803, "text": "It's externalizing language and so on."}, {"time": 805, "text": "So there is no hard delimitation of what makes an intelligent agent."}, {"time": 812, "text": "It's all about context."}, {"time": 814, "text": "Okay, but AlphaGo is better at Go than the best human player."}, {"time": 822, "text": "There's levels of skill here."}, {"time": 825, "text": "So do you think there's such a ability, such a concept as intelligence explosion in a specific task?"}, {"time": 834, "text": "And then, well, yeah."}, {"time": 837, "text": "Do you think it's possible to have a category of tasks on which you do have something like an exponential growth of ability to solve that particular problem?"}, {"time": 847, "text": "I think if you consider a specific vertical, it's probably possible to some extent."}, {"time": 855, "text": "I also don't think we have to speculate about it because we have real world examples of recursively self improving intelligent systems, right?"}, {"time": 866, "text": "So for instance, science is a problem solving system, a knowledge generation system, like a system that experiences the world in some sense and then gradually understands it and can act on it."}, {"time": 880, "text": "And that system is superhuman and it is clearly recursively self improving because science feeds into technology."}, {"time": 887, "text": "Technology can be used to build better tools, better computers, better instrumentation and so on, which in turn can make science faster, right?"}, {"time": 896, "text": "So science is probably the closest thing we have today to a recursively self improving superhuman AI."}, {"time": 904, "text": "And you can just observe is science, is scientific progress to the exploding, which itself is an interesting question."}, {"time": 912, "text": "You can use that as a basis to try to understand what will happen with a superhuman AI that has a science like behavior."}, {"time": 921, "text": "Let me linger on it a little bit more."}, {"time": 923, "text": "What is your intuition why an intelligence explosion is not possible?"}, {"time": 928, "text": "Like taking the scientific, all the semi scientific revolutions, why can't we slightly accelerate that process?"}, {"time": 938, "text": "So you can absolutely accelerate any problem solving process."}, {"time": 943, "text": "So a recursively self improvement is absolutely a real thing."}, {"time": 948, "text": "But what happens with a recursively self improving system is typically not explosion because no system exists in isolation."}, {"time": 956, "text": "And so tweaking one part of the system means that suddenly another part of the system becomes a bottleneck."}, {"time": 962, "text": "And if you look at science, for instance, which is clearly a recursively self improving, clearly a problem solving system, scientific progress is not actually exploding."}, {"time": 972, "text": "If you look at science, what you see is the picture of a system that is consuming an exponentially increasing amount of resources, but it's having a linear output in terms of scientific progress."}, {"time": 986, "text": "And maybe that will seem like a very strong claim."}, {"time": 988, "text": "Many people are actually saying that, scientific progress is exponential, but when they're claiming this, they're actually looking at indicators of resource consumption by science."}, {"time": 1003, "text": "For instance, the number of papers being published, the number of patents being filed and so on, which are just completely correlated with how many people are working on science today."}, {"time": 1018, "text": "So it's actually an indicator of resource consumption, but what you should look at is the output, is progress in terms of the knowledge that science generates, in terms of the scope and significance of the problems that we solve."}, {"time": 1032, "text": "And some people have actually been trying to measure that."}, {"time": 1036, "text": "Like Michael Nielsen, for instance, he had a very nice paper, I think that was last year about it."}, {"time": 1045, "text": "So his approach to measure scientific progress was to look at the timeline of scientific discoveries over the past, you know, 100, 150 years."}, {"time": 1057, "text": "And for each major discovery, ask a panel of experts to rate the significance of the discovery."}, {"time": 1066, "text": "And if the output of science as an institution were exponential, you would expect the temporal density of significance to go up exponentially."}, {"time": 1078, "text": "Maybe because there's a faster rate of discoveries, maybe because the discoveries are, you know, increasingly more important."}, {"time": 1084, "text": "And what actually happens if you plot this temporal density of significance measured in this way, is that you see very much a flat graph."}, {"time": 1094, "text": "You see a flat graph across all disciplines, across physics, biology, medicine, and so on."}, {"time": 1099, "text": "And it actually makes a lot of sense if you think about it, because think about the progress of physics 110 years ago, right?"}, {"time": 1108, "text": "It was a time of crazy change."}, {"time": 1110, "text": "Think about the progress of technology, you know, 170 years ago, when we started having, you know, replacing horses with cars, when we started having electricity and so on."}, {"time": 1120, "text": "It was a time of incredible change."}, {"time": 1121, "text": "And today is also a time of very, very fast change, but it would be an unfair characterization to say that today technology and science are moving way faster than they did 50 years ago or 100 years ago."}, {"time": 1134, "text": "And if you do try to rigorously plot the temporal density of the significance, yeah, of significance, sorry, you do see very flat curves."}, {"time": 1149, "text": "And you can check out the paper that Michael Nielsen had about this idea."}, {"time": 1156, "text": "And so the way I interpret it is, as you make progress in a given field, or in a given subfield of science, it becomes exponentially more difficult to make further progress."}, {"time": 1170, "text": "Like the very first person to work on information theory."}, {"time": 1175, "text": "If you enter a new field, and it's still the very early years, there's a lot of low hanging fruit you can pick."}, {"time": 1182, "text": "But the next generation of researchers is gonna have to dig much harder, actually, to make smaller discoveries, probably larger number of smaller discoveries, and to achieve the same amount of impact, you're gonna need a much greater head count."}, {"time": 1197, "text": "And that's exactly the picture you're seeing with science, that the number of scientists and engineers is in fact increasing exponentially."}, {"time": 1206, "text": "The amount of computational resources that are available to science is increasing exponentially and so on."}, {"time": 1211, "text": "So the resource consumption of science is exponential, but the output in terms of progress, in terms of significance, is linear."}, {"time": 1221, "text": "And the reason why is because, and even though science is regressively self improving, meaning that scientific progress turns into technological progress, which in turn helps science."}, {"time": 1232, "text": "If you look at computers, for instance, our products of science and computers are tremendously useful in speeding up science."}, {"time": 1241, "text": "The internet, same thing, the internet is a technology that's made possible by very recent scientific advances."}, {"time": 1247, "text": "And itself, because it enables scientists to network, to communicate, to exchange papers and ideas much faster, it is a way to speed up scientific progress."}, {"time": 1257, "text": "So even though you're looking at a regressively self improving system, it is consuming exponentially more resources to produce the same amount of problem solving, very much."}, {"time": 1269, "text": "So that's a fascinating way to paint it, and certainly that holds for the deep learning community."}, {"time": 1274, "text": "If you look at the temporal, what did you call it, the temporal density of significant ideas, if you look at in deep learning, I think, I'd have to think about that, but if you really look at significant ideas in deep learning, they might even be decreasing."}, {"time": 1292, "text": "So I do believe the per paper significance is decreasing, but the amount of papers is still today exponentially increasing."}, {"time": 1303, "text": "So I think if you look at an aggregate, my guess is that you would see a linear progress."}, {"time": 1308, "text": "If you were to sum the significance of all papers, you would see roughly in your progress."}, {"time": 1318, "text": "And in my opinion, it is not a coincidence that you're seeing linear progress in science despite exponential resource consumption."}, {"time": 1327, "text": "I think the resource consumption is dynamically adjusting itself to maintain linear progress because we as a community expect linear progress, meaning that if we start investing less and seeing less progress, it means that suddenly there are some lower hanging fruits that become available and someone's gonna step up and pick them, right?"}, {"time": 1351, "text": "So it's very much like a market for discoveries and ideas."}, {"time": 1356, "text": "But there's another fundamental part which you're highlighting, which as a hypothesis as science or like the space of ideas, any one path you travel down, it gets exponentially more difficult to get a new way to develop new ideas."}, {"time": 1374, "text": "And your sense is that's gonna hold across our mysterious universe."}, {"time": 1381, "text": "Yes, well, exponential progress triggers exponential friction."}, {"time": 1385, "text": "So that if you tweak one part of the system, suddenly some other part becomes a bottleneck, right?"}, {"time": 1390, "text": "For instance, let's say you develop some device that measures its own acceleration and then it has some engine and it outputs even more acceleration in proportion of its own acceleration and you drop it somewhere, it's not gonna reach infinite speed because it exists in a certain context."}, {"time": 1409, "text": "So the air around it is gonna generate friction and it's gonna block it at some top speed."}, {"time": 1414, "text": "And even if you were to consider the broader context and lift the bottleneck there, like the bottleneck of friction, then some other part of the system would start stepping in and creating exponential friction, maybe the speed of flight or whatever."}, {"time": 1429, "text": "And this definitely holds true when you look at the problem solving algorithm that is being run by science as an institution, science as a system."}, {"time": 1439, "text": "As you make more and more progress, despite having this recursive self improvement component, you are encountering exponential friction."}, {"time": 1449, "text": "The more researchers you have working on different ideas, the more overhead you have in terms of communication across researchers."}, {"time": 1458, "text": "If you look at, you were mentioning quantum mechanics, right?"}, {"time": 1462, "text": "Well, if you want to start making significant discoveries today, significant progress in quantum mechanics, there is an amount of knowledge you have to ingest, which is huge."}, {"time": 1474, "text": "So there's a very large overhead to even start to contribute."}, {"time": 1479, "text": "There's a large amount of overhead to synchronize across researchers and so on."}, {"time": 1484, "text": "And of course, the significant practical experiments are going to require exponentially expensive equipment because the easier ones have already been run, right?"}, {"time": 1496, "text": "So in your senses, there's no way escaping, there's no way of escaping this kind of friction with artificial intelligence systems."}, {"time": 1508, "text": "Yeah, no, I think science is a very good way to model what would happen with a superhuman recursive research improving AI."}, {"time": 1516, "text": "That's your sense, I mean, the... That's my intuition."}, {"time": 1519, "text": "It's not like a mathematical proof of anything."}, {"time": 1523, "text": "That's not my point."}, {"time": 1524, "text": "Like, I'm not trying to prove anything."}, {"time": 1526, "text": "I'm just trying to make an argument to question the narrative of intelligence explosion, which is quite a dominant narrative."}, {"time": 1532, "text": "And you do get a lot of pushback if you go against it."}, {"time": 1535, "text": "Because, so for many people, right, AI is not just a subfield of computer science."}, {"time": 1542, "text": "It's more like a belief system."}, {"time": 1544, "text": "Like this belief that the world is headed towards an event, the singularity, past which, you know, AI will become... will go exponential very much, and the world will be transformed, and humans will become obsolete."}, {"time": 1560, "text": "And if you go against this narrative, because it is not really a scientific argument, but more of a belief system, it is part of the identity of many people."}, {"time": 1571, "text": "If you go against this narrative, it's like you're attacking the identity of people who believe in it."}, {"time": 1575, "text": "It's almost like saying God doesn't exist, or something."}, {"time": 1579, "text": "So you do get a lot of pushback if you try to question these ideas."}, {"time": 1584, "text": "First of all, I believe most people, they might not be as eloquent or explicit as you're being, but most people in computer science are most people who actually have built anything that you could call AI, quote, unquote, would agree with you."}, {"time": 1598, "text": "They might not be describing in the same kind of way."}, {"time": 1600, "text": "It's more, so the pushback you're getting is from people who get attached to the narrative from, not from a place of science, but from a place of imagination."}, {"time": 1613, "text": "That's correct, that's correct."}, {"time": 1614, "text": "So why do you think that's so appealing?"}, {"time": 1616, "text": "Because the usual dreams that people have when you create a superintelligence system past the singularity, that what people imagine is somehow always destructive."}, {"time": 1629, "text": "Do you have, if you were put on your psychology hat, what's, why is it so appealing to imagine the ways that all of human civilization will be destroyed?"}, {"time": 1640, "text": "I think it's a good story."}, {"time": 1642, "text": "You know, it's a good story."}, {"time": 1643, "text": "And very interestingly, it mirrors a religious stories, right, religious mythology."}, {"time": 1650, "text": "If you look at the mythology of most civilizations, it's about the world being headed towards some final events in which the world will be destroyed and some new world order will arise that will be mostly spiritual, like the apocalypse followed by a paradise probably, right?"}, {"time": 1669, "text": "It's a very appealing story on a fundamental level."}, {"time": 1672, "text": "And we all need stories."}, {"time": 1674, "text": "We all need stories to structure the way we see the world, especially at timescales that are beyond our ability to make predictions, right?"}, {"time": 1684, "text": "So on a more serious non exponential explosion, question, do you think there will be a time when we'll create something like human level intelligence or intelligent systems that will make you sit back and be just surprised at damn how smart this thing is?"}, {"time": 1708, "text": "That doesn't require exponential growth or an exponential improvement, but what's your sense of the timeline and so on that you'll be really surprised at certain capabilities?"}, {"time": 1721, "text": "And we'll talk about limitations and deep learning."}, {"time": 1722, "text": "So do you think in your lifetime, you'll be really damn surprised?"}, {"time": 1726, "text": "Around 2013, 2014, I was many times surprised by the capabilities of deep learning actually."}, {"time": 1733, "text": "That was before we had assessed exactly what deep learning could do and could not do."}, {"time": 1737, "text": "And it felt like a time of immense potential."}, {"time": 1740, "text": "And then we started narrowing it down, but I was very surprised."}, {"time": 1744, "text": "I would say it has already happened."}, {"time": 1747, "text": "Was there a moment, there must've been a day in there where your surprise was almost bordering on the belief of the narrative that we just discussed."}, {"time": 1759, "text": "Was there a moment, because you've written quite eloquently about the limits of deep learning, was there a moment that you thought that maybe deep learning is limitless?"}, {"time": 1770, "text": "No, I don't think I've ever believed this."}, {"time": 1772, "text": "What was really shocking is that it worked."}, {"time": 1775, "text": "It worked at all, yeah."}, {"time": 1777, "text": "But there's a big jump between being able to do really good computer vision and human level intelligence."}, {"time": 1784, "text": "So I don't think at any point I wasn't under the impression that the results we got in computer vision meant that we were very close to human level intelligence."}, {"time": 1794, "text": "I don't think we're very close to human level intelligence."}, {"time": 1796, "text": "I do believe that there's no reason why we won't achieve it at some point."}, {"time": 1801, "text": "I also believe that it's the problem with talking about human level intelligence that implicitly you're considering like an axis of intelligence with different levels, but that's not really how intelligence works."}, {"time": 1816, "text": "Intelligence is very multi dimensional."}, {"time": 1819, "text": "And so there's the question of capabilities, but there's also the question of being human like, and it's two very different things."}, {"time": 1827, "text": "Like you can build potentially very advanced intelligent agents that are not human like at all."}, {"time": 1832, "text": "And you can also build very human like agents."}, {"time": 1835, "text": "And these are two very different things, right?"}, {"time": 1838, "text": "Let's go from the philosophical to the practical."}, {"time": 1842, "text": "Can you give me a history of Keras and all the major deep learning frameworks that you kind of remember in relation to Keras and in general, TensorFlow, Theano, the old days."}, {"time": 1852, "text": "Can you give a brief overview Wikipedia style history and your role in it before we return to AGI discussions?"}, {"time": 1859, "text": "Yeah, that's a broad topic."}, {"time": 1860, "text": "So I started working on Keras."}, {"time": 1864, "text": "It was the name Keras at the time."}, {"time": 1866, "text": "I actually picked the name like just the day I was going to release it."}, {"time": 1870, "text": "So I started working on it in February, 2015."}, {"time": 1874, "text": "And so at the time there weren't too many people working on deep learning, maybe like fewer than 10,000."}, {"time": 1880, "text": "The software tooling was not really developed."}, {"time": 1885, "text": "So the main deep learning library was Cafe, which was mostly C++."}, {"time": 1890, "text": "Why do you say Cafe was the main one?"}, {"time": 1892, "text": "Cafe was vastly more popular than Theano in late 2014, early 2015."}, {"time": 1898, "text": "Cafe was the one library that everyone was using for computer vision."}, {"time": 1903, "text": "And computer vision was the most popular problem in deep learning at the time."}, {"time": 1907, "text": "Like ConvNets was like the subfield of deep learning that everyone was working on."}, {"time": 1913, "text": "So myself, so in late 2014, I was actually interested in RNNs, in recurrent neural networks, which was a very niche topic at the time, right?"}, {"time": 1925, "text": "It really took off around 2016."}, {"time": 1928, "text": "And so I was looking for good tools."}, {"time": 1931, "text": "I had used Torch 7, I had used Theano, used Theano a lot in Kaggle competitions."}, {"time": 1939, "text": "I had used Cafe."}, {"time": 1940, "text": "And there was no like good solution for RNNs at the time."}, {"time": 1945, "text": "Like there was no reusable open source implementation of an LSTM, for instance."}, {"time": 1950, "text": "So I decided to build my own."}, {"time": 1952, "text": "And at first, the pitch for that was, it was gonna be mostly around LSTM recurrent neural networks."}, {"time": 1959, "text": "It was gonna be in Python."}, {"time": 1962, "text": "An important decision at the time that was kind of not obvious is that the models would be defined via Python code, which was kind of like going against the mainstream at the time because Cafe, Pylon 2, and so on, like all the big libraries were actually going with the approach of setting configuration files in YAML to define models."}, {"time": 1985, "text": "So some libraries were using code to define models, like Torch 7, obviously, but that was not Python."}, {"time": 1992, "text": "Lasagne was like a Theano based very early library that was, I think, developed, I don't remember exactly, probably late 2014."}, {"time": 2000, "text": "It's Python as well."}, {"time": 2002, "text": "It was like on top of Theano."}, {"time": 2004, "text": "And so I started working on something and the value proposition at the time was that not only what I think was the first reusable open source implementation of LSTM, you could combine RNNs and covenants with the same library, which is not really possible before, like Cafe was only doing covenants."}, {"time": 2030, "text": "And it was kind of easy to use because, so before I was using Theano, I was actually using scikitlin and I loved scikitlin for its usability."}, {"time": 2038, "text": "So I drew a lot of inspiration from scikitlin when I made Keras."}, {"time": 2042, "text": "It's almost like scikitlin for neural networks."}, {"time": 2045, "text": "The fit function."}, {"time": 2046, "text": "Exactly, the fit function, like reducing a complex string loop to a single function call, right?"}, {"time": 2052, "text": "And of course, some people will say, this is hiding a lot of details, but that's exactly the point, right?"}, {"time": 2058, "text": "The magic is the point."}, {"time": 2060, "text": "So it's magical, but in a good way."}, {"time": 2062, "text": "It's magical in the sense that it's delightful."}, {"time": 2066, "text": "I'm actually quite surprised."}, {"time": 2067, "text": "I didn't know that it was born out of desire to implement RNNs and LSTMs."}, {"time": 2074, "text": "So you were actually one of the first people to really try to attempt to get the major architectures together."}, {"time": 2081, "text": "And it's also interesting."}, {"time": 2082, "text": "You made me realize that that was a design decision at all is defining the model and code."}, {"time": 2087, "text": "Just, I'm putting myself in your shoes, whether the YAML, especially if cafe was the most popular."}, {"time": 2093, "text": "It was the most popular by far."}, {"time": 2094, "text": "If I was, if I were, yeah, I don't, I didn't like the YAML thing, but it makes more sense that you will put in a configuration file, the definition of a model."}, {"time": 2105, "text": "That's an interesting gutsy move to stick with defining it in code."}, {"time": 2110, "text": "Just if you look back."}, {"time": 2111, "text": "Other libraries were doing it as well, but it was definitely the more niche option."}, {"time": 2117, "text": "Okay, Keras and then."}, {"time": 2118, "text": "So I released Keras in March, 2015, and it got users pretty much from the start."}, {"time": 2124, "text": "So the deep learning community was very, very small at the time."}, {"time": 2127, "text": "Lots of people were starting to be interested in LSTM."}, {"time": 2130, "text": "So it was gonna release it at the right time because it was offering an easy to use LSTM implementation."}, {"time": 2135, "text": "Exactly at the time where lots of people started to be intrigued by the capabilities of RNN, RNNs for NLP."}, {"time": 2142, "text": "So it grew from there."}, {"time": 2143, "text": "Then I joined Google about six months later, and that was actually completely unrelated to Keras."}, {"time": 2154, "text": "So I actually joined a research team working on image classification, mostly like computer vision."}, {"time": 2160, "text": "So I was doing computer vision research at Google initially."}, {"time": 2163, "text": "And immediately when I joined Google, I was exposed to the early internal version of TensorFlow."}, {"time": 2170, "text": "And the way it appeared to me at the time, and it was definitely the way it was at the time is that this was an improved version of Theano."}, {"time": 2180, "text": "So I immediately knew I had to port Keras to this new TensorFlow thing."}, {"time": 2186, "text": "And I was actually very busy as a noobler, as a new Googler."}, {"time": 2191, "text": "So I had not time to work on that."}, {"time": 2194, "text": "But then in November, I think it was November, 2015, TensorFlow got released."}, {"time": 2201, "text": "And it was kind of like my wake up call that, hey, I had to actually go and make it happen."}, {"time": 2207, "text": "So in December, I ported Keras to run on top of TensorFlow, but it was not exactly a port."}, {"time": 2213, "text": "It was more like a refactoring where I was abstracting away all the backend functionality into one module so that the same code base could run on top of multiple backends."}, {"time": 2225, "text": "So on top of TensorFlow or Theano."}, {"time": 2227, "text": "And for the next year, Theano stayed as the default option."}, {"time": 2235, "text": "It was easier to use, somewhat less buggy."}, {"time": 2240, "text": "It was much faster, especially when it came to audience."}, {"time": 2243, "text": "But eventually, TensorFlow overtook it."}, {"time": 2247, "text": "And TensorFlow, the early TensorFlow, has similar architectural decisions as Theano, right?"}, {"time": 2253, "text": "So it was a natural transition."}, {"time": 2258, "text": "So what, I mean, that still Keras is a side, almost fun project, right?"}, {"time": 2265, "text": "Yeah, so it was not my job assignment."}, {"time": 2269, "text": "It was not."}, {"time": 2270, "text": "I was doing it on the side."}, {"time": 2272, "text": "And even though it grew to have a lot of users for a deep learning library at the time, like Stroud 2016, but I wasn't doing it as my main job."}, {"time": 2282, "text": "So things started changing in, I think it must have been maybe October, 2016."}, {"time": 2290, "text": "So one year later."}, {"time": 2292, "text": "So Rajat, who was the lead on TensorFlow, basically showed up one day in our building where I was doing like, so I was doing research and things like, so I did a lot of computer vision research, also collaborations with Christian Zighetti and deep learning for theorem proving."}, {"time": 2309, "text": "It was a really interesting research topic."}, {"time": 2314, "text": "And so Rajat was saying, hey, we saw Keras, we like it."}, {"time": 2321, "text": "We saw that you're at Google."}, {"time": 2322, "text": "Why don't you come over for like a quarter and work with us?"}, {"time": 2327, "text": "And I was like, yeah, that sounds like a great opportunity."}, {"time": 2330, "text": "And so I started working on integrating the Keras API into TensorFlow more tightly."}, {"time": 2337, "text": "So what followed up is a sort of like temporary TensorFlow only version of Keras that was in TensorFlow.com Trib for a while."}, {"time": 2349, "text": "And finally moved to TensorFlow Core."}, {"time": 2352, "text": "And I've never actually gotten back to my old team doing research."}, {"time": 2357, "text": "Well, it's kind of funny that somebody like you who dreams of, or at least sees the power of AI systems that reason and theorem proving we'll talk about has also created a system that makes the most basic kind of Lego building that is deep learning super accessible, super easy."}, {"time": 2382, "text": "So beautifully so."}, {"time": 2383, "text": "It's a funny irony that you're both, you're responsible for both things, but so TensorFlow 2.0 is kind of, there's a sprint."}, {"time": 2394, "text": "I don't know how long it'll take, but there's a sprint towards the finish."}, {"time": 2396, "text": "What do you look, what are you working on these days?"}, {"time": 2401, "text": "What are you excited about?"}, {"time": 2402, "text": "What are you excited about in 2.0?"}, {"time": 2404, "text": "I mean, eager execution."}, {"time": 2405, "text": "There's so many things that just make it a lot easier to work."}, {"time": 2409, "text": "What are you excited about and what's also really hard?"}, {"time": 2413, "text": "What are the problems you have to kind of solve?"}, {"time": 2415, "text": "So I've spent the past year and a half working on TensorFlow 2.0 and it's been a long journey."}, {"time": 2422, "text": "I'm actually extremely excited about it."}, {"time": 2425, "text": "I think it's a great product."}, {"time": 2426, "text": "It's a delightful product compared to TensorFlow 1.0."}, {"time": 2429, "text": "We've made huge progress."}, {"time": 2432, "text": "So on the Keras side, what I'm really excited about is that, so previously Keras has been this very easy to use high level interface to do deep learning."}, {"time": 2445, "text": "But if you wanted to, if you wanted a lot of flexibility, the Keras framework was probably not the optimal way to do things compared to just writing everything from scratch."}, {"time": 2461, "text": "So in some way, the framework was getting in the way."}, {"time": 2464, "text": "And in TensorFlow 2.0, you don't have this at all, actually."}, {"time": 2467, "text": "You have the usability of the high level interface, but you have the flexibility of this lower level interface."}, {"time": 2474, "text": "And you have this spectrum of workflows where you can get more or less usability and flexibility trade offs depending on your needs, right?"}, {"time": 2486, "text": "You can write everything from scratch and you get a lot of help doing so by subclassing models and writing some train loops using ego execution."}, {"time": 2498, "text": "It's very flexible, it's very easy to debug, it's very powerful."}, {"time": 2502, "text": "But all of this integrates seamlessly with higher level features up to the classic Keras workflows, which are very scikit learn like and are ideal for a data scientist, machine learning engineer type of profile."}, {"time": 2518, "text": "So now you can have the same framework offering the same set of APIs that enable a spectrum of workflows that are more or less low level, more or less high level that are suitable for profiles ranging from researchers to data scientists and everything in between."}, {"time": 2535, "text": "Yeah, so that's super exciting."}, {"time": 2536, "text": "I mean, it's not just that, it's connected to all kinds of tooling."}, {"time": 2541, "text": "You can go on mobile, you can go with TensorFlow Lite, you can go in the cloud or serving and so on."}, {"time": 2547, "text": "It all is connected together."}, {"time": 2548, "text": "Now some of the best software written ever is often done by one person, sometimes two."}, {"time": 2556, "text": "So with a Google, you're now seeing sort of Keras having to be integrated in TensorFlow, I'm sure has a ton of engineers working on."}, {"time": 2566, "text": "And there's, I'm sure a lot of tricky design decisions to be made."}, {"time": 2572, "text": "How does that process usually happen from at least your perspective?"}, {"time": 2576, "text": "What are the debates like?"}, {"time": 2580, "text": "Is there a lot of thinking, considering different options and so on?"}, {"time": 2588, "text": "So a lot of the time I spend at Google is actually discussing design discussions, right?"}, {"time": 2597, "text": "Writing design docs, participating in design review meetings and so on."}, {"time": 2602, "text": "This is as important as actually writing a code."}, {"time": 2606, "text": "So there's a lot of thought, there's a lot of thought and a lot of care that is taken in coming up with these decisions and taking into account all of our users because TensorFlow has this extremely diverse user base, right?"}, {"time": 2621, "text": "It's not like just one user segment where everyone has the same needs."}, {"time": 2625, "text": "We have small scale production users, large scale production users."}, {"time": 2629, "text": "We have startups, we have researchers, you know, it's all over the place."}, {"time": 2635, "text": "And we have to cater to all of their needs."}, {"time": 2637, "text": "If I just look at the standard debates of C++ or Python, there's some heated debates."}, {"time": 2644, "text": "Do you have those at Google?"}, {"time": 2646, "text": "I mean, they're not heated in terms of emotionally, but there's probably multiple ways to do it, right?"}, {"time": 2650, "text": "So how do you arrive through those design meetings at the best way to do it?"}, {"time": 2655, "text": "Especially in deep learning where the field is evolving as you're doing it."}, {"time": 2661, "text": "Is there some magic to it?"}, {"time": 2663, "text": "Is there some magic to the process?"}, {"time": 2666, "text": "I don't know if there's magic to the process, but there definitely is a process."}, {"time": 2670, "text": "So making design decisions is about satisfying a set of constraints, but also trying to do so in the simplest way possible, because this is what can be maintained, this is what can be expanded in the future."}, {"time": 2684, "text": "So you don't want to naively satisfy the constraints by just, you know, for each capability you need available, you're gonna come up with one argument in your API and so on."}, {"time": 2694, "text": "You want to design APIs that are modular and hierarchical so that they have an API surface that is as small as possible, right?"}, {"time": 2707, "text": "And you want this modular hierarchical architecture to reflect the way that domain experts think about the problem."}, {"time": 2716, "text": "Because as a domain expert, when you are reading about a new API, you're reading a tutorial or some docs pages, you already have a way that you're thinking about the problem."}, {"time": 2728, "text": "You already have like certain concepts in mind and you're thinking about how they relate together."}, {"time": 2735, "text": "And when you're reading docs, you're trying to build as quickly as possible a mapping between the concepts featured in your API and the concepts in your mind."}, {"time": 2746, "text": "So you're trying to map your mental model as a domain expert to the way things work in the API."}, {"time": 2753, "text": "So you need an API and an underlying implementation that are reflecting the way people think about these things."}, {"time": 2760, "text": "So in minimizing the time it takes to do the mapping."}, {"time": 2762, "text": "Yes, minimizing the time, the cognitive load there is in ingesting this new knowledge about your API."}, {"time": 2770, "text": "An API should not be self referential or referring to implementation details."}, {"time": 2775, "text": "It should only be referring to domain specific concepts that people already understand."}, {"time": 2784, "text": "So what's the future of Keras and TensorFlow look like?"}, {"time": 2787, "text": "What does TensorFlow 3.0 look like?"}, {"time": 2790, "text": "So that's kind of too far in the future for me to answer, especially since I'm not even the one making these decisions."}, {"time": 2799, "text": "But so from my perspective, which is just one perspective among many different perspectives on the TensorFlow team, I'm really excited by developing even higher level APIs, higher level than Keras."}, {"time": 2813, "text": "I'm really excited by hyperparameter tuning, by automated machine learning, AutoML."}, {"time": 2821, "text": "I think the future is not just, you know, defining a model like you were assembling Lego blocks and then collect fit on it."}, {"time": 2829, "text": "It's more like an automagical model that would just look at your data and optimize the objective you're after, right?"}, {"time": 2839, "text": "So that's what I'm looking into."}, {"time": 2843, "text": "Yeah, so you put the baby into a room with the problem and come back a few hours later with a fully solved problem."}, {"time": 2850, "text": "Exactly, it's not like a box of Legos."}, {"time": 2853, "text": "It's more like the combination of a kid that's really good at Legos and a box of Legos."}, {"time": 2858, "text": "It's just building the thing on its own."}, {"time": 2862, "text": "So that's an exciting future."}, {"time": 2864, "text": "I think there's a huge amount of applications and revolutions to be had under the constraints of the discussion we previously had."}, {"time": 2872, "text": "But what do you think of the current limits of deep learning?"}, {"time": 2877, "text": "If we look specifically at these function approximators that tries to generalize from data."}, {"time": 2886, "text": "You've talked about local versus extreme generalization."}, {"time": 2891, "text": "You mentioned that neural networks don't generalize well and humans do."}, {"time": 2894, "text": "So there's this gap."}, {"time": 2897, "text": "And you've also mentioned that extreme generalization requires something like reasoning to fill those gaps."}, {"time": 2903, "text": "So how can we start trying to build systems like that?"}, {"time": 2907, "text": "Right, yeah, so this is by design, right?"}, {"time": 2910, "text": "Deep learning models are like huge parametric models, differentiable, so continuous, that go from an input space to an output space."}, {"time": 2922, "text": "And they're trained with gradient descent."}, {"time": 2924, "text": "So they're trained pretty much point by point."}, {"time": 2927, "text": "They are learning a continuous geometric morphing from an input vector space to an output vector space."}, {"time": 2935, "text": "And because this is done point by point, a deep neural network can only make sense of points in experience space that are very close to things that it has already seen in string data."}, {"time": 2948, "text": "At best, it can do interpolation across points."}, {"time": 2953, "text": "But that means in order to train your network, you need a dense sampling of the input cross output space, almost a point by point sampling, which can be very expensive if you're dealing with complex real world problems, like autonomous driving, for instance, or robotics."}, {"time": 2973, "text": "It's doable if you're looking at the subset of the visual space."}, {"time": 2977, "text": "But even then, it's still fairly expensive."}, {"time": 2978, "text": "You still need millions of examples."}, {"time": 2980, "text": "And it's only going to be able to make sense of things that are very close to what it has seen before."}, {"time": 2986, "text": "And in contrast to that, well, of course, you have human intelligence."}, {"time": 2990, "text": "But even if you're not looking at human intelligence, you can look at very simple rules, algorithms."}, {"time": 2996, "text": "If you have a symbolic rule, it can actually apply to a very, very large set of inputs because it is abstract."}, {"time": 3004, "text": "It is not obtained by doing a point by point mapping."}, {"time": 3010, "text": "For instance, if you try to learn a sorting algorithm using a deep neural network, well, you're very much limited to learning point by point what the sorted representation of this specific list is like."}, {"time": 3024, "text": "But instead, you could have a very, very simple sorting algorithm written in a few lines."}, {"time": 3031, "text": "Maybe it's just two nested loops."}, {"time": 3035, "text": "And it can process any list at all because it is abstract, because it is a set of rules."}, {"time": 3042, "text": "So deep learning is really like point by point geometric morphings, train with good and decent."}, {"time": 3048, "text": "And meanwhile, abstract rules can generalize much better."}, {"time": 3053, "text": "And I think the future is we need to combine the two."}, {"time": 3056, "text": "So how do we, do you think, combine the two?"}, {"time": 3059, "text": "How do we combine good point by point functions with programs, which is what the symbolic AI type systems?"}, {"time": 3068, "text": "At which levels the combination happen?"}, {"time": 3071, "text": "I mean, obviously we're jumping into the realm of where there's no good answers."}, {"time": 3076, "text": "It's just kind of ideas and intuitions and so on."}, {"time": 3080, "text": "Well, if you look at the really successful AI systems today, I think they are already hybrid systems that are combining symbolic AI with deep learning."}, {"time": 3089, "text": "For instance, successful robotics systems are already mostly model based, rule based, things like planning algorithms and so on."}, {"time": 3099, "text": "At the same time, they're using deep learning as perception modules."}, {"time": 3103, "text": "Sometimes they're using deep learning as a way to inject fuzzy intuition into a rule based process."}, {"time": 3110, "text": "If you look at the system like in a self driving car, it's not just one big end to end neural network."}, {"time": 3117, "text": "You know, that wouldn't work at all."}, {"time": 3119, "text": "Precisely because in order to train that, you would need a dense sampling of experience base when it comes to driving, which is completely unrealistic, obviously."}, {"time": 3128, "text": "Instead, the self driving car is mostly symbolic, you know, it's software, it's programmed by hand."}, {"time": 3138, "text": "So it's mostly based on explicit models."}, {"time": 3141, "text": "In this case, mostly 3D models of the environment around the car, but it's interfacing with the real world using deep learning modules, right?"}, {"time": 3151, "text": "So the deep learning there serves as a way to convert the raw sensory information to something usable by symbolic systems."}, {"time": 3159, "text": "Okay, well, let's linger on that a little more."}, {"time": 3162, "text": "So dense sampling from input to output."}, {"time": 3165, "text": "You said it's obviously very difficult."}, {"time": 3168, "text": "Is it possible?"}, {"time": 3170, "text": "In the case of self driving, you mean?"}, {"time": 3171, "text": "Let's say self driving, right?"}, {"time": 3173, "text": "Self driving for many people, let's not even talk about self driving, let's talk about steering, so staying inside the lane."}, {"time": 3185, "text": "Lane following, yeah, it's definitely a problem you can solve with an end to end deep learning model, but that's like one small subset."}, {"time": 3190, "text": "Hold on a second."}, {"time": 3191, "text": "Yeah, I don't know why you're jumping from the extreme so easily, because I disagree with you on that."}, {"time": 3196, "text": "I think, well, it's not obvious to me that you can solve lane following."}, {"time": 3203, "text": "No, it's not obvious, I think it's doable."}, {"time": 3205, "text": "I think in general, there is no hard limitations to what you can learn with a deep neural network, as long as the search space is rich enough, is flexible enough, and as long as you have this dense sampling of the input cross output space."}, {"time": 3225, "text": "The problem is that this dense sampling could mean anything from 10,000 examples to like trillions and trillions."}, {"time": 3232, "text": "So that's my question."}, {"time": 3234, "text": "So what's your intuition?"}, {"time": 3236, "text": "And if you could just give it a chance and think what kind of problems can be solved by getting a huge amounts of data and thereby creating a dense mapping."}, {"time": 3248, "text": "So let's think about natural language dialogue, the Turing test."}, {"time": 3254, "text": "Do you think the Turing test can be solved with a neural network alone?"}, {"time": 3261, "text": "Well, the Turing test is all about tricking people into believing they're talking to a human."}, {"time": 3266, "text": "And I don't think that's actually very difficult because it's more about exploiting human perception and not so much about intelligence."}, {"time": 3277, "text": "There's a big difference between mimicking intelligent behavior and actual intelligent behavior."}, {"time": 3282, "text": "So, okay, let's look at maybe the Alexa prize and so on."}, {"time": 3285, "text": "The different formulations of the natural language conversation that are less about mimicking and more about maintaining a fun conversation that lasts for 20 minutes."}, {"time": 3294, "text": "That's a little less about mimicking and that's more about, I mean, it's still mimicking, but it's more about being able to carry forward a conversation with all the tangents that happen in dialogue and so on."}, {"time": 3305, "text": "Do you think that problem is learnable with a neural network that does the point to point mapping?"}, {"time": 3314, "text": "So I think it would be very, very challenging to do this with deep learning."}, {"time": 3317, "text": "I don't think it's out of the question either."}, {"time": 3321, "text": "I wouldn't rule it out."}, {"time": 3323, "text": "The space of problems that can be solved with a large neural network."}, {"time": 3326, "text": "What's your sense about the space of those problems?"}, {"time": 3330, "text": "So useful problems for us."}, {"time": 3332, "text": "In theory, it's infinite, right?"}, {"time": 3334, "text": "You can solve any problem."}, {"time": 3336, "text": "In practice, well, deep learning is a great fit for perception problems."}, {"time": 3341, "text": "In general, any problem which is naturally amenable to explicit handcrafted rules or rules that you can generate by exhaustive search over some program space."}, {"time": 3356, "text": "So perception, artificial intuition, as long as you have a sufficient training dataset."}, {"time": 3363, "text": "And that's the question, I mean, perception, there's interpretation and understanding of the scene, which seems to be outside the reach of current perception systems."}, {"time": 3372, "text": "So do you think larger networks will be able to start to understand the physics and the physics of the scene, the three dimensional structure and relationships of objects in the scene and so on?"}, {"time": 3385, "text": "Or really that's where symbolic AI has to step in?"}, {"time": 3388, "text": "Well, it's always possible to solve these problems with deep learning."}, {"time": 3396, "text": "It's just extremely inefficient."}, {"time": 3398, "text": "A model would be an explicit rule based abstract model would be a far better, more compressed representation of physics."}, {"time": 3406, "text": "Then learning just this mapping between in this situation, this thing happens."}, {"time": 3410, "text": "If you change the situation slightly, then this other thing happens and so on."}, {"time": 3414, "text": "Do you think it's possible to automatically generate the programs that would require that kind of reasoning?"}, {"time": 3422, "text": "Or does it have to, so the way the expert systems fail, there's so many facts about the world had to be hand coded in."}, {"time": 3428, "text": "Do you think it's possible to learn those logical statements that are true about the world and their relationships?"}, {"time": 3438, "text": "Do you think, I mean, that's kind of what theorem proving at a basic level is trying to do, right?"}, {"time": 3442, "text": "Yeah, except it's much harder to formulate statements about the world compared to formulating mathematical statements."}, {"time": 3450, "text": "Statements about the world tend to be subjective."}, {"time": 3454, "text": "So can you learn rule based models?"}, {"time": 3460, "text": "That's the field of program synthesis."}, {"time": 3463, "text": "However, today we just don't really know how to do it."}, {"time": 3468, "text": "So it's very much a grass search or tree search problem."}, {"time": 3472, "text": "And so we are limited to the sort of tree session grass search algorithms that we have today."}, {"time": 3478, "text": "Personally, I think genetic algorithms are very promising."}, {"time": 3482, "text": "So almost like genetic programming."}, {"time": 3484, "text": "Genetic programming, exactly."}, {"time": 3485, "text": "Can you discuss the field of program synthesis?"}, {"time": 3488, "text": "Like how many people are working and thinking about it?"}, {"time": 3494, "text": "Where we are in the history of program synthesis and what are your hopes for it?"}, {"time": 3500, "text": "Well, if it were deep learning, this is like the 90s."}, {"time": 3504, "text": "So meaning that we already have existing solutions."}, {"time": 3509, "text": "We are starting to have some basic understanding of what this is about."}, {"time": 3515, "text": "But it's still a field that is in its infancy."}, {"time": 3518, "text": "There are very few people working on it."}, {"time": 3520, "text": "There are very few real world applications."}, {"time": 3524, "text": "So the one real world application I'm aware of is Flash Fill in Excel."}, {"time": 3531, "text": "It's a way to automatically learn very simple programs to format cells in an Excel spreadsheet from a few examples."}, {"time": 3540, "text": "For instance, learning a way to format a date, things like that."}, {"time": 3542, "text": "Oh, that's fascinating."}, {"time": 3544, "text": "You know, OK, that's a fascinating topic."}, {"time": 3546, "text": "I always wonder when I provide a few samples to Excel, what it's able to figure out."}, {"time": 3552, "text": "Like just giving it a few dates, what are you able to figure out from the pattern I just gave you?"}, {"time": 3558, "text": "That's a fascinating question."}, {"time": 3559, "text": "And it's fascinating whether that's learnable patterns."}, {"time": 3563, "text": "And you're saying they're working on that."}, {"time": 3565, "text": "How big is the toolbox currently?"}, {"time": 3568, "text": "Are we completely in the dark?"}, {"time": 3569, "text": "So if you said the 90s."}, {"time": 3570, "text": "In terms of program synthesis?"}, {"time": 3572, "text": "So I would say, so maybe 90s is even too optimistic."}, {"time": 3577, "text": "Because by the 90s, we already understood back prop."}, {"time": 3581, "text": "We already understood the engine of deep learning, even though we couldn't really see its potential quite."}, {"time": 3587, "text": "Today, I don't think we have found the engine of program synthesis."}, {"time": 3590, "text": "So we're in the winter before back prop."}, {"time": 3594, "text": "In a way, yes."}, {"time": 3595, "text": "So I do believe program synthesis and general discrete search over rule based models is going to be a cornerstone of AI research in the next century."}, {"time": 3606, "text": "And that doesn't mean we are going to drop deep learning."}, {"time": 3610, "text": "Deep learning is immensely useful."}, {"time": 3611, "text": "Like, being able to learn is a very flexible, adaptable, parametric model."}, {"time": 3618, "text": "So it's got to understand that's actually immensely useful."}, {"time": 3620, "text": "All it's doing is pattern cognition."}, {"time": 3623, "text": "But being good at pattern cognition, given lots of data, is just extremely powerful."}, {"time": 3627, "text": "So we are still going to be working on deep learning."}, {"time": 3630, "text": "We are going to be working on program synthesis."}, {"time": 3631, "text": "We are going to be combining the two in increasingly automated ways."}, {"time": 3636, "text": "So let's talk a little bit about data."}, {"time": 3638, "text": "You've tweeted, about 10,000 deep learning papers have been written about hard coding priors about a specific task in a neural network architecture works better than a lack of a prior."}, {"time": 3652, "text": "Basically, summarizing all these efforts, they put a name to an architecture."}, {"time": 3656, "text": "But really, what they're doing is hard coding some priors that improve the performance of the system."}, {"time": 3661, "text": "But which gets straight to the point is probably true."}, {"time": 3666, "text": "So you say that you can always buy performance by, in quotes, performance by either training on more data, better data, or by injecting task information to the architecture of the preprocessing."}, {"time": 3678, "text": "However, this isn't informative about the generalization power the techniques use, the fundamental ability to generalize."}, {"time": 3684, "text": "Do you think we can go far by coming up with better methods for this kind of cheating, for better methods of large scale annotation of data?"}, {"time": 3693, "text": "So building better priors."}, {"time": 3694, "text": "If you automate it, it's not cheating anymore."}, {"time": 3698, "text": "I'm joking about the cheating, but large scale."}, {"time": 3701, "text": "So basically, I'm asking about something that hasn't, from my perspective, been researched too much is exponential improvement in annotation of data."}, {"time": 3715, "text": "Do you often think about?"}, {"time": 3718, "text": "I think it's actually been researched quite a bit."}, {"time": 3720, "text": "You just don't see publications about it."}, {"time": 3722, "text": "Because people who publish papers are going to publish about known benchmarks."}, {"time": 3727, "text": "Sometimes they're going to read a new benchmark."}, {"time": 3729, "text": "People who actually have real world large scale depending on problems, they're going to spend a lot of resources into data annotation and good data annotation pipelines, but you don't see any papers about it."}, {"time": 3740, "text": "So do you think, certainly resources, but do you think there's innovation happening?"}, {"time": 3745, "text": "To clarify the point in the tweet."}, {"time": 3748, "text": "So machine learning in general is the science of generalization."}, {"time": 3753, "text": "You want to generate knowledge that can be reused across different data sets, across different tasks."}, {"time": 3762, "text": "And if instead you're looking at one data set and then you are hard coding knowledge about this task into your architecture, this is no more useful than training a network and then saying, oh, I found these weight values perform well."}, {"time": 3781, "text": "So David Ha, I don't know if you know David, he had a paper the other day about weight agnostic neural networks."}, {"time": 3790, "text": "And this is a very interesting paper because it really illustrates the fact that an architecture, even without weights, an architecture is knowledge about a task."}, {"time": 3801, "text": "It encodes knowledge."}, {"time": 3803, "text": "And when it comes to architectures that are uncrafted by researchers, in some cases, it is very, very clear that all they are doing is artificially reencoding the template that corresponds to the proper way to solve the task encoding a given data set."}, {"time": 3825, "text": "For instance, I know if you looked at the baby data set, which is about natural language question answering, it is generated by an algorithm."}, {"time": 3835, "text": "So this is a question answer pairs that are generated by an algorithm."}, {"time": 3839, "text": "The algorithm is solving a certain template."}, {"time": 3841, "text": "Turns out, if you craft a network that literally encodes this template, you can solve this data set with nearly 100% accuracy."}, {"time": 3849, "text": "But that doesn't actually tell you anything about how to solve question answering in general, which is the point."}, {"time": 3857, "text": "The question is just to linger on it, whether it's from the data side or from the size of the network."}, {"time": 3863, "text": "I don't know if you've read the blog post by Rich Sutton, The Bitter Lesson, where he says, the biggest lesson that we can read from 70 years of AI research is that general methods that leverage computation are ultimately the most effective."}, {"time": 3877, "text": "So as opposed to figuring out methods that can generalize effectively, do you think we can get pretty far by just having something that leverages computation and the improvement of computation?"}, {"time": 3891, "text": "Yeah, so I think Rich is making a very good point, which is that a lot of these papers, which are actually all about manually hardcoding prior knowledge about a task into some system, it doesn't have to be deep learning architecture, but into some system."}, {"time": 3908, "text": "These papers are not actually making any impact."}, {"time": 3911, "text": "Instead, what's making really long term impact is very simple, very general systems that are really agnostic to all these tricks."}, {"time": 3921, "text": "Because these tricks do not generalize."}, {"time": 3923, "text": "And of course, the one general and simple thing that you should focus on is that which leverages computation."}, {"time": 3933, "text": "Because computation, the availability of large scale computation has been increasing exponentially following Moore's law."}, {"time": 3940, "text": "So if your algorithm is all about exploiting this, then your algorithm is suddenly exponentially improving."}, {"time": 3947, "text": "So I think Rich is definitely right."}, {"time": 3952, "text": "However, he's right about the past 70 years."}, {"time": 3957, "text": "He's like assessing the past 70 years."}, {"time": 3959, "text": "I am not sure that this assessment will still hold true for the next 70 years."}, {"time": 3964, "text": "It might to some extent."}, {"time": 3967, "text": "I suspect it will not."}, {"time": 3968, "text": "Because the truth of his assessment is a function of the context in which this research took place."}, {"time": 3976, "text": "And the context is changing."}, {"time": 3978, "text": "Moore's law might not be applicable anymore, for instance, in the future."}, {"time": 3983, "text": "And I do believe that when you tweak one aspect of a system, when you exploit one aspect of a system, some other aspect starts becoming the bottleneck."}, {"time": 3996, "text": "Let's say you have unlimited computation."}, {"time": 3998, "text": "Well, then data is the bottleneck."}, {"time": 4001, "text": "And I think we are already starting to be in a regime where our systems are so large in scale and so data ingrained that data today and the quality of data and the scale of data is the bottleneck."}, {"time": 4013, "text": "And in this environment, the bitter lesson from Rich is not going to be true anymore."}, {"time": 4020, "text": "So I think we are going to move from a focus on a computation scale to focus on data efficiency."}, {"time": 4029, "text": "Data efficiency."}, {"time": 4030, "text": "So that's getting to the question of symbolic AI."}, {"time": 4033, "text": "But to linger on the deep learning approaches, do you have hope for either unsupervised learning or reinforcement learning, which are ways of being more data efficient in terms of the amount of data they need that required human annotation?"}, {"time": 4051, "text": "So unsupervised learning and reinforcement learning are frameworks for learning, but they are not like any specific technique."}, {"time": 4059, "text": "So usually when people say reinforcement learning, what they really mean is deep reinforcement learning, which is like one approach which is actually very questionable."}, {"time": 4067, "text": "The question I was asking was unsupervised learning with deep neural networks and deep reinforcement learning."}, {"time": 4074, "text": "Well, these are not really data efficient because you're still leveraging these huge parametric models point by point with gradient descent."}, {"time": 4083, "text": "It is more efficient in terms of the number of annotations, the density of annotations you need."}, {"time": 4089, "text": "So the idea being to learn the latent space around which the data is organized and then map the sparse annotations into it."}, {"time": 4098, "text": "And sure, I mean, that's clearly a very good idea."}, {"time": 4103, "text": "It's not really a topic I would be working on, but it's clearly a good idea."}, {"time": 4108, "text": "So it would get us to solve some problems that?"}, {"time": 4111, "text": "It will get us to incremental improvements in labeled data efficiency."}, {"time": 4118, "text": "Do you have concerns about short term or long term threats from AI, from artificial intelligence?"}, {"time": 4127, "text": "Yes, definitely to some extent."}, {"time": 4130, "text": "And what's the shape of those concerns?"}, {"time": 4132, "text": "This is actually something I've briefly written about."}, {"time": 4136, "text": "But the capabilities of deep learning technology can be used in many ways that are concerning from mass surveillance with things like facial recognition."}, {"time": 4151, "text": "In general, tracking lots of data about everyone and then being able to making sense of this data to do identification, to do prediction."}, {"time": 4162, "text": "That's concerning."}, {"time": 4163, "text": "That's something that's being very aggressively pursued by totalitarian states like China."}, {"time": 4171, "text": "One thing I am very much concerned about is that our lives are increasingly online, are increasingly digital, made of information, made of information consumption and information production, our digital footprint, I would say."}, {"time": 4191, "text": "And if you absorb all of this data and you are in control of where you consume information, social networks and so on, recommendation engines, then you can build a sort of reinforcement loop for human behavior."}, {"time": 4213, "text": "You can observe the state of your mind at time t. You can predict how you would react to different pieces of content, how to get you to move your mind in a certain direction."}, {"time": 4227, "text": "And then you can feed you the specific piece of content that would move you in a specific direction."}, {"time": 4235, "text": "And you can do this at scale in terms of doing it continuously in real time."}, {"time": 4244, "text": "You can also do it at scale in terms of scaling this to many, many people, to entire populations."}, {"time": 4250, "text": "So potentially, artificial intelligence, even in its current state, if you combine it with the internet, with the fact that all of our lives are moving to digital devices and digital information consumption and creation, what you get is the possibility to achieve mass manipulation of behavior and mass psychological control."}, {"time": 4276, "text": "And this is a very real possibility."}, {"time": 4278, "text": "Yeah, so you're talking about any kind of recommender system."}, {"time": 4282, "text": "Let's look at the YouTube algorithm, Facebook, anything that recommends content you should watch next."}, {"time": 4289, "text": "And it's fascinating to think that there's some aspects of human behavior that you can say a problem of, is this person hold Republican beliefs or Democratic beliefs?"}, {"time": 4305, "text": "And this is a trivial, that's an objective function."}, {"time": 4310, "text": "And you can optimize, and you can measure, and you can turn everybody into a Republican or everybody into a Democrat."}, {"time": 4316, "text": "I do believe it's true."}, {"time": 4317, "text": "So the human mind is very, if you look at the human mind as a kind of computer program, it has a very large exploit surface."}, {"time": 4327, "text": "It has many, many vulnerabilities."}, {"time": 4329, "text": "Exploit surfaces, yeah."}, {"time": 4330, "text": "Ways you can control it."}, {"time": 4333, "text": "For instance, when it comes to your political beliefs, this is very much tied to your identity."}, {"time": 4339, "text": "So for instance, if I'm in control of your news feed on your favorite social media platforms, this is actually where you're getting your news from."}, {"time": 4349, "text": "And of course, I can choose to only show you news that will make you see the world in a specific way."}, {"time": 4357, "text": "But I can also create incentives for you to post about some political beliefs."}, {"time": 4364, "text": "And then when I get you to express a statement, if it's a statement that me as the controller, I want to reinforce."}, {"time": 4373, "text": "I can just show it to people who will agree, and they will like it."}, {"time": 4376, "text": "And that will reinforce the statement in your mind."}, {"time": 4379, "text": "If this is a statement I want you to, this is a belief I want you to abandon, I can, on the other hand, show it to opponents."}, {"time": 4389, "text": "We'll attack you."}, {"time": 4390, "text": "And because they attack you, at the very least, next time you will think twice about posting it."}, {"time": 4396, "text": "But maybe you will even start believing this because you got pushback."}, {"time": 4402, "text": "So there are many ways in which social media platforms can potentially control your opinions."}, {"time": 4410, "text": "And today, so all of these things are already being controlled by AI algorithms."}, {"time": 4418, "text": "These algorithms do not have any explicit political goal today."}, {"time": 4422, "text": "Well, potentially they could, like if some totalitarian government takes over social media platforms and decides that now we are going to use this not just for mass surveillance, but also for mass opinion control and behavior control."}, {"time": 4439, "text": "Very bad things could happen."}, {"time": 4441, "text": "But what's really fascinating and actually quite concerning is that even without an explicit intent to manipulate, you're already seeing very dangerous dynamics in terms of how these content recommendation algorithms behave."}, {"time": 4459, "text": "Because right now, the goal, the objective function of these algorithms is to maximize engagement, which seems fairly innocuous at first."}, {"time": 4472, "text": "However, it is not because content that will maximally engage people, get people to react in an emotional way, get people to click on something."}, {"time": 4484, "text": "It is very often content that is not healthy to the public discourse."}, {"time": 4494, "text": "For instance, fake news are far more likely to get you to click on them than real news simply because they are not constrained to reality."}, {"time": 4506, "text": "So they can be as outrageous, as surprising, as good stories as you want because they're artificial."}, {"time": 4515, "text": "To me, that's an exciting world because so much good can come."}, {"time": 4519, "text": "So there's an opportunity to educate people."}, {"time": 4524, "text": "You can balance people's worldview with other ideas."}, {"time": 4531, "text": "So there's so many objective functions."}, {"time": 4533, "text": "The space of objective functions that create better civilizations is large, arguably infinite."}, {"time": 4540, "text": "But there's also a large space that creates division and destruction, civil war, a lot of bad stuff."}, {"time": 4553, "text": "And the worry is, naturally, probably that space is bigger, first of all."}, {"time": 4559, "text": "And if we don't explicitly think about what kind of effects are going to be observed from different objective functions, then we're going to get into trouble."}, {"time": 4570, "text": "But the question is, how do we get into rooms and have discussions, so inside Google, inside Facebook, inside Twitter, and think about, OK, how can we drive up engagement and, at the same time, create a good society?"}, {"time": 4588, "text": "Is it even possible to have that kind of philosophical discussion?"}, {"time": 4591, "text": "I think you can definitely try."}, {"time": 4593, "text": "So from my perspective, I would feel rather uncomfortable with companies that are uncomfortable with these new student algorithms, with them making explicit decisions to manipulate people's opinions or behaviors, even if the intent is good, because that's a very totalitarian mindset."}, {"time": 4615, "text": "So instead, what I would like to see is probably never going to happen, because it's not super realistic, but that's actually something I really care about."}, {"time": 4622, "text": "I would like all these algorithms to present configuration settings to their users, so that the users can actually make the decision about how they want to be impacted by these information recommendation, content recommendation algorithms."}, {"time": 4641, "text": "For instance, as a user of something like YouTube or Twitter, maybe I want to maximize learning about a specific topic."}, {"time": 4650, "text": "So I want the algorithm to feed my curiosity, which is in itself a very interesting problem."}, {"time": 4658, "text": "So instead of maximizing my engagement, it will maximize how fast and how much I'm learning."}, {"time": 4664, "text": "And it will also take into account the accuracy, hopefully, of the information I'm learning."}, {"time": 4670, "text": "So yeah, the user should be able to determine exactly how these algorithms are affecting their lives."}, {"time": 4678, "text": "I don't want actually any entity making decisions about in which direction they're going to try to manipulate me."}, {"time": 4689, "text": "I want technology."}, {"time": 4691, "text": "So AI, these algorithms are increasingly going to be our interface to a world that is increasingly made of information."}, {"time": 4699, "text": "And I want everyone to be in control of this interface, to interface with the world on their own terms."}, {"time": 4709, "text": "So if someone wants these algorithms to serve their own personal growth goals, they should be able to configure these algorithms in such a way."}, {"time": 4721, "text": "Yeah, but so I know it's painful to have explicit decisions."}, {"time": 4726, "text": "But there is underlying explicit decisions, which is some of the most beautiful fundamental philosophy that we have before us, which is personal growth."}, {"time": 4741, "text": "If I want to watch videos from which I can learn, what does that mean?"}, {"time": 4748, "text": "So if I have a checkbox that wants to emphasize learning, there's still an algorithm with explicit decisions in it that would promote learning."}, {"time": 4757, "text": "What does that mean for me?"}, {"time": 4759, "text": "For example, I've watched a documentary on flat Earth theory, I guess."}, {"time": 4767, "text": "I learned a lot."}, {"time": 4768, "text": "I'm really glad I watched it."}, {"time": 4769, "text": "It was a friend recommended it to me."}, {"time": 4772, "text": "Because I don't have such an allergic reaction to crazy people, as my fellow colleagues do."}, {"time": 4777, "text": "But it was very eye opening."}, {"time": 4780, "text": "And for others, it might not be."}, {"time": 4782, "text": "From others, they might just get turned off from that, same with Republican and Democrat."}, {"time": 4787, "text": "And it's a non trivial problem."}, {"time": 4790, "text": "And first of all, if it's done well, I don't think it's something that wouldn't happen, that YouTube wouldn't be promoting, or Twitter wouldn't be."}, {"time": 4800, "text": "It's just a really difficult problem, how to give people control."}, {"time": 4805, "text": "Well, it's mostly an interface design problem."}, {"time": 4808, "text": "The way I see it, you want to create technology that's like a mentor, or a coach, or an assistant, so that it's not your boss."}, {"time": 4820, "text": "You are in control of it."}, {"time": 4822, "text": "You are telling it what to do for you."}, {"time": 4825, "text": "And if you feel like it's manipulating you, it's not actually doing what you want."}, {"time": 4831, "text": "You should be able to switch to a different algorithm."}, {"time": 4834, "text": "So that's fine tune control."}, {"time": 4836, "text": "You kind of learn that you're trusting the human collaboration."}, {"time": 4840, "text": "I mean, that's how I see autonomous vehicles too, is giving as much information as possible, and you learn that dance yourself."}, {"time": 4847, "text": "Yeah, Adobe, I don't know if you use Adobe product for like Photoshop."}, {"time": 4852, "text": "They're trying to see if they can inject YouTube into their interface, but basically allow you to show you all these videos, that everybody's confused about what to do with features."}, {"time": 4863, "text": "So basically teach people by linking to, in that way, it's an assistant that uses videos as a basic element of information."}, {"time": 4873, "text": "Okay, so what practically should people do to try to fight against abuses of these algorithms, or algorithms that manipulate us?"}, {"time": 4887, "text": "Honestly, it's a very, very difficult problem, because to start with, there is very little public awareness of these issues."}, {"time": 4895, "text": "Very few people would think there's anything wrong with the unused algorithm, even though there is actually something wrong already, which is that it's trying to maximize engagement most of the time, which has very negative side effects."}, {"time": 4909, "text": "So ideally, so the very first thing is to stop trying to purely maximize engagement, try to propagate content based on popularity, right?"}, {"time": 4926, "text": "Instead, take into account the goals and the profiles of each user."}, {"time": 4933, "text": "So you will be, one example is, for instance, when I look at topic recommendations on Twitter, it's like, you know, they have this news tab with switch recommendations."}, {"time": 4945, "text": "It's always the worst coverage, because it's content that appeals to the smallest common denominator to all Twitter users, because they're trying to optimize."}, {"time": 4957, "text": "They're purely trying to optimize popularity."}, {"time": 4959, "text": "They're purely trying to optimize engagement."}, {"time": 4961, "text": "But that's not what I want."}, {"time": 4962, "text": "So they should put me in control of some setting so that I define what's the objective function that Twitter is going to be following to show me this content."}, {"time": 4974, "text": "And honestly, so this is all about interface design."}, {"time": 4977, "text": "And we are not, it's not realistic to give users control of a bunch of knobs that define algorithm."}, {"time": 4983, "text": "Instead, we should purely put them in charge of defining the objective function."}, {"time": 4989, "text": "Like, let the user tell us what they want to achieve, how they want this algorithm to impact their lives."}, {"time": 4995, "text": "So do you think it is that, or do they provide individual article by article reward structure where you give a signal, I'm glad I saw this, or I'm glad I didn't?"}, {"time": 5004, "text": "So like a Spotify type feedback mechanism, it works to some extent."}, {"time": 5010, "text": "I'm kind of skeptical about it because the only way the algorithm, the algorithm will attempt to relate your choices with the choices of everyone else, which might, you know, if you have an average profile that works fine, I'm sure Spotify accommodations work fine if you just like mainstream stuff."}, {"time": 5029, "text": "If you don't, it can be, it's not optimal at all actually."}, {"time": 5033, "text": "It'll be in an efficient search for the part of the Spotify world that represents you."}, {"time": 5040, "text": "So it's a tough problem, but do note that even a feedback system like what Spotify has does not give me control over what the algorithm is trying to optimize for."}, {"time": 5056, "text": "Well, public awareness, which is what we're doing now, is a good place to start."}, {"time": 5061, "text": "Do you have concerns about longterm existential threats of artificial intelligence?"}, {"time": 5068, "text": "Well, as I was saying, our world is increasingly made of information."}, {"time": 5073, "text": "AI algorithms are increasingly going to be our interface to this world of information, and somebody will be in control of these algorithms."}, {"time": 5081, "text": "And that puts us in any kind of a bad situation, right?"}, {"time": 5085, "text": "It has risks."}, {"time": 5086, "text": "It has risks coming from potentially large companies wanting to optimize their own goals, maybe profit, maybe something else."}, {"time": 5095, "text": "Also from governments who might want to use these algorithms as a means of control of the population."}, {"time": 5103, "text": "Do you think there's existential threat that could arise from that?"}, {"time": 5106, "text": "So existential threat."}, {"time": 5109, "text": "So maybe you're referring to the singularity narrative where robots just take over."}, {"time": 5115, "text": "Well, I don't, I'm not terminating robots, and I don't believe it has to be a singularity."}, {"time": 5121, "text": "We're just talking to, just like you said, the algorithm controlling masses of populations."}, {"time": 5128, "text": "The existential threat being, hurt ourselves much like a nuclear war would hurt ourselves."}, {"time": 5137, "text": "I don't think that requires a singularity."}, {"time": 5139, "text": "That requires a loss of control over AI algorithm."}, {"time": 5143, "text": "So I do agree there are concerning trends."}, {"time": 5147, "text": "Honestly, I wouldn't want to make any longterm predictions."}, {"time": 5152, "text": "I don't think today we really have the capability to see what the dangers of AI are going to be in 50 years, in 100 years."}, {"time": 5161, "text": "I do see that we are already faced with concrete and present dangers surrounding the negative side effects of content recombination systems, of newsfeed algorithms concerning algorithmic bias as well."}, {"time": 5178, "text": "So we are delegating more and more decision processes to algorithms."}, {"time": 5185, "text": "Some of these algorithms are uncrafted, some are learned from data, but we are delegating control."}, {"time": 5192, "text": "Sometimes it's a good thing, sometimes not so much."}, {"time": 5196, "text": "And there is in general very little supervision of this process, right?"}, {"time": 5201, "text": "So we are still in this period of very fast change, even chaos, where society is restructuring itself, turning into an information society, which itself is turning into an increasingly automated information passing society."}, {"time": 5218, "text": "And well, yeah, I think the best we can do today is try to raise awareness around some of these issues."}, {"time": 5226, "text": "And I think we're actually making good progress."}, {"time": 5227, "text": "If you look at algorithmic bias, for instance, three years ago, even two years ago, very, very few people were talking about it."}, {"time": 5237, "text": "And now all the big companies are talking about it."}, {"time": 5240, "text": "They are often not in a very serious way, but at least it is part of the public discourse."}, {"time": 5244, "text": "You see people in Congress talking about it."}, {"time": 5247, "text": "And it all started from raising awareness."}, {"time": 5252, "text": "So in terms of alignment problem, trying to teach as we allow algorithms, just even recommender systems on Twitter, encoding human values and morals, decisions that touch on ethics, how hard do you think that problem is?"}, {"time": 5272, "text": "How do we have lost functions in neural networks that have some component, some fuzzy components of human morals?"}, {"time": 5281, "text": "Well, I think this is really all about objective function engineering, which is probably going to be increasingly a topic of concern in the future."}, {"time": 5290, "text": "Like for now, we're just using very naive loss functions because the hard part is not actually what you're trying to minimize."}, {"time": 5297, "text": "It's everything else."}, {"time": 5299, "text": "But as the everything else is going to be increasingly automated, we're going to be focusing our human attention on increasingly high level components, like what's actually driving the whole learning system, like the objective function."}, {"time": 5313, "text": "So loss function engineering is going to be, loss function engineer is probably going to be a job title in the future."}, {"time": 5320, "text": "And then the tooling you're creating with Keras essentially takes care of all the details underneath."}, {"time": 5327, "text": "And basically the human expert is needed for exactly that."}, {"time": 5332, "text": "That's the idea."}, {"time": 5333, "text": "Keras is the interface between the data you're collecting and the business goals."}, {"time": 5339, "text": "And your job as an engineer is going to be to express your business goals and your understanding of your business or your product, your system as a kind of loss function or a kind of set of constraints."}, {"time": 5351, "text": "Does the possibility of creating an AGI system excite you or scare you or bore you?"}, {"time": 5359, "text": "So intelligence can never really be general."}, {"time": 5362, "text": "You know, at best it can have some degree of generality like human intelligence."}, {"time": 5366, "text": "It also always has some specialization in the same way that human intelligence is specialized in a certain category of problems, is specialized in the human experience."}, {"time": 5375, "text": "And when people talk about AGI, I'm never quite sure if they're talking about very, very smart AI, so smart that it's even smarter than humans, or they're talking about human like intelligence, because these are different things."}, {"time": 5389, "text": "Let's say, presumably I'm oppressing you today with my humanness."}, {"time": 5394, "text": "So imagine that I was in fact a robot."}, {"time": 5401, "text": "That I'm impressing you with natural language processing."}, {"time": 5404, "text": "Maybe if you weren't able to see me, maybe this is a phone call."}, {"time": 5407, "text": "So that kind of system."}, {"time": 5410, "text": "Companion."}, {"time": 5411, "text": "So that's very much about building human like AI."}, {"time": 5415, "text": "And you're asking me, you know, is this an exciting perspective?"}, {"time": 5419, "text": "I think so, yes."}, {"time": 5421, "text": "Not so much because of what artificial human like intelligence could do, but, you know, from an intellectual perspective, I think if you could build truly human like intelligence, that means you could actually understand human intelligence, which is fascinating, right?"}, {"time": 5439, "text": "Human like intelligence is going to require emotions."}, {"time": 5442, "text": "It's going to require consciousness, which is not things that would normally be required by an intelligent system."}, {"time": 5449, "text": "If you look at, you know, we were mentioning earlier like science as a superhuman problem solving agent or system, it does not have consciousness, it doesn't have emotions."}, {"time": 5462, "text": "In general, so emotions, I see consciousness as being on the same spectrum as emotions."}, {"time": 5467, "text": "It is a component of the subjective experience that is meant very much to guide behavior generation, right?"}, {"time": 5478, "text": "It's meant to guide your behavior."}, {"time": 5480, "text": "In general, human intelligence and animal intelligence has evolved for the purpose of behavior generation, right?"}, {"time": 5489, "text": "Including in a social context."}, {"time": 5490, "text": "So that's why we actually need emotions."}, {"time": 5492, "text": "That's why we need consciousness."}, {"time": 5494, "text": "An artificial intelligence system developed in a different context may well never need them, may well never be conscious like science."}, {"time": 5502, "text": "Well, on that point, I would argue it's possible to imagine that there's echoes of consciousness in science when viewed as an organism, that science is consciousness."}, {"time": 5515, "text": "So, I mean, how would you go about testing this hypothesis?"}, {"time": 5519, "text": "How do you probe the subjective experience of an abstract system like science?"}, {"time": 5527, "text": "Well, the point of probing any subjective experience is impossible because I'm not science, I'm Lex."}, {"time": 5533, "text": "So I can't probe another entity, it's no more than bacteria on my skin."}, {"time": 5540, "text": "You're Lex, I can ask you questions about your subjective experience and you can answer me, and that's how I know you're conscious."}, {"time": 5548, "text": "Yes, but that's because we speak the same language."}, {"time": 5551, "text": "You perhaps, we have to speak the language of science in order to ask it."}, {"time": 5555, "text": "Honestly, I don't think consciousness, just like emotions of pain and pleasure, is not something that inevitably arises from any sort of sufficiently intelligent information processing."}, {"time": 5567, "text": "It is a feature of the mind, and if you've not implemented it explicitly, it is not there."}, {"time": 5573, "text": "So you think it's an emergent feature of a particular architecture."}, {"time": 5578, "text": "So do you think..."}, {"time": 5580, "text": "It's a feature in the same sense."}, {"time": 5582, "text": "So, again, the subjective experience is all about guiding behavior."}, {"time": 5588, "text": "If the problems you're trying to solve don't really involve an embodied agent, maybe in a social context, generating behavior and pursuing goals like this."}, {"time": 5599, "text": "And if you look at science, that's not really what's happening."}, {"time": 5602, "text": "Even though it is, it is a form of artificial AI, artificial intelligence, in the sense that it is solving problems, it is accumulating knowledge, accumulating solutions and so on."}, {"time": 5615, "text": "So if you're not explicitly implementing a subjective experience, implementing certain emotions and implementing consciousness, it's not going to just spontaneously emerge."}, {"time": 5628, "text": "But so for a system like, human like intelligence system that has consciousness, do you think it needs to have a body?"}, {"time": 5636, "text": "I mean, it doesn't have to be a physical body, right?"}, {"time": 5639, "text": "And there's not that much difference between a realistic simulation in the real world."}, {"time": 5643, "text": "So there has to be something you have to preserve kind of thing."}, {"time": 5646, "text": "Yes, but human like intelligence can only arise in a human like context."}, {"time": 5651, "text": "Intelligence needs other humans in order for you to demonstrate that you have human like intelligence, essentially."}, {"time": 5660, "text": "So what kind of tests and demonstration would be sufficient for you to demonstrate human like intelligence?"}, {"time": 5671, "text": "Just out of curiosity, you've talked about in terms of theorem proving and program synthesis, I think you've written about that there's no good benchmarks for this."}, {"time": 5680, "text": "That's one of the problems."}, {"time": 5682, "text": "So let's talk program synthesis."}, {"time": 5686, "text": "So what do you imagine is a good..."}, {"time": 5688, "text": "I think it's related questions for human like intelligence and for program synthesis."}, {"time": 5693, "text": "What's a good benchmark for either or both?"}, {"time": 5696, "text": "So I mean, you're actually asking two questions, which is one is about quantifying intelligence and comparing the intelligence of an artificial system to the intelligence for human."}, {"time": 5708, "text": "And the other is about the degree to which this intelligence is human like."}, {"time": 5713, "text": "It's actually two different questions."}, {"time": 5716, "text": "So you mentioned earlier the Turing test."}, {"time": 5719, "text": "Well, I actually don't like the Turing test because it's very lazy."}, {"time": 5723, "text": "It's all about completely bypassing the problem of defining and measuring intelligence and instead delegating to a human judge or a panel of human judges."}, {"time": 5734, "text": "So it's a total copout, right?"}, {"time": 5738, "text": "If you want to measure how human like an agent is, I think you have to make it interact with other humans."}, {"time": 5747, "text": "Maybe it's not necessarily a good idea to have these other humans be the judges."}, {"time": 5753, "text": "Maybe you should just observe behavior and compare it to what a human would actually have done."}, {"time": 5760, "text": "When it comes to measuring how smart, how clever an agent is and comparing that to the degree of human intelligence."}, {"time": 5771, "text": "So we're already talking about two things, right?"}, {"time": 5773, "text": "The degree, kind of like the magnitude of an intelligence and its direction, right?"}, {"time": 5780, "text": "Like the norm of a vector and its direction."}, {"time": 5783, "text": "And the direction is like human likeness and the magnitude, the norm is intelligence."}, {"time": 5792, "text": "You could call it intelligence, right?"}, {"time": 5794, "text": "So the direction, your sense, the space of directions that are human like is very narrow."}, {"time": 5802, "text": "So the way you would measure the magnitude of intelligence in a system in a way that also enables you to compare it to that of a human."}, {"time": 5814, "text": "Well, if you look at different benchmarks for intelligence today, they're all too focused on skill at a given task."}, {"time": 5824, "text": "Like skill at playing chess, skill at playing Go, skill at playing Dota."}, {"time": 5830, "text": "And I think that's not the right way to go about it because you can always beat a human at one specific task."}, {"time": 5839, "text": "The reason why our skill at playing Go or juggling or anything is impressive is because we are expressing this skill within a certain set of constraints."}, {"time": 5872, "text": "So if you want to measure intelligence, you need to rigorously define what intelligence is, which in itself, you know, it's a very challenging problem."}, {"time": 5882, "text": "And do you think that's possible?"}, {"time": 5884, "text": "To define intelligence?"}, {"time": 5886, "text": "I mean, you can provide, many people have provided, you know, some definition."}, {"time": 5890, "text": "I have my own definition."}, {"time": 5892, "text": "Where does your definition begin?"}, {"time": 5893, "text": "Where does your definition begin if it doesn't end?"}, {"time": 5896, "text": "Well, I think intelligence is essentially the efficiency with which you turn experience into generalizable programs."}, {"time": 5909, "text": "So what that means is it's the efficiency with which you turn a sampling of experience space into the ability to process a larger chunk of experience space."}, {"time": 5926, "text": "So measuring skill can be one proxy across many different tasks, can be one proxy for measuring intelligence."}, {"time": 5934, "text": "But if you want to only measure skill, you should control for two things."}, {"time": 5938, "text": "You should control for the amount of experience that your system has and the priors that your system has."}, {"time": 5948, "text": "But if you look at two agents and you give them the same priors and you give them the same amount of experience, there is one of the agents that is going to learn programs, representations, something, a model that will perform well on the larger chunk of experience space than the other."}, {"time": 5968, "text": "And that is the smaller agent."}, {"time": 5970, "text": "So if you fix the experience, which generate better programs, better meaning more generalizable."}, {"time": 5980, "text": "That's a very nice, clean definition of... Oh, by the way, in this definition, it is already very obvious that intelligence has to be specialized because you're talking about experience space and you're talking about segments of experience space."}, {"time": 5994, "text": "You're talking about priors and you're talking about experience."}, {"time": 5997, "text": "All of these things define the context in which intelligence emerges."}, {"time": 6004, "text": "And you can never look at the totality of experience space, right?"}, {"time": 6009, "text": "So intelligence has to be specialized."}, {"time": 6012, "text": "But it can be sufficiently large, the experience space, even though it's specialized."}, {"time": 6016, "text": "There's a certain point when the experience space is large enough to where it might as well be general."}, {"time": 6022, "text": "It feels general."}, {"time": 6022, "text": "It looks general."}, {"time": 6023, "text": "I mean, it's very relative."}, {"time": 6025, "text": "Like, for instance, many people would say human intelligence is general."}, {"time": 6029, "text": "In fact, it is quite specialized."}, {"time": 6032, "text": "We can definitely build systems that start from the same innate priors as what humans have at birth."}, {"time": 6039, "text": "Because we already understand fairly well what sort of priors we have as humans."}, {"time": 6044, "text": "Like many people have worked on this problem."}, {"time": 6046, "text": "Most notably, Elisabeth Spelke from Harvard."}, {"time": 6051, "text": "I don't know if you know her."}, {"time": 6052, "text": "She's worked a lot on what she calls core knowledge."}, {"time": 6056, "text": "And it is very much about trying to determine and describe what priors we are born with."}, {"time": 6062, "text": "Like language skills and so on, all that kind of stuff."}, {"time": 6066, "text": "So we have some pretty good understanding of what priors we are born with."}, {"time": 6071, "text": "So we could..."}, {"time": 6073, "text": "So I've actually been working on a benchmark for the past couple years, you know, on and off."}, {"time": 6078, "text": "I hope to be able to release it at some point."}, {"time": 6081, "text": "The idea is to measure the intelligence of systems by countering for priors, countering for amount of experience, and by assuming the same priors as what humans are born with."}, {"time": 6094, "text": "So that you can actually compare these scores to human intelligence."}, {"time": 6099, "text": "You can actually have humans pass the same test in a way that's fair."}, {"time": 6103, "text": "And so importantly, such a benchmark should be such that any amount of practicing does not increase your score."}, {"time": 6116, "text": "So try to picture a game where no matter how much you play this game, that does not change your skill at the game."}, {"time": 6125, "text": "Can you picture that?"}, {"time": 6125, "text": "As a person who deeply appreciates practice, I cannot actually."}, {"time": 6131, "text": "There's actually a very simple trick."}, {"time": 6136, "text": "So in order to come up with a task, so the only thing you can measure is skill at the task."}, {"time": 6142, "text": "All tasks are going to involve priors."}, {"time": 6145, "text": "The trick is to know what they are and to describe that."}, {"time": 6149, "text": "And then you make sure that this is the same set of priors as what humans start with."}, {"time": 6153, "text": "So you create a task that assumes these priors, that exactly documents these priors, so that the priors are made explicit and there are no other priors involved."}, {"time": 6162, "text": "And then you generate a certain number of samples in experience space for this task, right?"}, {"time": 6169, "text": "And this, for one task, assuming that the task is new for the agent passing it, that's one test of this definition of intelligence that we set up."}, {"time": 6184, "text": "And now you can scale that to many different tasks, that each task should be new to the agent passing it, right?"}, {"time": 6191, "text": "And also it should be human interpretable and understandable so that you can actually have a human pass the same test."}, {"time": 6196, "text": "And then you can compare the score of your machine and the score of your human."}, {"time": 6199, "text": "Which could be a lot of stuff."}, {"time": 6200, "text": "You could even start a task like MNIST."}, {"time": 6203, "text": "Just as long as you start with the same set of priors."}, {"time": 6208, "text": "So the problem with MNIST, humans are already trying to recognize digits, right?"}, {"time": 6215, "text": "But let's say we're considering objects that are not digits, some completely arbitrary patterns."}, {"time": 6224, "text": "Well, humans already come with visual priors about how to process that."}, {"time": 6228, "text": "So in order to make the game fair, you would have to isolate these priors and describe them and then express them as computational rules."}, {"time": 6237, "text": "Having worked a lot with vision science people, that's exceptionally difficult."}, {"time": 6241, "text": "A lot of progress has been made."}, {"time": 6243, "text": "There's been a lot of good tests and basically reducing all of human vision into some good priors."}, {"time": 6248, "text": "We're still probably far away from that perfectly, but as a start for a benchmark, that's an exciting possibility."}, {"time": 6254, "text": "Yeah, so Elisabeth Spelke actually lists objectness as one of the core knowledge priors."}, {"time": 6264, "text": "Objectness, cool."}, {"time": 6265, "text": "Objectness, yeah."}, {"time": 6267, "text": "So we have priors about objectness, like about the visual space, about time, about agents, about goal oriented behavior."}, {"time": 6275, "text": "We have many different priors, but what's interesting is that, sure, we have this pretty diverse and rich set of priors, but it's also not that diverse, right?"}, {"time": 6286, "text": "We are not born into this world with a ton of knowledge about the world, with only a small set of core knowledge."}, {"time": 6298, "text": "Yeah, sorry, do you have a sense of how it feels to us humans that that set is not that large?"}, {"time": 6305, "text": "But just even the nature of time that we kind of integrate pretty effectively through all of our perception, all of our reasoning, maybe how, you know, do you have a sense of how easy it is to encode those priors?"}, {"time": 6317, "text": "Maybe it requires building a universe and then the human brain in order to encode those priors."}, {"time": 6325, "text": "Or do you have a hope that it can be listed like an axiomatic?"}, {"time": 6329, "text": "So you have to keep in mind that any knowledge about the world that we are born with is something that has to have been encoded into our DNA by evolution at some point."}, {"time": 6341, "text": "And DNA is a very, very low bandwidth medium."}, {"time": 6346, "text": "Like it's extremely long and expensive to encode anything into DNA because first of all, you need some sort of evolutionary pressure to guide this writing process."}, {"time": 6357, "text": "And then, you know, the higher level of information you're trying to write, the longer it's going to take."}, {"time": 6364, "text": "And the thing in the environment that you're trying to encode knowledge about has to be stable over this duration."}, {"time": 6375, "text": "So you can only encode into DNA things that constitute an evolutionary advantage."}, {"time": 6380, "text": "So this is actually a very small subset of all possible knowledge about the world."}, {"time": 6385, "text": "You can only encode things that are stable, that are true, over very, very long periods of time, typically millions of years."}, {"time": 6393, "text": "For instance, we might have some visual prior about the shape of snakes, right?"}, {"time": 6398, "text": "But what makes a face, what's the difference between a face and an art face?"}, {"time": 6404, "text": "But consider this interesting question."}, {"time": 6408, "text": "Do we have any innate sense of the visual difference between a male face and a female face?"}, {"time": 6418, "text": "For a human, I mean."}, {"time": 6419, "text": "I would have to look back into evolutionary history when the genders emerged."}, {"time": 6424, "text": "But yeah, most..."}, {"time": 6426, "text": "I mean, the faces of humans are quite different from the faces of great apes."}, {"time": 6430, "text": "Great apes, right?"}, {"time": 6434, "text": "Yeah, you couldn't tell the face of a female chimpanzee from the face of a male chimpanzee, probably."}, {"time": 6443, "text": "Yeah, and I don't think most humans have all that ability."}, {"time": 6446, "text": "So we do have innate knowledge of what makes a face, but it's actually impossible for us to have any DNA encoded knowledge of the difference between a female human face and a male human face because that knowledge, that information came up into the world actually very recently."}, {"time": 6470, "text": "If you look at the slowness of the process of encoding knowledge into DNA."}, {"time": 6476, "text": "Yeah, so that's interesting."}, {"time": 6477, "text": "That's a really powerful argument that DNA is a low bandwidth and it takes a long time to encode."}, {"time": 6482, "text": "That naturally creates a very efficient encoding."}, {"time": 6485, "text": "But one important consequence of this is that, so yes, we are born into this world with a bunch of knowledge, sometimes high level knowledge about the world, like the shape, the rough shape of a snake, of the rough shape of a face."}, {"time": 6500, "text": "But importantly, because this knowledge takes so long to write, almost all of this innate knowledge is shared with our cousins, with great apes, right?"}, {"time": 6512, "text": "So it is not actually this innate knowledge that makes us special."}, {"time": 6516, "text": "But to throw it right back at you from the earlier on in our discussion, it's that encoding might also include the entirety of the environment of Earth."}, {"time": 6529, "text": "To some extent."}, {"time": 6529, "text": "So it can include things that are important to survival and production, so for which there is some evolutionary pressure, and things that are stable, constant over very, very, very long time periods."}, {"time": 6544, "text": "And honestly, it's not that much information."}, {"time": 6546, "text": "There's also, besides the bandwidths constraint and the constraints of the writing process, there's also memory constraints, like DNA, the part of DNA that deals with the human brain, it's actually fairly small."}, {"time": 6562, "text": "It's like, you know, on the order of megabytes, right?"}, {"time": 6565, "text": "There's not that much high level knowledge about the world you can encode."}, {"time": 6571, "text": "That's quite brilliant and hopeful for a benchmark that you're referring to of encoding priors."}, {"time": 6579, "text": "I actually look forward to, I'm skeptical whether you can do it in the next couple of years, but hopefully."}, {"time": 6585, "text": "I've been working."}, {"time": 6585, "text": "So honestly, it's a very simple benchmark, and it's not like a big breakthrough or anything."}, {"time": 6589, "text": "It's more like a fun side project, right?"}, {"time": 6593, "text": "But these fun, so is ImageNet."}, {"time": 6596, "text": "These fun side projects could launch entire groups of efforts towards creating reasoning systems and so on."}, {"time": 6604, "text": "And I think... Yeah, that's the goal."}, {"time": 6606, "text": "It's trying to measure strong generalization, to measure the strength of abstraction in our minds, well, in our minds and in artificial intelligence agencies."}, {"time": 6616, "text": "And if there's anything true about this science organism is its individual cells love competition."}, {"time": 6624, "text": "So and benchmarks encourage competition."}, {"time": 6626, "text": "So that's an exciting possibility."}, {"time": 6629, "text": "If you, do you think an AI winter is coming?"}, {"time": 6633, "text": "And how do we prevent it?"}, {"time": 6636, "text": "So an AI winter is something that would occur when there's a big mismatch between how we are selling the capabilities of AI and the actual capabilities of AI."}, {"time": 6647, "text": "And today, some deep learning is creating a lot of value."}, {"time": 6650, "text": "And it will keep creating a lot of value in the sense that these models are applicable to a very wide range of problems that are relevant today."}, {"time": 6660, "text": "And we are only just getting started with applying these algorithms to every problem they could be solving."}, {"time": 6666, "text": "So deep learning will keep creating a lot of value for the time being."}, {"time": 6670, "text": "What's concerning, however, is that there's a lot of hype around deep learning and around AI."}, {"time": 6707, "text": "But again, that's just a simple consequence of the fact that we have ever more people coming into the field."}, {"time": 6714, "text": "It doesn't mean the progress is actually exponentially fast."}, {"time": 6718, "text": "Let's say you're trying to raise money for your startup or your research lab."}, {"time": 6722, "text": "You might want to tell, you know, a grandiose story to investors about how deep learning is just like the brain and how it can solve all these incredible problems like self driving and robotics and so on."}, {"time": 6735, "text": "And maybe you can tell them that the field is progressing so fast and we are going to have AGI within 15 years or even 10 years."}, {"time": 6743, "text": "And none of this is true."}, {"time": 6745, "text": "And every time you're like saying these things and an investor or, you know, a decision maker believes them, well, this is like the equivalent of taking on credit card debt, but for trust, right?"}, {"time": 6762, "text": "And maybe this will, you know, this will be what enables you to raise a lot of money, but ultimately you are creating damage, you are damaging the field."}, {"time": 6774, "text": "So that's the concern is that that debt, that's what happens with the other AI winters is the concern is you actually tweeted about this with autonomous vehicles, right?"}, {"time": 6784, "text": "There's almost every single company now have promised that they will have full autonomous vehicles by 2021, 2022."}, {"time": 6791, "text": "That's a good example of the consequences of over hyping the capabilities of AI and the pace of progress."}, {"time": 6799, "text": "So because I work especially a lot recently in this area, I have a deep concern of what happens when all of these companies after I've invested billions have a meeting and say, how much do we actually, first of all, do we have an autonomous vehicle?"}, {"time": 6813, "text": "The answer will definitely be no."}, {"time": 6815, "text": "And second will be, wait a minute, we've invested one, two, three, four billion dollars into this and we made no profit."}, {"time": 6823, "text": "And the reaction to that may be going very hard in other directions that might impact even other industries."}, {"time": 6830, "text": "And that's what we call an AI winter is when there is backlash where no one believes any of these promises anymore because they've turned that to be big lies the first time around."}, {"time": 6840, "text": "And this will definitely happen to some extent for autonomous vehicles because the public and decision makers have been convinced that around 2015, they've been convinced by these people who are trying to raise money for their startups and so on, that L5 driving was coming in maybe 2016, maybe 2017, maybe 2018."}, {"time": 6862, "text": "Now we're in 2019, we're still waiting for it."}, {"time": 6867, "text": "And so I don't believe we are going to have a full on AI winter because we have these technologies that are producing a tremendous amount of real value."}, {"time": 6877, "text": "But there is also too much hype."}, {"time": 6879, "text": "So there will be some backlash, especially there will be backlash."}]}]