[{"title": "Thomas Tull: From Batman Dark Knight Trilogy to AI and The Rolling Stones | Lex Fridman Podcast #259", "id": "3Z7WimACqG8", "quotes": [{"time": 378, "text": "What is equity, what is private equity?"}, {"time": 381, "text": "Well, so if you're starting a company and you go around to a bunch of your successful friends and say, hey, you should invest in my company."}, {"time": 394, "text": "Well, that's sort of, that's great and it's capital, but it's not getting money from Fidelity or TRO or a sovereign wealth fund or an endowment fund from a university that has large pools of organized capital that has a longterm point of view on your business."}, {"time": 416, "text": "So if you get money from your neighbor who's a successful dentist, next year the dentist may say, hey, times are hard, I need my money back."}, {"time": 427, "text": "If you're partners with Fidelity or Morgan Stanley or any of these institutions, they have the capital and the wherewithal to say, okay, I'm looking at this over the next five to 10 years."}, {"time": 439, "text": "And I thought there was an opportunity to bring that type of capital to the movie business to be patient."}, {"time": 447, "text": "And the benefit of that patient, so it's longterm, you have to deal with fewer parties and they would do much larger investments."}, {"time": 458, "text": "So what are the benefits?"}, {"time": 460, "text": "What are the sort of the challenges of that kind of investment?"}, {"time": 462, "text": "Well, I think the benefits in some ways are they're professionals who are largely dispassionate."}, {"time": 468, "text": "It's like, look, if you're hitting the numbers you told me and you're hitting your plan, great."}, {"time": 475, "text": "And the other thing that always was interesting to me about the movie business is if I'm investing in an artificial intelligence company or a chipset company or something like that, a lot of the institutions don't have the technical expertise to really truly grasp what's being done."}, {"time": 496, "text": "So they don't, other than good business practices, they're not offering every little opinion."}, {"time": 501, "text": "The movies and television are completely approachable, meaning everybody has an opinion."}, {"time": 507, "text": "So whether it's, I think you guys chose the wrong actor for that or why did you do that movie?"}, {"time": 514, "text": "So it invites a lot more sort of second guessing and things like that."}, {"time": 519, "text": "So that was always one of the idiosyncrasies of the business that I thought was interesting."}, {"time": 527, "text": "And then when you talk about private equity versus public equity, if you're a public company where the companies are traded, you wanna buy Microsoft shares, you just go to your broker, go on TD Ameritrade and buy them."}, {"time": 541, "text": "If on the other hand, you're talking about private equity, that's institutions or individuals investing in private companies."}, {"time": 551, "text": "So thus, if you have pools of capital that mostly invest in private equity deals, that's how you'd think about it."}, {"time": 558, "text": "It's difficult to make those happen because it's individuals, you have to sort of, what, have dinners and agree."}, {"time": 566, "text": "So it's much less, it's much more human, much less mechanical, I would say."}, {"time": 573, "text": "Yeah, now, and again, massive difference between large private equity shops who are professionalized and in the same category that I mentioned earlier versus private individuals who are wealthy or whatever."}, {"time": 589, "text": "But again, it's much more individualized when you're going to people who like your idea and just say, I'd like to invest in this."}, {"time": 598, "text": "Is that, from all the kinds of investments you've seen, what do you think is the most conducive to creating works of genius, whether that's in technology, AI space, or whether that's in movies?"}, {"time": 612, "text": "So creating something special in this world."}, {"time": 616, "text": "I would say a couple of things."}, {"time": 618, "text": "Enough money that whatever endeavor you're going into, that you're not so nervous about the edges, right?"}, {"time": 627, "text": "If I have $100 to spend and I think I can create a perpetual motion machine or something for $104, I can't do it because they're all over me about the budget."}, {"time": 639, "text": "So I would say making sure that you have enough capital, making sure that that capital is patient enough so that it's, if you're gonna do things that are extraordinary, it takes some time."}, {"time": 652, "text": "And you're gonna break stuff, right?"}, {"time": 655, "text": "You're gonna make mistakes, you're gonna have a whole bunch of film on the cutting room floor, so to speak, or if you're in the lab, you're gonna have a whole bunch of broken stuff."}, {"time": 664, "text": "And I also think it's very important at the beginning, and I always try to do this with companies I invest in or buy, is make sure that you have a philosophical and somewhat mechanical alignment with the management team."}, {"time": 680, "text": "So that going in, you both understand, hey, this is how we think about this problem or this company, this is what we feel like our culture is, this is what our goal is, and these are the metrics by which we'll agree to measure them by."}, {"time": 695, "text": "Because if you don't have that shared, you know, hey, we're gonna take this journey, then I think that's where people get upset, disappointed, et cetera."}, {"time": 707, "text": "What about, this is a weird question, but constraints."}, {"time": 710, "text": "So this is both for filmmaking and investment."}, {"time": 714, "text": "Do you think more money is always better?"}, {"time": 718, "text": "So I like constraints a lot."}, {"time": 721, "text": "It's like constraints and almost like a desperation, and deadlines are catalysts for creativity, for productivity, for sort of innovation."}, {"time": 735, "text": "So can you kind of speak to that as an investor, as a creator, like what's the right balance here?"}, {"time": 743, "text": "Well, I think if you're focused on a particular problem or a company or a thesis, if you have that focus and you feel like I have unlimited resources or renewable resources, so there's really, there's no leverage in the situation, right?"}, {"time": 763, "text": "There's no, if I fail at this, I'll just go get more money, right?"}, {"time": 769, "text": "I'll just go, I think that's a hard way to be resilient and to think of new ways to solve problems."}, {"time": 780, "text": "So I think capitalizing things just, you know, to the nth degree does create some problems."}, {"time": 788, "text": "So I think there's that perfect blend of don't starve the oxygen to the point where you make short term decisions or non strategic or thoughtful decisions because you gotta pay the rent."}, {"time": 800, "text": "And on the other hand, you can't have it be like this, you know, everlasting gobstopper of whatever you want will just keep flowing the cash because that doesn't create any friction points that I think do result in works of genius, works of genius in things that, you know, that are transformative."}, {"time": 824, "text": "And one of the things that is interesting to me about society sort of writ large is I think that when you go through hard times and you have to do things that are uncomfortable and you don't wanna do them because you're tired, because you're, that in some ways builds up that you're comfortable being uncomfortable muscle."}, {"time": 852, "text": "And I sometimes think we're losing that a little bit and you can't sort of paint with a wide brush, but you know, that's one of the things that I kind of observe and hope that we don't go that way."}, {"time": 870, "text": "I do think challenge and discomfort are a kind of gift because like overcoming that, it's like from every perspective, from a human perspective, it's a source of happiness and fulfillment, overcoming challenge."}, {"time": 883, "text": "But from a business perspective, I see like if something is really difficult, to me it's also a sign that most others would, or many others would fail at this point."}, {"time": 894, "text": "So like it's a feature."}, {"time": 895, "text": "It's nice that something is difficult."}, {"time": 898, "text": "When people tell you that something is impossible, I love that because it's like, all right, well then that's what a lot of people would believe."}, {"time": 906, "text": "And that gives you an opportunity to be the person who shows it's not impossible."}, {"time": 911, "text": "And you, of course you might be wrong, but if you're not wrong, you have the opportunity to stand out."}, {"time": 915, "text": "So going through that hardship, taking those big risks, it's going to really pay off."}, {"time": 920, "text": "So like discomfort is a feature, not a bug of both personal life, it's just good for life, but for business, it seems like just good business sense."}, {"time": 934, "text": "If something is hard, it's probably a good idea to do that."}, {"time": 939, "text": "Because most others will fail."}, {"time": 941, "text": "Fun question."}, {"time": 942, "text": "I don't know if you can answer this, but what's the most expensive movie you were involved with to make?"}, {"time": 948, "text": "And why was it, you don't have to say numbers, but like is something stand out as being exceptionally expensive and why is it expensive?"}, {"time": 957, "text": "Um, I think Jurassic World was pretty expensive."}, {"time": 962, "text": "I mean, worked out great."}, {"time": 965, "text": "And, uh."}, {"time": 966, "text": "That's an epic film, by the way."}, {"time": 969, "text": "It, look, it's one of my favorites."}, {"time": 973, "text": "They just did an amazing job."}, {"time": 976, "text": "And frankly, the crazy thing about my life is all the stuff that I loved as a kid somehow came full circle back into my adult life."}, {"time": 987, "text": "And having the opportunity while I was out there to develop a friendship with Steven Spielberg and then have my name on the same film as Steven Spielberg."}, {"time": 999, "text": "I mean, that was pretty surreal."}, {"time": 1004, "text": "So that was an expensive film."}, {"time": 1006, "text": "You know, Dark Knight Rises was an expensive film."}, {"time": 1009, "text": "But again, to me, there's a difference between expensive and irresponsible, and expensive because the vision warranted and it turned out financially it certainly did."}, {"time": 1021, "text": "Yeah, with Jurassic World, it's."}, {"time": 1024, "text": "I mean, I can't even imagine having those meetings because like you have to create so much and so much of it is obviously not real."}, {"time": 1031, "text": "You can't bring dinosaurs in a. Yeah."}, {"time": 1035, "text": "Is that where a lot of the cost is, is in the computer side of things?"}, {"time": 1042, "text": "Yeah, those are generally pretty massive components of the budget, and especially if you're doing it and inventing things as you go."}, {"time": 1052, "text": "I mean, Jim Cameron is one of those filmmakers who is designing the plane as it's flying in such a brilliant way."}, {"time": 1063, "text": "And I've got to know him over the years and just in awe of the way his brain works."}, {"time": 1071, "text": "And so yeah, it's a big component."}, {"time": 1075, "text": "Can you speak a little bit more to him in terms of, because you're such a fascinating person because you care a lot about technology."}, {"time": 1082, "text": "You care a lot about the cutting edge of technology."}, {"time": 1086, "text": "So how does he, a creator, a director, build the plane while it's flying?"}, {"time": 1092, "text": "Like what's the role of innovation in this whole process?"}, {"time": 1095, "text": "Well, so I never made a film with Jim."}, {"time": 1100, "text": "I'm just a huge fan and got to know him and John Landau, his producing partner."}, {"time": 1107, "text": "And one of the things that just fascinates me about Jim is, so he makes Titanic and there's a bunch of underwater cameras and things that they need that don't exist."}, {"time": 1117, "text": "So he goes and invents them and has a good grasp of engineering and has not only the imagination, but the ability to lead a team to build them."}, {"time": 1130, "text": "I got to go down early when they were shooting Avatar at a warehouse, I think it was, where they were shooting."}, {"time": 1137, "text": "And as they were explaining to me how they were capturing it and that they could go back later because they created the environment, it blew my mind."}, {"time": 1148, "text": "And I said, okay, this is truly, people talk about a big leap."}, {"time": 1153, "text": "This certainly is one."}, {"time": 1154, "text": "So he has continued to push the envelope in terms of the art of the possible."}, {"time": 1160, "text": "And I just think he's an incredible genius in that way."}, {"time": 1166, "text": "Again, another hard question."}, {"time": 1167, "text": "So you, in the realm of music, care about story, storytelling."}, {"time": 1173, "text": "Is there some aspect in which money and beautiful graphics get in the way of story?"}, {"time": 1180, "text": "In filmmaking, so if you think about Jurassic World, obviously that's an experience like any other."}, {"time": 1192, "text": "Like what do you think about the tension between story, experience and like visual effects?"}, {"time": 1201, "text": "Well, look, if you're using big effect shots and all kinds of tricks to cover over the fact that you don't have a very interesting story to tell, that's where I think it gets in the way."}, {"time": 1217, "text": "Where I think you have these incredible filmmakers, we mentioned Chris Nolan and Jim Cameron, Guillermo del Toro, you could go on and on, folks that just see the world differently and use technology to enhance the storytelling, right?"}, {"time": 1238, "text": "To make you believe differently, rather to make you not just suspend your disbelief, but to feel like you're immersed in it."}, {"time": 1249, "text": "So I've certainly seen it done expertly and I've seen it done poorly."}, {"time": 1254, "text": "You've talked about this a little bit in the past."}, {"time": 1257, "text": "You kind of left the moviemaking business at an interesting time, perhaps you saw the changes."}, {"time": 1267, "text": "There's been a lot of excitement with Netflix, with TV, so the role of film in society has changed."}, {"time": 1273, "text": "So what do you think is the future of movies versus TV?"}, {"time": 1278, "text": "Like if you were as a business person, as a creator, as a consumer, as a technologist, are thinking about the next 10, 20 years, what do you think is going to be the godfather, the great pieces that move us as a society in the next 10, 20 years?"}, {"time": 1297, "text": "Is it going to be TV?"}, {"time": 1298, "text": "Is it going to be movie?"}, {"time": 1299, "text": "Is it going to be a TikTok clips?"}, {"time": 1304, "text": "Well, so, and I think the other category that I would add to that, that will be the next great medium is truly immersive virtual reality in which new storytellers will emerge, especially when you can go into VR and there's enough computing power to sustain it and to allow it to be social and for you to have different paths to go down."}, {"time": 1334, "text": "That'll be, I think, the next realm of what storytelling and experience will look like."}, {"time": 1340, "text": "Do you think a video game kind of world or is it more movies or is it more social network or is it all of it kind of blending reality and gaming and movies?"}, {"time": 1351, "text": "Yeah, I thought if you saw Ready Player One, which I love the book and the movie was cool too, but that's one version of it, right?"}, {"time": 1362, "text": "Where you go in, now everybody's talking about the metaverse and all that, but you go into a world that's fully rendered as yourself and you interact with that world."}, {"time": 1371, "text": "The other side of it is to go in somewhere between being a passive observer, but being able to move around your point of view and experiences, which I think is interesting."}, {"time": 1383, "text": "And then I think another adventure, so to speak, I could think of is a blend of video games."}, {"time": 1390, "text": "So there's a mission, right?"}, {"time": 1392, "text": "There's obstacles, there's everything and you move through it, but it's immersive and it tells a story at the same time."}, {"time": 1399, "text": "And that's why I think you're gonna see new amazing storytellers that we don't know yet that understand how to innovate and how to make you feel something in that environment."}, {"time": 1414, "text": "And to your earlier point, I saw probably around 2015 when Netflix decided to be bold, put out House of Cards, put out all the episodes, leave you in charge of the pace at which you would view them, which I thought was great."}, {"time": 1436, "text": "That was a gutsy move."}, {"time": 1438, "text": "And I can't tell you around Hollywood, anybody that says that everybody thought it was a great idea is not being truthful because everybody I talked to said this is, they're idiots, right?"}, {"time": 1450, "text": "What do they know about movie making and TV?"}, {"time": 1453, "text": "And what I saw happening was if you look at what Netflix pulled off and they realized that there isn't really a moat around the studios, you really could make stuff and really good stuff."}, {"time": 1469, "text": "And so they started to create their own content that pulled in Amazon, which pulled in Google through YouTube and then you had Hulu, then you had Disney deciding that they're gonna have Disney Plus."}, {"time": 1484, "text": "And the next thing you know, you have some of the biggest companies with the largest balance sheets on the planet being in the creative business."}, {"time": 1495, "text": "If you're an independent, that's bringing a knife to a gunfight to be sure."}, {"time": 1500, "text": "And so I thought that was interesting."}, {"time": 1503, "text": "The other thing that it used to be that movies were where the big things happened and television was sort of, it was small screen, different experience."}, {"time": 1513, "text": "And you had something like Game of Thrones come out, which was not only on the same epic level visually and storytelling wise, but had the budget to be able to do it."}, {"time": 1524, "text": "And now I think you're seeing all kinds of different storytelling taking place."}, {"time": 1535, "text": "And I also like that you're not pigeonholed into a time."}, {"time": 1540, "text": "You got two hours to tell the story."}, {"time": 1542, "text": "You can do a three part mini series, a five part mini series."}, {"time": 1545, "text": "You can do television that's all kinds of different format."}, {"time": 1549, "text": "That I think allows creators to do a lot more interesting things."}, {"time": 1557, "text": "It is also interesting to consider the role of companies that enable that, like the capital that enables that."}, {"time": 1564, "text": "Without Netflix and HBO, you wouldn't have some of these epic shows."}, {"time": 1571, "text": "And so if we're thinking about the virtual reality world that you're talking about, it's interesting to consider who will enable that."}, {"time": 1579, "text": "Now, like you said, Facebook is talking about meta and metaverse, but it's unclear that just having money is enough."}, {"time": 1588, "text": "Netflix did a lot of really revolutionary stuff."}, {"time": 1593, "text": "Amazon has money."}, {"time": 1594, "text": "There's a lot of companies that have money that don't quite do as good of a job yet at enabling creators of creating revolutionary new content."}, {"time": 1604, "text": "That changes the whole industry."}, {"time": 1606, "text": "And that's probably going to be the case with virtual reality."}, {"time": 1609, "text": "There is a lot of money needed to enable experiences, like in terms of compute infrastructure."}, {"time": 1617, "text": "There needs to be a huge amount of money there, but you also need to somehow give freedom to creators to have fun, to do their best work, and at the same time provide the perfect amount of constraints, all of that together."}, {"time": 1633, "text": "However Netflix makes it happen, they do a pretty good job because it's a very constrained platform, but yet all the creators I've ever talked to, comedians and so on, that work with Netflix, are really happy because they feel free to create their work."}, {"time": 1647, "text": "Yeah, and I think a lot of times companies are a letterhead, but it boils down to the people."}, {"time": 1654, "text": "And I think I've known Ted Sarandos a long time who ran the studio at Netflix and now took over for Reed running the company."}, {"time": 1664, "text": "But Ted, very smart, talented guy, and understood early how to cultivate talent and relationships with talent, which is important."}, {"time": 1673, "text": "When you're dealing with creative people, their motivations and their goals are not always the same, right?"}, {"time": 1680, "text": "They're not always capitalistic, right?"}, {"time": 1682, "text": "And so in terms of being able to communicate with creative people that are not always A to B to C is a talent."}, {"time": 1691, "text": "And so I think they did a great job."}, {"time": 1694, "text": "Ted did a great job with that early."}, {"time": 1698, "text": "But I think that you're gonna see different formats."}, {"time": 1701, "text": "I don't think, I mean, going to a theater to see a massive movie on that screen in that format is a fundamentally different experience."}, {"time": 1713, "text": "And I think you're gonna find movies, my old shop, Legendary, just put out Dune, which I thought was phenomenal."}, {"time": 1723, "text": "When we secured the rights to Dune years ago, I was over the moon because I love the book."}, {"time": 1731, "text": "I love the entire world that is Dune."}, {"time": 1737, "text": "And that's a movie that I think you see on the big screen."}, {"time": 1739, "text": "I think when Avatar 2 comes out, I wanna see that on a big screen."}, {"time": 1746, "text": "But I think you're gonna see a ton of content is obviously being produced, and it's not all gonna go to a theater going experience."}, {"time": 1754, "text": "So you're gonna see, I think, different versions of this over the next five to 10 years."}, {"time": 1759, "text": "In case James Cameron is listening to this, so he officially agreed to talk at the time of, on this podcast, at the time of Avatar 2 release."}, {"time": 1767, "text": "I'm just holding you to that in this recorded conversation."}, {"time": 1771, "text": "Also just super excited, both the movie and the director."}, {"time": 1778, "text": "There's something special about movies."}, {"time": 1781, "text": "They win Oscars, they're historic in nature."}, {"time": 1786, "text": "There's something about TV shows, even when they're epic like Game of Thrones, that they're forgotten much quicker in history."}, {"time": 1794, "text": "I don't know, maybe that's because we haven't had enough of them, but the De Niro performances, and the Scorsese films, all the great films that we think of throughout the generations that define generations are films."}, {"time": 1810, "text": "Is that just old school thinking?"}, {"time": 1812, "text": "Is that always going to be the case?"}, {"time": 1814, "text": "I mean, look, to me, going in a darkened theater with a bunch of strangers, and the lights go down, and you go on this journey, there is something special and magical about that."}, {"time": 1829, "text": "And I think movies have been a part of our cultural fabric forever."}, {"time": 1836, "text": "And for some reason, Hollywood in America was uniquely positioned to do a great job with it."}, {"time": 1846, "text": "Not that there aren't great foreign movies, but far and away, American movies dominate, not only the world market, but you know, and so whatever it is that we do well, or Hollywood does well, there's something in the water, apparently."}, {"time": 1863, "text": "But I agree that I love movies, and I will for the rest of my days."}, {"time": 1870, "text": "It's interesting how creators can move back and forth now as well."}, {"time": 1875, "text": "That used to be a complete no no."}, {"time": 1877, "text": "You're either a movie guy, or you're a person, or you're a TV director, and that's that."}, {"time": 1884, "text": "But those lines have completely blurred."}, {"time": 1887, "text": "And they're also blurring, I mean, they're blurring all kinds of lines."}, {"time": 1891, "text": "Like they're moving to TikTok and Instagram, and I know right now it seems ridiculous to consider that these one minute things could be considered even in the same realm creatively as a film, but maybe that changes over time too."}, {"time": 1910, "text": "Maybe experiences can completely become fluid in terms of their size, as long as they have some deep lasting impact on you as a human being, as a consumer."}, {"time": 1922, "text": "Look, to me, the whole thing is about either the moving image, or even sometimes a picture will bring out an emotion, a reaction, something."}, {"time": 1933, "text": "So short form is harder, because you have less time to set things up and all that."}, {"time": 1939, "text": "But I'm sure there will be short videos and creators that come up with things, and if a moving image can get a reaction out of you, and make you feel a certain way, and stay with you, or inspire you, well, that to me is just the next evolution of whatever it's gonna be between humans and cameras, et cetera."}, {"time": 1961, "text": "See, I think that's why we've talked offline about this."}, {"time": 1964, "text": "That's why I love robots, is I think there's certain things in the short form with robots that immediately can bring out a feeling in people."}, {"time": 1974, "text": "There's something about our consideration of our own intelligence, of our own consciousness, of all the fears and hopes, and the beautiful things about human nature, the dark things about human nature that somehow, especially Lego robots bring out."}, {"time": 1991, "text": "Because we have both a fear and excitement towards that."}, {"time": 1995, "text": "Are these going to be our overlords, our gods that overtake humanity?"}, {"time": 2000, "text": "Are these going to be things like horses or something like that, something that empower humanity?"}, {"time": 2007, "text": "Like you don't know what to make sense of it."}, {"time": 2008, "text": "That's why they're super exciting."}, {"time": 2011, "text": "Speaking of robots and film, you've gone into traditional industries and disrupted them quite a few times."}, {"time": 2020, "text": "Was there, is there a system for deciding which industry is right for disruption?"}, {"time": 2025, "text": "When you look at the world and see what are the big problems you would like to solve, do you have a system of how you see which problems to solve?"}, {"time": 2036, "text": "How do you look at the world?"}, {"time": 2038, "text": "Yeah, well, on the business side of that, so I have a holding company called Tolko, I know, very imaginatively named."}, {"time": 2047, "text": "Part of that is literally every name ever is now taken, registered and all that stuff."}, {"time": 2054, "text": "So we're a holding company."}, {"time": 2056, "text": "What's a holding company?"}, {"time": 2058, "text": "So instead of being a fund that has money flowing in and out of it, and there's what's called a vintage year, I raise capital and I agree to invest that capital for so long, and then I give it back to you, which sometimes creates artificial time pressures and things like that."}, {"time": 2074, "text": "A holding company is more permanent capital."}, {"time": 2078, "text": "So the idea was, behind Tolko, was to buy almost always whole companies or majority stakes with great management teams in spaces that did not traditionally have a lot of innovation."}, {"time": 2093, "text": "And to have our labs group, who were data scientists, AI practitioners, engineers, machine learning, et cetera, and to be able to bring that wherewithal to that company."}, {"time": 2107, "text": "So to provide them with the right capital and to provide them with access to technology, that would be hard to individually recruit for that company."}, {"time": 2117, "text": "So I would say that the thesis was to look for industries that were large enough, that hadn't traditionally had access to that type of technology or innovation, and to try to look for companies that not only looked that part, but had management teams that embraced this and wanted to take that kind of journey."}, {"time": 2141, "text": "Yeah, there is quite a few industries like that, but that finding the industries and the management pair, because those industries often have a lot of old school folks who don't, it takes quite a bit of work for them to leap into technology."}, {"time": 2160, "text": "I work quite a bit with the autonomous vehicles and just the automotive industry."}, {"time": 2166, "text": "Depending on the company, there's old school folks."}, {"time": 2168, "text": "It's like Detroit thinking versus like, what do you call it, I don't know, California thinking."}, {"time": 2175, "text": "Well, I think you have to look at the nexus of two things there."}, {"time": 2179, "text": "One is just plain old human behavior."}, {"time": 2182, "text": "If I am uncomfortable and this isn't a comfort zone for me and it's not something I have as a field of expertise, I'm gonna shy away from that."}, {"time": 2193, "text": "Especially if I'm successful and I feel good about myself and it's a big successful company or person or whatever it might be."}, {"time": 2201, "text": "And the second thing is that especially if you're a public company and you're being weighed and measured every quarter, you are rewarding the managers of that company to hit metrics and to be reliable and to say, hey, I'm counting quarter to quarter that you're gonna deliver what you say."}, {"time": 2220, "text": "It's difficult to say, you know what, everybody, for the next two years, I wouldn't count on our financial projections at all because we're gonna reinvent what we're doing."}, {"time": 2230, "text": "It's gonna work in the long run and you're gonna see that this was a really smart investment five to seven years from now."}, {"time": 2238, "text": "That's not the way capitalism is currently wired, generally, right?"}, {"time": 2244, "text": "And a lot of, so again, if you reward managers with yearly bonuses and stock options based and tied to stock price and all these other things, you know, and then ask them to go break stuff, that's hard, I think."}, {"time": 2261, "text": "So you're saying like, so the talker approach to this, the private investment is the best way or perhaps the only way to enable this kind of long term innovation, investment, taking big risks, investing in innovation."}, {"time": 2277, "text": "Well, look, we certainly are not, by any means, the only one doing it."}, {"time": 2282, "text": "I'm just saying that when you think about big companies, more successful, you know, that are in old line businesses, and I hear people sort of talk about, well, why can't they just pivot?"}, {"time": 2295, "text": "They recognize they need to be in the technology business because it's hard, it's hard to steer a ship and turn it that big, and especially if it's not part of your DNA at that company."}, {"time": 2308, "text": "So, you know, I just think that what we tried to do is to enable management teams that know where they wanna go and to be patient with capital and also, again, bring innovation to bear that they have access to."}, {"time": 2330, "text": "There's plenty of capital structures doing interesting things."}, {"time": 2334, "text": "That's one of the things I love about our country."}, {"time": 2337, "text": "This country innovates and this country invents things, and I'm constantly in awe of just the, you know, the human ability to innovate and to iterate."}, {"time": 2354, "text": "You know, I get to hang around some universities, including your old shop, MIT, and it's like."}, {"time": 2360, "text": "I'm still there."}, {"time": 2361, "text": "Yeah, you're still there."}, {"time": 2362, "text": "Still there, still teaching there."}, {"time": 2363, "text": "Still teaching, but that place is like Hogwarts."}, {"time": 2366, "text": "I mean, it's just, it's inspiring, right?"}, {"time": 2370, "text": "And certainly the energy in Silicon Valley, which now Austin, Texas, where we're sitting, has its own incredible ecosystem."}, {"time": 2380, "text": "So that's one of the things I love about America is the ability, and that really is, I think, in the American DNA, to create things and invent things, and I just, I think that's invigorating."}, {"time": 2395, "text": "And I think that's even bigger than capitalism, sort of the machine of how capitalism works."}, {"time": 2402, "text": "Capitalism is just one of the ways to sort of make that human nature shine, I suppose, but it's like, you mentioned MIT."}, {"time": 2412, "text": "There's a drive there to invent, to innovate, that's so purely human, that human spirit to sort of build something new."}, {"time": 2428, "text": "It's like that hopeful, optimistic spirit, especially in the engineering space."}, {"time": 2432, "text": "Like if you pay attention to the internet, like Twitter and all that kind of stuff, intellectuals and so on, there's a cynicism to when we talk about stuff, but there's an optimism to when we do stuff."}, {"time": 2446, "text": "And the doing part, when you actually build things, especially, like you care a lot about manufacturing too, like you actually build physical products, that's where we truly shine."}, {"time": 2459, "text": "Yeah, no question about it."}, {"time": 2461, "text": "And I'm passionate about our country making stuff again, doing our own manufacturing and making sure that we don't lose the ability, not just to create things intellectually and do the world's greatest blueprints, but actually make things here."}, {"time": 2482, "text": "Actual factories."}, {"time": 2486, "text": "How do we bring more manufacturing to the United States?"}, {"time": 2490, "text": "Well, there's a company that I have a big personal investment in called Rebuild with some folks that all went through the MIT school years ago."}, {"time": 2505, "text": "There's a good friend of mine named Jeff Wilkie who used to be at Amazon."}, {"time": 2509, "text": "And we all felt the same way that America needed to make sure that it didn't lose its edge in that way."}, {"time": 2516, "text": "So it's a company that invests in American high tech manufacturing."}, {"time": 2523, "text": "And I think the way that we do that is provide capital, provide training."}, {"time": 2529, "text": "To me, this is also fertile ground for good, sustainable, high paying jobs."}, {"time": 2536, "text": "And we have to make it economically feasible to do that, again, here in this country."}, {"time": 2544, "text": "And not to say to companies that, again, are being weighed and measured quarter by quarter."}, {"time": 2548, "text": "Hey, this is three times as expensive to do it here, but you should do it here."}, {"time": 2553, "text": "We need to innovate and we need to create processes and companies and opportunity that balance that equation."}, {"time": 2562, "text": "And I think as we saw during the pandemic, I don't think in this day and age you can be an isolationist."}, {"time": 2568, "text": "That doesn't make any sense to me."}, {"time": 2571, "text": "But being self reliant and self determinant and making sure that you are never in a position as a nation that we can't do basic things because we're relying on supply chain in other countries."}, {"time": 2585, "text": "And whether it's we're not friends anymore, or a natural disaster or a virus or something pops up, I think those are costs of doing business that we have to put into the calculus of being able to make things here."}, {"time": 2602, "text": "There's an extremely high cost to making supply chain resilient that we really have to consider."}, {"time": 2607, "text": "And so if you really consider that cost, it makes a lot of sense to invest especially long term in building up manufacturing in a way where like you're making most of the stuff in one place."}, {"time": 2620, "text": "Sort of bringing it all, not all, but as much in as possible."}, {"time": 2627, "text": "And building it almost like from scratch here in the United States."}, {"time": 2630, "text": "I mean, what I guess your thought is with innovation, it's possible to sort of revolutionize the way we do manufacturing."}, {"time": 2640, "text": "So reduce the amount of supply chain stuff and like build stuff from scratch."}, {"time": 2645, "text": "Like do high tech manufacturing."}, {"time": 2648, "text": "So like optimize all aspects of the manufacturing and all that kind of stuff."}, {"time": 2653, "text": "Yeah, and I think where technology is the most efficient is the human machine interface, right?"}, {"time": 2663, "text": "It's not let's automate everything and have nobody work anywhere."}, {"time": 2667, "text": "I, for a long time, that's neither feasible nor desirable."}, {"time": 2672, "text": "But where we can enhance jobs and make that interface immensely productive with the right training and so forth, I think that's a worthwhile endeavor and something that's gonna be important to our country."}, {"time": 2689, "text": "Yeah, I mean, you know who you're talking to."}, {"time": 2693, "text": "I love human robot interaction, human machine interaction, human AI interaction."}, {"time": 2697, "text": "So what do you think is the role of robotics in this high tech manufacturing?"}, {"time": 2702, "text": "Sort of like industrial robots, robotic arms, all that kind of stuff."}, {"time": 2706, "text": "Or even more complicated kind of robots."}, {"time": 2709, "text": "What do you think is the role of robotics?"}, {"time": 2711, "text": "What do you think is the role of AI in this manufacturing future you're thinking about?"}, {"time": 2716, "text": "Well, robotics to me is an extremely exciting field."}, {"time": 2720, "text": "I don't have the same expertise that you do."}, {"time": 2723, "text": "I have an adjacency, but not the depth of knowledge."}, {"time": 2727, "text": "Have never really delved deeply into it or made investments in it."}, {"time": 2730, "text": "But I think what's exciting about it is everything from doing jobs that are very dangerous for humans, enhancing the human experience."}, {"time": 2741, "text": "When you look at really repetitive labor, things that, you know, it might take away a job, but is it a good job for that person?"}, {"time": 2751, "text": "Is, you know, spending 30 years doing something highly repetitious, is that a good experience in life?"}, {"time": 2758, "text": "So I think, and then when you think about everything from military applications, you know, rescue, we're already seeing a bunch of those things."}, {"time": 2768, "text": "And then just lastly, when you talk about that human interaction with robots, when you start to have the combination, so you have some level of intelligence and interaction, I mean, that's why we always love the droids in Star Wars, right?"}, {"time": 2786, "text": "I mean, it's exciting, it captures the imagination."}, {"time": 2793, "text": "And I think, look, many, many hours have been spent on debating artificial intelligence and the ramifications, if things go sideways and so forth."}, {"time": 2808, "text": "And I think those are all, you know, those are appropriate conversations to be having."}, {"time": 2814, "text": "AI is happening."}, {"time": 2815, "text": "I think it's actually happening slower than most people realize, because there are tasks that humans do every minute of every day, standing up without losing your sense of balance."}, {"time": 2829, "text": "I mean, these are really hard things, but I think there's enough investment, both in private industry as well as nation states now on artificial intelligence that it is coming."}, {"time": 2843, "text": "So both in the software space, in the digital space and in the physical space."}, {"time": 2849, "text": "So we talk about manufacturing, so industrial robotics is very true that even in the factory, even the tasks that you think are pretty basic, you know, the amount of small intuitive decisions that humans make is quite incredible."}, {"time": 2866, "text": "So we have to be kind of explicit about saying which tasks are actually really hard and humans are just really good at them."}, {"time": 2874, "text": "And so on the flip side in the digital space with social networks, we recommend our systems with all kinds of like personal assistance in terms of voice based AI systems, all of that."}, {"time": 2890, "text": "There's opportunities there to find niches where AI can really have a transformative effect."}, {"time": 2897, "text": "I think one of the places that really haven't, this is where like you're worried to say stupid things, but I believe this very much that when we have AI systems in the home currently, you have somebody like Alexa and Google Home and so on, they're kind of very basic servants."}, {"time": 2920, "text": "They tell you about the weather, they can play some music, they can turn the lights on and off, all the kind of like smart home stuff."}, {"time": 2927, "text": "I think there's a lot of value in systems that form relationships with us in the way that pets do, dogs and cats."}, {"time": 2938, "text": "I don't know, just for people who have cats, cats don't care about you."}, {"time": 2942, "text": "They really don't, they don't form any kind of relationship."}, {"time": 2945, "text": "I don't know why you have relationship with them."}, {"time": 2948, "text": "Anyway, sorry, I threw out some shade."}, {"time": 2951, "text": "I'm just kidding by the way."}, {"time": 2953, "text": "That's a basic kind of connection you have with another living being."}, {"time": 2956, "text": "Then there's also just friends."}, {"time": 2958, "text": "You have different levels of friends, acquaintances, you have lifelong friends, all that."}, {"time": 2962, "text": "That friendship you have, I really believe that there is some aspect of the human experience that is deeply enriched by interacting with other beings."}, {"time": 2975, "text": "And for systems, computing systems, artificial intelligence systems in our world, to have the capability to engage in some of that, I think is not just an opportunity to help people grow, become better people, but it's also just a good business opportunity too."}, {"time": 2996, "text": "And that hasn't really been explored enough."}, {"time": 2998, "text": "So that to me is really, that's a whole exciting space that I think will enable better industrial robotics."}, {"time": 3008, "text": "It will empower a better Facebook or a better social network, a competitor to Facebook that overthrows Facebook."}, {"time": 3015, "text": "So it'll create better technologies that currently don't have that human robot interaction touch."}, {"time": 3024, "text": "So I don't know, that's super exciting to me, but that has to deal with the mess of human nature."}, {"time": 3034, "text": "The reason that most robotics people and AI people stay away from humans, they stay away from the human robot interaction problem, is because humans are complicated."}, {"time": 3046, "text": "They're messy, they're hard to control, they're hard to predict stuff about, they're hard to make sense of or like test repeatedly because one human can be drastically different from another human."}, {"time": 3062, "text": "And so to deal with that as a robotics problem is super hard."}, {"time": 3067, "text": "And so one of the questions is which problems can you remove the human from consideration when you're trying to solve the problem?"}, {"time": 3075, "text": "So like Elon Musk is an example of somebody who believes autonomous driving, we can remove the human from consideration, we can solve autonomous driving as a robotics problem."}, {"time": 3086, "text": "It's stay in the lane."}, {"time": 3088, "text": "When there's a red light, you stop at a red light."}, {"time": 3091, "text": "If there is humans in the picture like pedestrians, that's a ballistics problem."}, {"time": 3096, "text": "It's just treat them as a moving object that has with like 90% probability keeps moving in the way they were in the past few seconds with some smaller probability that might stop or turn."}, {"time": 3109, "text": "Just do some basic models about them and you'll be able to do just fine."}, {"time": 3113, "text": "So I tend to believe that even driving has to consider the full messiness of humans."}, {"time": 3121, "text": "The dance, the game theoretic dance of chicken that we all do when we jaywalk, we look at the car, that car doesn't, that driver doesn't have the guts to murder me so I'm going to walk in front of it and not look at the car."}, {"time": 3134, "text": "We do that kind of dance and AI systems need to be able to play, do that kind of dance."}, {"time": 3144, "text": "In Tolko, there's the labs."}, {"time": 3148, "text": "So there's a data science component, there's an AI component."}, {"time": 3152, "text": "So how do they go into a company and help revolutionize that industry?"}, {"time": 3158, "text": "Well, there's different examples."}, {"time": 3193, "text": "And when you have those two things come together, you get the result that we did at Figs."}, {"time": 3204, "text": "We have a company called Acashure, which it's AI lab and base is down here in Austin, Texas."}, {"time": 3211, "text": "It was an insurance, one of the largest insurance brokers in the world."}, {"time": 3216, "text": "And we did a deal with them and sold some of our insurance holdings that was completely AI driven."}, {"time": 3227, "text": "And in that case, you basically put the team inside the company, right?"}, {"time": 3232, "text": "Because it's a massive company and we've gone into all kinds of things."}, {"time": 3239, "text": "So it just depends on the different situations."}, {"time": 3243, "text": "But the biggest thing was just to make sure whatever the company needed, they had access to the talent."}, {"time": 3251, "text": "Sometimes we'd build it, sometimes we'd help recruit for it."}, {"time": 3255, "text": "You know how in technology, it's whatever works, right?"}, {"time": 3258, "text": "There's no one way to do things."}, {"time": 3262, "text": "Well, Acashure is really interesting as an example."}, {"time": 3265, "text": "So insurance is a fascinating space."}, {"time": 3267, "text": "It seems like very ripe still for disruption across the board."}, {"time": 3272, "text": "So how do you, it seems like a lot of the disruption has to do with almost the first dump step of we've been using mostly paper."}, {"time": 3286, "text": "It's not digitized."}, {"time": 3287, "text": "You have to basically create a infrastructure and a framework where everybody is using the same digital system, like databases and just organize the data."}, {"time": 3299, "text": "It seems like that's a huge leap that basically can revolutionize major industries that still hasn't been done."}, {"time": 3305, "text": "Insurance is obviously the great example of that."}, {"time": 3308, "text": "And one of the things that struck me, the founder CEO of Acashure is a guy named Greg Williams."}, {"time": 3314, "text": "They're out of Grand Rapids, Michigan."}, {"time": 3316, "text": "And as we were looking at expanding our footprint in insurance, I met with a lot of insurance executives."}, {"time": 3322, "text": "And they would talk about technology, but Greg truly understood the power of what would happen across actuarial sciences, predictive analytics and using machine learning to really run every aspect of your business."}, {"time": 3339, "text": "And then automating a lot of the, just the back office tedious steps."}, {"time": 3345, "text": "And as you said, one of the things that was great for us, they already had a data collection system and department."}, {"time": 3354, "text": "So it was much easier to pivot."}, {"time": 3358, "text": "And I'm very excited about the future of that company."}, {"time": 3361, "text": "It's, they're doing some pretty innovative, groundbreaking things."}, {"time": 3367, "text": "And those are the things that I like doing, right?"}, {"time": 3371, "text": "Is that, yes, I wanna make money."}, {"time": 3375, "text": "Just, that's what that is."}, {"time": 3377, "text": "But at the same time, what did you do with your time on earth, right?"}, {"time": 3381, "text": "Did you do anything to leave any kind of mark that you did anything interesting?"}, {"time": 3387, "text": "I can only speak for myself."}, {"time": 3389, "text": "There are many more ways to measure one's life."}, {"time": 3393, "text": "And I can only speak about how I think about things."}, {"time": 3397, "text": "I grew up poor in upstate New York with a single mom and watched her work a couple of jobs and had to, from a young age, shovel snow and mow lawns and do all kinds of things to help her make sure the lights weren't turned off in our little place."}, {"time": 3415, "text": "And so that's just something that I've always been driven towards."}, {"time": 3420, "text": "And I just, I have really eclectic tastes and interests."}, {"time": 3427, "text": "And it's just been an interesting journey."}, {"time": 3431, "text": "So help be part of and help enable some cool new creations across the board, like film, music, AI, manufacturing, just insurance, all the specific industries that you disrupted, yeah."}, {"time": 3453, "text": "Small tangent, back to your childhood with your mom."}, {"time": 3459, "text": "Any memories kind of stand out, stick with you as something that helped define who you are as a man?"}, {"time": 3469, "text": "Yeah, even though the university and college experience was not part of the family tree, and we had no connections, I didn't understand, I didn't know what a trust fund was or prep school, I didn't know what any of that was."}, {"time": 3487, "text": "But my mom from a young age would always say, you know, you're gonna go to college."}, {"time": 3492, "text": "There's no, you know, if you choose to, and I think from a young age, that was just an expectation that I had and that she instilled and the work ethic."}, {"time": 3503, "text": "I watched her."}, {"time": 3504, "text": "And then my grandmother was a janitor, a cleaning lady in a hospital for 50 years."}, {"time": 3511, "text": "And then I remember there were times of, you know, I'm probably 10 years old, it's freezing cold out."}, {"time": 3519, "text": "And if I don't go out and shovel six driveways, we don't have enough money to pay the bill."}, {"time": 3525, "text": "So I don't know, I'm not a psychologist, so I don't know how that manifests itself in my life today."}, {"time": 3532, "text": "But I think the grit to say, I'm not in the mood to do this, I don't wanna do this, but that's the work that needs to be done."}, {"time": 3544, "text": "And no excuses, not I'm a victim and I'm gonna sit around and talk about, no, it is what it is, and you have to get done what you need to get done."}, {"time": 3555, "text": "And again, I think it's, you can never fully put yourself in someone else's shoes or experience, so I don't know what that is or feels like."}, {"time": 3565, "text": "But for me, those were two, I think, formative things that were important in my childhood."}, {"time": 3573, "text": "So that's pretty, the reality of life like that is pretty humbling."}, {"time": 3578, "text": "You still, you've been so exceptionally successful that it's easy to get soft now."}, {"time": 3585, "text": "How do you get humbled these days?"}, {"time": 3589, "text": "By getting up."}, {"time": 3590, "text": "You know, I think for me personally, trying to push the envelope and being weighed and measured, right?"}, {"time": 3599, "text": "That's why I always loved sports too."}, {"time": 3600, "text": "There's a scoreboard."}, {"time": 3602, "text": "And I'm a huge believer in opportunity, meritocracy, all those things that I think are ideals that we wanna aspire to."}, {"time": 3614, "text": "And I think that there's a lot of things I'm involved with right now that I just wanna see if I can do it."}, {"time": 3622, "text": "I wanna see if, and you know, my own little mantra is cause the outcome, right?"}, {"time": 3629, "text": "As much as you can, and at the same time, have the humility and not to have the hubris or arrogance to say I'm always gonna cause the outcome."}, {"time": 3638, "text": "Because you'll get your ass kicked pretty quickly and humbled."}, {"time": 3643, "text": "The world and the universe is a big place with forces beyond, but I think, I also think a lot about being intellectually honest, which when I do university talks and so forth, I think that's a superpower."}, {"time": 3662, "text": "Because if you find yourself making decisions based on other people's expectations, based on places you don't wanna go, but you feel like momentum is taking you there, I think that's a big problem."}, {"time": 3682, "text": "And there are people that go to our top universities and can't wait to get out and start their own company and they want that pressure and they want to grind."}, {"time": 3695, "text": "And there are other people that are smart and talented, but just say, look, I don't wanna lay awake staring at the ceiling wondering how I'm gonna make payroll."}, {"time": 3703, "text": "I don't want that in my life."}, {"time": 3705, "text": "And I think if you can square that up and be okay with it and say, what makes me tick?"}, {"time": 3711, "text": "What makes me happy?"}, {"time": 3712, "text": "What puts me in a bad head space?"}, {"time": 3714, "text": "Because there's a difference between challenging yourself and going against your nature."}, {"time": 3720, "text": "So that's why I think that being intellectually honest and being able to really sit down and go inside your own head and say, what am I good at?"}, {"time": 3728, "text": "What am I not good at?"}, {"time": 3730, "text": "How am I gonna put myself in a position to be successful?"}, {"time": 3733, "text": "Because I'm working on my weaknesses, but I'm not gonna put myself career wise in a position where I'm just fundamentally gonna have a hard time being successful."}, {"time": 3748, "text": "Yeah, intellectually honest is a tricky one."}, {"time": 3750, "text": "And it gets, there's like levels to it too."}, {"time": 3755, "text": "Because some of the things I think about when you dream of doing certain kinds of big things, a part of intellectual honesty is to say several things."}, {"time": 3773, "text": "One is like, hey, the thing you're dreaming about, like one, the fact that nobody's done it probably shows that you're just a dreamer."}, {"time": 3787, "text": "This is not going to, like think clearly."}, {"time": 3793, "text": "The fact that it hasn't been done probably shows that it may not be the right path."}, {"time": 3797, "text": "And two is like, if you're dreaming about stuff, there's a certain point where it's like, hey, you haven't done it."}, {"time": 3805, "text": "Like, why haven't you done it already then?"}, {"time": 3807, "text": "Like you have to be honest with yourself."}, {"time": 3809, "text": "Like you have to be ambitious."}, {"time": 3810, "text": "Like a lot of people work hard a long time for a dream, but you have to wake up and be like, all right, I've been at this for 10 years."}, {"time": 3821, "text": "Like with a startup, you launch a startup and you think, okay, one year, two years, three years, four years, pretty successful, but it hasn't exploded like you dreamed and you have to shut it down."}, {"time": 3834, "text": "You have to be intellectually honest there."}, {"time": 3836, "text": "At the same time, you might want to be, like step it up, lean into it."}, {"time": 3843, "text": "Say almost like the flip side of like intellectual honesty is like maddening ambition of just saying, fuck it, I'm going to go all in."}, {"time": 3856, "text": "But that is a kind of intellectual honesty saying like, you know, the big problem here is I've been kind of going, doing too many things."}, {"time": 3866, "text": "Maybe with this dream, you have to go all in on it."}, {"time": 3870, "text": "I mean, this is human experience, it's complicated."}, {"time": 3874, "text": "Yes, all human things are complicated."}, {"time": 3877, "text": "And I think there's a difference between being reckless and making well thought out informed decisions."}, {"time": 3884, "text": "If you're going to go all in, make sure you've measured twice, cut once, as they say."}, {"time": 3890, "text": "And one of my other favorite, I forget, many years ago, I heard this saying and it stayed with me."}, {"time": 3897, "text": "It was never mistake, clear line of sight with distance and you know that."}, {"time": 3903, "text": "So I think that the key, whether you're starting a business or you're thinking about leaving the company you're at and starting a business or just leaving for another job, any of these things is as much as you can, right?"}, {"time": 3919, "text": "And psychologists, I think would tell us, it's hard to be self aware completely, right?"}, {"time": 3924, "text": "That's the rub that if we were all completely self aware of everything that we did and strengthen weaknesses, it'd be a different world."}, {"time": 3932, "text": "But I do think you can work on that and at least challenge yourself to think about it and not be in a position where I'm going to medical school because that's what you do in my family and even though I'm miserable doing it, things like that."}, {"time": 3951, "text": "So definitely you don't want to be sort of, because you don't think fall victim to conformity."}, {"time": 3959, "text": "Let's just go on doing the same thing over and over."}, {"time": 3963, "text": "But at the same time, is measure twice and cut once."}, {"time": 3971, "text": "It does feel like some of the biggest leaps taken are where you cut once and measure later."}, {"time": 3982, "text": "Is you leap in first."}, {"time": 3985, "text": "It's almost like a gut, I suppose that is a measurement, but you build up a good gut instinct of what to do and then you just do it and then you figure out, it's the building the airplane as you're flying it."}, {"time": 3999, "text": "Well, and I think each one of those instances that you could probably cite has its own unique circumstances, right?"}, {"time": 4007, "text": "I don't have a deep biotech background, so if I suddenly stood up and said, I'm gonna put everything I have into this idea, well, those are, it's game theory, right?"}, {"time": 4019, "text": "What are the odds of success?"}, {"time": 4021, "text": "If on the other hand, you're brilliant in your field or you've seen some opportunity that you think is wide open and you're gonna go for it and break stuff, that's great."}, {"time": 4036, "text": "You just wanna, to me, always say like, how crazy is this on the spectrum of, do I have any expertise?"}, {"time": 4045, "text": "What is the downside if I fail, right?"}, {"time": 4050, "text": "If you're at a certain point in life with young children and you've got a mortgage and whatever else, that is one circumstance versus I just got out of Stanford or I just got out of whatever and I'm gonna go for it."}, {"time": 4064, "text": "It's just the whole thing, right?"}, {"time": 4067, "text": "It is complex as you point out."}, {"time": 4069, "text": "And sometimes you just wanna have the right matrix in your head of decision making process to try to arrive at the right place."}, {"time": 4077, "text": "And even if you get close, that's where I think you say, you know what, the hell with it, I'm doing this."}, {"time": 4086, "text": "I do wanna ask you about one specific idea that sounds super fascinating that you're involved with recently."}, {"time": 4093, "text": "You led the $50 million seed round for a company called Colossal that is focused on deextinction."}, {"time": 4102, "text": "This is funny relative to our connection and conversation about Jurassic World."}, {"time": 4108, "text": "They're seeking to restore lost ecosystems and use gene editing to restore the woolly mammoth to the Arctic tundra."}, {"time": 4117, "text": "How are they gonna do that?"}, {"time": 4119, "text": "Well, I met this fascinating guy at Harvard named George Church five, six years ago, and found him to be incredibly smart, have an imagination."}, {"time": 4136, "text": "And he partnered up with a guy named Ben Lamb, who's an entrepreneur."}, {"time": 4142, "text": "And basically the press and to me the imaginative, like you're capturing my imagination by telling me you're gonna bring back the woolly mammoth and other extinct animals."}, {"time": 4155, "text": "And I, you know, we'll see where that road leads."}, {"time": 4158, "text": "I was more interested in an investor in the things that they're working through around understanding genes and proteins and CRISPR and all these other things because being adjacent to George Church and his team as these things unfold over the next decade, I thought was the right thing to do."}, {"time": 4182, "text": "So people are important here, just like investing people and seeing what the hell they come up with."}, {"time": 4188, "text": "Absolutely, I mean, you can look through history and great things are done by great people, right?"}, {"time": 4197, "text": "And companies, they end up over time becoming a logo and immediately what you think of them, but they started out with a person, with an idea and a team that cultivated that and made that happen."}, {"time": 4213, "text": "And I think there are certain folks that are just immensely talented that if you can be around them, and I also know his and his team's ethics in terms of, you know, after spending time talking about where the lines are, people in other countries that, you know, may not have the same process, may not have the same checks and balances, are doing this and pursuing this regardless."}, {"time": 4242, "text": "So at least I felt like with George and Ben and their teams, they're also very responsible people."}, {"time": 4249, "text": "This is where the human side of things comes into play."}, {"time": 4253, "text": "I've interacted with a lot of really brilliant people in the technology space where you kind of, you know, there's a lot of ways to feel this out."}, {"time": 4261, "text": "You can ask them whether they kind of read literature."}, {"time": 4263, "text": "You can feel out how much do they really understand about like human nature here."}, {"time": 4272, "text": "Like whatever the technology is, when it actually starts to play, interact with society at scale, like do they have an understanding or an intuition about how that happens?"}, {"time": 4286, "text": "Some of that requires studying history."}, {"time": 4288, "text": "Some of that requires like just looking at the worst and best parts and events in human history to understand like, hey, it doesn't always turn out like everybody hoped the technology turns out."}, {"time": 4303, "text": "If a person has a depth of understanding about history, about human nature, then I think that's the right person to mess with some of this cutting edge stuff."}, {"time": 4316, "text": "Now you want Marcus Aurelius with a PhD from MIT."}, {"time": 4324, "text": "Just small tangent, but you mentioned having a conversation with Warren Buffett, you spoke really highly of him as an investor, as a human being."}, {"time": 4335, "text": "What about him do you admire?"}, {"time": 4337, "text": "What from him, what insights have you drawn from him as a great investor yourself?"}, {"time": 4343, "text": "Well, the afternoon that I got to spend with him, which is something I'll treasure forever."}, {"time": 4348, "text": "Look, sometimes when you meet people, even that are immensely successful, you may decide that after 20 minutes or a half hour, oh, you were in the right place at the right time and that's fine."}, {"time": 4365, "text": "There are other people that are clearly different, special, and I don't care if you made them start from zero, you know, would end up in a good place."}, {"time": 4376, "text": "And so it was an absolute privilege to spend the time with him."}, {"time": 4383, "text": "You know, and a couple of things that stood out in the conversation, he is incredibly intellectually curious and well read, and I like how simplistic he likes to keep his thought matrix."}, {"time": 4397, "text": "And then also, instead of trying to outsmart the market, it seems like a simple axiom, but just look, good companies that are led by talented managers that are good businesses over time are gonna get there."}, {"time": 4415, "text": "So I'm not gonna day trade, I'm just gonna, I'm looking for value."}, {"time": 4420, "text": "And then just on life stuff, he just, you know, and also his ability to take in and then use information was incredibly impressive."}, {"time": 4434, "text": "So I only spent the, you know, I'd met him before, but I only spent one afternoon with him, but it's, you know, pretty incredible."}, {"time": 4442, "text": "And one of the things that stuck out to me is we were in the middle of talking about Tolko or investing or how we thought about it."}, {"time": 4450, "text": "And I said, you know, I'm trying to be smart about, and he stopped me and he said, Charlie Munger, his partner of many years, Charlie and I don't try to think of the smart thing to do."}, {"time": 4461, "text": "We try to think what's the dumb thing we could do here."}, {"time": 4464, "text": "And I kind of laughed and he said, no, I'm dead serious."}, {"time": 4468, "text": "We think about it from the standpoint of what could we do in this situation that later we'd be like, that was a really dumb thing to do."}, {"time": 4477, "text": "And I actually thought that was, it got in my head."}, {"time": 4481, "text": "And I still think a lot about that as I'm dissecting problems."}, {"time": 4486, "text": "So there is, like, that's a kind of longterm thinking if you just avoid the dumb things, or if you simplify, just focus on those simple steps, all it takes is just do that for a long period of time and you'll be successful."}, {"time": 4504, "text": "Well, it certainly worked for him, that's all I can say."}, {"time": 4510, "text": "You've been a great investor yourself."}, {"time": 4514, "text": "How do you know, when you judge people, so I, whenever I go to San Francisco, I was thinking of moving to San Francisco."}, {"time": 4522, "text": "That's why I decided to, after really giving it some thought, talking to people, decided to move to Austin."}, {"time": 4529, "text": "You know, everybody's dreaming big and they have big plans."}, {"time": 4533, "text": "And it's actually, I don't envy the job of an investor of any kind, because everybody has big dreams and it's hard to know who exactly, what idea is going to materialize, what team is going to materialize into something great."}, {"time": 4551, "text": "How do you make those decisions about people, about ideas?"}, {"time": 4557, "text": "Well, if I had any kind of a lattice work on this, it absolutely starts with the people."}, {"time": 4564, "text": "And I think the reason for that is your business plan is going to change, right?"}, {"time": 4570, "text": "There's very few businesses I know of that say, we're gonna make a widget in this location and 30 years later, we're successful and we just make a widget and that's what it is."}, {"time": 4581, "text": "Things happen, right?"}, {"time": 4582, "text": "And today they happen with such velocity that you have to be able to make hard decisions based on imperfect information."}, {"time": 4594, "text": "And are you, how are you going to calculate those answers?"}, {"time": 4598, "text": "How self interested are you going to be?"}, {"time": 4601, "text": "What kind of ethics will you apply?"}, {"time": 4604, "text": "What's your short term versus long term thinking?"}, {"time": 4607, "text": "Are you able to give an honest assessment of a situation?"}, {"time": 4613, "text": "Because the thing that you can count on is problems are gonna happen."}, {"time": 4618, "text": "Things you didn't anticipate are gonna happen."}, {"time": 4621, "text": "How pliable are you, right?"}, {"time": 4624, "text": "How much elasticity is there in your ability to be successful?"}, {"time": 4630, "text": "And I think it's important when you invest in something that you both see, you understand the roadmap ahead and agree to it, right?"}, {"time": 4641, "text": "Doesn't mean there won't be twists and turns, but you're not like, whoa, wait a minute, what did we do here?"}, {"time": 4646, "text": "This isn't what was in the thing I signed up for."}, {"time": 4649, "text": "And then I think honesty and communication is a huge thing to me with, I always tell people if bi directionally, if there's something going on, start the conversation with, Lex, we have a problem."}, {"time": 4668, "text": "Okay, now I'm sitting up, you have my full attention, we're gonna talk about whatever it is."}, {"time": 4674, "text": "Bad news should travel faster than good news."}, {"time": 4676, "text": "And because it's going to happen, being in business with someone that is gonna shoot you straight and sometimes say, I don't know."}, {"time": 4689, "text": "I don't know what the answer is."}, {"time": 4690, "text": "I gotta go figure it out."}, {"time": 4692, "text": "That I can process a lot better than, look, I don't want you mad at me or disappointed or I can't handle not having success."}, {"time": 4700, "text": "So we're just gonna kick the can."}, {"time": 4703, "text": "And I think, especially in today's business environment, that's very, very dangerous."}, {"time": 4709, "text": "So that's a bad sign, not just because it's good to communicate and be honest, but if they're not willing to do that, then it goes back to the intellectual honesty."}, {"time": 4720, "text": "They're probably not also able to be brutally honest with themselves when they look in the mirror about the direction of the company."}, {"time": 4728, "text": "But look, I wasn't there, so I don't know."}, {"time": 4733, "text": "But I think if you unpack many situations that turned out negatively, most of the people, whether you're faking lab results, you have a biotech company, everybody's staring at Theranos these days."}, {"time": 4748, "text": "Do I think in a lot of cases, you're either the villain, like you started out saying, I'm gonna screw my shareholders over and I'm gonna be a liar, that isn't my experience."}, {"time": 4762, "text": "Most things are little incremental moves that you say, we're gonna get this right next week, but today we gotta make the presentation."}, {"time": 4769, "text": "So we're gonna just tweak things a little bit."}, {"time": 4771, "text": "That's a slippery slope, right?"}, {"time": 4774, "text": "And so that's why I think from a standpoint of people, you wanna go into the foxhole with folks that, you know, understand things are gonna happen and I'm gonna let you know about them and we're gonna try to solve them together."}, {"time": 4792, "text": "And then just in terms of the idea, it's, I always ask like, okay, if this company executed the way, that's the other thing that always cracks me up about financials, whenever somebody pitches you, inevitably they'll say, our projections are really, really conservative."}, {"time": 4809, "text": "I'm still waiting for somebody to come in and say, look, my projections are wildly optimistic."}, {"time": 4814, "text": "We'll never hit these numbers, but anyway, it's, you know, if this company did what it says and executes and does it matter, right?"}, {"time": 4825, "text": "Does it move the needle enough?"}, {"time": 4827, "text": "And what are the things that uniquely position this company to be successful?"}, {"time": 4833, "text": "And you just have to be able to answer, I think a number of those questions pretty crisply."}, {"time": 4839, "text": "But at the end of the day, it's still a big risk."}, {"time": 4841, "text": "So you're just trying to minimize the risk."}, {"time": 4847, "text": "Let me jump to another topic."}, {"time": 4850, "text": "You're an incredible human being that you're involved with this."}, {"time": 4854, "text": "Your band, Ghost Hounds, is touring with the Rolling Stones."}, {"time": 4860, "text": "So before we talk about your band, let me ask about that."}, {"time": 4863, "text": "What's that like, playing with the Rolling Stones?"}, {"time": 4867, "text": "Surreal, just because they're my favorite band of all time."}, {"time": 4875, "text": "To me, the greatest rock and roll band, it's not even close, of all time."}, {"time": 4879, "text": "And, you know, to share the same stage, to be on tour and to go out and get that energy from the crowd, you know, and every night and come off stage and later when they go on and you hear that iconic, ladies and gentlemen, the Rolling Stones."}, {"time": 4896, "text": "And then it's incredible."}, {"time": 4898, "text": "And, you know, what's amazing to me about the band, next year will be their 60th anniversary, 60 years."}, {"time": 4908, "text": "And it's hard to be around anything for that long, but making music and packing stadiums."}, {"time": 4916, "text": "And what's amazing to me, they can play a two hour set and it's not just that, oh, that's a hit or you recognize it."}, {"time": 4923, "text": "It's like every song is an anthem, right?"}, {"time": 4926, "text": "And so it's been amazing."}, {"time": 4930, "text": "We got to play with them in 2019."}, {"time": 4932, "text": "And when they ask us to do this again, it's just an absolute privilege."}, {"time": 4939, "text": "I asked you this offline, so I know you are a kind of rockstar, but just me, maybe I'm projecting, but do you get nervous, such a large audience with the Rolling Stones?"}, {"time": 4953, "text": "It feels like there'll be a lot of pressure."}, {"time": 4956, "text": "Yeah, I mean, you definitely don't want to screw it up."}, {"time": 4959, "text": "I think our band is tight knit and all that stuff."}, {"time": 4965, "text": "And I think that the individual nervousness dissipates when you go out as a group and you're making music together and you sort of, okay, we're all in this and we're doing a thing, which is why even in sports, I always look at individual events like ice skating or anything where it's just you out there alone."}, {"time": 4989, "text": "And that's different than being with a team and nerve wracking."}, {"time": 4992, "text": "So I'm sure if it was me with an acoustic guitar just going out, it would feel different, but absolutely you get the right kind of butterflies, I would call it."}, {"time": 5004, "text": "And just the energy of playing music and having it be this relationship and look, I get it."}, {"time": 5013, "text": "I've been to a ton of concerts where I'm like, look, can we just get to the band please?"}, {"time": 5018, "text": "But what's been great is just an amazing reception."}, {"time": 5023, "text": "And we have this guy named Trey Nation who's the lead singer who's just incredibly talented."}, {"time": 5029, "text": "I mean, he's just not only an amazing voice, but just has that charismatic thing."}, {"time": 5038, "text": "What's it feel like to play in front of a huge audience?"}, {"time": 5042, "text": "What's, as a guitarist, are you lost in the music?"}, {"time": 5047, "text": "Like you almost don't feel the audience."}, {"time": 5050, "text": "Does it add extra energy?"}, {"time": 5052, "text": "Does it add extra anxiety?"}, {"time": 5054, "text": "What does it feel like?"}, {"time": 5057, "text": "You know, stadiums are interesting just because it's so big and cavernous."}, {"time": 5062, "text": "And because you want to protect your ears."}, {"time": 5064, "text": "So we use an in ear system so that you are a little disconnected from the crowd."}, {"time": 5070, "text": "Because if you're playing that loud and you're standing in front of your amps without ear protection, that's bad."}, {"time": 5076, "text": "How are you monitoring the sound?"}, {"time": 5078, "text": "The in ear stuff, is that producing sound or is it strictly ear plugs?"}, {"time": 5081, "text": "No, it's producing the sound."}, {"time": 5083, "text": "So it's like putting ear pods in and listening to a song and you're playing to it, right?"}, {"time": 5088, "text": "It's just us playing, but it protects your ears."}, {"time": 5094, "text": "But the energy from the crowd, when they get going and get into it, which Knock On Wood so far has been amazing, there's nothing like it."}, {"time": 5106, "text": "I mean, it's just this bi directional thing that happens."}, {"time": 5112, "text": "And music and sports were kind of my first loves."}, {"time": 5118, "text": "And yeah, it's very difficult to describe, I think accurately, because it's like no other feeling."}, {"time": 5131, "text": "Musically, how is it different than playing in a garage with the band by yourself practicing?"}, {"time": 5138, "text": "Like, do you feel like you're creating something different when you got the guitar and the amp and just the sound dissipating out and everybody's listening, is that?"}, {"time": 5152, "text": "It's, listen, the first time we did it and there's nobody in the stadium, first time I ever played in the stadium."}, {"time": 5159, "text": "And I'm just like, I'm out there in front and just hitting different chords and playing different licks."}, {"time": 5166, "text": "And I'm like, it's like I won a contest and I get to do this."}, {"time": 5171, "text": "But what's different about it, and each venue is different."}, {"time": 5176, "text": "So if you, we went on the road with ZZ Top a few years ago, which was incredible."}, {"time": 5182, "text": "Love Billy Gibbons, he's a Texan."}, {"time": 5185, "text": "Incredible person and guitar player."}, {"time": 5188, "text": "But when you're playing in like five to 7,000 seats, it's really, I mean, it's, you're right there with them, with the crowd."}, {"time": 5197, "text": "And then when you play in an arena, we toured with Bob Seger on his last tour, which was cool."}, {"time": 5204, "text": "Played some shows with him."}, {"time": 5207, "text": "And again, the arena, like they're all kind of packed on top of you."}, {"time": 5211, "text": "And it's super loud, which was cool."}, {"time": 5215, "text": "Meaning the crowd is, stadiums is a completely different animal."}, {"time": 5219, "text": "And it's just a completely different experience."}, {"time": 5225, "text": "Do you enjoy it versus like a smaller room?"}, {"time": 5229, "text": "What, as a guitarist, as a musician, what's your favorite like room to play of the size?"}, {"time": 5236, "text": "Any room that'll have me."}, {"time": 5237, "text": "You know, look, I think arenas are the perfect blend."}, {"time": 5243, "text": "If I had to say, because it's loud and, you know, 20, 30,000 people, but like right up, right up on you."}, {"time": 5251, "text": "A stadium, look, playing the stadiums with the Rolling Stones, it just is gonna go on the head marker somewhere is one of the more, you know, I say this, and I really mean it."}, {"time": 5263, "text": "My life is like a punked episode that just hasn't, no one's burst in yet, but yeah, it's as cool as you think it is."}, {"time": 5273, "text": "So 60 years, how do you think Mick Jagger still got it?"}, {"time": 5278, "text": "How do you explain it?"}, {"time": 5279, "text": "I gotta tell you something."}, {"time": 5280, "text": "I mean, the funny thing is whatever, wherever there is excellence, people wanna know how'd you do it, right?"}, {"time": 5289, "text": "What's the secret?"}, {"time": 5292, "text": "Not only is Mick Jagger, and I think the songs that Keith Richards and Mick Jagger wrote together, if you go back and listen to the lyrics, it's just incredibly poignant, and I'm just a huge Stones fan, so, but he works out like a maniac, right?"}, {"time": 5312, "text": "And it's that 10,000 hours thing, and it's that, hey, maybe I don't feel my best today, but I'm gonna get up and do my routine and work out so that at his age, which, I mean, you can look at people at different ages chronologically that are, maybe we're both at this age, but I'm a lot older than you are, and vice versa."}, {"time": 5337, "text": "And he just, I think it's the combination of raw talent and the ability, and he's very smart, right?"}, {"time": 5346, "text": "Like he understands how to have interaction with a crowd and hold them in the palm of his hand and be an entertainer, but then on top of that, the reason he can at this age run around stadiums and be just as energetic is he puts the work in."}, {"time": 5362, "text": "And that's one thing, step that I think a lot of people miss sometimes, where they want that magic trick, they wanna know what's the shortcut."}, {"time": 5370, "text": "Most of the time, the answer is there's no shortcut."}, {"time": 5372, "text": "Yeah, you have to work hard on the way there and work hard to stay on top."}, {"time": 5380, "text": "And sometimes it's not even like work hard, it's just like be a professional, which that involves, in his case, at his age, with the amount of stuff you have to do on stage and the way he does it."}, {"time": 5393, "text": "For two hours."}, {"time": 5393, "text": "You have, this is a professional athlete."}, {"time": 5398, "text": "A professional athlete that has to do things that are probably designed for 20 year olds and 30 year olds has to do it at an older age, which means what do you have to do?"}, {"time": 5408, "text": "Well, he probably has a whole physical routine he has to do."}, {"time": 5412, "text": "Diet, the whole thing."}, {"time": 5413, "text": "And it's hard, look, if you wanna do great things, you probably have to do hard things to get there."}, {"time": 5420, "text": "I'm not gonna make you pick, just stick on the stones for one more minute."}, {"time": 5426, "text": "But what are some great Rolling Stones songs that were impactful to you, lyrically, musically, maybe something you like playing, like air guitar."}, {"time": 5443, "text": "Probably my favorites, I love Sympathy for the Devil."}, {"time": 5447, "text": "It's a very, I don't know, sort of Faustian."}, {"time": 5451, "text": "I love the lyrics."}, {"time": 5452, "text": "I love how the, almost a voodoo beat just kind of builds throughout the song."}, {"time": 5458, "text": "That's always been one of my favorites."}, {"time": 5460, "text": "So in that song, he never mentions Devil, does he?"}, {"time": 5462, "text": "No, wait, sorry."}, {"time": 5464, "text": "Like, you know my name."}, {"time": 5468, "text": "There's like a flirtation going on in the lyrics."}, {"time": 5472, "text": "Yeah, here's all the trouble I've caused along the way with you humans."}, {"time": 5476, "text": "And I just think it's really, really great."}, {"time": 5478, "text": "And musically, it builds really nicely."}, {"time": 5481, "text": "And it's like both fun and dark."}, {"time": 5484, "text": "It's a, there's a playful nature to it."}, {"time": 5490, "text": "It's, that's very stones."}, {"time": 5493, "text": "The only, they can pull it off because it's like playful, but it's also like dark and dangerous, dangerous, dangerous."}, {"time": 5500, "text": "And Gimme Shelter is just, you know, and to this day, when I listen to the studio version and Mary Clayton just comes on and sings that epic, iconic part."}, {"time": 5515, "text": "And there's a documentary that was done about backup singers, phenomenal."}, {"time": 5522, "text": "And it tells the story of that moment in that song with Mary Clayton."}, {"time": 5528, "text": "And it's just her voice and the way it unfolded, they got her out of bed at like 10 o clock at night in LA."}, {"time": 5535, "text": "And she's like the Rolling Stones, and went in and just killed it."}, {"time": 5540, "text": "And I can't sing at all."}, {"time": 5543, "text": "I'm by ordinance not allowed around a microphone."}, {"time": 5546, "text": "So I'm always in awe when someone can sing like that."}, {"time": 5552, "text": "But, you know, those are, those are some of my favorite Rolling Stones songs and Painted Black's awesome."}, {"time": 5561, "text": "I mean, I could go on and on."}, {"time": 5562, "text": "Yeah, Painted Black is great."}, {"time": 5564, "text": "Again, a song that builds as bad as, I mean, it defines a whole generation."}, {"time": 5568, "text": "What made you pick up a guitar?"}, {"time": 5569, "text": "What made you fall in love with the guitar?"}, {"time": 5572, "text": "It's just the coolest instrument, right?"}, {"time": 5575, "text": "I mean, when you watched back then, and I was kind of an old soul."}, {"time": 5581, "text": "I was listening at a fairly young age to Muddy Waters, Robert Johnson, Lightning Hopkins, BB King, and just the soulfulness."}, {"time": 5594, "text": "Thrills gone."}, {"time": 5596, "text": "Oh my, I mean, BB plays five notes and just kills it and the emotion that it evokes."}, {"time": 5604, "text": "So I just was just in awe of the instrument."}, {"time": 5609, "text": "And I also, there's always somebody around who's a musician that just picks the instrument up and can play, right?"}, {"time": 5619, "text": "And they're just so talented at it."}, {"time": 5621, "text": "And they can just listen to a record and play it."}, {"time": 5623, "text": "That was never me."}, {"time": 5625, "text": "I never took formal lessons."}, {"time": 5627, "text": "I had to grind to just make it sound like I wanted it to sound."}, {"time": 5634, "text": "So both technically and ear, everything was hard work."}, {"time": 5638, "text": "Yeah, I mean, I could hear it and what they call, you know, you play."}, {"time": 5644, "text": "So my right hand, the rhythm side of it is, that's probably if I have anything, my strength."}, {"time": 5653, "text": "But there's something pretty amazing that happens when you get together with other people and play a song in that moment where it hits the pocket and you all kind of know it."}, {"time": 5667, "text": "And it's just such a cool feeling."}, {"time": 5671, "text": "And it was interesting growing up because I was, again, I always had eclectic interests."}, {"time": 5676, "text": "So I loved math and physics and science."}, {"time": 5678, "text": "So I had those friends and I was an athlete and played football and baseball and basketball."}, {"time": 5683, "text": "So I had my jock friends, and then I had my music friends and so it was just kind of that."}, {"time": 5691, "text": "And so when I was still living in Los Angeles and had Legendary, I just missed playing."}, {"time": 5701, "text": "And so I put this band together and called it the Ghost Hounds because again, huge Robert Johnson fan and that legend of Robert Johnson selling his soul at the crossroads in exchange for his musical talent."}, {"time": 5717, "text": "And you guys have that in one of the videos."}, {"time": 5719, "text": "Such a cool video."}, {"time": 5720, "text": "Exactly, so I just thought that's such cool lore."}, {"time": 5726, "text": "I just love the blues."}, {"time": 5728, "text": "So Robert Johnson would often talk about hellhounds on his trail."}, {"time": 5733, "text": "And so I always just thought, huh, what about ghost towns?"}, {"time": 5737, "text": "So I wish it were a more clever, deeper story, but that's about it for the name."}, {"time": 5743, "text": "That's pretty deep, Robert Johnson's incredible."}, {"time": 5745, "text": "But you also talk about that you connect to the storytelling of blues."}, {"time": 5750, "text": "So what makes a good story in a song?"}, {"time": 5753, "text": "Like what aspect of storytelling connects with you in song?"}, {"time": 5757, "text": "So I'm a big lyrics guy too."}, {"time": 5759, "text": "I love like deep lyric people like Tom Waits and like people that are like Leonard Cohen, like even Bob Dylan, they're like obviously, it's poetry."}, {"time": 5772, "text": "And then there's some people like the Rolling Stones there."}, {"time": 5775, "text": "It's like seemingly simpler, but it's still so much more to it."}, {"time": 5780, "text": "It's like less is often more."}, {"time": 5783, "text": "It still tells a strong story."}, {"time": 5785, "text": "Yeah, and there's certain people and Jagger and Mick Jagger and Keith Richards are in this boat."}, {"time": 5791, "text": "Billy Gibbons is in this boat."}, {"time": 5792, "text": "They just say things in a certain way that are just cool, right?"}, {"time": 5797, "text": "It's just, and so I write our music and lyrics."}, {"time": 5802, "text": "I have to tell a story."}, {"time": 5804, "text": "I have to know the characters in the song."}, {"time": 5806, "text": "I'm not good at just writing some rhymes and having it match up to the right key and the right music."}, {"time": 5812, "text": "I have to understand like, that's just me."}, {"time": 5816, "text": "And so I think that, look, if you have three or four minutes to tell a story, you have to be more efficient with your use of language."}, {"time": 5827, "text": "And you have to understand what you're building to it understand what you're building to, if anything, and evoke emotion."}, {"time": 5835, "text": "And hopefully for those three minutes, get the listener to understand not only the point of the song, but where you're coming from and to make you feel a certain way."}, {"time": 5848, "text": "There's a song that the audience has seemed to like a lot on the new album called Good Old Days."}, {"time": 5854, "text": "And I wrote that because especially during COVID and reflecting on what normalcy looks like and what happens when you're cut off, I just was kind of taken with this idea of that when you sit around and reminisce with friends, oftentimes it's not just like some big event happened."}, {"time": 5879, "text": "It's, remember that summer, we'd go up to the lake all the time and it's who you were with."}, {"time": 5885, "text": "And at the time, it probably seemed pretty pedestrian."}, {"time": 5889, "text": "It just seemed like kind of a normal day, but it was the company you were keeping."}, {"time": 5893, "text": "It was the time in your life."}, {"time": 5895, "text": "It was whatever it was."}, {"time": 5897, "text": "And I just kind of struck me that right now we're doing stuff that you're gonna reminisce about later that seems kind of ordinary to be like, man, that was such a great time."}, {"time": 5909, "text": "So the idea is be in the moment and all that stuff."}, {"time": 5911, "text": "But these are the good old days."}, {"time": 5914, "text": "And enjoy it and soak it in and kind of be present for it."}, {"time": 5919, "text": "Yeah, it's a great perspective to take on the present because we are in the thing that we'll remember."}, {"time": 5924, "text": "We're living through the thing we'll remember."}, {"time": 5926, "text": "And sometimes the things we'll remember is the simple stuff, the little stuff."}, {"time": 5932, "text": "Outside of Keith Richards, who is the greatest, ridiculous question, but just indulge me, who is the greatest blues guitarist of all time, rock guitarist of all time?"}, {"time": 5945, "text": "Well, you got a little bit of a hybrid with Jimi Hendrix, right?"}, {"time": 5948, "text": "Because he played the blues and he played rock and roll."}, {"time": 5951, "text": "So I think most guitarists would say Jimi Hendrix was pretty ridiculous."}, {"time": 5957, "text": "That probably for me, I'm a huge, huge, huge Hendrix fan to play."}, {"time": 5961, "text": "He can't, I mean, even to this day, I don't care, technology, pedals, whatever, he just somehow fused with the instrument."}, {"time": 5971, "text": "I can't be sitting here in Austin, Texas without mentioning one of the great guitar players of all time, Stevie Ray Vaughn."}, {"time": 5980, "text": "See, that's how, I know you're like a rock star."}, {"time": 5982, "text": "You're sucking up to the audience."}, {"time": 5983, "text": "Well, no, you have listeners all over the place, but Stevie Ray Vaughn is another one of those."}, {"time": 5991, "text": "That is incredible."}, {"time": 5991, "text": "Just blows me away."}, {"time": 5995, "text": "And then with the older guys, BB King, Hubert Sumlin, Clapton."}, {"time": 6001, "text": "I saw him on his last tour and just walked out on my, just like unbelievable how he still sounds."}, {"time": 6014, "text": "And both electric and acoustic, just so strange."}, {"time": 6018, "text": "Absolute master."}, {"time": 6020, "text": "And the greatest storyteller, you mentioned Bob Seger."}, {"time": 6023, "text": "That's an interesting one."}, {"time": 6026, "text": "He almost doesn't get enough credit, I feel like, for how great he is."}, {"time": 6031, "text": "Obviously he's super famous, but."}, {"time": 6033, "text": "No, he's, and his voice."}, {"time": 6036, "text": "I also, I had the privilege of getting friendly with John Fogerty, you know, John Fogerty and CCR fame."}, {"time": 6043, "text": "And he's another one that's just the way he phrases things."}, {"time": 6048, "text": "And you just look at the catalog of stuff he wrote."}, {"time": 6052, "text": "Amazing talent."}, {"time": 6054, "text": "I read Bruce Springsteen's book and was, I'm a fan, but after reading the book, it was really, you go back and listen to his lyrics and the way he pours himself out is pretty incredible."}, {"time": 6073, "text": "And then again, with the old blues guys, I just think the emotion they could get out of playing like, staying on the one, right?"}, {"time": 6083, "text": "Just playing the same rhythm."}, {"time": 6085, "text": "John Lee Hooker."}, {"time": 6087, "text": "You listen to Manish Boy by Muddy Waters and it's just, there's something so, it just draws me in every time."}, {"time": 6098, "text": "And the emotion they're able to get out of things."}, {"time": 6102, "text": "And I'm also a huge Chuck Berry fan."}, {"time": 6104, "text": "I just think that sound is, I love it."}, {"time": 6108, "text": "Do you know how to play Johnny B. Goode?"}, {"time": 6115, "text": "Maybe one of the great moments, at least of my childhood, was back to the future and watching Michael J."}, {"time": 6119, "text": "Fox plug in and then at the end, play at the dance to save his parents with Johnny B. Goode, pretty awesome."}, {"time": 6131, "text": "Yeah, the guitar is so much more than a musical instrument."}, {"time": 6134, "text": "It feels like, it's like the, in the 20th century, it's like the car."}, {"time": 6140, "text": "Like it defines so much of Hollywood, so much of a generation of what it means to be, I don't know, what it means to be a man, what it means to be a human in America."}, {"time": 6152, "text": "Emblematic to me of a certain type of music."}, {"time": 6157, "text": "And that's, I made a documentary years ago called It Might Get Loud with Jimmy Page, The Edge."}, {"time": 6163, "text": "I highly recommend that everybody watch that documentary."}, {"time": 6166, "text": "It's an incredible celebration of the guitar."}, {"time": 6168, "text": "Yeah, it says Jimmy Page, Jack White from White Stripes."}, {"time": 6173, "text": "The Edge."}, {"time": 6174, "text": "And The Edge from U2."}, {"time": 6177, "text": "Well, now you have to tell the story of that one because how the heck did that all come together?"}, {"time": 6182, "text": "Because it's so fascinating, such different musicians all coming together, talking about their story, talking about how they approach the music and also playing together a little bit in this casual kind of setting."}, {"time": 6195, "text": "Well, look, one day I came downstairs and the Rolling Stone magazine is sitting there and it was the 50 top guitarists of all time, their list."}, {"time": 6205, "text": "And then I had some other financial report with video games and the top video game at the time was Guitar Hero, right?"}, {"time": 6212, "text": "And then there was a third thing, I can't recall it, but I just, and I said to myself, what is it about the guitar that is so central to the rock and roll, whatever you wanna call it?"}, {"time": 6225, "text": "Like, why is that the symbol?"}, {"time": 6226, "text": "And I said to myself, I wanna ask Jimmy Page why he picked up the guitar, because he's Jimmy Page, right?"}, {"time": 6236, "text": "And so I called a friend of mine, Davis Guggenheim, who had directed Inconvenient Truth, and I think still is, but at the time was the biggest documentary ever."}, {"time": 6246, "text": "And I called Davis and I said, look, I have this idea."}, {"time": 6249, "text": "I wanna make this movie about the guitar, about different eras and styles and whatever, but I've never made a documentary."}, {"time": 6256, "text": "I don't know how to do that."}, {"time": 6258, "text": "So I was just looking for advice."}, {"time": 6260, "text": "And thankfully, because he's one of the best documentarians ever, Davis is like, you know what, I can't get this out of my head."}, {"time": 6269, "text": "I'll direct it, which was amazing."}, {"time": 6272, "text": "And we wrote three names down that represented different eras and different styles."}, {"time": 6278, "text": "Rarely do you get, you go three for three, but it was those three guys."}, {"time": 6284, "text": "And it was just such a incredible experience to sit there and get to know Jimmy Page."}, {"time": 6293, "text": "You know, I mean, it was like, and he was like Gandalf, man."}, {"time": 6297, "text": "He was like always Jimmy Page."}, {"time": 6300, "text": "And... That was so cool to see him."}, {"time": 6303, "text": "Gandalf was, there's like a wisdom, there's a calmness to him compared to like the restlessness of Jack White."}, {"time": 6312, "text": "Like the, I mean, that combination was just fascinating."}, {"time": 6316, "text": "It was one of the coolest experiences ever."}, {"time": 6319, "text": "And one of the things, there was a moment where Jimmy, he was going through his guitar case and he had the double neck from stairway to heaven and he handed it to me and I was like, mm hmm."}, {"time": 6332, "text": "I mean, it's like somebody handing you X caliber or something."}, {"time": 6336, "text": "Amazing experience."}, {"time": 6338, "text": "And The Edge, one of the kindest human beings you'll ever meet in your life."}, {"time": 6342, "text": "Just an amazing person."}, {"time": 6344, "text": "And I think he hit it right on the head with Jack is he's got that energy, you know, and constantly pushing himself."}, {"time": 6352, "text": "But it's hard to believe it's been, I think 10 or 11 or maybe even 12 years since it came out, but."}, {"time": 6358, "text": "After watching it, I realized like how much it was needed."}, {"time": 6362, "text": "And I was almost surprised it didn't already exist."}, {"time": 6367, "text": "It was like, yeah, the guitar wasn't quite celebrated like explicitly."}, {"time": 6373, "text": "We almost didn't acknowledge it."}, {"time": 6375, "text": "How important it was culturally."}, {"time": 6377, "text": "It's kind of amazing."}, {"time": 6378, "text": "And the way it closed from the song, the."}, {"time": 6380, "text": "The Wait."}, {"time": 6381, "text": "It was called The Wait, yeah, by the band."}, {"time": 6384, "text": "That's because they didn't want to go home."}, {"time": 6386, "text": "We were shooting on a Warner Brothers soundstage for three days when we called it The Summit where the three of them came together."}, {"time": 6394, "text": "And the two things I'll never forget is when Jimmy starts to play the riff from Whole Lotta Love."}, {"time": 6401, "text": "Edge and Jack ceased to be rock, you know, rock gods or whatever, and had the same 15 year old kid feeling that I did."}, {"time": 6411, "text": "You could see in their face."}, {"time": 6413, "text": "And then at the end, they're like, hey, can we play?"}, {"time": 6415, "text": "We just want to, we don't want to go."}, {"time": 6417, "text": "Can we just play something acoustically?"}, {"time": 6419, "text": "So we printed out the lyrics."}, {"time": 6420, "text": "That's what they wanted to play."}, {"time": 6421, "text": "And they just sat there and sat on those couches and just."}, {"time": 6426, "text": "Such a good way to end."}, {"time": 6429, "text": "What's your guitar rig setup like?"}, {"time": 6432, "text": "You have a few guitars."}, {"time": 6435, "text": "First, let's just put on the line."}, {"time": 6437, "text": "So what's better, Les Paul or Strat?"}, {"time": 6441, "text": "Well, I'm not going to get into what's better because I'm sure that'll start a flood of whatever."}, {"time": 6447, "text": "I'm going to say it's Strat."}, {"time": 6450, "text": "I'm a Les Paul."}, {"time": 6451, "text": "My main instrument is a Les Paul."}, {"time": 6454, "text": "But I, okay, let me just put it on the table."}, {"time": 6456, "text": "I'm speaking as somebody who literally, I don't think I've ever actually strummed a chord on a Les Paul."}, {"time": 6462, "text": "So I've been, maybe I'm uninitiated."}, {"time": 6466, "text": "So I don't, I don't speak from experience, but it's probably because of Hendrix is so deeply influenced by Hendrix that I just kind of follow in his footsteps and clap them and so on."}, {"time": 6476, "text": "The amazing thing to me is if you look back at Leo Fender and what the Gibson Guitar Company and Les Paul did in the fifties, those are still the shapes and the perfect thing today, right?"}, {"time": 6489, "text": "The Strat and the Telecaster and the Les Paul."}, {"time": 6492, "text": "And it's, they got it right way back, way back then."}, {"time": 6495, "text": "So I have my main guitar, you got to name your guitar."}, {"time": 6501, "text": "So my main guitar is named Hazel and it's a 59 Les Paul."}, {"time": 6506, "text": "And there's something magical in that year, like a Stradivarius and they're just, there's something different about them."}, {"time": 6516, "text": "So I play that and then I play it through sort of my main rig is either a 59 Fender Twin or a 65 Marshall."}, {"time": 6530, "text": "And then when we're on the road now, cause when you use older vintage stuff, you just got to be super careful with the tubes and everything, it has to be reliable."}, {"time": 6538, "text": "So very nicely, the guys from Two Rock sent me some of their amps and they're really, cause I don't use any new stuff, but the Two Rock stuff is pretty great."}, {"time": 6547, "text": "So that's actually what I'm using."}, {"time": 6548, "text": "Oh, it gets close to the sound that you like with the Marshall."}, {"time": 6551, "text": "Yeah, it's new and reliable."}, {"time": 6554, "text": "So that's what I'm using on the road right now."}, {"time": 6555, "text": "Do people use like emulation?"}, {"time": 6557, "text": "Do they use software?"}, {"time": 6558, "text": "Is it still?"}, {"time": 6560, "text": "I personally don't, I go, I don't have many pedals."}, {"time": 6563, "text": "I use a Klon, an old vintage Klon straight into the amp."}, {"time": 6568, "text": "As old school as possible."}, {"time": 6570, "text": "Is there other cool guitars you have that kind of stand out?"}, {"time": 6574, "text": "I have a bunch of what they call Blackguard Telecasters from the 50s, which are pretty great."}, {"time": 6582, "text": "What are those, Blackguard Telecasters?"}, {"time": 6584, "text": "Yeah, so they just, you know, it's in the 50s."}, {"time": 6585, "text": "Oh, they actually legit have a Blackguard."}, {"time": 6587, "text": "Pickguard."}, {"time": 6589, "text": "But they're incredible, so."}, {"time": 6591, "text": "What's the color of the Telecaster itself?"}, {"time": 6593, "text": "Most of them are yellow with black and then they got into different configurations, but there's something, I have a 51 Telecaster that I play in Open G, and in songs with Open G, that just, again, there's something, you know, and I'll take all the help I can get in terms of making it sound great."}, {"time": 6613, "text": "So I'll try to find the magic ones."}, {"time": 6615, "text": "What's your writing process like for the music and the lyrics?"}, {"time": 6621, "text": "Is there, do you have to go to the mountains?"}, {"time": 6626, "text": "Is there whiskey involved?"}, {"time": 6627, "text": "What do you have to do?"}, {"time": 6628, "text": "Or do you just write a little bit whenever you have a moment of free time?"}, {"time": 6631, "text": "I'm a boring guy, because I don't drink."}, {"time": 6633, "text": "I don't, I just, I figure I can screw things up plenty on my own without adding anything."}, {"time": 6639, "text": "It's a good call."}, {"time": 6640, "text": "But, you know, for me, it either starts with a riff, just something that I think is an interesting, you know, riff or tone that I can kind of sink my teeth into a little bit."}, {"time": 6655, "text": "And a lot of times I'll write a title and love a title and then start to back it up."}, {"time": 6662, "text": "So the title is almost like an idea."}, {"time": 6664, "text": "Yeah, like this is where I want to be and then start kind of writing it out."}, {"time": 6670, "text": "And again, I just have to know, am I writing from a character's point of view?"}, {"time": 6676, "text": "Am I writing about someone or something, you know, as like the narrator?"}, {"time": 6682, "text": "And, you know, what is this person?"}, {"time": 6683, "text": "Are they happy?"}, {"time": 6684, "text": "Are they sad?"}, {"time": 6686, "text": "Where are they in life?"}, {"time": 6687, "text": "I don't know if all that, like, great writers, I'm sure, would say, why don't you just write?"}, {"time": 6694, "text": "You don't need all that."}, {"time": 6696, "text": "But that's, for me, that's my process."}, {"time": 6698, "text": "Well, I'm not so sure about that."}, {"time": 6699, "text": "I bet you quite a lot of writers have created a world in their mind before they even put the simplest of words down."}, {"time": 6708, "text": "So yeah, there's quite a lot to that."}, {"time": 6714, "text": "What's your favorite song to play?"}, {"time": 6717, "text": "Is there some favorite ones you go to?"}, {"time": 6720, "text": "But both play and kind of, I'm sure you love singing."}, {"time": 6725, "text": "No, you don't?"}, {"time": 6726, "text": "I'm not, I'm neither talented nor do I have the desire."}, {"time": 6730, "text": "And I think, you know, if you come see the show, you won't see a microphone anywhere near me."}, {"time": 6736, "text": "But do you, I mean, do you hear, like when you're thinking about lyrics, do you hear the idea of the words?"}, {"time": 6742, "text": "And especially what's great with Trey is I write for his voice."}, {"time": 6748, "text": "And then we have these amazing backup singers that are just, and I can hear all of it, I just can't do it."}, {"time": 6757, "text": "And so I'd say of our stuff, there's a song called Half My Fault that I play in Open G that just, I love playing the song."}, {"time": 6769, "text": "I love that energy."}, {"time": 6770, "text": "And then there's, we have a new blues album coming out and there's a song called Baby We're Through and it just stays on the one."}, {"time": 6781, "text": "And if for non musicians, that means, like in a lot of rock and roll and blues, it's what's called a one, four, five progression from your kind of root note."}, {"time": 6791, "text": "And you would hear, if you're a non musician, if you heard it, you'd be like, oh yeah, that's a lot of songs."}, {"time": 6796, "text": "And this song just stays on the same groove."}, {"time": 6798, "text": "Like La Grange or Shake Your Hips or any of those songs."}, {"time": 6803, "text": "And it's just got this unbelievable energy and it's fun to play, but I have to keep the same rhythmic thing going for the whole song."}, {"time": 6812, "text": "With that simplicity, I mean, the personality of the song can really shine."}, {"time": 6816, "text": "I mean, Trey's, I mean, that guy, really cool."}, {"time": 6822, "text": "He just comes through."}, {"time": 6824, "text": "I mean, I guess you need that from a lead singer."}, {"time": 6825, "text": "He's just, he's just."}, {"time": 6827, "text": "You gotta have that, and my other guitar player, Johnny Bob is, he's a phenomenal, I mean, like a legitimate guitar slinger."}, {"time": 6838, "text": "You know, we probably split the leads 70, 30, and he is just, you know, there's times sometimes I look over at him and I'm like, I'm being a fan right now because what you just laid down is pretty good."}, {"time": 6852, "text": "From a lead perspective, what's the most fun thing to play?"}, {"time": 6856, "text": "What kind of stuff do you, do you like slow?"}, {"time": 6858, "text": "Do you like, I mean, if you, like, thrill is gone."}, {"time": 6861, "text": "So if you look at B.B."}, {"time": 6861, "text": "King, sometimes one note just bending the shit out of that."}, {"time": 6865, "text": "What do you call that, vibrato?"}, {"time": 6867, "text": "If I'm gonna play the lead, it's a certain kind of feel."}, {"time": 6870, "text": "Slow blues is probably my favorite to play, or something that's got a little more of that Chuck Berry drive where you can be rhythmic in the lead."}, {"time": 6881, "text": "You know, I can't, the shredding thing that those guys do is, that's not my."}, {"time": 6887, "text": "I was actually always able to do that really well."}, {"time": 6891, "text": "Like, you mentioned people that pick up fast, like, maybe it's the classical piano training."}, {"time": 6895, "text": "I can play super fast on guitar, super technical."}, {"time": 6898, "text": "But to me, the hardest thing and my favorite thing is just, it's probably less to do with the guitar, more living on life that's worth playing a guitar for."}, {"time": 6910, "text": "It's like a certain kind of emotion that you can put into the notes."}, {"time": 6915, "text": "And that has to do with bending notes well."}, {"time": 6917, "text": "Like, bending notes is a whole other art form of, I worked surprisingly a long time on Comfortably Numb."}, {"time": 6928, "text": "And there's, so David Gilmour, there's a lot of bending."}, {"time": 6931, "text": "And they're simple, they sound simple."}, {"time": 6935, "text": "But the dynamics of them, to express like a build up in the way it's held and there's often a vibrato at the top for a bit."}, {"time": 6946, "text": "Just that, it's almost like a sigh and a sigh of relief and the build up."}, {"time": 6954, "text": "I mean, that's an art form for him that's hard to get right."}, {"time": 6958, "text": "It's not just playing a note, playing a note, playing a note, it's in that like dynamic movement of a note that so much can happen."}, {"time": 6966, "text": "That's where the blues happens to."}, {"time": 6968, "text": "Look, I'm a huge Freddie King fan too, right?"}, {"time": 6971, "text": "And you listen to these guys and they're, you sit there and they're like, man, you're playing in a small range on the neck."}, {"time": 6982, "text": "But, you know, it's like, I know the notes you're playing and I'm playing them too, but not like that, right?"}, {"time": 6990, "text": "I mean, it's, and Gilmour is certainly one of those guys that's an incredible guitar player."}, {"time": 6995, "text": "And yet another chapter of an amazing life."}, {"time": 7000, "text": "You love football, like you mentioned."}, {"time": 7001, "text": "You play football?"}, {"time": 7003, "text": "What position do you play?"}, {"time": 7008, "text": "So, maybe we can talk a little bit about your love of football and the fact that you are part owner of the Pittsburgh Steelers."}, {"time": 7021, "text": "So, I mean, where do we start?"}, {"time": 7022, "text": "You start at the beginning, let's start at the end."}, {"time": 7025, "text": "Why the Steelers?"}, {"time": 7026, "text": "What attracted you to the, first of all, I think not to be controversial, but one of the best uniforms in football in terms of just the black and gold, just."}, {"time": 7039, "text": "Decal only on one side."}, {"time": 7041, "text": "Yeah, the helmet."}, {"time": 7043, "text": "Look, I've bled black and gold since I was a little boy."}, {"time": 7047, "text": "I grew up in upstate New York."}, {"time": 7049, "text": "And the first football game I ever saw was the Steelers in the Super Bowl is a really little kit."}, {"time": 7055, "text": "And it just, I mean, Jack Lambert and Joe Green and Franco Harris and those guys were like, came down from Olympia, Mount Olympus or something."}, {"time": 7065, "text": "And I just was enamored with the team."}, {"time": 7068, "text": "And because we only had three channels, the only time I'd get to see them is occasionally when they were the game of the week or something."}, {"time": 7077, "text": "And I just loved to me what they stood for, the toughness and they played football the way that I thought was great."}, {"time": 7088, "text": "I was a huge Jack Lambert fan, our Hall of Fame linebacker who just intimidated everybody."}, {"time": 7095, "text": "So that was like the, that was the decade of the steel curtain."}, {"time": 7101, "text": "I mean, arguably one of the great sort of defensive in football history and also one of the greatest football teams period of in football history."}, {"time": 7112, "text": "I've been a lifelong fan and was very fortunate to meet Mr. Rooney."}, {"time": 7119, "text": "The Rooney family started the team in 1933, got to know him and just was asked to be part of the ownership group."}, {"time": 7129, "text": "I think it was the end of 2007, first year as part of the group in 2008, we won the Super Bowl."}, {"time": 7136, "text": "And it was like beyond surreal and just beyond surreal."}, {"time": 7141, "text": "And it's amazing to be able to do."}, {"time": 7147, "text": "I mean, the Rooney family is one of those most revered in sports for the way they conduct themselves."}, {"time": 7156, "text": "Mr. Rooney passed away, I think five years ago now and we lost him, but was a champion, helped build the league."}, {"time": 7163, "text": "I mean, put the league as we know it together."}, {"time": 7167, "text": "More importantly, it was a civil rights champion who created what we now call the Rooney rule to make sure that we're being fair about giving minority coaches a chance to get hired."}, {"time": 7180, "text": "And just is one of the most kind and amazing human beings I ever met."}, {"time": 7187, "text": "It's incredible what sport does."}, {"time": 7191, "text": "Like to bring out the best in people, to give people hope, to inspire people."}, {"time": 7198, "text": "There's something about football that has all the elements of a great sport."}, {"time": 7204, "text": "It's the teamwork, it's the sort of the combat aspect of it."}, {"time": 7210, "text": "It's like, it's the purity of it."}, {"time": 7211, "text": "It's of like strength and power and speed and all the elements of like last minute, close calls required to win the game."}, {"time": 7225, "text": "And where referee decisions, of course, that's essential for a sport can screw up the whole thing."}, {"time": 7230, "text": "Just got all of it together."}, {"time": 7232, "text": "I think just, I don't know, it gives the drama and the triumphs are just beautiful."}, {"time": 7240, "text": "Like some of my favorite memories, I don't know if it's an accident or this is common with people, it's just with friends watching football and connecting over that."}, {"time": 7251, "text": "Yeah, well, look, it's an incredible game because there's nowhere to hide, right?"}, {"time": 7256, "text": "You're out there on the field."}, {"time": 7257, "text": "You know, it's a great game that requires not only all those attributes that you said, but it's incredibly complex game."}, {"time": 7267, "text": "So if you don't know what you're looking at and you don't understand how complex defenses are trying to disguise what they're doing, offenses are trying to overcome that and you can set up one play the entire game, but a team that plays well together, right?"}, {"time": 7286, "text": "Knows their plays inside and out, knows their assignments inside and out, can overcome and beat a more physically gifted team because of that aspect of working together."}, {"time": 7298, "text": "One of the things that I always loved about sports is just you're out there, there's a set of rules and there's a scoreboard."}, {"time": 7308, "text": "So at the end of that game, it says, and you can make excuses about the refs or this happened or that happened, but at the end of the day, did you go out and compete?"}, {"time": 7321, "text": "And when you went out and were a competitor, how did it work out, right?"}, {"time": 7327, "text": "And the simplicity of that and the purity of that is something that I always have been drawn to."}, {"time": 7335, "text": "What about the business of sort of owning a team or putting together a team or trying to like build up a team that's going to be a great team?"}, {"time": 7343, "text": "Like what are some interesting aspects that people might not realize that you can carry over from all the other experience you have in business?"}, {"time": 7352, "text": "I think the hardest thing about professional sports, right now it's individuals getting paid money to play a sport, which is different than, it's certainly different than amateur."}, {"time": 7365, "text": "And the decisions that are hard is when you get to know somebody who's a player on the team and either they're at the end of their career or you need to go in a different direction and that person who's done everything that you've asked, whatever the coaches have asked of that person and you get close to them."}, {"time": 7385, "text": "And then when they have to be traded, released or whatever happens, it's, that's sad."}, {"time": 7392, "text": "And being able to stand back and in some ways be dispassionate and not be a fan, right?"}, {"time": 7400, "text": "There's a, I'm on the baseball hall of fame board and one of the guys that's on the board of me is Jerry Reinsdorf."}, {"time": 7410, "text": "And I think it was Jerry who said, if you act like a fan, you'll be sitting with them, which I thought was kind of funny."}, {"time": 7417, "text": "Well, I got to push back on that a little bit as a, by way of a fan asking a dumb question."}, {"time": 7427, "text": "Okay, let me just give some examples."}, {"time": 7429, "text": "It's very common in sport."}, {"time": 7431, "text": "It's funny you said this example of like certain great players going to another team right at the end of their career."}, {"time": 7440, "text": "And it always makes me sad."}, {"time": 7443, "text": "It almost makes me want to wish that he kind of retired right there from a perspective of just like, do you ever, as a owner, but just in that space, think about like the Steelers in the full arc of human history."}, {"time": 7461, "text": "So not like as a business."}, {"time": 7463, "text": "I mean, okay, this question might be absurd."}, {"time": 7466, "text": "I don't have to think about it as a business."}, {"time": 7468, "text": "You know, I'm a minority owner, so I can think about it almost as a fan, but I'm sorry, go ahead."}, {"time": 7474, "text": "Yeah, well, that's what I mean."}, {"time": 7475, "text": "I suppose this is a dumb question to think of, like of a business in that way, not just investment, but like legacy of like what footprint would you leave on this world, on this history?"}, {"time": 7492, "text": "That is one thing that I can say unequivocally, and I only have the experience that I have."}, {"time": 7499, "text": "But one of the things that I'm so proud of about the way the Steelers conduct themselves is, and that's the Rooney family, that's the legacy of the Rooney family, is asking constantly about what's right for the league, what's right for the players, what's the right thing to do here?"}, {"time": 7519, "text": "And that's something that I would hear Mr. Rooney say all the time."}, {"time": 7523, "text": "So I think that legacy is important because ultimately the team belongs to that city, right?"}, {"time": 7529, "text": "Belongs to those fans and the owners are the custodians of that."}, {"time": 7535, "text": "So I think, and when you realize what sports teams mean to the fans, the memories that it creates, the bonds that it creates, it's a responsibility."}, {"time": 7550, "text": "And I think that you do have to think beyond the, certainly not just dollars and cents, but just sports is a very big deal in our society."}, {"time": 7562, "text": "And it has to be, I think, held to a standard that's not just, well, were we profitable this year?"}, {"time": 7572, "text": "That's, there are other businesses for that."}, {"time": 7574, "text": "It is certainly a business."}, {"time": 7576, "text": "I don't mean to romanticize to the point that it's not, but to me, it's more than that."}, {"time": 7582, "text": "Or at least my experience has been that it's more than that."}, {"time": 7584, "text": "It's a source of meaning for millions of people."}, {"time": 7588, "text": "And you see that most, like during COVID, for example, when there's so much desperation, so many people losing their jobs, so many people having to deal with the uncertainty of what the future holds."}, {"time": 7598, "text": "There's something about those sports that just unites us that again, the tragedy and the triumphs of sport, of united, of gathering together with your friends, with family, shared experience of over like this, yeah, over just team, over rooting for your team, for your city ultimately."}, {"time": 7619, "text": "And the access, again, as I alluded to, we didn't have anything when I was growing up, but I would pour through the box scores."}, {"time": 7627, "text": "I was a huge Yankee fan and Steeler fan and feeling some ownership of that, right?"}, {"time": 7633, "text": "That I could read the box score and relive what they did and occasionally see them on TV and feel like I was part of that celebration when they won and everything."}, {"time": 7644, "text": "It's a very powerful thing."}, {"time": 7647, "text": "You've been exceptionally successful in a bunch of avenues and a bunch of efforts."}, {"time": 7651, "text": "What advice would you give to a young person today, a high school student, a college undergraduate that's thinking about career, maybe advice, not about just career, but about how to live a life they can be proud of?"}, {"time": 7669, "text": "You know, we talked earlier about intellectual honesty and to me, that's the first step of just saying to the best of your ability, who am I?"}, {"time": 7677, "text": "And what's important to me and what do I wanna do and accomplish?"}, {"time": 7683, "text": "If you can start with that and develop some sort of rules based philosophical, here's what I'll do, what I won't do."}, {"time": 7694, "text": "And that way you can be flexible and pliable and you're gonna need to be, but if you still have a compass that tells you, hey, at least I know this is the path I'm gonna take, I think that's very important."}, {"time": 7709, "text": "The rules you're referring to, the principles, that's kind of like underlying integrity."}, {"time": 7715, "text": "So knowing what lines you don't cross on this path."}, {"time": 7719, "text": "Exactly right, because if you have those absolutes, there are many decisions that come into focus very quickly because hey, that's not for me, or hey, I'm willing to do whatever it takes to do X, Y, and Z."}, {"time": 7733, "text": "And it has to do with the thing you were talking about."}, {"time": 7736, "text": "It's kind of interesting, you mentioned earlier in the conversation about slippery slope and that's how often it happens, like how the slipping into unethical behavior happens."}, {"time": 7747, "text": "It's a slippery slope of little adjustments, you put stuff off and I found that to be, I've been fortunate to not have to encounter these moments very much in my life, but I still encounter them."}, {"time": 7762, "text": "That's what integrity I think looks like, is as the slippery slope is happening, those little things is without drama, without making a show of it, making a decision that stands behind your principles and just walking away."}, {"time": 7780, "text": "Yeah, and besides the big ideas, I'm gonna change the world, I'm gonna innovate, I'm gonna do all those other things, I also start, if I'm giving any advice, which we can debate whether or not I should be giving advice, but just in terms of, well, let me start with this."}, {"time": 7799, "text": "Are you a good friend?"}, {"time": 7801, "text": "Can you be counted on?"}, {"time": 7802, "text": "Do you do what you say you're going to do?"}, {"time": 7807, "text": "Are you accountable to what you sign up for and do you hold others accountable?"}, {"time": 7812, "text": "What does all that look like?"}, {"time": 7813, "text": "And then I think it's being as intellectually curious and well read as you can be."}, {"time": 7820, "text": "We live in a world that is designed to distract you, right?"}, {"time": 7824, "text": "And being able to sit with your thoughts or go on a walk and think deeply about something and not just surface area, you text me, I text you back and we decide the fate of the world based on a couple of text messages or something."}, {"time": 7842, "text": "You don't wanna lose touch, I think, with being well read and understanding and standing on great thinkers shoulders and learning from those works."}, {"time": 7855, "text": "And then I also think that there's resiliency and then there's grit."}, {"time": 7862, "text": "And I heard someone say one time that those are slightly different."}, {"time": 7866, "text": "And I'm also, I know that there are all kinds of challenges in life, right?"}, {"time": 7873, "text": "That are tragic, that are unfair."}]}]