[{"title": "Bjarne Stroustrup: C++ | Lex Fridman Podcast #48", "id": "uTxRF5ag27A", "quotes": [{"time": 335, "text": "TITLE So when you say types, stuff you're saying has echoes of object oriented programming."}, {"time": 341, "text": "Every language that uses the word class for type is a descendant of Simula, directly or indirectly."}, {"time": 344, "text": "Christen Nygaard and Ole Johan Dahl were mathematicians and they didn't think in terms of types, but they understood sets and classes of elements."}, {"time": 364, "text": "And so they called their types classes."}, {"time": 364, "text": "And basically in C++, as in Simula, classes are user defined type."}, {"time": 377, "text": "TITLE So can you try the impossible task and give a brief history of programming languages from your perspective?"}, {"time": 381, "text": "So we started with Algol 60, Simula, Pascal, but that's just the 60s and 70s."}, {"time": 388, "text": "The most sort of interesting and major improvement of programming languages was Fortran, the first Fortran."}, {"time": 399, "text": "Because before that, all code was written for a specific machine and each specific machine had a language, a simple language or a cross simpler or some extension of that idea."}, {"time": 412, "text": "But you're writing for a specific machine in the language of that machine."}, {"time": 422, "text": "And Bacchus and his team at IBM built a language that would allow you to write what you really wanted."}, {"time": 432, "text": "That is, you could write it in a language that was natural for people."}, {"time": 441, "text": "Now, these people happen to be engineers and physicists."}, {"time": 441, "text": "So the language that came out was somewhat unusual for the rest of the world."}, {"time": 446, "text": "But basically they said formula translation because they wanted to have the mathematical formulas translated into the machine."}, {"time": 457, "text": "And as a side effect, they got portability because now they're writing in the terms that the humans used and the way humans thought."}, {"time": 467, "text": "And then they had a program that translated it into the machine's needs."}, {"time": 474, "text": "And that was new and that was great."}, {"time": 474, "text": "And it's something to remember."}, {"time": 474, "text": "We want to raise the language to the human level, but we don't want to lose the efficiency."}, {"time": 489, "text": "And that was the first step towards the human."}, {"time": 489, "text": "That was the first step."}, {"time": 489, "text": "And of course, they were a very particular kind of humans."}, {"time": 495, "text": "Business people were different, so they got cobalt instead, et cetera, et cetera."}, {"time": 500, "text": "And Simula came out."}, {"time": 500, "text": "No, let's not go to Simula yet."}, {"time": 500, "text": "Let's go to Algol."}, {"time": 508, "text": "Fortran didn't have, at the time, the notions of not a precise notion of type, not a precise notion of scope, not a set of translation phases that was what we have today, lexical syntax, semantics."}, {"time": 529, "text": "It was sort of a bit of a model in the early days, but hey, they've just done the biggest breakthrough in the history of programming, right?"}, {"time": 541, "text": "So you can't criticize them for not having gotten all the technical details right."}, {"time": 546, "text": "So we got Algol."}, {"time": 546, "text": "That was very pretty."}, {"time": 546, "text": "And most people in commerce and science considered it useless because it was not flexible enough, and it wasn't efficient enough, and et cetera, et cetera."}, {"time": 560, "text": "But that was a breakthrough from a technical point of view."}, {"time": 566, "text": "Then Simula came along to make that idea more flexible, and you could define your own types."}, {"time": 574, "text": "And that's where I got very interested."}, {"time": 583, "text": "That was late 60s."}, {"time": 585, "text": "This was late 60s."}, {"time": 592, "text": "But Christen, once you get started and in full flow, it's very hard to get a word in edgeways."}, {"time": 609, "text": "Where you just listen."}, {"time": 610, "text": "So it was great."}, {"time": 610, "text": "I learned it from there."}, {"time": 614, "text": "Not to romanticize the notion, but it seems like a big leap to think about object oriented programming."}, {"time": 618, "text": "It's really a leap of abstraction."}, {"time": 625, "text": "And was that as big and beautiful of a leap as it seems from now in retrospect, or was it an obvious one at the time?"}, {"time": 638, "text": "It was not obvious, and many people have tried to do something like that, and most people didn't come up with something as wonderful as Simula."}, {"time": 649, "text": "Lots of people got their PhDs and made their careers out of forgetting about Simula or never knowing it."}, {"time": 656, "text": "For me, the key idea was basically I could get my own types."}, {"time": 656, "text": "And that's the idea that goes further into C++, where I can get better types and more flexible types and more efficient types."}, {"time": 672, "text": "But it's still the fundamental idea."}, {"time": 672, "text": "When I want to write a program, I want to write it with my types that is appropriate to my problem and under the constraints that I'm under with hardware, software, environment, et cetera."}, {"time": 687, "text": "And that's the key idea."}, {"time": 692, "text": "People picked up on the class hierarchies and the virtual functions and the inheritance, and that was only part of it."}, {"time": 699, "text": "It was an interesting and major part and still a major part and a lot of graphic stuff, but it was not the most fundamental."}, {"time": 707, "text": "It was when you wanted to relate one type to another."}, {"time": 715, "text": "You don't want them all to be independent."}, {"time": 715, "text": "The classical example is that you don't actually want to write a city simulation with vehicles where you say, well, if it's a bicycle, write the code for turning a bicycle to the left."}, {"time": 731, "text": "If it's a normal car, turn right the normal car way."}, {"time": 737, "text": "If it's a fire engine, turn right the fire engine way."}, {"time": 737, "text": "You get these big case statements and bunches of if statements and such."}, {"time": 743, "text": "Instead, you tell the base class that that's the vehicle saying, turn left the way you want to."}, {"time": 752, "text": "And this is actually a real example."}, {"time": 761, "text": "They used it to simulate and optimize the emergency services for somewhere in Norway back in the 60s."}, {"time": 773, "text": "So this was one of the early examples for why you needed inheritance and you needed a runtime polymorphism because you wanted to handle this set of vehicles in a manageable way."}, {"time": 793, "text": "You can't just rewrite your code each time a new kind of vehicle comes along."}, {"time": 799, "text": "Yeah, that's a beautiful, powerful idea."}, {"time": 799, "text": "And of course it stretches through your work with C++ as we'll talk about."}, {"time": 804, "text": "But I think you've structured it nicely."}, {"time": 804, "text": "What other breakthroughs came along in the history of programming languages if we were to tell the history in that way?"}, {"time": 819, "text": "Obviously, I'm better at telling the part of the history that is the path I'm on as opposed to all the paths."}, {"time": 826, "text": "Yeah, you skipped the hippie John McCarthy and Lisp, one of my favorite languages."}, {"time": 831, "text": "Functional."}, {"time": 833, "text": "But Lisp is not one of my favorite languages."}, {"time": 833, "text": "It's obviously important."}, {"time": 833, "text": "It's obviously interesting."}, {"time": 839, "text": "Lots of people write code in it and then they rewrite it into C or C++ when they want to go to production."}, {"time": 845, "text": "It's in the world I'm at, which are constrained by performance, reliability, issues, deployability, cost of hardware."}, {"time": 855, "text": "I don't like things to be too dynamic."}, {"time": 864, "text": "It is really hard to write a piece of code that's perfectly flexible that you can also deploy on a small computer and that you can also put in, say, a telephone switch in Bogota."}, {"time": 872, "text": "What's the chance?"}, {"time": 880, "text": "If you get an error and you find yourself in the debugger that the telephone switch in Bogota on late Sunday night has a programmer around, their chance is zero."}, {"time": 885, "text": "A lot of the things I think most about can't afford that flexibility."}, {"time": 893, "text": "I'm quite aware that maybe 70%, 80% of all code are not under the kind of constraints I'm interested in."}, {"time": 907, "text": "But somebody has to do the job I'm doing because you have to get from these high level flexible languages to the hardware."}, {"time": 920, "text": "The stuff that lasts for 10, 20, 30 years is robust, operates under very constrained conditions."}, {"time": 927, "text": "And it's fascinating and beautiful in its own way."}, {"time": 931, "text": "C++ is one of my favorite languages, and so is Lisp."}, {"time": 931, "text": "So I can embody two for different reasons as a programmer."}, {"time": 940, "text": "I understand why Lisp is popular, and I can see the beauty of the ideas and similarly with Smalltalk."}, {"time": 950, "text": "It's just not as relevant in my world."}, {"time": 950, "text": "And by the way, I distinguish between those and the functional languages where I go to things like ML and Haskell."}, {"time": 964, "text": "Different kind of languages, they have a different kind of beauty and they're very interesting."}, {"time": 972, "text": "And I think that's interesting."}, {"time": 979, "text": "And I actually try to learn from all the languages I encounter to see what is there that would make working on the kind of problems I'm interested in with the kind of constraints that I'm interested in, what can actually be done better?"}, {"time": 994, "text": "Because we can surely do better than we do today."}, {"time": 1002, "text": "You've said that it's good for any professional programmer to know at least five languages as speaking about a variety of languages that you've taken inspiration from, and you've listed yours as being, at least at the time, C++, obviously, Java, Python, Ruby, script."}, {"time": 1026, "text": "Can you first of all, update that list, modify it?"}, {"time": 1026, "text": "You don't have to be constrained to just five, but can you describe what you picked up also from each of these languages?"}, {"time": 1041, "text": "How do you see them as inspirations for you when you're working with C++?"}, {"time": 1045, "text": "This is a very hard question to answer."}, {"time": 1045, "text": "So about languages, you should know languages."}, {"time": 1052, "text": "I reckon I knew about 25 or thereabouts when I did C++."}, {"time": 1052, "text": "It was easier in those days because the languages were smaller, and you didn't have to learn a whole programming environment and such to do it."}, {"time": 1068, "text": "You could learn the language quite easily."}, {"time": 1068, "text": "And it's good to learn so many languages."}, {"time": 1075, "text": "I imagine, just like with natural language for communication, there's different paradigms that emerge in all of them, that there's commonalities and so on."}, {"time": 1088, "text": "So I picked five out of a hat."}, {"time": 1088, "text": "You picked five out of a hat."}, {"time": 1092, "text": "Obviously."}, {"time": 1092, "text": "The important thing that the number is not one."}, {"time": 1099, "text": "It's like, I don't like, I mean, if you're a monoglot, you are likely to think that your own culture is the only one superior to everybody else's."}, {"time": 1104, "text": "A good learning of a foreign language and a foreign culture is important."}, {"time": 1110, "text": "It helps you think and be a better person."}, {"time": 1110, "text": "With programming languages, you become a better programmer, better designer with the second language."}, {"time": 1121, "text": "Now, once you've got two, the weight of five is not that long."}, {"time": 1121, "text": "It's the second one that's most important."}, {"time": 1128, "text": "And then when I had to pick five, I sort of thinking what kinds of languages are there?"}, {"time": 1138, "text": "Well, there's a really low level stuff."}, {"time": 1138, "text": "It's actually good to know machine code."}, {"time": 1144, "text": "Even still?"}, {"time": 1145, "text": "Even today."}, {"time": 1145, "text": "The C++ optimizers write better machine code than I do."}, {"time": 1153, "text": "But I don't think I could appreciate them if I actually didn't understand machine code and machine architecture."}, {"time": 1160, "text": "At least in my position, I have to understand a bit of it because you mess up the cache and you're off in performance by a factor of 100."}, {"time": 1168, "text": "It shouldn't be that if you are interested in either performance or the size of the computer you have to deploy."}, {"time": 1175, "text": "So I would go as a simpler."}, {"time": 1182, "text": "I used to mention C, but these days going low level is not actually what gives you the performance."}, {"time": 1191, "text": "It is to express your ideas so cleanly that you can think about it and the optimizer can understand what you're up to."}, {"time": 1197, "text": "My favorite way of optimizing these days is to throw away out the clever bits and see if it still runs fast."}, {"time": 1204, "text": "And sometimes it runs faster."}, {"time": 1204, "text": "So I need the abstraction mechanisms or something like C++ to write compact high performance code."}, {"time": 1213, "text": "There was a beautiful keynote by Jason Turner at the CppCon a couple of years ago where he decided he was going to program Pong on Motorola 6800, I think it was."}, {"time": 1227, "text": "And he says, well, this is relevant because it looks like a microcontroller."}, {"time": 1240, "text": "It has specialized hardware."}, {"time": 1240, "text": "It has not very much memory and it's relatively slow."}, {"time": 1246, "text": "And so he shows in real time how he writes Pong starting with fairly straightforward low level stuff, improving his abstractions and what he's doing."}, {"time": 1256, "text": "He's writing C++ and it translates into 86 assembler, which you can do with Clang and you can see it in real time."}, {"time": 1266, "text": "It's the compiler explorer, which you can use on the web."}, {"time": 1274, "text": "And then he wrote a little program that translated 86 assembler into Motorola assembler."}, {"time": 1279, "text": "And so he types and you can see this thing in real time."}, {"time": 1287, "text": "You can see it in real time."}, {"time": 1287, "text": "And even if you can't read the assembly code, you can just see it."}, {"time": 1293, "text": "His code gets better."}, {"time": 1293, "text": "The code, the assembler gets smaller."}, {"time": 1299, "text": "He increases the abstraction level, uses C++ 11 as it were better."}, {"time": 1305, "text": "This code gets cleaner."}, {"time": 1305, "text": "It gets easier maintainable."}, {"time": 1305, "text": "The code shrinks and it keeps shrinking."}, {"time": 1305, "text": "And I could not in any reasonable amount of time write that assembler as good as the compiler generated from really quite nice modern C++."}, {"time": 1322, "text": "And I'll go as far as to say the thing that looked like C was significantly uglier and smaller and larger when it became machine code."}, {"time": 1342, "text": "So the abstractions that can be optimized are important."}, {"time": 1347, "text": "I would love to see that kind of visualization in larger code bases."}, {"time": 1350, "text": "That might be beautiful."}, {"time": 1351, "text": "But you can't show a larger code base in a one hour talk and have it fit on screen."}, {"time": 1358, "text": "So that's C and C++."}, {"time": 1360, "text": "So my two languages would be machine code and C++."}, {"time": 1360, "text": "And then I think you can learn a lot from the functional languages."}, {"time": 1367, "text": "So PIC has gloy ML."}, {"time": 1367, "text": "I don't care which."}, {"time": 1367, "text": "I think actually you learn the same lessons of expressing especially mathematical notions really clearly and having a type system that's really strict."}, {"time": 1383, "text": "And then you should probably have a language for sort of quickly churning out something."}, {"time": 1391, "text": "You could pick JavaScript."}, {"time": 1391, "text": "You could pick Python."}, {"time": 1391, "text": "You could pick Ruby."}, {"time": 1399, "text": "What do you make of JavaScript in general?"}, {"time": 1399, "text": "So you're talking in the platonic sense about languages, about what they're good at, what their philosophy of design is."}, {"time": 1406, "text": "But there's also a large user base behind each of these languages and they use it in the way sometimes maybe it wasn't really designed for."}, {"time": 1418, "text": "JavaScript is used way beyond probably what it was designed for."}, {"time": 1424, "text": "Let me say it this way."}, {"time": 1424, "text": "When you build a tool, you do not know how it's going to be used."}, {"time": 1429, "text": "You try to improve the tool by looking at how it's being used and when people cut their fingers off and try and stop that from happening."}, {"time": 1435, "text": "But really you have no control over how something is used."}, {"time": 1441, "text": "So I'm very happy and proud of some of the things C++ is being used at and some of the things I wish people wouldn't do."}, {"time": 1447, "text": "Bitcoin mining being my favorite example uses as much energy as Switzerland and mostly serves criminals."}, {"time": 1455, "text": "But back to the languages, I actually think that having JavaScript run in the browser was an enabling thing for a lot of things."}, {"time": 1465, "text": "Yes, you could have done it better, but people were trying to do it better and they were using more principles, language designs, but they just couldn't do it right."}, {"time": 1481, "text": "And the nonprofessional programmers that write lots of that code just couldn't understand them."}, {"time": 1489, "text": "So it did an amazing job for what it was."}, {"time": 1498, "text": "It's not the prettiest language and I don't think it ever will be the prettiest language, but let's not be bigots here."}, {"time": 1505, "text": "So what was the origin story of C++?"}, {"time": 1510, "text": "Yeah, you basically gave a few perspectives of your inspiration of object oriented programming."}, {"time": 1519, "text": "That's you had a connection with C and performance efficiency was an important thing you were drawn to."}, {"time": 1524, "text": "Efficiency and reliability."}, {"time": 1524, "text": "Reliability."}, {"time": 1524, "text": "You have to get both."}, {"time": 1530, "text": "What's reliability?"}, {"time": 1530, "text": "I really want my telephone calls to get through and I want the quality of what I am talking, coming out at the other end."}, {"time": 1538, "text": "The other end might be in London or wherever."}, {"time": 1548, "text": "And you don't want the system to be crashing."}, {"time": 1548, "text": "If you're doing a bank, you mustn't crash."}, {"time": 1548, "text": "It might be your bank account that is in trouble."}, {"time": 1555, "text": "There's different constraints like in games, it doesn't matter too much if there's a crash, nobody dies and nobody gets ruined."}, {"time": 1566, "text": "But I am interested in the combination of performance, partly because of sort of speed of things being done, part of being able to do things that is necessary to have reliability of larger systems."}, {"time": 1584, "text": "If you spend all your time interpreting a simple function call, a simple function call, you are not going to have enough time to do proper signal processing to get the telephone calls to sound right."}, {"time": 1599, "text": "Either that or you have to have ten times as many computers and you can't afford your phone anymore."}, {"time": 1606, "text": "It's a ridiculous idea in the modern world because we have solved all of those problems."}, {"time": 1611, "text": "I mean, they keep popping up in different ways because we tackle bigger and bigger problems."}, {"time": 1618, "text": "So efficiency remains always an important aspect."}, {"time": 1623, "text": "But you have to think about efficiency, not just as speed, but as an enabler to important things."}, {"time": 1629, "text": "And one of the things it enables is reliability, is dependability."}, {"time": 1638, "text": "When I press the pedal, the brake pedal of a car, it is not actually connected directly to anything but a computer."}, {"time": 1644, "text": "That computer better work."}, {"time": 1651, "text": "Let's talk about reliability just a little bit."}, {"time": 1651, "text": "So modern cars have ECUs, have millions of lines of code today."}, {"time": 1659, "text": "So this is certainly especially true of autonomous vehicles where some of the aspects of the control or driver assistance systems that steer the car, that keep it in the lane and so on."}, {"time": 1670, "text": "So how do you think, you know, I talked to regulators, people in government who are very nervous about testing the safety of these systems of software."}, {"time": 1676, "text": "Ultimately software that makes decisions that could lead to fatalities."}, {"time": 1683, "text": "So how do we test software systems like these?"}, {"time": 1691, "text": "First of all, safety, like performance and like security is the system's property."}, {"time": 1701, "text": "People tend to look at one part of a system at a time and saying something like, this is secure."}, {"time": 1708, "text": "I don't need to do that."}, {"time": 1708, "text": "Yeah, that piece of code is secure."}, {"time": 1708, "text": "I'll buy your operator."}, {"time": 1714, "text": "If you want to have reliability, if you want to have performance, if you want to have security, you have to look at the whole system."}, {"time": 1721, "text": "I did not expect you to say that, but that's very true."}, {"time": 1726, "text": "Yes, I'm dealing with one part of the system and I want my part to be really good, but I know it's not the whole system."}, {"time": 1732, "text": "Furthermore, if making an individual part perfect, may actually not be the best way of getting the highest degree of reliability and performance and such."}, {"time": 1745, "text": "There's people that say C++ is not type safe."}, {"time": 1745, "text": "You can break it."}, {"time": 1745, "text": "I can break anything that runs on a computer."}, {"time": 1754, "text": "I may not go through your type system."}, {"time": 1754, "text": "If I wanted to break into your computer, I'll probably try SQL injection."}, {"time": 1760, "text": "And it's very true."}, {"time": 1760, "text": "If you think about safety or even reliability at the system level, especially when a human being is involved, it starts becoming hopeless pretty quickly in terms of proving that something is safe to a certain level."}, {"time": 1783, "text": "Because there's so many variables."}, {"time": 1783, "text": "It's so complex."}, {"time": 1783, "text": "Well, let's get back to something we can talk about and actually talk about it."}, {"time": 1794, "text": "Talk about and actually make some progress on."}, {"time": 1794, "text": "We can look at C++ programs and we can try and make sure they crash this often."}, {"time": 1801, "text": "The way you do that is largely by simplification."}, {"time": 1814, "text": "The first step is to simplify the code, have less code, have code that are less likely to go wrong."}, {"time": 1821, "text": "It's not by runtime testing everything."}, {"time": 1821, "text": "It is not by big test frameworks that you are using."}, {"time": 1828, "text": "Yes, we do that also."}, {"time": 1828, "text": "But the first step is actually to make sure that when you want to express something, you can express it directly in code rather than going through endless loops and convolutions in your head before it gets down the code."}, {"time": 1843, "text": "The way you are thinking about a problem is not in the code."}, {"time": 1851, "text": "There is a missing piece that's just in your head."}, {"time": 1851, "text": "And the code, you can see what it does, but it cannot see what you thought about it unless you have expressed things directly."}, {"time": 1865, "text": "When you express things directly, you can maintain it."}, {"time": 1865, "text": "It's easier to find errors."}, {"time": 1873, "text": "It's easier to make modifications."}, {"time": 1873, "text": "It's actually easier to test it."}, {"time": 1873, "text": "And lo and behold, it runs faster."}, {"time": 1879, "text": "And therefore, you can use a smaller number of computers, which means there's less hardware that could possibly break."}, {"time": 1886, "text": "So I think the key here is simplification."}, {"time": 1894, "text": "But it has to be, to use the Einstein quote, as simple as possible and no simpler."}, {"time": 1900, "text": "Not simpler."}, {"time": 1901, "text": "There are other areas with under constraints where you can be simpler than you can be in C++."}, {"time": 1906, "text": "But in the domain I'm dealing with, that's the simplification I'm after."}, {"time": 1913, "text": "So how do you inspire or ensure that the Einstein level of simplification is reached?"}, {"time": 1923, "text": "So can you do code review?"}, {"time": 1923, "text": "Can you look at code?"}, {"time": 1923, "text": "If I gave you the code for the Ford F150 and said, here, is this a mess or is this okay?"}, {"time": 1931, "text": "Is it possible to tell?"}, {"time": 1931, "text": "Is it possible to regulate?"}, {"time": 1943, "text": "An experienced developer can look at code and see if it smells."}, {"time": 1943, "text": "Mixed metaphors deliberately."}, {"time": 1951, "text": "The point is that it is hard to generate something that is really obviously clean and can be appreciated."}, {"time": 1966, "text": "But you can usually recognize when you haven't reached that point."}, {"time": 1972, "text": "And so I've never looked at the F150 code, so I wouldn't know."}, {"time": 1972, "text": "But I know what I ought to be looking for."}, {"time": 1983, "text": "I'll be looking for some tricks that correlate with bugs and elsewhere."}, {"time": 1983, "text": "And I have tried to formulate rules for what good code looks like."}, {"time": 1992, "text": "And the current version of that is called the C++ core guidelines."}, {"time": 2002, "text": "One thing people should remember is there's what you can do in a language and what you should do."}, {"time": 2012, "text": "In a language, you have lots of things that is necessary in some context, but not in others."}, {"time": 2019, "text": "There's things that exist just because there's 30 year old code out there and you can't get rid of it."}, {"time": 2025, "text": "But you can't have rules that says when you create it, try and follow these rules."}, {"time": 2031, "text": "This does not create good programs by themselves, but it limits the damage from mistakes."}, {"time": 2042, "text": "It limits the possibilities of mistakes."}, {"time": 2042, "text": "And basically, we are trying to say, what is it that a good programmer does?"}, {"time": 2048, "text": "At the fairly simple level of where you use the language and how you use it."}, {"time": 2056, "text": "Now, I can put all the rules for chiseling in marble."}, {"time": 2056, "text": "It doesn't mean that somebody who follows all of those rules can do a masterpiece by Michelangelo."}, {"time": 2064, "text": "That is, there's something else to write a good program."}, {"time": 2072, "text": "Just is there something else to create an important work of art?"}, {"time": 2072, "text": "That is, there's some kind of inspiration, understanding, gift."}, {"time": 2080, "text": "But we can approach the sort of technical, the craftsmanship level of it."}, {"time": 2093, "text": "The famous painters, the famous sculptures was among other things, superb craftsmen."}, {"time": 2103, "text": "They could express their ideas using their tools very well."}, {"time": 2103, "text": "And so these days, I think what I'm doing, what a lot of people are doing, we are still trying to figure out how it is to use our tools very well."}, {"time": 2120, "text": "For a really good piece of code, you need a spark of inspiration, and you can't, I think, regulate that."}, {"time": 2129, "text": "You cannot say that I'll take a picture only, I'll buy your picture only if you're at least Van Gogh."}, {"time": 2137, "text": "There are other things you can regulate, but not the inspiration."}, {"time": 2145, "text": "I think that's quite beautifully put."}, {"time": 2145, "text": "It is true that there is as an experienced programmer, when you see code that's inspired, that's like Michelangelo, you know it when you see it."}, {"time": 2164, "text": "And the opposite of that is code that is messy, code that smells, you know, when you see it."}, {"time": 2172, "text": "And I'm not sure you can describe it in words, except vaguely through guidelines and so on."}, {"time": 2177, "text": "Yes, it's easier to recognize ugly than to recognize beauty in code."}, {"time": 2177, "text": "And for the reason is that sometimes beauty comes from something that's innovative and unusual."}, {"time": 2187, "text": "And you have to sometimes think reasonably hard to appreciate that."}, {"time": 2194, "text": "On the other hand, the messes have things that are in common."}, {"time": 2201, "text": "And you can have static checkers and dynamic checkers that find a large number of the most common mistakes."}, {"time": 2212, "text": "You can catch a lot of sloppiness mechanically."}, {"time": 2212, "text": "I'm a great fan of static analysis in particular, because you can check for not just the language rules, but for the usage of language rules."}, {"time": 2229, "text": "And I think we will see much more static analysis in the coming decade."}, {"time": 2236, "text": "Can you describe what static analysis is?"}, {"time": 2236, "text": "You represent a piece of code so that you can write a program that goes over that representation and look for things that are are right and not right."}, {"time": 2253, "text": "So, for instance, you can analyze a program to see if resources are leaked."}, {"time": 2266, "text": "That's one of my favorite problems."}, {"time": 2266, "text": "It's not actually all that hard and modern C++, but you can do it."}, {"time": 2274, "text": "If you are writing in the C level, you have to have a malloc and a free."}, {"time": 2280, "text": "And they have to match."}, {"time": 2280, "text": "If you have them in a single function, you can usually do it very easily."}, {"time": 2288, "text": "If there's a malloc here, there should be a free there."}, {"time": 2288, "text": "On the other hand, in between can be showing complete code and then it becomes impossible."}, {"time": 2296, "text": "If you pass that pointer to the memory out of a function and then want to make sure that the free is done somewhere else, now it gets really difficult."}, {"time": 2311, "text": "And so for static analysis, you can run through a program and you can try and figure out if there's any leaks."}, {"time": 2318, "text": "And what you will probably find is that you will find some leaks and you'll find quite a few places where your analysis can't be complete."}, {"time": 2327, "text": "It might depend on runtime."}, {"time": 2334, "text": "It might depend on the cleverness of your analyzer and it might take a long time."}, {"time": 2342, "text": "Some of these programs run for a long time."}, {"time": 2342, "text": "But if you combine such analysis with a set of rules that says how people could use it, you can actually see why the rules are violated."}, {"time": 2357, "text": "And that stops you from getting into the impossible complexities."}, {"time": 2357, "text": "You don't want to solve the halting problem."}, {"time": 2365, "text": "So static analysis is looking at the code without running the code."}, {"time": 2371, "text": "And thereby it's almost not a production code, but it's almost like an education tool of how the language should be used."}, {"time": 2378, "text": "It guides you like it at its best, right?"}, {"time": 2378, "text": "It would guide you in how you write future code as well."}, {"time": 2385, "text": "And you learn together."}, {"time": 2390, "text": "So basically you need a set of rules for how you use the language."}, {"time": 2390, "text": "Then you need a static analysis that catches your mistakes when you violate the rules or when your code ends up doing things that it shouldn't, despite the rules, because there is the language rules."}, {"time": 2409, "text": "We can go further."}, {"time": 2409, "text": "And again, it's back to my idea that I'd much rather find errors before I start running the code."}, {"time": 2416, "text": "If nothing else, once the code runs, if it catches an error at run times, I have to have an error handler."}, {"time": 2423, "text": "And one of the hardest things to write in code is error handling code, because you know something went wrong."}, {"time": 2430, "text": "Do you know really exactly what went wrong?"}, {"time": 2436, "text": "How can you recover when you don't know what the problem was?"}, {"time": 2436, "text": "You can't be 100% sure what the problem was in many, many cases."}, {"time": 2442, "text": "And this is part of it."}, {"time": 2442, "text": "So yes, we need good languages, we need good type systems, we need rules for how to use them, we need static analysis."}, {"time": 2452, "text": "And the ultimate for static analysis is of course program proof, but that still doesn't scale to the kind of systems we deploy."}, {"time": 2468, "text": "Then we start needing testing and the rest of the stuff."}, {"time": 2475, "text": "So C++ is an object oriented programming language that creates, especially with its newer versions, as we'll talk about, higher and higher levels of abstraction."}, {"time": 2482, "text": "So how do you design?"}, {"time": 2490, "text": "Let's even go back to the origin of C++."}, {"time": 2490, "text": "How do you design something with so much abstraction that's still efficient and is still something that you can manage, do static analysis on, you can have constraints on, they can be reliable, all those things we've talked about."}, {"time": 2510, "text": "To me, there's a slight tension between high level abstraction and efficiency."}, {"time": 2519, "text": "I could probably have a year's course just trying to answer it."}, {"time": 2526, "text": "Yes, there's a tension between efficiency and abstraction, but you also get the interesting situation that you get the best efficiency out of the best abstraction."}, {"time": 2533, "text": "And my main tool for efficiency for performance actually is abstraction."}, {"time": 2541, "text": "So let's go back to how C++ was got there."}, {"time": 2548, "text": "You said it was object oriented programming language."}, {"time": 2548, "text": "I actually never said that."}, {"time": 2555, "text": "It's always quoted, but I never did."}, {"time": 2555, "text": "I said C++ supports object oriented programming and other techniques."}, {"time": 2562, "text": "And that's important because I think that the best solution to most complex, interesting problems require ideas and techniques from things that has been called object oriented data abstraction, functional, traditional C style code, all of the above."}, {"time": 2582, "text": "And so when I was designing C++, I soon realized I couldn't just add features."}, {"time": 2594, "text": "If you just add what looks pretty or what people ask for or what you think is good, one by one, you're not going to get a coherent whole."}, {"time": 2604, "text": "What you need is a set of guidelines that that guides your decisions."}, {"time": 2612, "text": "Should this feature be in or should this feature be out?"}, {"time": 2620, "text": "How should a feature be modified before it can go in and such?"}, {"time": 2628, "text": "And in the book I wrote about that, the design evolution of C++, there's a whole bunch of rules like that."}, {"time": 2636, "text": "Most of them are not language technical."}, {"time": 2636, "text": "They're things like don't violate static type system because I like static type system for the obvious reason that I like things to be reliable on reasonable amounts of hardware."}, {"time": 2652, "text": "But one of these rules is the zero overhead principle."}, {"time": 2661, "text": "The what kind of principle?"}, {"time": 2662, "text": "The zero overhead principle."}, {"time": 2662, "text": "It basically says that if you have an abstraction, it should not cost anything compared to write the equivalent code at a lower level."}, {"time": 2678, "text": "So if I have, say, a matrix multiply, it should be written in such a way that you could not drop to the C level of abstraction and use arrays and pointers and such and run faster."}, {"time": 2694, "text": "And so people have written such matrix multiplications, and they've actually gotten code that ran faster than Fortran because once you had the right abstraction, you can eliminate temporaries and you can do loop fusion and other good stuff like that."}, {"time": 2708, "text": "That's quite hard to do by hand and in a lower level language."}, {"time": 2716, "text": "And there's some really nice examples of that."}, {"time": 2721, "text": "And the key here is that that matrix multiplication, the matrix abstraction, allows you to write code that's simple and easy."}, {"time": 2729, "text": "You can do that in any language."}, {"time": 2734, "text": "But with C++, it has the features so that you can also have this thing run faster than if you hand coded it."}, {"time": 2739, "text": "Now, people have given that lecture many times, I and others, and a very common question after the talk where you have demonstrated that you can outperform Fortran for dense matrix multiplication, people come up and says, yeah, but that was C++."}, {"time": 2757, "text": "If I rewrote your code in C, how much faster would it run?"}, {"time": 2757, "text": "The answer is much slower."}, {"time": 2766, "text": "This happened the first time actually back in the 80s with a friend of mine called Doug McElroy, who demonstrated exactly this effect."}, {"time": 2771, "text": "And so the principle is you should give programmers the tools so that the abstractions can follow the zero void principle."}, {"time": 2782, "text": "Furthermore, when you put in a language feature in C++ or a standard library feature, you try to meet this."}, {"time": 2788, "text": "It doesn't mean it's absolutely optimal, but it means if you hand code it with the usual facilities in the language in C++ in C, you should not be able to better it."}, {"time": 2805, "text": "Usually you can do better if you use embedded assembler for machine code for some of the details to utilize part of a computer that the compiler doesn't know about."}, {"time": 2820, "text": "But you should get to that point before you beat to the abstraction."}, {"time": 2820, "text": "So that's a beautiful ideal to reach for."}, {"time": 2826, "text": "And we meet it quite often."}, {"time": 2826, "text": "Quite often."}, {"time": 2826, "text": "So where's the magic of that coming from?"}, {"time": 2834, "text": "There's some of it is the compilation process."}, {"time": 2834, "text": "So the implementation of C++, some of it is the design of the feature itself, the guidelines."}, {"time": 2840, "text": "So I think it's important that you think about the guidelines."}, {"time": 2847, "text": "So I've recently and often talked to Chris Latner, so Clang."}, {"time": 2856, "text": "What, just out of curiosity, is your relationship in general with the different implementations of C++ as you think about you and committee and other people in C++, think about the design of features or design of previous features."}, {"time": 2870, "text": "In trying to reach the ideal of zero overhead, does the magic come from the design, the guidelines, or from the implementations?"}, {"time": 2886, "text": "And not all."}, {"time": 2886, "text": "You go for programming technique, programming language features, and implementation techniques."}, {"time": 2893, "text": "You need all three."}, {"time": 2898, "text": "And how can you think about all three at the same time?"}, {"time": 2902, "text": "It takes some experience, takes some practice, and sometimes you get it wrong."}, {"time": 2902, "text": "But after a while, you sort of get it right."}, {"time": 2908, "text": "I don't write compilers anymore."}, {"time": 2908, "text": "But Brian Kernighan pointed out that one of the reasons C++ succeeded was some of the craftsmanship I put into the early compilers."}, {"time": 2929, "text": "And of course, I did the language assign."}, {"time": 2929, "text": "Of course, I wrote a fair amount of code using this kind of stuff."}, {"time": 2934, "text": "And I think most of the successes involve progress in all three areas together."}, {"time": 2942, "text": "A small group of people can do that."}, {"time": 2942, "text": "Two, three people can work together to do something like that."}, {"time": 2950, "text": "It's ideal if it's one person that has all the skills necessary."}, {"time": 2950, "text": "But nobody has all the skills necessary in all the fields where C++ is used."}, {"time": 2956, "text": "So if you want to approach my ideal in, say, concurrent programming, you need to know about algorithms from current programming."}, {"time": 2963, "text": "You need to know the trigger of lock free programming."}, {"time": 2970, "text": "You need to know something about compiler techniques."}, {"time": 2976, "text": "And then you have to know some of the application areas where this is, like some forms of graphics or some forms of what we call web server kind of stuff."}, {"time": 2986, "text": "And that's very hard to get into a single head."}, {"time": 2997, "text": "But small groups can do it too."}, {"time": 2997, "text": "So is there differences in your view, not saying which is better or so on, but differences in the different implementations of C++?"}, {"time": 3006, "text": "Why are there several sort of maybe naive questions for me?"}, {"time": 3013, "text": "GCC, clang, so on?"}, {"time": 3013, "text": "This is a very reasonable question."}, {"time": 3013, "text": "When I designed C++, most languages had multiple implementations."}, {"time": 3023, "text": "Because if you run on an IBM, if you run on a Sun, if you run on a Motorola, there was just many, many companies and they each have their own compilation structure and their own compilers."}, {"time": 3041, "text": "It was just fairly common that there was many of them."}, {"time": 3047, "text": "And I wrote C Front assuming that other people would write compilers with C++ if successful."}, {"time": 3054, "text": "And furthermore, I wanted to utilize all the backend infrastructures that were available."}, {"time": 3064, "text": "I soon realized that my users were using 25 different linkers."}, {"time": 3064, "text": "I couldn't write my own linker."}, {"time": 3070, "text": "Yes, I could, but I couldn't write 25 linkers and also get any work done on the language."}, {"time": 3080, "text": "And so it came from a world where there was many linkers, many optimizers, many compiler front ends, not to start, but many operating systems."}, {"time": 3087, "text": "The whole world was not an 86 and a Linux box or something, whatever is the standard today."}, {"time": 3096, "text": "In the old days, they set a VAX."}, {"time": 3105, "text": "So basically, I assumed there would be lots of compilers."}, {"time": 3105, "text": "It was not a decision that there should be many compilers."}, {"time": 3111, "text": "It was just a fact."}, {"time": 3111, "text": "That's the way the world is."}, {"time": 3111, "text": "And yes, many compilers emerged."}, {"time": 3120, "text": "And today, there's at least four front ends, Clang, GCC, Microsoft, and EDG, it is design group."}, {"time": 3133, "text": "They supply a lot of the independent organizations and the embedded systems industry."}, {"time": 3141, "text": "And there's lots and lots of backends."}, {"time": 3141, "text": "We have to think about how many dozen backends there are."}, {"time": 3149, "text": "Because different machines have different things, especially in the embedded world, the machines are very different, the architectures are very different."}, {"time": 3155, "text": "And so having a single implementation was never an option."}, {"time": 3163, "text": "Now, I also happen to dislike monocultures."}, {"time": 3173, "text": "Monocultures."}, {"time": 3174, "text": "They are dangerous."}, {"time": 3174, "text": "Because whoever owns the monoculture can go stale."}, {"time": 3174, "text": "And there's no competition."}, {"time": 3181, "text": "And there's no incentive to innovate."}, {"time": 3181, "text": "There's a lot of incentive to put barriers in the way of change."}, {"time": 3189, "text": "Because hey, we own the world."}, {"time": 3189, "text": "And it's a very comfortable world for us."}, {"time": 3189, "text": "And who are you to mess with that?"}, {"time": 3195, "text": "So I really am very happy that there's four front ends for C++."}, {"time": 3195, "text": "Clang's great."}, {"time": 3206, "text": "But GCC was great."}, {"time": 3206, "text": "But then it got somewhat stale."}, {"time": 3206, "text": "Clang came along."}, {"time": 3206, "text": "And GCC is much better now."}, {"time": 3216, "text": "Microsoft is much better now."}, {"time": 3216, "text": "So at least a low number of front ends puts a lot of pressure on standards compliance and also on performance and error messages and compile time speed, all this good stuff that we want."}, {"time": 3239, "text": "Do you think, crazy question, there might come along, do you hope there might come along implementation of C++ written, given all its history, written from scratch?"}, {"time": 3256, "text": "So written today from scratch?"}, {"time": 3258, "text": "Well, Clang and the LLVM is more or less written from scratch."}, {"time": 3264, "text": "But there's been C++ 11, 14, 17, 20."}, {"time": 3264, "text": "You know, there's been a lot of I think sooner or later somebody's going to try again."}, {"time": 3270, "text": "There has been attempts to write new C++ compilers and some of them has been used and some of them has been absorbed into others and such."}, {"time": 3282, "text": "Yeah, it'll happen."}, {"time": 3285, "text": "So what are the key features of C++?"}, {"time": 3285, "text": "And let's use that as a way to sort of talk about the evolution of C++, the new features."}, {"time": 3292, "text": "So at the highest level, what are the features that were there in the beginning?"}, {"time": 3299, "text": "What features got added?"}, {"time": 3303, "text": "Let's first get a principle or an aim in place."}, {"time": 3303, "text": "C++ is for people who want to use hardware really well and then manage the complexity of doing that through abstraction."}, {"time": 3318, "text": "And so the first facility you have is a way of manipulating the machines at a fairly low level."}, {"time": 3327, "text": "That looks very much like C. It has loops, it has variables, it has pointers like machine addresses, it can access memory directly, it can allocate stuff in the absolute minimum of space needed on the machine."}, {"time": 3345, "text": "There's a machine facing part of C++ which is roughly equivalent to C. I said C++ could beat C and it can."}, {"time": 3352, "text": "It doesn't mean I dislike C. If I disliked C, I wouldn't have built on it."}, {"time": 3359, "text": "Furthermore, after Dennis Ritchie, I'm probably the major contributor to modern C. I had lunch with Dennis most days for 16 years and we never had a harsh word between us."}, {"time": 3378, "text": "So these C versus C++ fights are for people who don't quite understand what's going on."}, {"time": 3386, "text": "Then the other part is the abstraction."}, {"time": 3386, "text": "The key is the class."}, {"time": 3394, "text": "There, the key is the class which is a user defined type."}, {"time": 3394, "text": "My idea for the class is that you should be able to build a type that's just like the building types in the way you use them, in the way you declare them, in the way you get the memory and you can do just as well."}, {"time": 3414, "text": "So in C++ there's an int as in C. You should be able to build an abstraction, a class which we can call capital int that you can use exactly like an integer and run just as fast as an integer."}, {"time": 3431, "text": "There's the idea right there."}, {"time": 3431, "text": "And of course you probably don't want to use the int itself but it has happened."}, {"time": 3438, "text": "People have wanted integers that were range checked so that you couldn't overflow and such, especially for very safety critical applications like the fuel injection for a marine diesel engine for the largest ships."}, {"time": 3457, "text": "This is a real example by the way."}, {"time": 3457, "text": "This has been done."}, {"time": 3457, "text": "They built themselves an integer that was just like integer except that couldn't overflow."}, {"time": 3463, "text": "If there was an overflow you went into the error handling."}, {"time": 3469, "text": "And then you built more interesting types."}, {"time": 3469, "text": "You can build a matrix which you need to do graphics or you could build a gnome for a video game."}, {"time": 3484, "text": "And all these are classes and they appear just like the built in types."}, {"time": 3488, "text": "In terms of efficiency and so on."}, {"time": 3488, "text": "So what else is there?"}, {"time": 3491, "text": "And flexibility."}, {"time": 3492, "text": "So I don't know, for people who are not familiar with object oriented programming there's inheritance."}, {"time": 3500, "text": "There's a hierarchy of classes."}, {"time": 3500, "text": "You can just like you said create a generic vehicle that can turn left."}, {"time": 3507, "text": "So what people found was that you don't actually know."}, {"time": 3507, "text": "How do I say this?"}, {"time": 3507, "text": "A lot of types are related."}, {"time": 3520, "text": "That is the vehicles, all vehicles are related."}, {"time": 3520, "text": "Bicycles, cars, fire engines, tanks."}, {"time": 3520, "text": "They have some things in common and some things that differ."}, {"time": 3532, "text": "And you would like to have the common things common and having the differences specific."}, {"time": 3537, "text": "And when you didn't want to know about the differences, just turn left."}, {"time": 3544, "text": "You don't have to worry about it."}, {"time": 3544, "text": "That's how you get the traditional object oriented programming coming out of Simula adopted by Smalltalk and C++ and all the other languages."}, {"time": 3559, "text": "The other kind of obvious similarity between types comes when you have something like a vector."}, {"time": 3565, "text": "Fortran gave us the vector as called array of doubles."}, {"time": 3565, "text": "But the minute you have a vector of doubles, you want a vector of double precision doubles and for short doubles for graphics."}, {"time": 3582, "text": "And why should you not have a vector of integers while you're added or a vector of vectors and a vector of vectors of chess pieces?"}, {"time": 3590, "text": "Now you have a board, right?"}, {"time": 3590, "text": "So this is you express the commonality as the idea of a vector and the variations come through parameterization."}, {"time": 3610, "text": "And so here we get the two fundamental ways of abstracting or of having similarities of types in C++."}, {"time": 3617, "text": "There's the inheritance and there's a parameterization."}, {"time": 3617, "text": "There's the object oriented programming and there's the generic programming."}, {"time": 3623, "text": "With the templates for the generic programming."}, {"time": 3627, "text": "So you've presented it very nicely, but now you have to make all that happen and make it efficient."}, {"time": 3637, "text": "So generic programming with templates, there's all kinds of magic going on, especially recently that you can help catch up on."}, {"time": 3643, "text": "But it feels to me like you can do way more than what you just said with templates."}, {"time": 3650, "text": "You can start doing this kind of metaprogramming, this kind of... You can do metaprogramming also."}, {"time": 3655, "text": "I didn't go there in that explanation."}, {"time": 3655, "text": "We're trying to be very basic, but go back on to the implementation."}, {"time": 3662, "text": "If you couldn't implement this efficiently, if you couldn't use it so that it became efficient, it has no place in C++ because it will violate the zero overhead principle."}, {"time": 3674, "text": "So when I had to get object oriented programming inheritance, I took the idea of virtual functions from Simula."}, {"time": 3682, "text": "Virtual functions is a Simula term, class is a Simula term."}, {"time": 3698, "text": "And I did the simplest implementation I knew of, which was basically a jump table."}, {"time": 3707, "text": "So you get the virtual function table, the function goes in, does an indirection through a table and get the right function."}, {"time": 3714, "text": "That's how you pick the right thing there."}, {"time": 3718, "text": "And I thought that was trivial."}, {"time": 3718, "text": "It's close to optimal and it was obvious."}, {"time": 3718, "text": "It turned out the Simula had a more complicated way of doing it and therefore was slower."}, {"time": 3726, "text": "And it turns out that most languages have something that's a little bit more complicated, sometimes more flexible, but you pay for it."}, {"time": 3736, "text": "And one of the strengths of C++ was that you could actually do this object oriented stuff and your overhead compared to ordinary functions, there's no indirection."}, {"time": 3742, "text": "It's sort of in 5, 10, 25% just the call."}, {"time": 3750, "text": "It's down there."}, {"time": 3750, "text": "It's not two."}, {"time": 3750, "text": "And that means you can afford to use it."}, {"time": 3760, "text": "Furthermore, in C++, you have the distinction between a virtual function and a nonvirtual function."}, {"time": 3766, "text": "If you don't want any overhead, if you don't need the indirection that gives you the flexibility in object oriented programming, just don't ask for it."}, {"time": 3773, "text": "So the idea is that you only use virtual functions if you actually need the flexibility."}, {"time": 3780, "text": "So it's not zero overhead, but it's zero overhead compared to any other way of achieving the flexibility."}, {"time": 3791, "text": "Now, auto parameterization."}, {"time": 3791, "text": "Basically, the compiler looks at the template, say the vector, and it looks at the parameter, and then combines the two and generates a piece of code that is exactly as if you've written a vector of that specific type."}, {"time": 3814, "text": "So that's the minimal overhead."}, {"time": 3822, "text": "If you have many template parameters, you can actually combine code that the compiler couldn't usually see at the same time and therefore get code that is faster than if you had handwritten the stuff, unless you are very, very clever."}, {"time": 3836, "text": "So the thing is, parameterized code, the compiler fills stuff in during the compilation process, not during runtime."}, {"time": 3844, "text": "And furthermore, it gives all the information it's gotten, which is the template, the parameter, and the context of use."}, {"time": 3860, "text": "It combines the three and generates good code."}, {"time": 3860, "text": "But it can generate, now, it's a little outside of what I'm even comfortable thinking about, but it can generate a lot of code."}, {"time": 3876, "text": "And how do you, I remember being both amazed at the power of that idea, and how ugly the debugging looked?"}, {"time": 3885, "text": "Debugging can be truly horrid."}, {"time": 3891, "text": "Come back to this, because I have a solution."}, {"time": 3891, "text": "Anyway, the debugging was ugly."}, {"time": 3898, "text": "The code generated by C++ has always been ugly, because there's these inherent optimizations."}, {"time": 3906, "text": "A modern C++ compiler has front end, middle end, and back end."}, {"time": 3910, "text": "Even C Front, back in 83, had front end and back end optimizations."}, {"time": 3910, "text": "I actually took the code, generated an internal representation, munched that representation to generate good code."}, {"time": 3927, "text": "So people say, it's not a compiler, it generates C. The reason it generated C was I wanted to use C's code generator, and I wanted to use C's code generator to generate good code."}, {"time": 3938, "text": "C was I wanted to use C's code generators that was really good at back end optimizations."}, {"time": 3944, "text": "But I needed front end optimizations, and therefore, the C I generated was optimized C. The way a really good handcrafted optimizer human could generate it, and it was not meant for humans."}, {"time": 3960, "text": "It was the output of a program, and it's much worse today."}, {"time": 3960, "text": "And with templates, it gets much worse still."}, {"time": 3966, "text": "So it's hard to combine simple debugging with the optimal code, because the idea is to drag in information from different parts of the code to generate good code, machine code."}, {"time": 3985, "text": "And that's not readable."}, {"time": 3985, "text": "So what people often do for debugging is they turn the optimizer off."}, {"time": 3994, "text": "And so you get code that when something in your source code looks like a function call, it is a function call."}, {"time": 4002, "text": "When the optimizer is turned on, it may disappear, the function call, it may inline."}, {"time": 4010, "text": "And so one of the things you can do is you can actually get code that is smaller than the function call, because you eliminate the function preamble and return."}, {"time": 4026, "text": "And there's just the operation there."}, {"time": 4026, "text": "One of the key things when I did templates was I wanted to make sure that if you have, say, a sort algorithm, and you give it a sorting criteria, if that sorting criteria is simply comparing things with less than, the code generated should be the less than, not an indirect function call to a comparison object, which is what it is in the source code."}, {"time": 4060, "text": "But we really want down to the single instruction."}, {"time": 4067, "text": "But anyway, turn off the optimizer, and you can debug."}, {"time": 4067, "text": "The first level of debugging can be done, and I always do without the optimization on, because then I can see what's going on."}, {"time": 4079, "text": "And then there's this idea of concepts that puts some, now I've never even, I don't know if it was ever available in any form, but it puts some constraints on the stuff you can parameterize, essentially."}, {"time": 4098, "text": "Let me try and explain this."}, {"time": 4098, "text": "So yes, it wasn't there 10 years ago."}, {"time": 4098, "text": "We have had versions of it that actually work for the last four or five years."}, {"time": 4107, "text": "It was a design by Gabi Dos Reis, Drew Sutton and me."}, {"time": 4117, "text": "We were professors and postdocs in Texas at the time."}, {"time": 4117, "text": "And the implementation by Andrew Sutton has been available for that time."}, {"time": 4126, "text": "And it is part of C++20."}, {"time": 4126, "text": "And there's a standard library that uses it."}, {"time": 4139, "text": "So this is becoming really very real."}, {"time": 4139, "text": "It's available in Clang and GCC."}, {"time": 4139, "text": "GCC for a couple of years, and I believe Microsoft is soon going to do it."}, {"time": 4150, "text": "We expect all of C++20 to be available in all the major compilers in 20."}, {"time": 4157, "text": "But this kind of stuff is available now."}, {"time": 4166, "text": "I'm just saying that because otherwise people might think I was talking about science fiction."}, {"time": 4171, "text": "And so what I'm going to say is concrete."}, {"time": 4171, "text": "You can run it today."}, {"time": 4177, "text": "And there's production uses of it."}, {"time": 4177, "text": "So the basic idea is that when you have a generic component, like a sort function, the sort function will require at least two parameters."}, {"time": 4187, "text": "One is the data structure with a given type and a comparison criteria."}, {"time": 4194, "text": "And these things are related, but obviously you can't compare things if you don't know what the type of things you compare."}, {"time": 4210, "text": "And so you want to be able to say, I'm going to sort something and it is to be sortable."}, {"time": 4216, "text": "What does it mean to be sortable?"}, {"time": 4216, "text": "You look it up in the standard."}, {"time": 4216, "text": "It has to have a it has to be a sequence with a beginning and an end."}, {"time": 4220, "text": "There has to be random access to that sequence."}, {"time": 4227, "text": "And there has to be the element types has to be comparable by default."}, {"time": 4234, "text": "Which means less than operator can operate on."}, {"time": 4237, "text": "Less than logical operator can operate."}, {"time": 4239, "text": "Basically what concepts are, they're compile time predicates."}, {"time": 4239, "text": "They're predicates you can ask, are you a sequence?"}, {"time": 4245, "text": "Yes, I have a beginning and end."}, {"time": 4245, "text": "Are you a random access sequence?"}, {"time": 4245, "text": "Yes, I have a subscripting and plus."}, {"time": 4252, "text": "Is your element type something that has a less than?"}, {"time": 4252, "text": "Yes, I have a less than it's and so basically that's the system."}, {"time": 4260, "text": "And so instead of saying, I will take a parameter of any type, it'll say, I'll take something that's sortable."}, {"time": 4271, "text": "And it's well defined."}, {"time": 4271, "text": "And so we say, okay, you can sort with less than, I don't want less than, I want greater than or something I invent."}, {"time": 4277, "text": "So you have two parameters, the sortable thing and the comparison criteria."}, {"time": 4284, "text": "And the comparison criteria will say, well, I can, you can write it saying it should operate on the element type."}, {"time": 4293, "text": "And then you can say, well, I can sort with less than, and it has the comparison operations."}, {"time": 4301, "text": "So that's just simply the fundamental thing."}, {"time": 4301, "text": "It's compile time predicates."}, {"time": 4309, "text": "Do you have the properties I need?"}, {"time": 4309, "text": "So it specifies the requirements of the code on the parameters that it gets."}, {"time": 4316, "text": "It's very similar to types actually."}, {"time": 4316, "text": "But operating in the space of concepts."}, {"time": 4325, "text": "The word concept was used by Alex Stefanov, who is sort of the father of generic programming in the context of C++."}, {"time": 4335, "text": "There's other places that use that word, but the way we call it generic programming is Alex's."}, {"time": 4343, "text": "And he called them concepts because he said they are the sort of the fundamental concepts of an area."}, {"time": 4349, "text": "So they should be called concepts."}, {"time": 4349, "text": "And we've had concepts all the time."}, {"time": 4354, "text": "If you look at the KNR book about C, C has arithmetic types and it has integral types."}, {"time": 4365, "text": "It says so in the book."}, {"time": 4365, "text": "And then it lists what they are and they have certain properties."}, {"time": 4372, "text": "The difference today is that we can actually write a concept that will ask a type, are you an integral type?"}, {"time": 4379, "text": "Do you have the properties necessary to be an integral type?"}, {"time": 4385, "text": "Do you have plus, minus, divide and such?"}, {"time": 4385, "text": "So maybe the story of concepts, because I thought it might be part of C++11."}, {"time": 4395, "text": "C O X or whatever it was at the time."}, {"time": 4395, "text": "What was the, why didn't it, what, like what we'll, we'll talk a little bit about this fascinating process of standards, because I think it's really interesting for people."}, {"time": 4410, "text": "It's interesting for me, but why did it take so long?"}, {"time": 4414, "text": "What shapes did the idea of concepts take?"}, {"time": 4421, "text": "What were the challenges?"}, {"time": 4421, "text": "Back in 87 or thereabouts."}, {"time": 4421, "text": "1987?"}, {"time": 4429, "text": "Well, 1987 or thereabouts when I was designing templates, obviously I wanted to express the notion of what is required by a template of its arguments."}, {"time": 4434, "text": "And so I looked at this and basically for templates, I wanted three properties."}, {"time": 4443, "text": "I wanted to be very flexible."}, {"time": 4443, "text": "It had to be able to express things I couldn't imagine because I know I can't imagine everything."}, {"time": 4454, "text": "And I've been suffering from languages that try to constrain you to only do what the designer thought good."}, {"time": 4460, "text": "Didn't want to do that."}, {"time": 4467, "text": "Secondly, it had to run faster, as fast or faster than handwritten code."}, {"time": 4467, "text": "So basically, if I have a vector of T and I take a vector of char, it should run as fast as you built a vector of char yourself without parameterization."}, {"time": 4483, "text": "And thirdly, I wanted to be able to express the constraints of the arguments, have proper type checking of the interfaces."}, {"time": 4501, "text": "And neither I nor anybody else at the time knew how to get all three."}, {"time": 4501, "text": "And I thought for C++, I must have the two first."}, {"time": 4509, "text": "Otherwise, it's not C++."}, {"time": 4509, "text": "And it bothered me for another couple of decades that I couldn't solve the third one."}, {"time": 4517, "text": "I mean, I was the one that put function argument type checking into C. I know the value of good interfaces."}, {"time": 4523, "text": "I didn't invent that idea."}, {"time": 4523, "text": "It's very common, but I did it."}, {"time": 4529, "text": "And I wanted to do the same for templates, of course, and I couldn't."}, {"time": 4537, "text": "So it bothered me."}, {"time": 4537, "text": "Then we tried again, 2002, 2003."}, {"time": 4537, "text": "Gaby DesRays and I started analyzing the problem, explained possible solutions."}, {"time": 4547, "text": "It was not a complete design."}, {"time": 4547, "text": "A group in University of Indiana, an old friend of mine, they started a project at Indiana and we thought we could get a good system of concepts in another two or three years that would have made C++ 11 to C++ 06 or 07."}, {"time": 4582, "text": "Well, it turns out that I think we got a lot of the fundamental ideas wrong."}, {"time": 4582, "text": "They were too conventional."}, {"time": 4593, "text": "They didn't quite fit C++ in my opinion."}, {"time": 4593, "text": "Didn't serve implicit conversions very well."}, {"time": 4601, "text": "It didn't serve mixed type arithmetic, mixed type computations very well."}, {"time": 4601, "text": "A lot of stuff came out of the functional community and that community didn't deal with multiple types in the same way as C++ does, had more constraints on what you could express and didn't have the draconian performance requirements."}, {"time": 4632, "text": "And basically we tried."}, {"time": 4632, "text": "We tried very hard."}, {"time": 4632, "text": "We had some successes, but it just in the end wasn't, didn't compile fast enough, was too hard to use and didn't run fast enough unless you had optimizers that was beyond the state of the art."}, {"time": 4651, "text": "They still are."}, {"time": 4660, "text": "So we had to do something else."}, {"time": 4660, "text": "Basically it was the idea that a set of parameters has defined a set of operations and you go through an interaction table just like for virtual functions and then you try to optimize the interaction away to get performance."}, {"time": 4675, "text": "And we just couldn't do all of that."}, {"time": 4683, "text": "But get back to the standardization."}, {"time": 4683, "text": "We are standardizing C++ under ISO rules, which are very open process."}, {"time": 4692, "text": "People come in, there's no requirements for education or experience."}, {"time": 4700, "text": "So you started to develop C++ and there's a whole, when was the first standard established?"}, {"time": 4700, "text": "What is that like?"}, {"time": 4708, "text": "The ISO standard, is there a committee that you're referring to?"}, {"time": 4708, "text": "There's a group of people."}, {"time": 4714, "text": "How often do you meet?"}, {"time": 4714, "text": "What's the discussion?"}, {"time": 4719, "text": "I'll try and explain that."}, {"time": 4719, "text": "So sometime in early 1989, two people, one from IBM, one from HP, turned up in my office and told me I would like to standardize C++."}, {"time": 4732, "text": "This was a new idea to me and when I pointed out that it wasn't finished yet and it wasn't ready for formal standardization and such."}, {"time": 4749, "text": "And they say, no, Bjarne, you haven't gotten it."}, {"time": 4749, "text": "You really want to do this."}, {"time": 4756, "text": "Our organizations depend on C++."}, {"time": 4756, "text": "We cannot depend on something that's owned by another corporation that might be a competitor."}, {"time": 4763, "text": "Of course we could rely on you, but you might get run over by a boss."}, {"time": 4771, "text": "We really need to get this out in the open."}, {"time": 4771, "text": "It has to be standardized under formal rules and we are going to standardize it under ISO rules and you really want to be part of it because basically otherwise we'll do it ourselves."}, {"time": 4791, "text": "And we know you can do it better."}, {"time": 4791, "text": "So through a combination of arm twisting and flattery, it got started."}, {"time": 4800, "text": "So in late 89, there was a meeting in DC at the, actually no, it was not ISO then, it was ANSI, the American National Standard doing."}, {"time": 4823, "text": "We met there."}, {"time": 4823, "text": "We were lectured on the rules of how to do an ANSI standard."}, {"time": 4823, "text": "There was about 25 of us there, which apparently was a new record for that kind of meeting."}, {"time": 4830, "text": "And some of the old C guys that has been standardized in C was there."}, {"time": 4838, "text": "So we got some expertise in."}, {"time": 4838, "text": "So the way this works is that it's an open process."}, {"time": 4845, "text": "Anybody can sign up if they pay the minimal fee, which is about a thousand dollars, less than a little bit more now."}, {"time": 4852, "text": "And I think it's $1,280."}, {"time": 4852, "text": "It's not going to kill you."}, {"time": 4861, "text": "And we have three meetings a year."}, {"time": 4861, "text": "This is fairly standard."}, {"time": 4861, "text": "We tried two meetings a year for a couple of years that didn't work too well."}, {"time": 4870, "text": "So three one week meetings a year and you meet and you have technical discussions, and then you bring proposals forward for votes."}, {"time": 4880, "text": "The votes are done one person per, one vote per organization."}, {"time": 4888, "text": "So you can't have say IBM come in with 10 people and dominate things that's not allowed."}, {"time": 4899, "text": "And these are organizations that extensively UC plus plus."}, {"time": 4904, "text": "Or individuals or individuals."}, {"time": 4904, "text": "I mean, it's a bunch of people in the room deciding the design of a language based on which a lot of the world's systems run."}, {"time": 4920, "text": "Well, I think most people would agree it's better than if I decided it or better than if a single organization like AG&T decides it."}, {"time": 4926, "text": "I don't know if everyone agrees to that, by the way."}, {"time": 4933, "text": "Bureaucracies have their critics too."}, {"time": 4933, "text": "Look, standardization is not pleasant."}, {"time": 4943, "text": "It's like democracy."}, {"time": 4943, "text": "As Churchill says, democracy is the worst way, except for the others."}, {"time": 4951, "text": "And it's, I would say the same with formal standardization."}, {"time": 4956, "text": "But anyway, so we meet and we have these votes and that determines what the standard is."}, {"time": 4965, "text": "A couple of years later, we extended this so it became worldwide."}, {"time": 4965, "text": "We have standard organizations that are active in currently 15 to 20 countries and another 15 to 20 are sort of looking and voting based on the rest of the work on it."}, {"time": 4988, "text": "And we meet three times a year."}, {"time": 4988, "text": "Next week I'll be in Cologne, Germany, spending a week doing standardization and we'll vote out the committee draft of C++20, which goes to the national standards committees for comments and requests for changes and improvements."}, {"time": 5014, "text": "Then we do that and there's a second set of votes where hopefully everybody votes in favor."}, {"time": 5019, "text": "This has happened several times."}, {"time": 5019, "text": "The first time we finished, we started in the first technical meeting was in 1990."}, {"time": 5027, "text": "The last was in 98."}, {"time": 5027, "text": "We voted it out."}, {"time": 5027, "text": "That was the standard that people used until 11 or a little bit past 11."}, {"time": 5035, "text": "And it was an international standard."}, {"time": 5035, "text": "All the countries voted in favor."}, {"time": 5044, "text": "It took longer with 11."}, {"time": 5044, "text": "I'll mention why, but all the nations voted in favor."}, {"time": 5053, "text": "And we work on the basis of consensus."}, {"time": 5053, "text": "That is, we do not want something that passes 6040 because then we're going to get dialects and opponents and people complain too much."}, {"time": 5064, "text": "They all complain too much, but basically it has no real effect."}, {"time": 5070, "text": "The standards has been obeyed."}, {"time": 5070, "text": "They have been working to make it easier to use many compilers, many computers and all of that kind of stuff."}, {"time": 5084, "text": "It was traditional with ISO standards to take 10 years."}, {"time": 5084, "text": "We did the first one in eight, brilliant."}, {"time": 5094, "text": "And we thought we were going to do the next one in six because now we are good at it."}, {"time": 5100, "text": "It took 13."}, {"time": 5100, "text": "It was named OX."}, {"time": 5100, "text": "Hoping that you would at least get it within the single, within the odds, the single digits."}, {"time": 5110, "text": "I thought we would get, I thought we'd get six, seven or eight."}, {"time": 5115, "text": "The confidence of youth."}, {"time": 5115, "text": "Well, the point is that this was sort of like a second system effect."}, {"time": 5121, "text": "That is, we now knew how to do it."}, {"time": 5121, "text": "And so we're going to do it much better."}, {"time": 5128, "text": "And we've got more ambitious and it took longer."}, {"time": 5128, "text": "Furthermore, there is this tendency because it's a 10 year cycle or it doesn't matter."}, {"time": 5135, "text": "Just before you're about to ship, somebody has a bright idea."}, {"time": 5145, "text": "And so we really, really must get that in."}, {"time": 5145, "text": "We did that successfully with the STL."}, {"time": 5157, "text": "We got the standard library that gives us all the STL stuff."}, {"time": 5157, "text": "That basically, I think it saved C++."}, {"time": 5165, "text": "And then people tried it with other things and it didn't work so well."}, {"time": 5171, "text": "They got things in, but it wasn't as dramatic and it took longer and longer and longer."}, {"time": 5177, "text": "So after C++ 11, which was a huge improvement and what, basically what most people are using today, we decided never again."}, {"time": 5186, "text": "And so how do you avoid those slips?"}, {"time": 5186, "text": "And the answer is that you ship more often."}, {"time": 5196, "text": "So that if you have a slip on a 10 year cycle, by the time you know it's a slip, there's 11 years till you get it."}, {"time": 5206, "text": "Now with a three year cycle, there is about three or four years till you get it."}, {"time": 5212, "text": "Like the delay between feature freeze and shipping."}, {"time": 5212, "text": "So you always get one or two years more."}, {"time": 5222, "text": "And so we shipped 14 on time, we shipped 17 on time, and we ship, we will ship 20 on time."}, {"time": 5230, "text": "It'll happen."}, {"time": 5230, "text": "And furthermore, this gives a predictability that allows the implementers, the compiler implementers, the library implementers, they have a target and they deliver on it."}, {"time": 5246, "text": "11 took two years before most compilers were good enough."}, {"time": 5254, "text": "14, most compilers were actually getting pretty good in 14."}, {"time": 5254, "text": "17, everybody shipped in 17."}, {"time": 5265, "text": "We are going to have at least almost everybody ship almost everything in 20."}, {"time": 5265, "text": "And I know this and I know this because they're shipping in 19."}, {"time": 5273, "text": "Predictability is good."}, {"time": 5273, "text": "Delivery on time is good."}, {"time": 5281, "text": "And so yeah."}, {"time": 5281, "text": "That's how it works."}, {"time": 5285, "text": "There's a lot of features that came in in C++ 11."}, {"time": 5285, "text": "There's a lot of features at the birth of C++ that were amazing and ideas with concepts in 2020."}, {"time": 5293, "text": "What to you is the most, just to you personally, beautiful or just you sit back and think, wow, that's just nice and clean feature of C++?"}, {"time": 5312, "text": "I have written two papers for the History of Programming Languages Conference, which basically asked me such questions."}, {"time": 5321, "text": "And I'm writing a third one, which I will deliver at the History of Programming Languages Conference in London next year."}, {"time": 5327, "text": "So I've been thinking about that."}, {"time": 5333, "text": "And there is one clear answer."}, {"time": 5333, "text": "Constructors and destructors."}, {"time": 5333, "text": "The way a constructor can establish the environment for the use of a type for an object and the destructor that cleans up any messes at the end of it."}, {"time": 5348, "text": "That is key to C++."}, {"time": 5348, "text": "That's why we don't have to use garbage collection."}, {"time": 5355, "text": "That's how we can get predictable performance."}, {"time": 5355, "text": "That's how you can get the minimal overhead in many, many cases, and have really clean types."}, {"time": 5362, "text": "It's the idea of constructor destructor pairs."}, {"time": 5371, "text": "Sometimes it comes out under the name RAII."}, {"time": 5371, "text": "Resource acquisition is initialization, which is the idea that you grab resources in the constructor and release them in destructor."}, {"time": 5386, "text": "It's also the best example of why I shouldn't be in advertising."}, {"time": 5386, "text": "I get the best idea and I call it resource acquisition is initialization."}, {"time": 5393, "text": "Not the greatest naming I've ever heard."}, {"time": 5399, "text": "So it's types, abstraction of types."}, {"time": 5411, "text": "You said, I want to create my own types."}, {"time": 5411, "text": "So types is an essential part of C++ and making them efficient is the key part."}, {"time": 5418, "text": "And to you, this is almost getting philosophical, but the construction and the destruction, the creation of an instance of a type and the freeing of resources from that instance of a type is what defines the object."}, {"time": 5436, "text": "It's almost like birth and death is what defines human life."}, {"time": 5445, "text": "By the way, philosophy is important."}, {"time": 5445, "text": "You can't do good language design without philosophy because what you are determining is what people can express and how."}, {"time": 5459, "text": "This is very important."}, {"time": 5459, "text": "By the way, constructors destructors came into C++ in 79 in about the second week of my work with what was then called C of the classes."}, {"time": 5468, "text": "It is a fundamental idea."}, {"time": 5475, "text": "Next comes the fact that you need to control copying because once you control, as you said, birth and death, you have to control taking copies, which is another way of creating an object."}, {"time": 5489, "text": "And finally, you have to be able to move things around so you get the move operations."}, {"time": 5489, "text": "And that's the set of key operations you can define on a C++ type."}, {"time": 5495, "text": "And so to you, those things are just just a beautiful part of C++ that is at the core of it all."}, {"time": 5505, "text": "You mentioned that you hope there will be one unified set of guidelines in the future for how to construct a programming language."}, {"time": 5520, "text": "So perhaps not one programming language, but a unification of how we build programming languages, if you remember such statements."}, {"time": 5528, "text": "I have some trouble remembering it, but I know the origin of that idea."}, {"time": 5533, "text": "So maybe you can talk about sort of C++ has been improving."}, {"time": 5533, "text": "There's been a lot of programming language."}, {"time": 5539, "text": "Do you, where does the arc of history taking us?"}, {"time": 5539, "text": "Do you hope that there is a unification about the languages with which we communicate in the digital space?"}, {"time": 5552, "text": "Well, I think that languages should be designed not by clobbering language features together and and doing slightly different versions of somebody else's ideas, but through the creation of a set of principles, rules of thumbs, whatever you call them."}, {"time": 5573, "text": "I made them for C++."}, {"time": 5573, "text": "And we're trying to teach people in the standards committee about these rules, because a lot of people come in and says, I've got a great idea."}, {"time": 5587, "text": "Let's put it in the language."}, {"time": 5587, "text": "And then you have to ask, why does it fit in the language?"}, {"time": 5592, "text": "Why does it fit in this language?"}, {"time": 5592, "text": "It may fit in another language and not here, or it may fit here and not the other language."}, {"time": 5598, "text": "So you have to work from a set of principles and you have to develop that set of principles."}, {"time": 5603, "text": "And one example that I sometimes remember is I was sitting down with some of the designers of Common Lisp and we were talking about languages and language features."}, {"time": 5623, "text": "And obviously we didn't agree about anything because, well, Lisp is not C++ and vice versa."}, {"time": 5630, "text": "It's too many parentheses."}, {"time": 5630, "text": "But suddenly we started making progress."}, {"time": 5638, "text": "I said, I had this problem and I developed it according to these ideas."}, {"time": 5638, "text": "And they said, why?"}, {"time": 5646, "text": "We had that problem, different problem, and we developed it with the same kind of principles."}, {"time": 5651, "text": "And so we worked through large chunks of C++ and large chunks of Common Lisp and figured out we actually had similar sets of principles of how to do it."}, {"time": 5661, "text": "But the constraints on our designs were very different and the aims for the usage was very different."}, {"time": 5669, "text": "But there was commonality in the way you reason about language features and the fundamental principles you are trying to do."}, {"time": 5685, "text": "So do you think that's possible?"}, {"time": 5685, "text": "So there, just like there is perhaps a unified theory of physics, of the fundamental forces of physics, that I'm sure there is commonalities among the languages, but there's also people involved that help drive the development of these languages."}, {"time": 5706, "text": "Do you have a hope or an optimism that there will be a unification?"}, {"time": 5706, "text": "If you think about physics and Einstein towards a simplified language, do you think that's possible?"}, {"time": 5724, "text": "Let's remember sort of modern physics, I think, started with Galileo in the 1300s."}, {"time": 5724, "text": "So they've had 700 years to get going."}, {"time": 5732, "text": "Modern computing started in about 49."}, {"time": 5732, "text": "We've got, what is it, 70 years."}, {"time": 5732, "text": "They have 10 times."}, {"time": 5743, "text": "Furthermore, they are not as bothered with people using physics the way we are worried about programming is done by humans."}, {"time": 5752, "text": "So each have problems and constraints the others have, but we are very immature compared to physics."}, {"time": 5761, "text": "So I would look at sort of the philosophical level and look for fundamental principles."}, {"time": 5769, "text": "Like you don't leak resources, you shouldn't."}, {"time": 5778, "text": "You don't take errors at runtime that you don't need to."}, {"time": 5778, "text": "You don't violate some kind of type system."}, {"time": 5789, "text": "There's many kinds of type systems, but when you have one, you don't break it, etc., etc."}, {"time": 5795, "text": "There will be quite a few, and it will not be the same for all languages."}, {"time": 5795, "text": "But I think if we step back at some kind of philosophical level, we would be able to agree on sets of principles that applied to sets of problem areas."}, {"time": 5812, "text": "And within an area of use, like in C++'s case, what used to be called systems programming, the area between the hardware and the fluffier parts of the system, you might very well see a convergence."}, {"time": 5832, "text": "So these days you see Rust having adopted RAII and sometimes accuse me for having borrowed it 20 years before they discovered it."}, {"time": 5847, "text": "But we're seeing some kind of convergence here instead of relying on garbage collection all the time."}, {"time": 5858, "text": "The garbage collection languages are doing things like the dispose patterns and such that imitate some of the construction destruction stuff."}, {"time": 5866, "text": "And they're trying not to use the garbage collection all the time and things like that."}, {"time": 5872, "text": "So there's a conversion."}, {"time": 5872, "text": "But I think we have to step back to the philosophical level, agree on principles, and then we'll see some conversions, convergences."}, {"time": 5884, "text": "And it will be application domain specific."}, {"time": 5890, "text": "So a crazy question, but I work a lot with machine learning, with deep learning."}, {"time": 5890, "text": "I'm not sure if you touch that world that much, but you could think of programming as a thing that takes some input."}, {"time": 5904, "text": "A programming is the task of creating a program and a program takes some input and produces some output."}, {"time": 5909, "text": "So machine learning systems train on data in order to be able to take an input and produce output."}, {"time": 5917, "text": "But they're messy, fuzzy things, much like we as children grow up."}, {"time": 5917, "text": "We take some input, we make some output, but we're noisy."}, {"time": 5928, "text": "We mess up a lot."}, {"time": 5928, "text": "We're definitely not reliable."}, {"time": 5928, "text": "Biological system are a giant mess."}, {"time": 5933, "text": "So there's a sense in which machine learning is a kind of way of programming, but just fuzzy."}, {"time": 5941, "text": "It's very, very, very different than C++."}, {"time": 5941, "text": "Because C++ is just like you said, it's extremely reliable, it's efficient, you can measure it, you can test it in a bunch of different ways."}, {"time": 5958, "text": "With biological systems or machine learning systems, you can't say much except sort of empirically saying that 99.8% of the time, it seems to work."}, {"time": 5966, "text": "What do you think about this fuzzy kind of programming?"}, {"time": 5974, "text": "Do you even see it as programming?"}, {"time": 5974, "text": "Is it totally another kind of world?"}, {"time": 5981, "text": "I think it's a different kind of world."}, {"time": 5981, "text": "And it is fuzzy."}, {"time": 5981, "text": "And in my domain, I don't like fuzziness."}, {"time": 5988, "text": "That is, people say things like they want everybody to be able to program."}, {"time": 5988, "text": "But I don't want everybody to program my airplane controls or the car controls."}, {"time": 5996, "text": "I want that to be done by engineers."}, {"time": 6006, "text": "I want that to be done with people that are specifically educated and trained for doing building things."}, {"time": 6013, "text": "And it is not for everybody."}, {"time": 6013, "text": "Similarly, a language like C++ is not for everybody."}, {"time": 6020, "text": "It is generated to be a sharp and effective tool for professionals, basically, and definitely for people who aim at some kind of precision."}, {"time": 6030, "text": "You don't have people doing calculations without understanding math."}, {"time": 6037, "text": "Counting on your fingers is not going to cut it if you want to fly to the moon."}, {"time": 6044, "text": "And so there are areas where an 84% accuracy rate, 16% false positive rate, is perfectly acceptable and where people will probably get no more than 70."}, {"time": 6056, "text": "You said 98%."}, {"time": 6056, "text": "What I have seen is more like 84."}, {"time": 6069, "text": "And by really a lot of blood, sweat, and tears, you can get up to 92.5."}, {"time": 6076, "text": "So this is fine if it is, say, prescreening stuff before the human look at it."}, {"time": 6076, "text": "It is not good enough for life threatening situations."}, {"time": 6087, "text": "And so there's lots of areas where the fuzziness is perfectly acceptable and good and better than humans, cheaper than humans, cheaper than humans."}, {"time": 6100, "text": "But it's not the kind of engineering stuff I'm mostly interested in."}, {"time": 6100, "text": "I worry a bit about machine learning in the context of cars."}, {"time": 6108, "text": "You know much more about this than I do."}, {"time": 6113, "text": "I worry too."}, {"time": 6114, "text": "But I'm sort of an amateur here."}, {"time": 6114, "text": "I've read some of the papers, but I've not ever done it."}]}]