[{"title": "Eric Weinstein: On the Nature of Good and Evil, Genius and Madness | Lex Fridman Podcast #134", "id": "o2nG7-eXxko", "quotes": [{"time": 272, "text": "I mean, I'm in love with the story of it."}, {"time": 276, "text": "You're often so poetic about music."}, {"time": 280, "text": "Like it clearly touches your soul on many levels."}, {"time": 285, "text": "Is it deeper than just rocking out with the in your convertible Corvette 69?"}, {"time": 292, "text": "I imagine Eric Weinstein is driving down the California highways, blasting some kind of music."}, {"time": 298, "text": "Is it just like being able to be carefree for moments of time?"}, {"time": 303, "text": "Or is there something more fundamental that connects to like the theory of everything in physics and life and all of that?"}, {"time": 311, "text": "How often do you have the chance, for example, to hear mathematics performed as you do in Bach, right?"}, {"time": 317, "text": "Like something with that kind of precision and elegance that can't really be grasped, where to go back to Leonard Cohen's famous line, the baffled king composing, right?"}, {"time": 331, "text": "Such a good song."}, {"time": 332, "text": "Such a good song, but it's also like individual verses of that song are insanely important."}, {"time": 339, "text": "The baffled king is how we often make music."}, {"time": 343, "text": "We don't really understand what did we just do that broke that person's heart sitting on the couch, right?"}, {"time": 350, "text": "And so it's a very strange thing that you should be able to have."}, {"time": 354, "text": "Think of it like you're a computer."}, {"time": 355, "text": "You've got this weird open music port, port 37.8, you know?"}, {"time": 360, "text": "Like it's not even supposed to be there."}, {"time": 363, "text": "And suddenly somebody starts playing guitar and they're making you feel things."}, {"time": 367, "text": "Or like in particular, particular instruments like the violin, it's so difficult."}, {"time": 374, "text": "It's so unforgiving."}, {"time": 375, "text": "And when it gives up its secrets, it just, you know, it wraps its fingers around your heart and won't let go."}, {"time": 382, "text": "Sometimes I talk about head, heart, and loins."}, {"time": 384, "text": "When something can grab your head, heart, and your loins at the same moment and integrate them, there are very few opportunities to live like that."}, {"time": 394, "text": "And if you think about Eddie Van Halen, as far as your head, the musical innovations and the fact that he was drawing directly from the classical canon really speaks to the idea that maybe rock is what somebody like Jimi Hendrix saw it as being, you know, an infinitely extensible medium."}, {"time": 416, "text": "In terms of heart, I always notice the smile on his face."}, {"time": 421, "text": "It's painful to look at an Eddie Van Halen solo now."}, {"time": 425, "text": "Like sometimes you'll see the cigarette dripping off the side of his mouth and you're like, that's gonna fucking kill you."}, {"time": 430, "text": "And I'm not even worried about it for you."}, {"time": 432, "text": "I'm worried about it for me."}, {"time": 433, "text": "You're gonna rob."}, {"time": 434, "text": "I don't even need to hear you play another note."}, {"time": 436, "text": "I just like knowing that you're in the world, that there is somebody that everyone looks to that nobody, I've never heard a guitarist say, eh, I don't know."}, {"time": 445, "text": "I think he was okay."}, {"time": 446, "text": "Like I've never heard it."}, {"time": 448, "text": "You can hate him, but you still think he was a genius."}, {"time": 451, "text": "There are very few people like that in the world."}, {"time": 454, "text": "And then loins, those leaps, that guy was incredibly good looking and, you know, skin tight pants, super athleticism."}, {"time": 463, "text": "He completely owned the male sexuality of the stage, both being the completely dominant, you know, sort of mythical alpha male."}, {"time": 472, "text": "I hate that expression, but there you are."}, {"time": 474, "text": "But also this kind of little boy with this mischievous smirk and, you know, the sense that it all came together."}, {"time": 482, "text": "How could you not eat that up?"}, {"time": 484, "text": "You could just imagine the millions of like young teenage boys, gorgeous, like playing air guitar in their room, just that, yeah, basically dreaming of being that kind of God, the most perfect example of what a human being can be."}, {"time": 500, "text": "Yeah, it's fascinating to think."}, {"time": 502, "text": "It is, and then, you know, as in many of the cases with these bands, you get these multiple talents in the same outfit."}, {"time": 510, "text": "And I think that the original configuration with David Lee Roth, I mean, David Lee Roth is such a hot mess at all times."}, {"time": 518, "text": "I would love you to talk to David Lee Roth."}, {"time": 521, "text": "Like if the, that dance would be just gorgeous."}, {"time": 527, "text": "Can you handle it?"}, {"time": 528, "text": "Can you ride that?"}, {"time": 531, "text": "Probably not because I think he's very, I get the feeling that he's very smart and very dysregulated."}, {"time": 540, "text": "And I don't know that I could, like bring him down to earth for a moment."}, {"time": 544, "text": "Well, I can also get pretty dysregulated, you know?"}, {"time": 547, "text": "And so I don't know whether, it could be magic."}, {"time": 550, "text": "It could be a shit show."}, {"time": 551, "text": "I don't know what you thought of his appearance on Rogan."}, {"time": 554, "text": "That was an interesting one."}, {"time": 555, "text": "I loved it, but Joe and that, and Joe does this sometimes, sometimes he just sits back and listens and he just lets like the music play, which works really well."}, {"time": 566, "text": "I think you have a chance to kind of jump into the chaos and then you'll just start."}, {"time": 572, "text": "And the places you will go, you may not even talk about music for like hours."}, {"time": 577, "text": "It might just go to this, cause he, I think lives in Japan."}, {"time": 580, "text": "Like there's a weird, he's been an EMT after he was a rock star."}, {"time": 585, "text": "He chose to be kind of like, I don't know."}, {"time": 588, "text": "You know, it's like there's depth to that man that hasn't been explored by him either."}, {"time": 593, "text": "So that'll be an exciting conversation."}, {"time": 596, "text": "Can we go back to Larry Cohen?"}, {"time": 598, "text": "Can we just, the things I feel when I listen to Hallelujah by Leonard Cohen or anything by him really, but that one."}, {"time": 607, "text": "Do you really want to get into it?"}, {"time": 609, "text": "What is it that song mean to you?"}, {"time": 614, "text": "Is it love?"}, {"time": 617, "text": "Well, first of all, it's mystery."}, {"time": 619, "text": "Like it starts off about mystery."}, {"time": 622, "text": "So what are you doing?"}, {"time": 624, "text": "You're doing this alternation between the two chords."}, {"time": 628, "text": "So three notes at the same time."}, {"time": 630, "text": "One is called the tonic, or you have the major and the relative minor and he's alternating between them."}, {"time": 638, "text": "There's only one note of difference between those two chords."}, {"time": 641, "text": "One of them would be feeling sad."}, {"time": 642, "text": "One of them would be more joyous, typically described."}, {"time": 646, "text": "And so by altering one note, it's the minimal amount to take you back and forth between joy and happiness as that's encoded in us."}, {"time": 654, "text": "So he starts off with, I heard there was a scene, David played the please a little bit."}, {"time": 658, "text": "You don't really care for music, do you?"}, {"time": 662, "text": "That's really interesting because he's using this technique called Bethos, right?"}, {"time": 666, "text": "So the alternation between the sublime and kind of the guttural or ridiculous or the mundane, right?"}, {"time": 673, "text": "So he's like."}, {"time": 675, "text": "There's a bitterness to it too."}, {"time": 676, "text": "Is it just play?"}, {"time": 678, "text": "Well, the way I hear it, again, a great song allows for different interpretations."}, {"time": 681, "text": "You happen to be asking me, so I'm going to impart some stuff that probably isn't in the song, but why it speaks to me, that's what makes it great."}, {"time": 688, "text": "The way I hear it is he doesn't believe the audience."}, {"time": 692, "text": "Then what are you doing listening to this?"}, {"time": 694, "text": "You stupid idiots, of course you care for music."}, {"time": 697, "text": "You're too cool to care."}, {"time": 699, "text": "So I see through you and screw you."}, {"time": 701, "text": "That's the energy I get."}, {"time": 705, "text": "Then he does this weird thing."}, {"time": 706, "text": "It goes like this is where he should put the description of where he is in the chord progression, which is the tonic, right?"}, {"time": 714, "text": "And then he hits the fourth and the fifth, which are the two other major elements, the subdominant and the dominant in functional harmony."}, {"time": 722, "text": "So he's describing the chord progression in real time in the lyrics."}, {"time": 727, "text": "There's two ways this can come about in other songs."}, {"time": 730, "text": "We had this example of every time we say goodbye."}, {"time": 734, "text": "Do you know this song?"}, {"time": 735, "text": "Every time we say goodbye."}, {"time": 737, "text": "No, I think it was a Cole Porter, maybe, or Gershwin, maybe Porter, I don't know."}, {"time": 742, "text": "I cry a little, there is no love song finer, but how strange the change from major to minor, right?"}, {"time": 752, "text": "Like it's a beautiful use of it."}, {"time": 754, "text": "Then there's times when it's duplicitous."}, {"time": 757, "text": "So for example, you'll have, I guess my favorite examples of this are Johnny Cash's Ring of Fire."}, {"time": 765, "text": "I fell into a burning ring of fire."}, {"time": 768, "text": "And then what does he do with the lyrics in the tune?"}, {"time": 773, "text": "I went down, down, down."}, {"time": 775, "text": "He goes up, right?"}, {"time": 776, "text": "And so the idea is like, oh, okay, that was a head fake."}, {"time": 780, "text": "And another one of these is Nina Simone's Feeling Good."}, {"time": 785, "text": "Oh, okay, so what do you get?"}, {"time": 787, "text": "Birds flying high, you know how I feel."}, {"time": 792, "text": "Then sun up in the sky, you know how I feel."}, {"time": 798, "text": "That woman's voice, she doesn't give a damn yet."}, {"time": 802, "text": "She's just."}, {"time": 802, "text": "And I feel it, but then what's the, da dum, da dum."}, {"time": 806, "text": "It's like heavy stripping music."}, {"time": 808, "text": "It's, you're not in a good place."}, {"time": 810, "text": "You're probably in some strip club, with the last of your money, you're drinking lousy beer, some bad situation."}, {"time": 819, "text": "And she's feeling good?"}, {"time": 820, "text": "No, it's funereal."}, {"time": 821, "text": "It's oppressive, right?"}, {"time": 823, "text": "I never thought of that song that way."}, {"time": 826, "text": "Well, you think of it as joyous?"}, {"time": 829, "text": "No, no, no, if you think about it, contrast it with Ray Charles, for example."}, {"time": 833, "text": "You know, do you know Lonely Avenue?"}, {"time": 836, "text": "Well, my room has got two windows, but the sunshine never comes through."}, {"time": 842, "text": "It's really depressed."}, {"time": 844, "text": "It's the same sort of vibe as Nina, but she's claiming that she's in great shape."}, {"time": 849, "text": "So she's like a good case of the unreliable narrator."}, {"time": 853, "text": "Leonard Cohen, to me, is talking about the unreliable audience."}, {"time": 856, "text": "That's too cool to be with the performer on stage."}, {"time": 858, "text": "There are things that go with the music, like the Cole Porter stuff, there's go against like the Johnny Cash."}, {"time": 863, "text": "I think these are the games that musicians play that the rest of us only sort of notice subliminally."}, {"time": 871, "text": "Fourth, the fifth, then he, when he, he should say something about the relative minor or the, he's giving you the secret, the baffled king, in other words, he doesn't know why it works."}, {"time": 882, "text": "Did Pachelbel know why Pachelbel's Canon would work?"}, {"time": 885, "text": "It was a discovery."}, {"time": 887, "text": "That's the whole thing."}, {"time": 888, "text": "Like some music is discovered and some music is invented."}, {"time": 892, "text": "And he's talking about a musical discovery."}, {"time": 896, "text": "He's talking about the Pythagorean power of the wave equation and then superimpose, like there's two genius intellectual concepts behind music."}, {"time": 905, "text": "One of which is the wave equation."}, {"time": 907, "text": "Usually we solve it for a one dimensional medium because we're talking about strings or air columns."}, {"time": 911, "text": "Occasionally you're talking about things like handpans or steel drums or metallophones or gamelons, whatever."}, {"time": 919, "text": "And those have a wave equation too, that's much more chaotic."}, {"time": 923, "text": "The other equation is this crazy thing that two to the 19 twelfths is almost exactly equal to three, which is what gave us even temperament."}, {"time": 931, "text": "And so the tension between those two things is in fact one of these most beautiful stories inside of that system."}, {"time": 940, "text": "That formula of the baffled king is a discovery."}, {"time": 943, "text": "It's not, he's not really composing it."}, {"time": 946, "text": "The reason he's baffled, it's imagine that you took like a little brush and you started brushing off a pyramid under the sands."}, {"time": 955, "text": "You might think that you created the pyramid by your brushing, but in fact, if somebody else did it, that's why you're baffled, right?"}, {"time": 962, "text": "That's beautifully put, you're right."}, {"time": 964, "text": "And as creating one of the greatest songs of all time and as he's doing it, he's baffled."}, {"time": 970, "text": "And he's within the song."}, {"time": 973, "text": "And he Leonard is baffled is my contention, but he knows enough to know that he's baffled, right?"}, {"time": 979, "text": "And so the idea is that he is composing, he has the audacity to compose as David."}, {"time": 987, "text": "He's echoing David at a minimum."}, {"time": 990, "text": "And then in a later song, which I really wish we would discuss, that's totally dystopic and you will not like it at all, is the future, which contains this line that I think I used in my episode with Roger Penrose on the portal."}, {"time": 1004, "text": "Note the subtle plug."}, {"time": 1005, "text": "The portal, the portal, the portal, the portal."}, {"time": 1009, "text": "I'm the little Jew that wrote the Bible."}, {"time": 1011, "text": "So there is this way in which Leonard Cohen, I think is constantly coming to the idea of being a biblical like scribe."}, {"time": 1019, "text": "And I think this is one of the great things that you see Dylan doing this with all along the watchtower."}, {"time": 1024, "text": "You saw Warren Zevon, who we should talk much more about, doing this with a song called I Was in the House When the House Burned Down."}, {"time": 1031, "text": "Do you know this thing?"}, {"time": 1033, "text": "This is embarrassing."}, {"time": 1034, "text": "Sweetheart."}, {"time": 1034, "text": "This is a great day."}, {"time": 1036, "text": "Warren Zevon is one of the most important songwriters of our time."}, {"time": 1040, "text": "And he's been largely forgotten by this generation."}, {"time": 1046, "text": "But Bob Dylan would sing one of his songs in tribute."}, {"time": 1049, "text": "I've heard Bob Dylan, you know, very small number of songwriters really move him."}, {"time": 1055, "text": "Woody Guthrie, Gordon Lightfoot, and Warren Zevon."}, {"time": 1060, "text": "By the way, Bob Dylan, if you're out there, appear on either one of our podcasts."}, {"time": 1065, "text": "We need to get your voice into a new medium for a new group."}, {"time": 1069, "text": "This is a time for Bob Dylan, my friend."}, {"time": 1072, "text": "Honestly, you've been doing an amazing job in this space."}, {"time": 1075, "text": "One of the reasons I'm super excited to do this podcast again is that I've learned some things about what I don't do well."}, {"time": 1083, "text": "And I also have sort of struggled with the question, should I do those things better?"}, {"time": 1088, "text": "Because what if it's, you know, I always use the same example of the fitted sheet when you're trying to put a queen size fitted sheet on a king size mattress."}, {"time": 1095, "text": "He's like, okay, I got that corner squared away."}, {"time": 1097, "text": "Then you get another corner that pops off and they have to go back around."}, {"time": 1101, "text": "I wonder whether I can improve my style in the ways in which, you know, I think it's just a recognition of a difference."}, {"time": 1108, "text": "You do a better job of getting to the soul of a really top intellectual guest and making them accessible and presenting them as themselves for a huge number of people."}, {"time": 1122, "text": "And I'd give my eye tooth to be able to do that."}, {"time": 1125, "text": "Do you ever think about this?"}, {"time": 1126, "text": "Like, cause I think about what is the greatest conversation I'll ever have."}, {"time": 1132, "text": "You know, like in a sense of the portal, not to reduce it to anything, but there will be the greatest conversation."}, {"time": 1140, "text": "You may have already had it, but it's very possible."}, {"time": 1143, "text": "If enough people like me can keep twisting your arm to keep doing the portal, please, that is, there'll be an amazing conversation."}, {"time": 1152, "text": "One of the questions that I ask myself is like, who is the person that I'm especially equipped?"}, {"time": 1160, "text": "For some reason, I'm convinced on Putin."}, {"time": 1163, "text": "There's something in my head that says, I can do this man better than anyone else in this world."}, {"time": 1170, "text": "I got this thought in my head about it, I don't know why."}, {"time": 1172, "text": "And I'm convinced, but I think the universe works in that way."}, {"time": 1175, "text": "Like if it tells you, it's gonna happen."}, {"time": 1178, "text": "The way I would say it is, is that almost everybody who becomes a Supreme Court justice believes at a very early age, they're going to become a Supreme Court justice."}, {"time": 1186, "text": "Many people believe at an early age that they can do it, don't get there."}, {"time": 1189, "text": "But of those who get there, almost all of them had this sort of, well, I call it pathological self confidence."}, {"time": 1196, "text": "And I do think you have pathological self confidence and you also have humility."}, {"time": 1202, "text": "And most people would hear those as a contradiction."}, {"time": 1205, "text": "I think that you would not be able to get away with what you do if you didn't have the humility."}, {"time": 1211, "text": "And so I think the great danger is that your equation becomes unbalanced, that you either lose the humility or you lose the humility overwhelms the ego and the drive."}, {"time": 1224, "text": "Because right now you've got a Mexican standoff in your mind and the rest of us are just benefiting."}, {"time": 1229, "text": "My Mexican standoffs aren't as stable as yours."}, {"time": 1232, "text": "It's all reservoir dogs all the time."}, {"time": 1236, "text": "But actually the person who that describes is Peter Thiel."}, {"time": 1239, "text": "Peter Thiel thinks more, people always say like, what does Peter think about X, Y, and Z, P, and Q?"}, {"time": 1244, "text": "It's like, well, do you want communist Peter?"}, {"time": 1246, "text": "Do you want hyper capitalist Peter?"}, {"time": 1247, "text": "He's got all these minds in there, oh my God, right?"}, {"time": 1250, "text": "On everything."}, {"time": 1250, "text": "That's why he's successful is that he's got all these minds fighting each other."}, {"time": 1253, "text": "And so when people say Peter is this or Peter is that, I just laugh because like nobody who knows him would describe him as having thoughts at the level that people are claiming."}, {"time": 1264, "text": "And I do think that in my case, there's also pathological epistemic humility."}, {"time": 1274, "text": "Like just, I know how little I can do in one life."}, {"time": 1280, "text": "I know how many things I've screwed up."}, {"time": 1282, "text": "I know how many things I've got wrong."}, {"time": 1285, "text": "And on the other hand, I know that if not, it's like Hillel's questions, if I'm not for myself, who will be for me?"}, {"time": 1292, "text": "And if I'm only for myself, what am I?"}, {"time": 1294, "text": "If not now, when?"}, {"time": 1296, "text": "At some level, there's a question about if I don't decide that someone is capable and that that somebody is me."}, {"time": 1305, "text": "And if I apply that to everyone else on the planet, then nobody's gonna do anything."}, {"time": 1310, "text": "And so I do think that one of the things that people like you and I get is who are you to say that?"}, {"time": 1317, "text": "F that, man, just sign me up for some Dunning Kruger."}, {"time": 1323, "text": "Yeah, but it's multiple minds like you said."}, {"time": 1326, "text": "Like this morning, I was feeling so good and confident about I couldn't think no wrong."}, {"time": 1332, "text": "And I remember last night clearly thinking that I'm the dumbest human who's ever lived and nothing I've ever said is worth anything."}, {"time": 1339, "text": "What the fuck am I doing with my life?"}, {"time": 1342, "text": "Why am I scared?"}, {"time": 1343, "text": "I was terrified of this conversation."}, {"time": 1346, "text": "Who the hell am I?"}, {"time": 1347, "text": "This conversation?"}, {"time": 1348, "text": "Because I'm an idiot."}, {"time": 1349, "text": "And because, you know, Lex, but no, no, no, no."}, {"time": 1354, "text": "But this morning, I was the baddest motherfucker who's ever walked this earth."}, {"time": 1359, "text": "So I was very conscious."}, {"time": 1361, "text": "I think it was the coffee, I'm not sure, maybe some sleep."}, {"time": 1364, "text": "This sounds very Russian and it involves multiple beverages, some of them being alcoholic, others containing caffeine."}, {"time": 1369, "text": "There's, in fact, I can't share the story behind it, but there is a bottle of vodka in the fridge."}, {"time": 1377, "text": "So, I mean, I should have hit you for coffee because this is a morning show here."}, {"time": 1382, "text": "So I put out a call that we get a chance to have this conversation and people ask these wonderful questions."}, {"time": 1388, "text": "A few people asked about depression and suicide."}, {"time": 1396, "text": "This is a Russian program, so we have to go there."}, {"time": 1399, "text": "And I think about Leonard Cohen and one of the things that always kind of broke my heart and kind of suffocated the hope I have for just, I don't know, for love in a person's life is to hear how much depression was a part of Leonard Cohen's life and how much he suffered."}, {"time": 1424, "text": "I guess one way, I'm not sure where we can go with this question, but do you think about the places that the mind can go, like these dark places?"}, {"time": 1435, "text": "Is there something like where the only escape out is suicide, for example, that's the darkest version of it?"}, {"time": 1442, "text": "That, I really think suicide is a big place in suicidal ideation and self harm and we don't talk a lot about it."}, {"time": 1454, "text": "It's a similar problem to trying to talk about trans."}, {"time": 1457, "text": "These are umbrella categories."}, {"time": 1459, "text": "And if the commonality is that somebody harms themselves, but we don't know whether that's coming because of a problem in brain chemistry, because of an event in their life, whether evolutionary programming for suicide is weirdly normal, whether or not it might have a religious motivation."}, {"time": 1480, "text": "There's too many different forms of self harm."}, {"time": 1483, "text": "It's something like the 10th largest killer thereabouts."}, {"time": 1489, "text": "And I think that you can look at it from different angles."}, {"time": 1493, "text": "I'm old enough to have had Pete Seeger come to my college when I was at university and to watch his good humor in the face of all adversity."}, {"time": 1507, "text": "I think of Odetta, I used to go to Odetta concerts."}, {"time": 1510, "text": "I don't know if you know who she is."}, {"time": 1513, "text": "Okay, this is gonna be one of the better days of your life."}, {"time": 1515, "text": "Check out Odetta when we're done with the interview."}, {"time": 1519, "text": "She was a civil rights figure, but also just had a profound voice and great musicianship."}, {"time": 1525, "text": "These people were in the struggle, right?"}, {"time": 1529, "text": "And they saw lots of bad things happen and they kept their humor about them."}, {"time": 1534, "text": "And the thing is that you can take on the Weltschmerz, the pain of the planet, or you can try to do something else, which is to be a happy warrior, even if the odds are terrible and the cost of failure is catastrophic."}, {"time": 1555, "text": "So even when surrounded by darkness."}, {"time": 1558, "text": "But the thing is with Leonard Cohen is he created such beautiful music."}, {"time": 1563, "text": "And yet it's like Anthony Bourdain, the same."}, {"time": 1568, "text": "And yet they go to this dark place."}, {"time": 1571, "text": "And it could be, it's easy to say it's just biochemistry."}, {"time": 1576, "text": "There's a linkage between this highly generative, creative side and in some cases, dark depression, in other cases, not."}, {"time": 1586, "text": "So you can't say that it's tied, the genius and madness are always co traveling or the beauty and pain are one in the same."}, {"time": 1595, "text": "What you can say is that there's a cluster of people that tell you that for that cluster, there is a relationship between the darkness and the beauty."}, {"time": 1603, "text": "And I do think that in part, it's squaring circles that can't be squared."}, {"time": 1607, "text": "We were just talking before about the inability to serve two perfect systems, the perfect system of the wave equation and the perfect system of even temperament."}, {"time": 1621, "text": "They're both perfect, they're not compatible."}, {"time": 1625, "text": "And once you realize that there is perfection and an inability to make contact with perfection, I think you recognize that there is no solution to this world."}, {"time": 1643, "text": "Yeah, that's weird with the poets and musicians."}, {"time": 1646, "text": "Do you want to say this is a particular thing that you do, but then there's Spanish fly by Van Halen."}, {"time": 1653, "text": "And then you realize, oh, well, what do you get out of Spanish fly by Van Halen?"}, {"time": 1657, "text": "I think it's very singular because of the fact that it's purely acoustic."}, {"time": 1662, "text": "For some reason, I always, I couldn't imagine Eddie Van Halen separate from the band in front of thousands of people just screaming and rocking out with lights everywhere."}, {"time": 1673, "text": "And Spanish fly made me think like, it made me imagine him sitting alone on a couch in a room."}, {"time": 1678, "text": "I think that's who he was, I really do."}, {"time": 1680, "text": "I mean, believe me, I get it."}, {"time": 1683, "text": "He was a rockstar, he was a rock god."}, {"time": 1684, "text": "Got it, got it, got it, got it."}, {"time": 1687, "text": "I'm almost positive that you can't get to where he got to without being a complete introvert."}, {"time": 1693, "text": "Yeah, it made me imagine that there's some half naked supermodel walking around, hoping that they can do their thing together."}, {"time": 1704, "text": "And Eddie's completely disinterested."}, {"time": 1706, "text": "He'd be with the guitar."}, {"time": 1707, "text": "He'd be with the guitar, right?"}, {"time": 1709, "text": "Because honestly, at some level, in one case, maybe you're conquesting, maybe you're pursuing love and romance."}, {"time": 1717, "text": "In the other case, you're talking about a relationship to the order, the creator, the almighty, whatever it is you want to call that substrate that is reality."}, {"time": 1726, "text": "And do I believe that Eddie Van Halen and Jimi Hendrix and Paganini and Heifetz jacked into the true essence of the world?"}, {"time": 1737, "text": "I don't think it's as good as differential geometry."}, {"time": 1741, "text": "I do think it's amazing for other reasons."}, {"time": 1745, "text": "And thank God, because it's very typical to communicate differential geometry at scale."}, {"time": 1750, "text": "But the thing about eruption, for example, what level do you want to come into eruption?"}, {"time": 1755, "text": "Do you want just the sheer majesty and pageantry?"}, {"time": 1758, "text": "Do you want the theatrics?"}, {"time": 1760, "text": "Like you could put him on wires and set his pants on fire or whatever, and it'd be totally in keeping with it."}, {"time": 1767, "text": "On the other hand, you want to talk to something completely precise that shows off the virtuosity of what's possible with the Stratocaster."}, {"time": 1776, "text": "Everything works."}, {"time": 1778, "text": "Multi axis."}, {"time": 1779, "text": "But there's a precision to it, which is very different than Hendrix."}, {"time": 1784, "text": "There's a messiness to Hendrix that to me, somebody who has OCD has always been a struggle."}, {"time": 1789, "text": "How does Hendrix affect you?"}, {"time": 1790, "text": "I mean, let's have the Jimi Hendrix conversation."}, {"time": 1792, "text": "I don't know that we can do anything to it that hasn't already been done to it."}, {"time": 1796, "text": "Maybe that's not true."}, {"time": 1796, "text": "Maybe the idea is that every generation has to have its Hendrix conversation, and this is a long form part."}, {"time": 1802, "text": "It's Jimi Hendrix experience."}, {"time": 1804, "text": "Yeah, so funny."}, {"time": 1805, "text": "I hear you stole it from Joe Rogan."}, {"time": 1810, "text": "There's so many details."}, {"time": 1811, "text": "One, it hurt my soul on so many levels that you can put a thumb over the guitar to play a note, to hold the note."}, {"time": 1823, "text": "And it doesn't, because I want it to be the Russian virtuoso that sits with his classical guitar in a perfect form, plays really fast with the fingers, and then you want the thumb to be perfectly relaxed and supporting the neck."}, {"time": 1837, "text": "So that's the Russian conservatory student."}, {"time": 1839, "text": "Conservatory student, yeah."}, {"time": 1840, "text": "Then there's the Russian wild man."}, {"time": 1844, "text": "Well, they're different Russian archetypes, right?"}, {"time": 1847, "text": "So the completely idiosyncratic Russian is very different in a weird way from the, I can do this backwards in any key in my sleep and in any time signature that you just snap your fingers."}, {"time": 1863, "text": "We've discussed my piano tuner in previous episodes."}, {"time": 1868, "text": "No, no, that was offline conversation."}, {"time": 1870, "text": "You told me the story."}, {"time": 1871, "text": "I should tell you the story."}, {"time": 1873, "text": "You should retell the story."}, {"time": 1874, "text": "There I was in darkest Manhattan with the world's shittiest, it wasn't even an upright, it was a spinet piano."}, {"time": 1881, "text": "A friend had given it to me."}, {"time": 1883, "text": "The piano fell out of tune and I would have to tune it."}, {"time": 1887, "text": "And the only tuner I knew was this Russian guy and I hated dealing with him."}, {"time": 1891, "text": "There was something about his attitude that just really rubbed me the wrong way."}, {"time": 1895, "text": "So anyway, my wife says, tune that thing."}, {"time": 1897, "text": "So we get the piano tuner to come and he's tuning this."}, {"time": 1900, "text": "He's like, are you sure you wanna tune this piece of shit?"}, {"time": 1905, "text": "So he's like, okay, it's your money."}, {"time": 1908, "text": "The phone rings and I have the phone ringer set on a landline to Paganini Caprice 24."}, {"time": 1915, "text": "And immediately as the phone rings, he figures out what key the phone ringer is and which is not the key that like list composed the variations on Caprice 24."}, {"time": 1929, "text": "And he starts going into theme and variations on Caprice 24 at some level I've never heard before, just jaw dropping it."}, {"time": 1937, "text": "And like the phone stops ringing and we have this awkward silence."}, {"time": 1940, "text": "I said, I didn't know you were such a great piano player."}, {"time": 1943, "text": "And then he says one of these things in Russian accented English hurts in a way you can't imagine."}, {"time": 1949, "text": "He said, no, you are the piano player."}, {"time": 1951, "text": "I am merely the piano tuner."}, {"time": 1953, "text": "And I was just like, oh man, through the heart."}, {"time": 1958, "text": "You know, it's kind of reminiscent."}, {"time": 1960, "text": "I'd love to hear actually your opinion."}, {"time": 1961, "text": "This is reminiscent of the Good Will Hunting story."}, {"time": 1965, "text": "That movie?"}, {"time": 1966, "text": "That movie."}, {"time": 1967, "text": "What about it?"}, {"time": 1969, "text": "Yeah, I guess when I think of that film, I think about Matt Damon as a young guy, risking everything, giving up Harvard."}, {"time": 1980, "text": "I think probably the most accomplished group of people in the world are people who choose to give up Harvard voluntarily."}, {"time": 1987, "text": "Beautiful, right?"}, {"time": 1989, "text": "Bigger than Harvard."}, {"time": 1990, "text": "Ives was one of these people, Bill Gates, of course."}, {"time": 1998, "text": "And then oddly, you know."}, {"time": 1999, "text": "Zuckerberg."}, {"time": 2001, "text": "But then Steve Jobs gave up a Reed, and Reed is like the weirdest, craziest college in the world."}, {"time": 2007, "text": "People should pay much more attention to Reed."}, {"time": 2009, "text": "And I'm sorry it's going through a hard time at the moment, but what it was before the current craziness is really an interesting story."}, {"time": 2016, "text": "Irregardless, as we say in the 617 Area Code, I think that a lot of my reaction is to the real story of Matt Damon having this vision and being the young guy to pull it off."}, {"time": 2029, "text": "And I also think about Robin Williams trying to explore heart through this lens of acting."}, {"time": 2038, "text": "And as you and I, you've hung out with comedians."}, {"time": 2044, "text": "They know that they already screwed up a bunch of people."}, {"time": 2048, "text": "They're proud about it."}, {"time": 2051, "text": "The idea that Robin Williams, who I saw many years ago when I was in LA in the comedy clubs around here, he was a straight up crazy, dysregulated genius in tremendous pain."}, {"time": 2065, "text": "And his desire to do it earnestly through acting rather than constantly by just sniping or being a clown or showing us how fast his mind worked relative to ours, I was really moved by that."}, {"time": 2082, "text": "I thought that he brought some authenticity and took a huge risk for a comedian to be that real."}, {"time": 2089, "text": "And again, like you said, it doesn't always have to be, but in that case, the madness and the genius were neighbors."}, {"time": 2096, "text": "That one couldn't have been any other way."}, {"time": 2099, "text": "No, because his mind, the thing about seeing him in a comedy club was that he would react to random stimulus in the environment."}, {"time": 2108, "text": "You know, it could be a heckler."}, {"time": 2109, "text": "Sometimes you almost got the feeling that he wanted a heckler because it gave him something to play against, right?"}, {"time": 2116, "text": "He was infinitely, instantly inventive."}, {"time": 2120, "text": "But I actually, to me, the best Robin Williams is as he got closer and closer to the end of his life because there was a sadness and he's almost fighting the sadness with this improvisational, like the weapons he has is this wit and humor and this dancing that he does with language."}, {"time": 2142, "text": "But, and then sometimes when you just fall silent, you can see the sadness."}, {"time": 2148, "text": "And I don't know, there's something so beautiful about that."}, {"time": 2151, "text": "It's like this bird with a broken wing that's like trying to fly, you know, and it's getting older and older."}, {"time": 2156, "text": "And I mean, those, he would have made a one hell of a podcast guest, I'll tell you that."}, {"time": 2164, "text": "That's a sad."}, {"time": 2165, "text": "Yeah, I have some sadness that I really do think that part of what we call podcasting is actually just getting to know a soul over and over again."}, {"time": 2174, "text": "Like maybe the idea is that this is talking about depression and sadness and heavy feelings is not an American specialty."}, {"time": 2188, "text": "Seeing that in context with the beauty of life is a Russian specialty."}, {"time": 2193, "text": "Like it is very much."}, {"time": 2194, "text": "Russian specialty, sounds like a diner menu."}, {"time": 2199, "text": "You want the Russian specialty?"}, {"time": 2200, "text": "A big scoop of ice cream with tons of depression."}, {"time": 2206, "text": "I do think that we're in a really terrifying and depressing time."}, {"time": 2211, "text": "And I think that part of it is that we don't know if something huge is about to get started."}, {"time": 2217, "text": "And we don't even know what this is."}, {"time": 2219, "text": "I mean, we just sit here in this weird world that is falling into some new state and we're not even super curious."}, {"time": 2226, "text": "It's like, what the hell just happened?"}, {"time": 2228, "text": "Everybody's got an answer."}, {"time": 2229, "text": "And I'm positive that all of those answers are wrong."}, {"time": 2233, "text": "Let's try to at least sneak up on the good answer."}, {"time": 2237, "text": "So the central core of the answer is that the US seemed to be the greatest thing in the world in large measure because we hadn't noticed that we were getting a benefit from having no plan, not having to make a plan for low growth."}, {"time": 2253, "text": "As long as we had growth, we were in great shape."}, {"time": 2258, "text": "Let's imagine that you could run an experiment, you have a billion copies of Earth and you start the initial conditions slightly different."}, {"time": 2268, "text": "On some giant number of planets, a lot of the things that were discovered from the 1800s through the end of the 20th century are discovered in a period of time because a lot of that just has to do with once you crack the puzzle of getting better instruments, you can see more."}, {"time": 2288, "text": "And the more you can see, the more you can make use of what you can see."}, {"time": 2291, "text": "And it turns out there was lots of stuff to do with like germs or electron orbitals or spectrum, electromagnetic spectrum."}, {"time": 2302, "text": "And so we got to do all of those things and the US roughly corresponded for a good chunk of its history with this bonanza."}, {"time": 2310, "text": "And so of course we look like an amazing genius country."}, {"time": 2314, "text": "We have no plan."}, {"time": 2315, "text": "Imagine that you could sell a car, you don't have to put in seat belts, you don't have to put in airbags, you don't have to put in rear view mirrors or sensors or a rear view mirror."}, {"time": 2324, "text": "You could save a lot of money on a car by not putting in all of the stuff to keep things from going wrong."}, {"time": 2332, "text": "And I think that's what we had."}, {"time": 2333, "text": "We had a machine that as long as growth was insanely good, we plowed it back, the riches and spoils and then treasure back into the system and made more genius stuff."}, {"time": 2344, "text": "And we carried along a good chunk of humanity, hundreds of millions of people."}, {"time": 2349, "text": "We did not have a plan for what happens when the growth goes below the stall speed of our society."}, {"time": 2356, "text": "How confident should we be that the growth has slowed in a way that is permanent rather than a kind of slap in the face where we..."}, {"time": 2366, "text": "It's not the right concept."}, {"time": 2367, "text": "Right concept is, I try to use the same words over and over again in case people see mold because then the perseveration actually gets somewhere."}, {"time": 2375, "text": "So I use this analogy of the orchard because everyone talks about low hanging fruit."}, {"time": 2380, "text": "They know the concept of low hanging fruit, but they don't think in terms of orchards."}, {"time": 2387, "text": "So they say things like, you think we've picked all the low hanging fruit, but I believe in the inventiveness of the human mind."}, {"time": 2393, "text": "It's like, okay, that doesn't even work as an analogy."}, {"time": 2398, "text": "What if the idea is we only picked all the low hanging fruit here, and then we're having this stupid argument about low hanging fruit, and we're not going and looking for new orchards."}, {"time": 2406, "text": "We're not planting new orchards."}, {"time": 2408, "text": "We're not looking for forests."}, {"time": 2409, "text": "We're just sitting here arguing about low hanging fruit."}, {"time": 2411, "text": "So my claim is there's probably a lot more low hanging fruit and it's not here."}, {"time": 2415, "text": "It's in other orchards."}, {"time": 2417, "text": "One of those turned out to be the digital orchard."}, {"time": 2420, "text": "The digital orchard has not been as stagnant as lots of these other, like the chemical orchard."}, {"time": 2429, "text": "I have faith that there is a small percentage of the population, but not zero, that's looking for those other orchards."}, {"time": 2438, "text": "Like I'm excited about one of those orchards, which is, I believe there'll be robots in everybody's homes and that will unlock some totally new thing."}, {"time": 2448, "text": "Totally new set of technologies, ideas, the way we live life, the productivity, all the everything, it'll change everything."}, {"time": 2457, "text": "So I'm excited about that orchard."}, {"time": 2459, "text": "So I'm roaming that orchard and wondering how the hell you kind of bring back like the ant that finds a new source of food."}, {"time": 2468, "text": "I'm trying to find an apple I can bring back to the."}, {"time": 2471, "text": "Great, so you're in an explorer idiom."}, {"time": 2476, "text": "And do you have faith that there's enough of those?"}, {"time": 2478, "text": "I don't think there are very many of us."}, {"time": 2480, "text": "I mean, I'm one of them too."}, {"time": 2482, "text": "How many does it take?"}, {"time": 2483, "text": "It takes one ant."}, {"time": 2488, "text": "How many elons does it take to screw in a light bulb?"}, {"time": 2491, "text": "Okay, let's imagine that we went, imagine some ant goes and finds a new source of food, right?"}, {"time": 2499, "text": "And then it comes back to the colony and it says, hey, I think I found a new source of food."}, {"time": 2504, "text": "And the initial reaction is, you're not authorized to find new food."}, {"time": 2511, "text": "Why would you try to go find new food?"}, {"time": 2512, "text": "We're gonna remove you from Twitter."}, {"time": 2514, "text": "Yeah, and by the way, I think the fact that you think you're allowed to go find new food shows how privileged you are as an ant."}, {"time": 2519, "text": "Get out of the colony, kill him, kill him."}, {"time": 2521, "text": "Well, that's probably not a great model for finding new orchards."}, {"time": 2526, "text": "And I think that what we find is that where there's a system that allows somebody to ascend without a lot of gatekeeping, you can have that."}, {"time": 2535, "text": "But I saw this happen in hedge funds."}, {"time": 2537, "text": "Hedge funds for a while hoovered up a lot of talent because they were places that had funding and had freedom."}, {"time": 2547, "text": "And in general, really smart people want to be free and they don't wanna think a lot about how they're gonna feed themselves."}, {"time": 2557, "text": "They wanna get lost in their minds."}, {"time": 2559, "text": "So you can either give them productive places to play, dangerous places to play."}, {"time": 2565, "text": "They're either gonna break into computers or find vaccines for you or build bombs or build companies."}, {"time": 2573, "text": "And we're not providing for the people who have to disrupt and have to innovate and trying to channel that effort."}, {"time": 2581, "text": "We're so focused on this other thing, which is fairness and safety."}, {"time": 2586, "text": "And fairness and safety, by the way, are really important."}, {"time": 2588, "text": "I don't wanna denigrate them."}, {"time": 2590, "text": "But the singular focus on fairness and safety without, in the same breath, being focused on growth and discovery and creation is gonna doom us because what we're talking about is we're always talking about divvying up the pie that is as opposed to the pie that will be."}, {"time": 2608, "text": "Imagine that you spent all your time trying to divvy up the 13th century pie and you destroyed your ability to get to the 20th century."}, {"time": 2616, "text": "You'd be an idiot."}, {"time": 2618, "text": "But one place I think I disagree with you is I don't think you need that many people to empower the geniuses, the innovators, the people who refuse to spend most of their days in meetings about fairness."}, {"time": 2633, "text": "Let's have a disagreement."}, {"time": 2634, "text": "I think podcasting, whatever you call that medium, is just one little example of a tool that you can give power to, like you and your podcast can have the next Elon Musk and make him a star."}, {"time": 2649, "text": "Now I see where you're going."}, {"time": 2651, "text": "There have been a series of places for people to play and be free."}, {"time": 2657, "text": "And we've lost them successively."}, {"time": 2659, "text": "What's a good place you remember?"}, {"time": 2661, "text": "Because I disagree with you there too."}, {"time": 2663, "text": "I think they're still there."}, {"time": 2664, "text": "You can still play."}, {"time": 2665, "text": "You interviewed Noam Chomsky."}, {"time": 2670, "text": "Noam Chomsky comes from an era."}, {"time": 2672, "text": "Where you can play?"}, {"time": 2673, "text": "Where you could play?"}, {"time": 2676, "text": "And you can't play."}, {"time": 2677, "text": "This is where I disagree with you."}, {"time": 2678, "text": "We've already had this."}, {"time": 2680, "text": "Go check the Clips channel for the Lex Friedman podcast."}, {"time": 2683, "text": "I think I wasn't brave enough at that time and I'm not really brave enough now."}, {"time": 2689, "text": "Because I don't."}, {"time": 2690, "text": "Where's the vodka?"}, {"time": 2691, "text": "It's a feeling and people are gonna tear me apart."}, {"time": 2694, "text": "Oh, what are you?"}, {"time": 2695, "text": "And you speak from emotion and facts."}, {"time": 2698, "text": "Wait, wait, wait, wait, wait."}, {"time": 2699, "text": "The feeling."}, {"time": 2700, "text": "What podcast is this?"}, {"time": 2702, "text": "Tell the people who are currently editing your brain, because I saw that move right now."}, {"time": 2708, "text": "That they should go find another podcast."}, {"time": 2711, "text": "Let's get rid of some of your audience right now."}, {"time": 2714, "text": "Please go find another podcast if you're editing my brain."}, {"time": 2717, "text": "Nevertheless, all the self doubt, they're sitting in that brain."}, {"time": 2721, "text": "I can't stand to watch this."}, {"time": 2723, "text": "What is this self doubt loop that you're in?"}, {"time": 2725, "text": "The thing is, when I walk the halls of MIT."}, {"time": 2732, "text": "There's bureaucracy, there's administrators that never have done anything interesting in their entire lives."}, {"time": 2737, "text": "There's meetings, there's."}, {"time": 2739, "text": "All the usual crap."}, {"time": 2741, "text": "But there's, in the eyes of individuals."}, {"time": 2746, "text": "There's this glow of excitement that has nothing to do with career."}, {"time": 2749, "text": "I understand this."}, {"time": 2751, "text": "And it's still a playground."}, {"time": 2752, "text": "There's little pockets of playgrounds from which genius can emerge still."}, {"time": 2758, "text": "And they're unaffected by diversity meetings or fairness meetings or blah, blah, blah."}, {"time": 2764, "text": "I love to hear that."}, {"time": 2766, "text": "Well, you don't think so?"}, {"time": 2767, "text": "I don't believe it."}, {"time": 2768, "text": "Cause I've watched the change, Lex."}, {"time": 2770, "text": "I've watched people."}, {"time": 2771, "text": "We were all editing ourselves all the time."}, {"time": 2773, "text": "I remember my old mind."}, {"time": 2774, "text": "I liked it better."}, {"time": 2777, "text": "All of this relentless focus on critical race theory and critical theory, postmodernism, fairness, social justice."}, {"time": 2786, "text": "It's making many of us into worse people."}, {"time": 2789, "text": "You think that's that?"}, {"time": 2790, "text": "Do you think the Matt Damon's of the character is paying attention to any of that?"}, {"time": 2795, "text": "You think that has an effect?"}, {"time": 2796, "text": "Have you seen what happened to Matt Damon himself?"}, {"time": 2799, "text": "Matt Damon has tried to say various things at various times that seemed to be relatively innocuous."}, {"time": 2804, "text": "He can't speak."}, {"time": 2806, "text": "Well, let's not mix up."}, {"time": 2808, "text": "Matt Damon is just an actor."}, {"time": 2810, "text": "He was just a Harvard student who came up with his own genius screenplay, acted and made it happen."}, {"time": 2817, "text": "No, we're somewhere else."}, {"time": 2819, "text": "You don't think you can build a rocket company out of MIT still?"}, {"time": 2823, "text": "I think that there are things that you can still do."}, {"time": 2826, "text": "But we're losing them."}, {"time": 2827, "text": "We lose them."}, {"time": 2828, "text": "We keep losing them."}, {"time": 2830, "text": "I would say the biggest problem, here, let me just say, what I think the solution would be is to fire anybody who's not faculty, especially young faculty should have way more power and administration should have much less power."}, {"time": 2847, "text": "Because right now, the administration, which used some of the, who used to be faculty, but they've lost the fire, the spark that gave them, they've lost the memories of the playground."}, {"time": 2859, "text": "And so the people that admire and love the playground, like you could see it in their behavior, should have way more power."}, {"time": 2866, "text": "And so we should create a systems that give them power."}, {"time": 2869, "text": "I think I'll take it."}, {"time": 2870, "text": "You're very idealistic."}, {"time": 2872, "text": "And you're very, you've got a huge heart."}, {"time": 2875, "text": "It's a weird time."}, {"time": 2876, "text": "Cause I don't want to dissuade you from believing beautiful things."}, {"time": 2882, "text": "Because I see how potent you are."}, {"time": 2884, "text": "You do all these things, Jiu Jitsu, guitar, podcasting, programming, computers, et cetera, et cetera."}, {"time": 2893, "text": "I don't think you're right."}, {"time": 2894, "text": "I think we're in a really deeply screwed up place where even the tiny number of, let me give you an alternate version of this dystopia."}, {"time": 2903, "text": "I do think that there are people who are capable and there's still places to play and cause things to happen that progress the story forward."}, {"time": 2910, "text": "But if you look at the fire that some of the people are in who fit that profile, like how much crap has Elon Musk taken?"}, {"time": 2919, "text": "Quite considerable, right?"}, {"time": 2922, "text": "And not much admiration from the... Craig Venter, Jim Watson."}, {"time": 2931, "text": "These are very difficult people."}, {"time": 2933, "text": "Steve Jobs is a very difficult guy, you know?"}, {"time": 2938, "text": "Yeah, it is a bit heartbreaking to me."}, {"time": 2941, "text": "I mean, everybody is different generations."}, {"time": 2943, "text": "I just, my mind is a little focused on Elon Musk because he's the modern person."}, {"time": 2948, "text": "Well, you know him."}, {"time": 2949, "text": "I mean, he's a person to you."}, {"time": 2951, "text": "It hurts my heart to see how few faculty and people with Nobel prizes and so on admire Elon."}, {"time": 2961, "text": "He gets a lot of fans from people that buy his products and young minds just excited."}, {"time": 2971, "text": "But why don't we as an institution, why doesn't MIT say that somebody amongst us will be the next Elon Musk and we want to encourage them?"}, {"time": 2983, "text": "Like say that, say that in meetings, say that."}, {"time": 2986, "text": "Like that's success for us as MIT."}, {"time": 2991, "text": "And they, instead there's this jealousy."}, {"time": 2994, "text": "It's like, did you hear what Elon Musk tweeted?"}, {"time": 2996, "text": "Did you see, like how irresponsible is what he's doing?"}, {"time": 3000, "text": "How, like you're just saying all these things that are just dripping with jealousy and basically..."}, {"time": 3009, "text": "I want what he's got."}, {"time": 3013, "text": "Here's the weird thing."}, {"time": 3014, "text": "Rivalry has a different signature."}, {"time": 3017, "text": "You see, when you know that you're never going to make it, that's the position you take."}, {"time": 3026, "text": "What is it in Kung Fu Panda, which you've watched now?"}, {"time": 3031, "text": "What does Tai Lung say when he's looking for the dragon warrior and the furious five come to defeat him on the bridge?"}, {"time": 3040, "text": "One of them gives up Poe's name accidentally and Tai Lung hears it."}, {"time": 3046, "text": "Poe, so that is his name."}, {"time": 3048, "text": "Finally, a worthy opponent."}, {"time": 3050, "text": "Our battle will be legendary, right?"}, {"time": 3053, "text": "He's excited."}, {"time": 3056, "text": "Well, you learn about this in boxing."}, {"time": 3058, "text": "Sometimes you'll see a division or an MMA, which is lousy with talent."}, {"time": 3063, "text": "Just, you can't swing a cat without hitting an amazing athlete."}, {"time": 3069, "text": "Sometimes you'll have a division, which at that particular moment has one star and no real competition in that weight class or something."}, {"time": 3076, "text": "That person is in bad shape because you can't build a legend without the other."}, {"time": 3084, "text": "When you think of Muhammad Ali, what are the names that you immediately think of?"}, {"time": 3088, "text": "And you have to phrase your, you have to think of the other heavyweights."}, {"time": 3093, "text": "Liston."}, {"time": 3095, "text": "So those opponents are in part what made Muhammad Ali Muhammad Ali."}, {"time": 3102, "text": "And that's why the Mayweather McGregor revelation that, okay, this guy has got his opponent's picture in his house."}, {"time": 3113, "text": "How weird is that?"}, {"time": 3115, "text": "Well, because without the opponent, you may not be able to get there."}, {"time": 3118, "text": "Now, I am not a huge fan of the wrong kinds of rivalries."}, {"time": 3125, "text": "Do you have examples in mind?"}, {"time": 3126, "text": "Well, there are rivalries where people take each other's credit cards and take each other's credit and screw each other over."}, {"time": 3132, "text": "And then there are other rivalries like the RNA Thai Club where these guys were so in love with what they were doing that they couldn't wait to share everything."}, {"time": 3142, "text": "And like Nobel prizes were so abundant that most people got Nobel prizes just for being a member of the RNA Thai Club and doing cool stuff."}, {"time": 3151, "text": "And yeah, that's the golden kind of sweet spot."}, {"time": 3156, "text": "Most of these people can't do what Elon's doing because they can't break rules, they can't take the pressure."}, {"time": 3161, "text": "I'll tell you what really concerns me about your perspective."}, {"time": 3165, "text": "I think that there are a lot of genius ideas inside of people who don't have the stomach for conflict and derision."}, {"time": 3173, "text": "And I think a lot of those people are female."}, {"time": 3177, "text": "And I think that until we come up with a world in which we can swat down the trolls, or we can actually cause the trolls not to ruin everything."}, {"time": 3187, "text": "And I don't necessarily mean by shutting them up, I don't necessarily mean by being brutal to them, but somehow separating off people who are working and people who are trolling."}, {"time": 3198, "text": "I think that we're losing a huge amount of human genius in part because women in particular are not necessarily going to push an idea if it results in 10 years of being derided."}, {"time": 3214, "text": "Very few men are willing to do that either."}, {"time": 3217, "text": "But there are some of us who are so dumb that we will pigheadedly stick to an idea for 10 years even if the world collapses."}, {"time": 3224, "text": "I don't think that there are as many women who are going to make that calculation even if they know the idea is correct."}, {"time": 3231, "text": "And one of the things that I believe technology can help us fight the trolls, of all definitions of troll, like I believe that a better Twitter can be built."}, {"time": 3240, "text": "Interesting, I do not."}, {"time": 3242, "text": "I don't believe that a Twitter successor can be built that solves most of the problems."}, {"time": 3247, "text": "I think you can always improve what we have, but I don't think that converges in something that really works because I think ultimately the problem isn't Twitter, the problem is us."}, {"time": 3257, "text": "For example, I've recently made a very disturbing realization, which is academics and social scientists and academics and trolls have very many similar behaviors."}, {"time": 3271, "text": "It's largely a trolling community."}, {"time": 3274, "text": "I tend to believe that the trolls are not, it's like the Peter Thiel mini mind idea, which in all of the trolls, there's the possibility of goodness."}, {"time": 3287, "text": "And all you have to do, not all you have to do, what you have to do is create technology that incentivizes them to embrace, to discover, to embrace, to practice the better angels of their nature."}, {"time": 3304, "text": "And I believe that people actually want to do that."}, {"time": 3310, "text": "The trolls is a short term dopamine rush of childish toxicity that all of us want to overcome."}, {"time": 3320, "text": "I believe that like deep within, we want to overcome that."}, {"time": 3323, "text": "I try to keep myself from believing what you believe."}, {"time": 3329, "text": "Because you'd be disappointed if it's not true."}, {"time": 3330, "text": "Because it's dangerous, because a lot of these people are implacable foes and there aren't many of them, but when you meet somebody who's like, yeah, I just like screwing people up."}, {"time": 3339, "text": "I'm here for the pain."}, {"time": 3342, "text": "I just believe even in them, there's a good."}, {"time": 3344, "text": "There's a wonderful book that I'm gonna recommend to you where I hope this comes from."}, {"time": 3349, "text": "Maybe I've got the source wrong, but in any event, it's a great book called Maximum City about Bombay."}, {"time": 3356, "text": "And I believe the conceit is that the author leaves Bombay as a kid and comes back as an adult and he realizes he has to rediscover the city because he can't live in the city he left."}, {"time": 3369, "text": "So he gets in contact with all of the weird areas of the city and one of them is the underworld."}, {"time": 3375, "text": "He hangs out with the police, but in the underworld, he's talking to contract killers."}, {"time": 3379, "text": "And he says, you know, it's really weird."}, {"time": 3382, "text": "Everybody pleads for their life right before I kill them."}, {"time": 3386, "text": "And they always say this thing about, I've got two kids at home."}, {"time": 3392, "text": "He says, never say that to a contract killer because we have terrible relationships with our parents."}, {"time": 3397, "text": "Doesn't it dare us to do that?"}, {"time": 3400, "text": "And I was just thinking like, oh, wow."}, {"time": 3401, "text": "So there's a minus sign in front of that statement."}, {"time": 3404, "text": "You're sitting there saying, you know, I've got a three year old, it's like, okay, well, I'm gonna take this POS out of that kid's life."}, {"time": 3411, "text": "Maybe I'll have a chance."}, {"time": 3413, "text": "You don't know how people are wired."}, {"time": 3416, "text": "And as much as I hate to say it, there are people whose wiring is so disturbing and so different from yours that you will never guess why you can't reach them or how much pleasure they may have gotten because they may have gone over a point of no return."}, {"time": 3431, "text": "Nevertheless, you are just a smart guy who is using his intuition to make a hypothesis."}, {"time": 3439, "text": "You do not know this for sure."}, {"time": 3441, "text": "And I am, you know, whatever the hell I am that has a different hypothesis that even in the darkest human beings that seem to be only full of evil, there's a good person there that could be discovered."}, {"time": 3459, "text": "And that's one of the reasons I love doing your show is that you have these beliefs, even as a Russian."}, {"time": 3468, "text": "The Russian special."}, {"time": 3469, "text": "As you know, the Russian, there is a weirdness which is a total cynicism and total idealism locked together, right?"}, {"time": 3476, "text": "That's very much a part of the Russian character."}, {"time": 3480, "text": "The reason I kept bothering you, kept bothering you to have this conversation is I'm really worried about the next couple of months."}, {"time": 3490, "text": "And if there's anybody in this world that could help alleviate my worry by at least walking along with me through this worry of mine, it's you."}, {"time": 3505, "text": "Do you think we're headed towards some kind of civil war?"}, {"time": 3510, "text": "Some kind of division that explodes beyond just stuff on Twitter, but something that's really destructive to the fabric of our society?"}, {"time": 3521, "text": "Well, I believe we're in a revolution, as you know."}, {"time": 3525, "text": "I've called it the no name revolution or N squared revolution."}, {"time": 3528, "text": "I've been talking about it for years."}, {"time": 3531, "text": "I don't think, I think waiting for this to be called a civil war is not smart."}, {"time": 3538, "text": "Only history will call it such."}, {"time": 3540, "text": "But I think that the problem is is that you're encountering things that you've never seen trying to fit them into things that you already know."}, {"time": 3548, "text": "But history repeats itself."}, {"time": 3550, "text": "Yes, ish."}, {"time": 3553, "text": "You don't see lessons from history in."}, {"time": 3556, "text": "We see today."}, {"time": 3557, "text": "But I don't see it repeating itself."}, {"time": 3558, "text": "You know, the famous quote is that it rhymes."}, {"time": 3562, "text": "It rhymes."}, {"time": 3563, "text": "I mean, the thing I guess I'm speaking to is violence."}, {"time": 3568, "text": "We're in there."}, {"time": 3569, "text": "The abstraction of violence."}, {"time": 3571, "text": "Imagine you were coding up violence as an abstract class."}, {"time": 3578, "text": "Thank you for speaking to the audience."}, {"time": 3580, "text": "Trying to lose these people."}, {"time": 3582, "text": "Come with me."}, {"time": 3586, "text": "Look, I've dealt with your audience and your audience contains the smartest people around."}, {"time": 3591, "text": "I guarantee you if I say some stuff, first of all, any wrong thing that I'll say, they're gonna detail."}, {"time": 3596, "text": "So that'll be a little bit of catnip to bring in the smart people."}, {"time": 3600, "text": "But they'll also digest it for each other."}, {"time": 3602, "text": "It's one of the great lessons of long form podcasting."}, {"time": 3604, "text": "If you don't waste all your time explaining things, that's the job of the audience to do amongst themselves."}, {"time": 3611, "text": "They're happy doing the work."}, {"time": 3612, "text": "And those who aren't, they leave."}, {"time": 3614, "text": "Isn't that great?"}, {"time": 3615, "text": "They'll leave."}, {"time": 3616, "text": "The people who don't wanna struggle will leave."}, {"time": 3618, "text": "You can get rid of them."}, {"time": 3620, "text": "I think that the point is you would want to say violence is defined relative to a context."}, {"time": 3628, "text": "So let's call it meta violence so that we don't get into the problem."}, {"time": 3632, "text": "We already have a term for physical violence, right?"}, {"time": 3634, "text": "So we have meta violence and physical violence."}, {"time": 3637, "text": "I would say that physical violence is subclassed from meta violence."}, {"time": 3640, "text": "Meta violence is the disruption of a system."}, {"time": 3643, "text": "It's sort of, for example, if a cell dies, you can die through apoptosis or necrosis."}, {"time": 3652, "text": "Apoptosis is controlled programmed cell death."}, {"time": 3655, "text": "Necrosis is just like, okay, this didn't work."}, {"time": 3659, "text": "That was a violent disruption of the system."}, {"time": 3662, "text": "And this meta class is presumed in the documentation."}, {"time": 3665, "text": "Is it all negative?"}, {"time": 3667, "text": "No, what are you talking about?"}, {"time": 3670, "text": "So this is part of the problem in the madness of our age, right?"}, {"time": 3674, "text": "Which is if you open up a drawer in your cabinet, right, in your kitchen, and you see knives, spoons, and forks, do you have a sense that the spoons are good utensils and the knives or forks are bad utensils because they're mean?"}, {"time": 3692, "text": "I mean, like if you start thinking in these terms, that knife is there to do violence."}, {"time": 3699, "text": "That's violence you want done, right?"}, {"time": 3703, "text": "When I cut a mango, I'm doing violence to the mango."}, {"time": 3706, "text": "The mango expects that I will do violence to it because otherwise I won't be able to get the meat and it won't get its seed spread somewhere else."}, {"time": 3716, "text": "So in part, violence is absolutely part of our story."}, {"time": 3721, "text": "So, okay, so there's this meta violence class."}, {"time": 3725, "text": "And what's..."}, {"time": 3725, "text": "So the meta violence class is already, it's a multiple inheritance pattern."}, {"time": 3730, "text": "Whatever's going on right now inherits from meta violence."}, {"time": 3733, "text": "No, but there's certain subclasses that allow evil to emerge."}, {"time": 3741, "text": "So what I'm specifically worried about is that... What's on your mind, Lex?"}, {"time": 3749, "text": "I worry that amidst the chaos of these protests or the chaos that could be created by the feeling that the election does not represent the voice of the people, like saying that whoever gets, quote unquote, wins the election according to some kind of reporting of the numbers that come out, that's not going to represent what people actually want to be the leader."}, {"time": 3782, "text": "Like something in that narrative will create so much division that people will resort to literal violence, like protests that really... That the United States loses its united aspect."}, {"time": 3797, "text": "And because of that, because of that chaos and tension, evil people, evil forces that my definition of evil is just cruel human beings use that moment to attain power."}, {"time": 3813, "text": "The kind of power that is ultimately goes against the ideal of the United States."}, {"time": 3819, "text": "That could be Donald Trump."}, {"time": 3820, "text": "That could be another human being."}, {"time": 3823, "text": "My worry is that love doesn't win out in this."}, {"time": 3827, "text": "The unity doesn't win out in this."}, {"time": 3829, "text": "And I feel like you and I have responsibility."}, {"time": 3838, "text": "And so how do we let love win in this moment of potential chaos?"}, {"time": 3843, "text": "We're gonna have to fight for it."}, {"time": 3847, "text": "You're gonna have to become a fighter."}, {"time": 3849, "text": "You're gonna have to throw some serious punches if that's what you want."}, {"time": 3853, "text": "You have to be Muhammad Ali here because the moment you start criticizing anything, people, you have to be a masterful communicator because... That's why you're here."}, {"time": 3866, "text": "Look, Lex, in part, your decency is allowing you to do things that you couldn't otherwise do."}, {"time": 3875, "text": "I saw that you had Michael Malice on your podcast."}, {"time": 3879, "text": "Now, Michael Malice is, I think of somebody who at his best is extremely shrewd and insightful, yes?"}, {"time": 3889, "text": "He's also got this trolling game, which he's quite open about and you talk to him about it, which I can't stand."}, {"time": 3895, "text": "And this is the idea, oh, grandpa doesn't get the internet."}, {"time": 3898, "text": "Well, I'm grandpa, I don't get the internet."}, {"time": 3900, "text": "I don't love the trolling."}, {"time": 3901, "text": "There are trolls of the past who were incredibly good."}, {"time": 3907, "text": "I don't see any of the modern trolls as being that kind of genius level trolling the people who deserve it in the way that they deserve it."}, {"time": 3916, "text": "Right now, what I see is that anything that stands up gets cut down."}, {"time": 3921, "text": "It's like anything earnest, you have to turn it into cynicism and a meme."}, {"time": 3925, "text": "It's this idea that the people who believe that the world is chaos and has no point are constantly trying to let you know, don't try to use the internet for meaning, for decency, for goodness, because we are going to find out that that's all sanctimonious hypocrisy."}, {"time": 3941, "text": "And we will make you suffer."}, {"time": 3944, "text": "So I do think that there's a lot of sanctimonious hypocrisy in the world."}, {"time": 3948, "text": "Some of it mine, some of it yours, but we all have it."}, {"time": 3953, "text": "And the trolls somewhat remove that, but it's not a judicious, kind, constructive, compassionate, caring version most of the time."}, {"time": 3960, "text": "And a lot of those trolls, and I have this feeling about Michael Malice, I don't know whether it's right, that there's somebody who deeply cares and loves beneath it and that that's motivating some of the trolling behavior."}, {"time": 3971, "text": "And you and I don't seem to be doing that."}, {"time": 3973, "text": "I don't see you as almost ever trolling."}, {"time": 3976, "text": "Now you and I, I'm very much against trolling."}, {"time": 3979, "text": "I'm very much against trolling."}, {"time": 3981, "text": "It doesn't mean that it's selective."}, {"time": 3983, "text": "You know what, it's not even true."}, {"time": 3986, "text": "Like everything we say, we say like, I'm for it, I'm against it."}, {"time": 3991, "text": "This isn't my native language."}, {"time": 3993, "text": "I speak nuance."}, {"time": 3993, "text": "I don't speak this internet shit."}, {"time": 3995, "text": "And the more I have to communicate through internet shit, right, I almost never take a tweet seriously if it contains the letters LMAO, LOL, RTFOL, you know, FOL."}, {"time": 4011, "text": "There's an interesting effect where people say stuff and then finish with LOL."}, {"time": 4016, "text": "You put it beautifully that it indicates to me that this is a person, we've talked about like why I wear this stupid suit, is like this is anti, this is to fight the LOL at the end of sentences, is take, it's like stand up for the words you're saying."}, {"time": 4031, "text": "Don't finish stuff with LOL, removing completely the responsibility of the content of the sentence that preceded it."}, {"time": 4039, "text": "Yeah, also choosing the outfit that works both for Men in Black and the Blues Brothers, not a terrible choice."}, {"time": 4046, "text": "Okay, but getting back, look, Lex, we're not in a position to do this."}, {"time": 4051, "text": "You need to be seated in a different chair."}, {"time": 4055, "text": "Your chair is the wrong chair."}, {"time": 4057, "text": "You're in the wrong chair."}, {"time": 4059, "text": "It's been so long."}, {"time": 4061, "text": "All right, I want to talk about you and Joe Biden."}, {"time": 4066, "text": "Joe Biden was a 29 year old guy with nothing particular going on so far as I can tell."}, {"time": 4074, "text": "Okay, I know people as impressive at age 29 as Joe Biden, 12 rows back, 3D, doesn't matter, huge number of people."}, {"time": 4085, "text": "None of them my age can get to where he got to."}, {"time": 4089, "text": "Like we're all morons."}, {"time": 4092, "text": "Anytime somebody takes out, like if you found Eddie Van Halen in a guitar shop, you'd be angry."}, {"time": 4100, "text": "What is this guy doing repairing guitars?"}, {"time": 4105, "text": "Then somebody will say, maybe he loves to repair guitars."}, {"time": 4109, "text": "Yeah, I mean, what is your piano, Russian piano tuner doing?"}, {"time": 4112, "text": "What is my Russian piano?"}, {"time": 4113, "text": "That was the whole point of that story, which is what is it that happened in that life that converted somebody?"}, {"time": 4121, "text": "And I find this, for example, with Russian doctors who are technicians in offices now."}, {"time": 4129, "text": "There's a huge amount of talent in the world that's not sitting in its proper seat."}, {"time": 4134, "text": "And quite honestly, I've gotten to the point where my feeling is we've got to take the seats."}, {"time": 4143, "text": "And maybe we don't sit in them."}, {"time": 4145, "text": "Maybe the idea is that we take the seats and we put some smart Gen Z person in the seat and say, look, no chanting."}, {"time": 4152, "text": "I don't wanna hear you say, no justice, no peace."}, {"time": 4155, "text": "If there aren't verbs, if it rhymes, it's wrong."}, {"time": 4160, "text": "Like I used to have this thing, if it rhymed things that rhymed wrong, if it rhymed things that rhyme are more true."}, {"time": 4166, "text": "But like in general, if something starts out one, two, three, four, I don't wanna hear what the rest of your sentences."}, {"time": 4174, "text": "But I feel like the responsibility that you carry, that I carry, this is where Joe Rogan generally removes himself from being, I'm just a comedian."}, {"time": 4185, "text": "This idea of I'm just a comedian."}, {"time": 4187, "text": "We all do that."}, {"time": 4189, "text": "But at this moment in history, like history literally can pivot on the words of a tattooed, ripped 50 year old comedian."}, {"time": 4204, "text": "And I think the same is true with you."}, {"time": 4207, "text": "Okay, well, I'm interested and I care."}, {"time": 4210, "text": "Speaking of lyrics, there are many here among us who feel that life has been a joke."}, {"time": 4217, "text": "That's not us."}, {"time": 4218, "text": "The hour is getting late."}, {"time": 4220, "text": "In the song, the joker and the thief are on opposite sides of Jesus having this conversation over Jesus."}, {"time": 4227, "text": "You and I, we've been through that."}, {"time": 4228, "text": "That's not our fate."}, {"time": 4229, "text": "That's somebody else's fate to throw spitballs at the internet."}, {"time": 4233, "text": "That's not your fate."}, {"time": 4234, "text": "You're an earnest guy."}, {"time": 4235, "text": "You're filled with love."}, {"time": 4236, "text": "You're getting the most amazing podcasts."}, {"time": 4238, "text": "Yes, you're broadcasting."}, {"time": 4239, "text": "But you can win over the internet."}, {"time": 4240, "text": "This is the point I'm trying to make that you're saying I'm just a grandpa."}, {"time": 4244, "text": "I don't get the internet."}, {"time": 4245, "text": "No, I'm telling you, you're gonna get bigger and then you're gonna get cut down."}, {"time": 4249, "text": "You're gonna keep ascending for a while, Lex."}, {"time": 4252, "text": "And then you're saying, and naturally there's a..."}, {"time": 4253, "text": "I'm telling you, I watch the same process."}, {"time": 4255, "text": "People get up to a certain level."}, {"time": 4257, "text": "And one of the things that's going on, in my opinion, with Joe Rogan, is that when Joe Rogan starts to talk about his misgivings about Joe Biden, in a way that you find at any bar in America, about cognitive decline in a 77 year old who's about to be 78, I believe in November, we have never had anything remotely as insane as a 78 year old person slated to win the White House."}, {"time": 4286, "text": "And you're saying when that idea is being communicated, is there something about the disc concept that you talk about, the system naturally starts to..."}, {"time": 4293, "text": "Some bad thing happens to Joe or one of Joe's close associates."}, {"time": 4298, "text": "The ability to destroy people who become inconvenient has been documented."}, {"time": 4304, "text": "This is what we have done in the past."}, {"time": 4307, "text": "Whether we are doing it now, we don't know, because we are not doing this church committee too."}, {"time": 4313, "text": "In order to know whether or not you are currently destroying American citizens as we did in the past and as we have documented, as we found out in 1976, the federal government destroyed Americans who had political beliefs that the government didn't want to continue."}, {"time": 4331, "text": "And I don't know whether you are grasping that."}, {"time": 4334, "text": "One interpretation of why Jon Stewart and why Joe Rogan and why Bill Maher, all these people to some extent hide behind, it's a joke."}, {"time": 4345, "text": "It's because they're trying to find a protected class."}, {"time": 4349, "text": "Is there some place I can stand and speak the truth which does not result in my being garbage collected?"}, {"time": 4357, "text": "I guess you're right."}, {"time": 4358, "text": "My intuition is you can stand, as you gain more power, you can stand behind your words."}, {"time": 4366, "text": "There's a fight over Joe Rogan right now."}, {"time": 4369, "text": "I mean, I've talked about it for a few years now."}, {"time": 4372, "text": "People did not understand how big that program was."}, {"time": 4375, "text": "People didn't understand long form podcasting."}, {"time": 4377, "text": "I was derided by people who I think of as being very shrewd for believing in these podcasts as a major force."}, {"time": 4387, "text": "And most of the people who derided me have said, wow, did I not get things?"}, {"time": 4391, "text": "It's like if you started to propose, you wanted to do the Sopranos in the era of 30 minute sitcoms."}, {"time": 4401, "text": "Like, you don't get it, man."}, {"time": 4402, "text": "The American people, they're not interested in these long plot storylines."}, {"time": 4405, "text": "That's your weird thing?"}, {"time": 4407, "text": "Nobody cares, dude."}, {"time": 4408, "text": "Everybody just wants short, fast, memorable."}, {"time": 4411, "text": "And like, okay, so if you do that, you totally miss the opportunity."}, {"time": 4415, "text": "And the savvy people used to say, kid, let me tell you, nobody ever lost a dime underestimating the intelligence of the American people."}, {"time": 4423, "text": "Well, that was totally wrong because they didn't calculate opportunity costs."}, {"time": 4426, "text": "I have been talking about the problem of Joe for a long time."}, {"time": 4431, "text": "The problem is, is that when the system wakes up, they're gonna wanna control it."}, {"time": 4436, "text": "And they come up with new different mechanisms of doing that."}, {"time": 4439, "text": "I guess one interesting one is cancel culture."}, {"time": 4443, "text": "Well, look at the number of people around Joe who they've come after since they realized that Joe was really big."}, {"time": 4449, "text": "Joey Diaz, Brian Callan, Chris Delia."}, {"time": 4457, "text": "Now, I'm not saying that those are all related, but I do notice that there are at least correlations between when Joe says something when something bad happens in Joe's universe."}, {"time": 4473, "text": "It's easier for me to believe that that's happening when it's happening around Joe himself."}, {"time": 4480, "text": "But I'm worried about my friend."}, {"time": 4483, "text": "And I don't necessarily wanna push him towards being more if he doesn't want it."}, {"time": 4488, "text": "Because I don't wanna conscript people."}, {"time": 4491, "text": "He's got a great life."}, {"time": 4492, "text": "He's got a great situation."}, {"time": 4493, "text": "He's done a huge service."}, {"time": 4497, "text": "How much do I owe Joe just for what he's done for you to say nothing of what he's done for me or for Brett or for Sam or any of these people?"}, {"time": 4506, "text": "And I'd like to think that we all try to give back, but I'm worried about Joe."}, {"time": 4513, "text": "He's not worried."}, {"time": 4515, "text": "One of the inspiring things about Joe is he's in this war alone."}, {"time": 4521, "text": "And the way he fights the war is by just enjoying life."}, {"time": 4525, "text": "Well, that's his thing, as long as he stays close to things that he loves and being, one of the things is he's honest about his drug use."}, {"time": 4532, "text": "He loves to hunt."}, {"time": 4534, "text": "So he's just, he does a certain amount of like semi vice signaling upfront."}, {"time": 4540, "text": "And then you just also know him."}, {"time": 4541, "text": "This is why every time they try to take him down, you use the N word."}, {"time": 4547, "text": "Unfortunately, everybody knows who Joe is."}, {"time": 4550, "text": "And yes, he doesn't act as if he went to a fancy finishing school, right?"}, {"time": 4558, "text": "That's not his energy."}, {"time": 4560, "text": "The fact that you've got some super smart guy who always pretends to be a meathead, just like, hey, I'm a comedian."}, {"time": 4566, "text": "It's like all these defenses and disguises."}, {"time": 4568, "text": "Okay, you've got this super smart guy who he's admitted to most of the things that you can take him down for."}, {"time": 4577, "text": "And because everybody's been effectively in his den his basement, think about that studio is his basement."}, {"time": 4583, "text": "People have hung out with Joe so many hours that you can't tell them something about Joe where they're gonna say, wow, I'm gonna believe the New York Times and not the hundreds of hours I've spent on the Joe Rogan experience."}, {"time": 4592, "text": "But the cool thing is that this is what inspires me is that the way he's waging war against the system, it's just by being a good person and talking enough hours in a week where that message like bleeds throughout the words and the gaps between."}, {"time": 4609, "text": "And that's so inspiring to me that the good people can win by just being good."}, {"time": 4615, "text": "And he's kind and he's tough."}, {"time": 4617, "text": "And he also, he's no pushover."}, {"time": 4621, "text": "I always worry a little bit when I sit down in my chair."}, {"time": 4625, "text": "You still get scared that he'll call you on some kind of bullshit that you weren't even aware of?"}, {"time": 4629, "text": "No, the first time I was on the show, the energy wasn't great between us."}, {"time": 4634, "text": "And it was in a sober October situation."}, {"time": 4636, "text": "So I think I hadn't understood that and maybe our egos got a little bit off."}, {"time": 4643, "text": "I mean, I was having fun, but maybe it was just too complicated life forms getting to know each other."}, {"time": 4649, "text": "The first one was probably, yeah, that made me a little nervous for the future."}, {"time": 4657, "text": "But then, Joe and I have become friends, although sometimes we have miscommunications like on Yom Kippur, I texted him and I said, Joe, I want to apologize for ways I've let you down as a friend that haven't been there for you and appreciate everything you've done for me all this time."}, {"time": 4674, "text": "Like I get this text back like, what the fuck is your problem?"}, {"time": 4677, "text": "You're great, dude."}, {"time": 4680, "text": "I don't know what bad place you're in, but cheer up."}, {"time": 4682, "text": "It's like, Joe, don't you have any Jews in your life that apologize for what they've done?"}, {"time": 4687, "text": "He was just like, dude, have you lost your mind?"}, {"time": 4689, "text": "What the hell's gotten into you?"}, {"time": 4691, "text": "Yeah, what do you think about the Spotify thing?"}, {"time": 4698, "text": "Ask me a question."}, {"time": 4699, "text": "He's now, as opposed to being just a comedian with the podcast, he now is just a comedian with the podcast who stepped like in the middle of the center of cancel culture, which is like, I know Spotify is in Sweden, but they represent Silicon Valley."}, {"time": 4717, "text": "They represent the very kind of structures."}, {"time": 4720, "text": "They contain and represent the kind of structures that threatened to destroy the Elans of the world."}, {"time": 4728, "text": "And he just like stepped like with his Alex Jones and his Joey Diaz just strolled right into the middle of it."}, {"time": 4736, "text": "Yeah, I think it's awesome."}, {"time": 4739, "text": "But do you think he's strong enough to, I don't know."}, {"time": 4744, "text": "I mean, I don't even know the right way to ask this, but is he strong enough to persevere?"}, {"time": 4748, "text": "It's a bit interesting."}, {"time": 4750, "text": "It's like when a lion decides, wow, that honey badger looks tasty."}, {"time": 4754, "text": "I'm gonna swallow it whole, see what happens."}, {"time": 4757, "text": "Because I talked to him offline."}, {"time": 4758, "text": "He really seems to be willing to give away the 100 million, which gives him so much power."}, {"time": 4764, "text": "Oh, I don't, it's a powerful thing to be able to say, I don't, yeah, to the honey badger."}, {"time": 4773, "text": "He just strolls in, but he's willing to walk away from anything in this world."}, {"time": 4776, "text": "Well, he's gonna walk out the other side of the lion."}, {"time": 4778, "text": "I don't think he's gonna go out the way he came in."}, {"time": 4781, "text": "Well, you know what it is?"}, {"time": 4782, "text": "It's Tommy Lee Jones entering the bug."}, {"time": 4785, "text": "This is like a giant alien, he just walks into it?"}, {"time": 4787, "text": "He just, he gets swallowed by the bug and he blasts out from the inside."}, {"time": 4792, "text": "I have it as Tommy Lee Jones."}, {"time": 4793, "text": "Yeah, that's Joe Rogan to you."}, {"time": 4795, "text": "Yeah, is that my feeling is that Spotify doesn't understand what they're messing with."}, {"time": 4799, "text": "I could be wrong, but I'm not."}, {"time": 4801, "text": "No, you're right."}, {"time": 4802, "text": "I'm right."}, {"time": 4805, "text": "Because Joe doesn't need anything, man."}, {"time": 4807, "text": "I mean, this is the weird thing about it."}, {"time": 4808, "text": "It's like, I'm sure that he loves all his toys, whatever, blah, blah, blah."}, {"time": 4811, "text": "He's a rich guy."}, {"time": 4812, "text": "Yes, he's got a few money."}, {"time": 4814, "text": "He had a few money a long time ago."}, {"time": 4816, "text": "And you're not, you know, the other thing about, it's a bit weird being friends with a dude like that."}, {"time": 4824, "text": "Cause like you call him up or he'll call you up and he's like, what's going on in your life?"}, {"time": 4830, "text": "Kind of depressed, trying to get some math done."}, {"time": 4832, "text": "What are you up?"}, {"time": 4833, "text": "Oh dude, I can cheer you up."}, {"time": 4834, "text": "I just came off of a 29,000 person stadium."}, {"time": 4838, "text": "It's like, oh cool."}, {"time": 4840, "text": "How'd you do that?"}, {"time": 4841, "text": "I just announced it on Instagram a few days ago and it filled up."}, {"time": 4844, "text": "Just like, oh damn."}, {"time": 4847, "text": "I mean, that thing is so powerful."}, {"time": 4852, "text": "I mean, you could be that too."}, {"time": 4854, "text": "The instant Joe takes an interest in politics and saving the world."}, {"time": 4858, "text": "You might destroy all of that."}, {"time": 4859, "text": "It's going bye bye."}, {"time": 4861, "text": "I promise you."}, {"time": 4864, "text": "I mean, cause you have to do it."}, {"time": 4865, "text": "Like you've said this many times before."}, {"time": 4867, "text": "I'll bet you, I'll bet you a bottle of Stoli that you can get, if you get Joe Rogan to get highly politically active and call out the system for all the bullshit that it is in a very pointed and determined fashion and he doesn't get destroyed, I'll give you the vodka."}, {"time": 4886, "text": "The vodka?"}, {"time": 4887, "text": "That sounds like a pretty damn good deal."}, {"time": 4889, "text": "But you've said this, I mean."}, {"time": 4892, "text": "No living heroes, my friend, no living heroes."}, {"time": 4897, "text": "No living heroes."}, {"time": 4899, "text": "It's just difficult."}, {"time": 4900, "text": "You just have to be good at it."}, {"time": 4902, "text": "I mean, if you just say generic political things."}, {"time": 4906, "text": "You're going to be taken down."}, {"time": 4908, "text": "But if you're."}, {"time": 4908, "text": "The more heroic you are, the more beautiful you are, the more you will be made to suffer."}, {"time": 4914, "text": "If they cannot get you on reputation."}, {"time": 4916, "text": "If Jesus himself came down."}, {"time": 4919, "text": "I don't know if I ever read."}, {"time": 4920, "text": "I probably have never read to you the hit piece I did on Jesus."}, {"time": 4924, "text": "You don't know about this?"}, {"time": 4925, "text": "No, I did not know."}, {"time": 4926, "text": "I did hit pieces on all of the best people in the world."}, {"time": 4931, "text": "So whoever it was who cured cancer, discovered new particles or whatever it is, I did a hit piece against them to prove that I can do it to anybody around anything at any time."}, {"time": 4942, "text": "Except Eddie Van Halen is what we're talking about."}, {"time": 4944, "text": "Well, Eddie Van Halen is now dead."}, {"time": 4946, "text": "But if this was a situation, you know, hot for teacher, canceled."}, {"time": 4953, "text": "Disrespectful."}, {"time": 4958, "text": "Also, you know, packaging female objectification for young men."}, {"time": 4964, "text": "Clearly Eddie Van Halen is one of the worst people alive."}, {"time": 4967, "text": "But the skill, the incredible inspiration that is just radiating from his music inspires so many millions that they will fight those canceled pieces."}, {"time": 4980, "text": "This is your thing."}, {"time": 4981, "text": "You have this idea that there's a war between good and evil and the good has already been designated the winner."}, {"time": 4986, "text": "And it's not true."}, {"time": 4988, "text": "But your belief that it's true."}, {"time": 4991, "text": "Fake it till you make it, no?"}, {"time": 4993, "text": "I mean, you gotta, it's motivating both of us."}, {"time": 4996, "text": "Like I also believe that we're gonna win because if I don't, then I can't get out of bed and it's pretty heavy at the moment."}, {"time": 5002, "text": "Do you think 2021 can make us feel good about the trajectory of society?"}, {"time": 5011, "text": "So like where we emerge from this year feeling good."}, {"time": 5016, "text": "Like there's a smile on Eric Weinstein's face and the next time we talk, we'll be doing some kind of duet on guitar and not having this worried look on our faces."}, {"time": 5029, "text": "Okay, but you've also promised you're going to somehow end this in a positive."}, {"time": 5034, "text": "Okay, so how do you turn the no around?"}, {"time": 5037, "text": "What's the U turn from the no?"}, {"time": 5039, "text": "Until we get some actually decent people in the right chairs who are not constantly thinking about their next paycheck, I don't see a solution."}, {"time": 5050, "text": "Let me just say what the prerequisites for a solution are and to let you know why I don't think it's coming."}, {"time": 5058, "text": "First of all, both of these political parties, the leadership of them is disgusting and has to go."}, {"time": 5064, "text": "They're tearing us apart."}, {"time": 5066, "text": "They lack the will to be Americans."}, {"time": 5068, "text": "They don't understand the subtlety of the project."}, {"time": 5072, "text": "They're simply the people who figured out how to inhabit the seats and that is their great achievement."}, {"time": 5081, "text": "I believe that in order to solve this, you need people who can integrate, who are not partisan at the level of the partisan warriors that we're seeing, people who believe in dividing the pies of the future rather than the present pie as our main task as Americans because we are built around growth."}, {"time": 5098, "text": "I'm sorry to say it."}, {"time": 5102, "text": "You need an ability to have subtle conversations and you need the ability to exclude."}, {"time": 5109, "text": "And at the moment, everyone knows inclusion is good, which it isn't."}, {"time": 5114, "text": "It's like saying, well, water is good."}, {"time": 5116, "text": "If I say water is good, everybody will agree with me."}, {"time": 5118, "text": "It's not, people drown."}, {"time": 5122, "text": "People need to get dehydrated."}, {"time": 5124, "text": "It can be life saving or life ending."}, {"time": 5126, "text": "It isn't good or bad."}, {"time": 5128, "text": "Inclusion is not good or bad."}, {"time": 5130, "text": "Inclusion is just inclusion."}, {"time": 5131, "text": "Exclusion is part of inclusion."}, {"time": 5134, "text": "We've taught people that they can reason through the world as sub cocker spaniels."}, {"time": 5143, "text": "They just bark things at each other."}, {"time": 5145, "text": "I'm for safety."}, {"time": 5148, "text": "I'm for inclusion."}, {"time": 5149, "text": "I'm for growth."}, {"time": 5152, "text": "Do you guys use verbs, dependent clauses?"}, {"time": 5155, "text": "Are there compound complex sentences?"}, {"time": 5157, "text": "Where are we in this sea of nonsense?"}, {"time": 5161, "text": "You have to be able to build a place where you have smart, talented people who represent a diverse group of correct opinions."}, {"time": 5170, "text": "You need to get rid of almost all of the people who have opinions that are antithetical to what we're trying to accomplish."}, {"time": 5177, "text": "You need to give them insulation, which we're terrified because we don't trust anybody."}, {"time": 5181, "text": "So everything has to be transparent."}, {"time": 5183, "text": "If you're going to the bathroom, I want those walls to be plexiglass so I can see what you're doing."}, {"time": 5187, "text": "It's like, that's too much transparency."}, {"time": 5189, "text": "We have too much and not enough at the same time."}, {"time": 5192, "text": "And then in essence, you need to ensure that people aren't worried about feeding their family every four seconds for being real."}, {"time": 5201, "text": "None of that is happening."}, {"time": 5203, "text": "And our billionaires, our billionaires are pathetic."}, {"time": 5207, "text": "What is the point of billionaires if you're not going to do billionaire type cool stuff like saying, F you, and I'm going to throw $3 billion at the project of restoring the national conversation?"}, {"time": 5225, "text": "I don't grasp this."}, {"time": 5226, "text": "What is the point of creating obscene wealth if we don't have anyone smart enough and caring enough to use it?"}, {"time": 5232, "text": "So I agree with that last part for sure."}, {"time": 5236, "text": "Let me slightly push back on the idea that the leaders themselves are broken."}, {"time": 5242, "text": "I feel like this goes to the Joe Rogan, Joe Biden and Trump having a debate on that program."}, {"time": 5251, "text": "I feel like Joe Biden has a lot of really interesting ideas that he's almost forgot how to communicate."}, {"time": 5260, "text": "He's been fake for so long within the system."}, {"time": 5264, "text": "Hillary was fake for too long."}, {"time": 5265, "text": "I'm sure she had real ideas at the beginning that she still was campaigning on decades later."}, {"time": 5270, "text": "But if the system, if the platforms empowered you to search, to be honest, to be real, to search for those ideas within yourself, like long form conversations do, then even the Donald Trump and Joe Biden leaders we have now would take this country to a better place that would unite people."}, {"time": 5292, "text": "So like, we can keep the current Congress."}, {"time": 5295, "text": "We just need to create better platforms."}, {"time": 5297, "text": "This is going to the intuition that there's good in Donald Trump."}, {"time": 5301, "text": "There's depth and complexity and intelligence."}, {"time": 5304, "text": "And the same with Joe Biden."}, {"time": 5306, "text": "There's good in Joe Biden."}, {"time": 5308, "text": "And it's just, we're not incentivizing."}, {"time": 5312, "text": "I mean, there's several things I think are broken."}, {"time": 5315, "text": "One of them is Twitter."}, {"time": 5316, "text": "The other is journalism."}, {"time": 5318, "text": "It's just the platforms of us communicating with each other."}, {"time": 5321, "text": "One of the reasons that I try to come up with unifying explanations is that, if you look at the number of wildfires in California, let's say, that we've just seen, if you treat them all as spontaneous, uncorrelated instances, it feels like, oh my God, it's just whack a mole."}, {"time": 5338, "text": "Every time I send a fire truck here, there's a fire over there."}, {"time": 5342, "text": "So you want to come up with something like a central theory, which is, why do I suddenly have a problem when I hadn't had a problem before?"}, {"time": 5349, "text": "So I look for these unifying explanations."}, {"time": 5352, "text": "And I found one the other day that really speaks to me."}, {"time": 5356, "text": "I mean, people are very frustrated because they've been trained to think about this incorrectly, in my opinion."}, {"time": 5361, "text": "But here's the graph that you need to look at."}, {"time": 5365, "text": "On the x axis is time by year."}, {"time": 5369, "text": "And on the y axis is something like average age of a human."}, {"time": 5377, "text": "The title of the graph is any desirable situation involving institutions."}, {"time": 5384, "text": "So that could be CEO, it could be tenured professor."}, {"time": 5390, "text": "It could be who's getting grants."}, {"time": 5393, "text": "It could be the age at which people win Nobel Prizes."}, {"time": 5401, "text": "University presidents, all these things go up."}, {"time": 5405, "text": "In other words, for a long period of time, the average age of the person in a desirable situation has been increasing something like nine months for every 12."}, {"time": 5419, "text": "Those graphs have to go down at some point."}, {"time": 5422, "text": "The specter of having five people all born in the 1940s as the final entrance in the presidential context, that makes no sense."}, {"time": 5436, "text": "Think about how bizarre a thing that nobody's even really talking about."}, {"time": 5440, "text": "The last five people were all ancient by presidential standards."}, {"time": 5447, "text": "Not one, not two, but five."}, {"time": 5449, "text": "We are talking about a contest between somebody who is the oldest of the baby boomers, the very beginning of the baby boom, summer of 46th birthday, fighting somebody who is in the silent generation."}, {"time": 5465, "text": "The silent generation guy in a town hall in Florida gets this question from a Gen Z guy saying, what's going on with my future?"}, {"time": 5474, "text": "Joe Biden has the audacity to say, I'm a transitional president."}, {"time": 5480, "text": "You guys are the highly educated one."}, {"time": 5482, "text": "When has any generation in history needed a transitional 78 year old person to take office?"}, {"time": 5489, "text": "It's bizarre, it's preposterous."}, {"time": 5491, "text": "That graph is the graph we can't talk about."}, {"time": 5495, "text": "That graph is the graph of our destruction."}, {"time": 5499, "text": "Because it has the, you can make a one line argument, which sounds like ageism, which isn't a very good argument."}, {"time": 5511, "text": "But what it does is, is it muddles the conversation."}, {"time": 5514, "text": "And you always have to ask yourself the question, if this conversation becomes muddled, who wins as a result of the muddling?"}, {"time": 5521, "text": "Well, it's a battle, but let's just win it."}, {"time": 5524, "text": "Let's win the battle."}, {"time": 5525, "text": "You give."}, {"time": 5526, "text": "Are you running?"}, {"time": 5527, "text": "For sure, I'll run."}, {"time": 5529, "text": "I was born in Russia, can't run."}, {"time": 5531, "text": "So, but we Russians can hack elections, so we'll figure it out."}, {"time": 5535, "text": "This is me officially announcing my run for president."}, {"time": 5537, "text": "I was born in St. Petersburg, Florida."}, {"time": 5543, "text": "Lex, what is it that you really wanna ask?"}, {"time": 5545, "text": "I think, I wanna put some responsibility on the portal."}, {"time": 5552, "text": "That the portal gives power to the people in that graph."}, {"time": 5558, "text": "Like, cause you put it quite brilliantly that the people that move the world, their age has been going up."}, {"time": 5567, "text": "And not move the world, but put in the position where they get the chance to affect the world."}, {"time": 5574, "text": "These new platforms, I think Twitter falls in them, give power to the younger people."}, {"time": 5580, "text": "It doesn't have to be about age necessarily, but the younger thinking people."}, {"time": 5584, "text": "So that's a promising thing."}, {"time": 5586, "text": "And you are like, you're like Gandalf."}, {"time": 5589, "text": "You get to pick your Frodo's or whatever."}, {"time": 5591, "text": "I'm not very good with the analogy, but the whole point is for you as Gandalf."}, {"time": 5596, "text": "I don't know that I make that much sense."}, {"time": 5598, "text": "Gandalf makes sense."}, {"time": 5600, "text": "I don't know if people know how to fit me into this ecosystem."}, {"time": 5604, "text": "I think there's something in my presentation that people find very confusing."}, {"time": 5607, "text": "No, figure it out."}, {"time": 5608, "text": "I disagree with you, but you need to look at the mirror and think like, what is it?"}, {"time": 5612, "text": "Is it, maybe you need a mustache."}, {"time": 5616, "text": "But there's something about figuring out how to be a charismatic communicator in this."}, {"time": 5623, "text": "And that's the responsibility."}, {"time": 5625, "text": "You said like finishing sentences with the LOL is painful for your soul."}, {"time": 5630, "text": "Yeah, that's just how somebody lets me know."}, {"time": 5632, "text": "I don't have to take their opinion seriously."}, {"time": 5634, "text": "Yeah, it's still the language, the way that people are communicating and you're swimming that wave."}, {"time": 5641, "text": "I have a growing platform."}, {"time": 5642, "text": "It feels like this is the place to give power."}, {"time": 5645, "text": "I agree, but we're gonna get swatted down."}, {"time": 5647, "text": "I just don't think so."}, {"time": 5649, "text": "Why are you afraid of the big?"}, {"time": 5650, "text": "Like this is, I've studied it."}, {"time": 5653, "text": "Because I've studied, let me ask you a question, Lex."}, {"time": 5658, "text": "I believe that every society is supposed to have a collection of what I call break glass in case of emergency people."}, {"time": 5669, "text": "These are people who are universally loved and trusted by your society."}, {"time": 5673, "text": "For example, David Attenborough, the great British naturalist and presenter, recently came on Instagram."}, {"time": 5680, "text": "He's worried about the planet."}, {"time": 5683, "text": "And I said, look, there are very few of these people left."}, {"time": 5686, "text": "Let's pay attention, find out what he has to say."}, {"time": 5688, "text": "Maybe he's gonna be an ass."}, {"time": 5689, "text": "Maybe he's gonna be in it."}, {"time": 5690, "text": "Maybe he's gonna say wrong things, don't know."}, {"time": 5692, "text": "Tell me about your top 10 universal American heroes."}, {"time": 5697, "text": "This is not a rhetorical question."}, {"time": 5700, "text": "Give me five."}, {"time": 5702, "text": "Okay, everybody looks to that person and says, yep, the best of us."}, {"time": 5706, "text": "Probably follow that person."}, {"time": 5708, "text": "Well, everybody's an interesting concept."}, {"time": 5711, "text": "I mean, Elon Musk is very divisive, right?"}, {"time": 5714, "text": "But I'm talking about overwhelmingly people would follow that person if that person gave a rousing, intelligent speech that said, we must act now because we're in dire straits."}, {"time": 5728, "text": "I think a lot of people fall in that category."}, {"time": 5730, "text": "For me, it would be in the tech world, in the engineering world."}, {"time": 5735, "text": "Tell me his names."}, {"time": 5741, "text": "The Rock."}, {"time": 5743, "text": "I'm thinking like, who is the most eloquent actor?"}, {"time": 5745, "text": "So like, you think celebrities, so people with platforms."}, {"time": 5748, "text": "I didn't say celebrities, but you have to be well known."}, {"time": 5750, "text": "I believe like, yeah, so this goes to Joe Rogan."}, {"time": 5759, "text": "First two did not really impress me as being what I said, but okay."}, {"time": 5765, "text": "Elon several years ago would have."}, {"time": 5768, "text": "Can you try to?"}, {"time": 5770, "text": "Joe Rogan has."}, {"time": 5771, "text": "Why do they fail?"}, {"time": 5772, "text": "Why does Elon fail?"}, {"time": 5773, "text": "Lots of people treat Joe Rogan as if he's some sort of right wing racist because they've never watched his program."}, {"time": 5779, "text": "They don't know who his friends are."}, {"time": 5782, "text": "Oh, but when I thought you said everybody, I thought you meant a large enough people where a huge change can happen, not actually literally everybody."}, {"time": 5793, "text": "Because I think."}, {"time": 5794, "text": "I mean people who've pulled off, like people who've pulled off something where everybody's convinced that that person just deeply."}, {"time": 5804, "text": "I mean, I think I've told you this story before, but the one time I've seen the power of a figure like this, I mean, very few times I've been in a large crowd and I've seen people just moved where they would do almost anything good, bad and different because they were primed."}, {"time": 5823, "text": "One was a Rolling Stones concert."}, {"time": 5826, "text": "The other one was Nelson Mandela coming to Boston."}, {"time": 5830, "text": "And man, you've never seen anything like this."}, {"time": 5833, "text": "You check out the photos from the banks of the Charles River when Nelson Mandela came."}, {"time": 5838, "text": "There are people that you need in your dark hours and we can't agree on who they are."}, {"time": 5846, "text": "And as soon as they emerge, we tar them with shit."}, {"time": 5849, "text": "We get out the shit branch."}, {"time": 5853, "text": "What do we disagree about here?"}, {"time": 5855, "text": "I think it doesn't matter who it is."}, {"time": 5857, "text": "I think really good speeches are needed."}, {"time": 5860, "text": "And I think a lot."}, {"time": 5861, "text": "Who's gonna give them?"}, {"time": 5862, "text": "I saw Killer Mike try to give a good speech."}, {"time": 5864, "text": "Yeah, he did."}, {"time": 5866, "text": "In Atlanta, right?"}, {"time": 5867, "text": "That was something."}, {"time": 5869, "text": "Very impressed."}, {"time": 5871, "text": "Even Killer Mike immediately gets into this."}, {"time": 5874, "text": "Sell out."}, {"time": 5877, "text": "Yeah, but he didn't take up the responsibility."}, {"time": 5881, "text": "I would say."}, {"time": 5882, "text": "Of going bigger."}, {"time": 5885, "text": "So he was speaking to the community."}, {"time": 5887, "text": "And he was doing what he."}, {"time": 5888, "text": "On this particular moment, he's exceptional at it."}, {"time": 5891, "text": "And he was speaking to this particular moment."}, {"time": 5893, "text": "He didn't take it a step farther, which is like giving the same speech, but bigger than race."}, {"time": 5903, "text": "Bigger than this particular moment, but more about the American project."}, {"time": 5909, "text": "You know the guy who landed the plane in the Hudson?"}, {"time": 5913, "text": "That's a good example."}, {"time": 5914, "text": "So that guy until we screw him up is the kind of thing that I'm talking about."}, {"time": 5922, "text": "I mean, Jaco, maybe that's another."}, {"time": 5923, "text": "Jaco's pretty good."}, {"time": 5924, "text": "Can't really tell."}, {"time": 5925, "text": "Is he a Democrat?"}, {"time": 5926, "text": "Is he a Republican?"}, {"time": 5927, "text": "He's an American."}, {"time": 5928, "text": "That's for damn sure."}, {"time": 5930, "text": "And I think there's a lot of folks."}, {"time": 5932, "text": "No, I think Jaco, there aren't."}, {"time": 5934, "text": "That's one of the reasons why Jaco's so special."}, {"time": 5936, "text": "That's so important."}, {"time": 5937, "text": "Your podcast, The Portal, is something in my little universe is something a lot of people really love."}, {"time": 5946, "text": "And it moves them."}, {"time": 5948, "text": "They draw a lot of meaning from it."}, {"time": 5951, "text": "And also, especially in difficult times."}, {"time": 5956, "text": "It gives them a comfort of through like this kind of, it's not just nuance."}, {"time": 5963, "text": "There's like, even when you're talking about chaos, there's love underneath all of it."}, {"time": 5968, "text": "And I think people would draw a lot of meaning from it, which is why they are wondering why you haven't been doing I'm wondering why you haven't been doing that many podcasts or you haven't done it in maybe a month and a half or two months in this most difficult of times."}, {"time": 5989, "text": "Is there a good reason?"}, {"time": 5993, "text": "There are lots of good reasons."}, {"time": 5996, "text": "So the first one is kind of weird, which is everybody assumes that everyone wants to be famous."}, {"time": 6001, "text": "And if you say, I don't want to be famous, it's like, oh, you're just saying that because you want to be everyone to think you're famous."}, {"time": 6009, "text": "You're not that famous."}, {"time": 6009, "text": "You know, okay."}, {"time": 6012, "text": "I don't love being as well known as I've become."}, {"time": 6019, "text": "There's lots of things that are fun about it."}, {"time": 6021, "text": "It's wonderful that you can go to, I can go to any city in the world and there are portal listeners there."}, {"time": 6027, "text": "All I need to do is put out a tweet and 20 people show up for a drink."}, {"time": 6030, "text": "And they're amazing people."}, {"time": 6031, "text": "And they're almost, I mean, you can see my live Q and A's on my Instagram page."}, {"time": 6037, "text": "If you go to Eric R. Weinstein, I just pick somebody randomly and I was really worried about it at first."}, {"time": 6043, "text": "And you know, maybe I should be worried about it, but in general, people all over the world are just so positive."}, {"time": 6049, "text": "And so, you know."}, {"time": 6051, "text": "And thoughtful and have a story that's kind of self selected."}, {"time": 6056, "text": "But I don't like the fame."}, {"time": 6058, "text": "The thing we just described comes with the fame."}, {"time": 6061, "text": "You know, you're worried that it's getting."}, {"time": 6063, "text": "It's ephemeral."}, {"time": 6064, "text": "It'll, look Lex, it'll turn on you in a heartbeat."}, {"time": 6070, "text": "It'll turn on you in a heartbeat."}, {"time": 6071, "text": "And the other problem is I don't, I don't like my audience being my audience."}, {"time": 6076, "text": "I want to get closer to them."}, {"time": 6078, "text": "I want to talk to them."}, {"time": 6078, "text": "I want to find out what is this doing in your life?"}, {"time": 6081, "text": "My house fills up with art that people send me."}, {"time": 6084, "text": "The lightest thing is an effects pedal called something like, I don't know, bow tie overdrive from a guy in Mexico, right?"}, {"time": 6093, "text": "You play electric, by the way, in a tiny little tangent."}, {"time": 6096, "text": "Do you play electric?"}, {"time": 6097, "text": "I have a Stratocaster, but it doesn't have a strap and I don't know what to do with it and I have a bad amp."}, {"time": 6102, "text": "So you should, you should, you should hook me up with the."}, {"time": 6106, "text": "We'll find it a home maybe."}, {"time": 6109, "text": "You're starting to sense that this is too much."}, {"time": 6112, "text": "No, I want to be, I want to be here."}, {"time": 6114, "text": "I want to do the work very simply."}, {"time": 6120, "text": "I don't have an ability to fully explain myself."}, {"time": 6123, "text": "I don't want to claim that I don't love the fact that how much love do we get from these programs?"}, {"time": 6129, "text": "Like I, the generically people are incredibly generous."}, {"time": 6136, "text": "You know, people have begged me, set up a Patreon account and I haven't been able to do it."}, {"time": 6141, "text": "I should do it."}, {"time": 6142, "text": "I've said to everybody, it's a business."}, {"time": 6144, "text": "It's a business."}, {"time": 6144, "text": "It's a business, but like they're so used to being defrauded."}, {"time": 6148, "text": "When somebody starts thinking about monetary incentives, my, my goal was to say, I'm going to keep talking to you about you."}, {"time": 6154, "text": "You wonder why I started doing ads on my show was because I wanted people to think from the get go, this is a business."}, {"time": 6161, "text": "This is what I sound like when I'm selling, but you know, like you see I've lost weight."}, {"time": 6194, "text": "I want to help train you."}, {"time": 6195, "text": "And it's got me on a, on a good, uh, good path."}, {"time": 6198, "text": "So, you know, that's one paid advertiser and two people on I'm calling out just because there are, you know, two, two outfits, Steven Cates and Fitbit that have changed my life."}, {"time": 6208, "text": "I wanted people to say, you know, you don't have to be afraid of advertising."}, {"time": 6211, "text": "If I do it in this way, this is powering your show, but the whole issue of money is weird because people have these crazy feelings like, Oh wow."}, {"time": 6221, "text": "I knew he was a shill."}, {"time": 6224, "text": "He's a grifter, you know?"}, {"time": 6225, "text": "I didn't love that."}, {"time": 6226, "text": "I didn't love the issue."}, {"time": 6228, "text": "So I didn't set up a Patreon."}, {"time": 6230, "text": "The security issues for talking and being me are significant."}, {"time": 6236, "text": "And I don't have the kind of money to hire around the clock."}, {"time": 6240, "text": "I mean, I, I desperately want to get to a level of wealth where I don't have to think about money."}, {"time": 6247, "text": "I don't think it's, you know, some people want money because they, they, they need it for status."}, {"time": 6252, "text": "I think I can handle status if I want it doing this, I don't want the status necessarily."}, {"time": 6258, "text": "And I don't want, I'd want the status, but I don't want the fame that goes with it."}, {"time": 6264, "text": "I want the money."}, {"time": 6265, "text": "I don't want to be seen as this is about money because it's about a substance and drink, you know, all of those things."}, {"time": 6273, "text": "That's part of, I haven't solved these issues."}, {"time": 6277, "text": "I've been feeling bad because people say, where's the portal work?"}, {"time": 6280, "text": "We're desperate."}, {"time": 6280, "text": "These are difficult times."}, {"time": 6281, "text": "We have an election coming up and it's just like, do you think for a moment that I want to explain that I actually got really uncomfortable being as well known as I was?"}, {"time": 6290, "text": "And then what is it that I want?"}, {"time": 6291, "text": "Because I want to be better known and less well known at the same time."}, {"time": 6295, "text": "It doesn't, there's nothing the audience can do."}, {"time": 6296, "text": "I don't want the audience to be the audience."}, {"time": 6298, "text": "That doesn't make sense to people."}, {"time": 6299, "text": "I want it to be a business, but I don't think people need to fear a business of the businesses open about being a business that, and then that's all to the side, what you're seeing now in front of the election is an incredibly meta violent period in our online existence, and I believe that anybody who attempts to say these two parties are completely screwed at the moment."}, {"time": 6325, "text": "The leadership of these parties is unsalvageable, unworkable."}, {"time": 6330, "text": "Everyone hears that from inside the two party system."}, {"time": 6334, "text": "Oh, I get it."}, {"time": 6334, "text": "He's trying to subtract votes off of Biden."}, {"time": 6337, "text": "He's trying to scuttle Trump."}, {"time": 6340, "text": "This is a play for his show because he's trying to plug in to discuss there's a bill Hicks routine on marketing."}, {"time": 6346, "text": "Have you ever seen this brilliant?"}, {"time": 6349, "text": "I recommend it to everyone where he comes out on stage and he says, are there any people in marketing and sales in the audience?"}, {"time": 6356, "text": "Woo."}, {"time": 6357, "text": "It's like, okay, great."}, {"time": 6359, "text": "Can you do us all a favor and die?"}, {"time": 6361, "text": "And like, everybody laughs."}, {"time": 6362, "text": "He's like, no, I'm not laughing."}, {"time": 6364, "text": "I'm seeing being serious."}, {"time": 6365, "text": "So he's talked about how marketing is horrible."}, {"time": 6367, "text": "So you're like, where's this act going?"}, {"time": 6370, "text": "Then he gets to the point of it."}, {"time": 6371, "text": "It's like, oh, I know how you marketing people think bills going after that, uh, resentment dollar."}, {"time": 6377, "text": "That's good dollar."}, {"time": 6378, "text": "Let's get that resentment anti marketing dollar."}, {"time": 6380, "text": "It's like, no, that's not what I'm saying."}, {"time": 6381, "text": "I really hate marketers."}, {"time": 6383, "text": "Oh, that's good."}, {"time": 6383, "text": "It's the authenticity dollar."}, {"time": 6386, "text": "You can't escape this kind of negative marketing thought."}, {"time": 6391, "text": "And I guess that gets to the issue that I don't want to be destroyed in advance of this election."}, {"time": 6396, "text": "I don't think it's a good use of my relationship to my audience to be broadcasting how completely ridiculous Donald Trump and Joe Biden are as candidates for the president of the United States."}, {"time": 6413, "text": "Full stop."}, {"time": 6414, "text": "None of this makes any sense."}, {"time": 6415, "text": "These moderators of these pseudo debates were in the wrong format with the wrong people."}, {"time": 6421, "text": "No part of this makes a wit of sense."}, {"time": 6424, "text": "Can I try to push back several claims?"}, {"time": 6427, "text": "One is I don't believe the systems as they stand now can destroy their equine voice, the voice you're a child."}, {"time": 6440, "text": "I'm sorry to say that, but, well, let me, well, it's also possible."}, {"time": 6444, "text": "It's entirely possible that you're the child."}, {"time": 6449, "text": "Because a child would say you would call other people a child."}, {"time": 6453, "text": "Get in the first blow reveal the tell because the only power they have is to attack you psychologically."}, {"time": 6464, "text": "Well, I believe that the army of people that love you is much more powerful than mainstream media, than people that you might hear it say ridiculous things that you just said, which has tried to reduce you, like the marketing thinking."}, {"time": 6485, "text": "I just believe there's an army."}, {"time": 6488, "text": "Maybe there's a better term of people that see you for who you are and a hungry, like I'm not disputing those things."}, {"time": 6497, "text": "And what I'm saying, I would venture to say as your therapist that you're actually, uh, the battle is all in your mind."}, {"time": 6508, "text": "All in your mind that you have found these demons in the system, and they're just a tiny minority and it's all in your mind."}, {"time": 6519, "text": "They cannot actually remove."}, {"time": 6522, "text": "They're not strong enough to remove the voice of Eric Weinstein to silence the voice."}, {"time": 6529, "text": "I love this."}, {"time": 6531, "text": "This is some of the best fiction writing I've ever heard."}, {"time": 6535, "text": "Let me tell you, I have relatives who've known me my entire life, where one article in the New York Times, they will believe that over me."}, {"time": 6544, "text": "My contention is that it has no power except to affect your psychology."}, {"time": 6550, "text": "What you have to do is the Rogan thing, which is laugh."}, {"time": 6553, "text": "Just laugh."}, {"time": 6555, "text": "I am laughing."}, {"time": 6556, "text": "I know, but more."}, {"time": 6558, "text": "I'm telling you something."}, {"time": 6560, "text": "The way this works is through ruin."}, {"time": 6563, "text": "Ruin can come to anyone."}, {"time": 6567, "text": "There's no one who cannot be ruined."}, {"time": 6569, "text": "Every single person is signed up right now to be ruined by the system."}, {"time": 6575, "text": "Don't you understand that you have more power than the system?"}, {"time": 6580, "text": "You can ruin the system."}, {"time": 6582, "text": "Your Twitter account, the podcast."}, {"time": 6585, "text": "I'm telling you about the Army."}, {"time": 6587, "text": "I agree that my Twitter account, my pocket."}, {"time": 6590, "text": "But what we've seen, for example, you saw what happened to Brett's Articles of Unity project."}, {"time": 6596, "text": "What happened on the Twitter side?"}, {"time": 6603, "text": "Well, actually, say the word and say the word."}, {"time": 6605, "text": "It was blocked or removed from Twitter."}, {"time": 6607, "text": "Suspended."}, {"time": 6608, "text": "Account suspended."}, {"time": 6609, "text": "And I have a direct line to Jack."}, {"time": 6615, "text": "So I'm talking to the CEO who I am crazy enough to still believe in."}, {"time": 6621, "text": "I do, too."}, {"time": 6622, "text": "I believe somehow there's a very strange thing going on with Jack Dorsey."}, {"time": 6627, "text": "I cannot possibly reconcile the actions with the person I've... That is a next level mind in there."}, {"time": 6637, "text": "I don't know it well enough to say that it's all next level."}, {"time": 6639, "text": "I'm not claiming he doesn't have any blind spots."}, {"time": 6641, "text": "Every smart person I know has blind spots."}, {"time": 6643, "text": "I don't know what he's up against."}, {"time": 6644, "text": "Blah, blah, blah."}, {"time": 6646, "text": "There's no way that the Jack Dorsey that I've talked to and the Jack Dorsey that interacted over Articles of Unity can be the same person."}, {"time": 6655, "text": "He is constrained by that company in some way that doesn't make sense to me."}, {"time": 6659, "text": "Either that or he's the most duplicitous person on earth and I'm not believing it."}, {"time": 6662, "text": "I just don't buy it."}, {"time": 6665, "text": "Something horrible is happening."}, {"time": 6670, "text": "My claim is I can remove you functionally from the chessboard in a tiny number of moves, no matter who you are, no matter how virtuous or how much of a bastard you've been your entire life, it doesn't take more than three or four moves to basically neuter you as a force."}, {"time": 6688, "text": "And I disagree that if that's possible, that means I'm not very good at chess."}, {"time": 6692, "text": "Like Unity 2020 was removed from Twitter because it's not good enough, not within the system."}, {"time": 6699, "text": "Like the army of people that feel the brilliance of the idea was too small."}, {"time": 6706, "text": "Okay, but fear, uncertainty and doubt is the name of the game, the coin of the realm."}, {"time": 6711, "text": "Psychology though, it's not real power."}, {"time": 6713, "text": "It just affects the mind."}, {"time": 6715, "text": "Okay, I have a reading assignment for you because you're Russian, you'll really enjoy this."}, {"time": 6721, "text": "As part of the great American tobacco settlement, the Tobacco Institute had to disgorge its archives of all of its strategies, all of its skullduggery and put it on the web for all time so that we can all understand how the tobacco companies got together and destroyed people, right?"}, {"time": 6739, "text": "You see tobacco destroys people."}, {"time": 6742, "text": "You can see, you know, Scientology destroys people."}, {"time": 6746, "text": "There are various vindictive organizations that will not tolerate reality in opposition to them."}, {"time": 6756, "text": "Let's take them down."}, {"time": 6759, "text": "That's what I'm trying to tell you is..."}, {"time": 6761, "text": "So why aren't you doing the podcast to return?"}, {"time": 6763, "text": "Because that's one of the weapons of war."}, {"time": 6769, "text": "Well, first of all, if you're at war, I don't want to discuss strategy on a podcast, right?"}, {"time": 6777, "text": "But that's your misunderstanding."}, {"time": 6779, "text": "What did Montgomery say about Rommel?"}, {"time": 6781, "text": "But wasn't his line, I read your book, you beautiful bastard."}, {"time": 6786, "text": "It's like, why are you using the tactics that you already explained?"}, {"time": 6790, "text": "So one of the things I'm doing is I'm not having a strategic conversation with you and several hundred thousand of our closest friends."}, {"time": 6800, "text": "I pulled back because this is not the battle that I know what I'm doing."}, {"time": 6808, "text": "I do not feel passionately enough about defeating Donald Trump to elect Joe Biden, even if that's the way I'm going to ultimately vote, right?"}, {"time": 6819, "text": "I don't believe in the Biden Democratic Party."}, {"time": 6822, "text": "I don't believe in the Trump Republican Party."}, {"time": 6825, "text": "So, yes, it's an incredibly consequential election."}, {"time": 6828, "text": "But to me, it's like the Crips and the Bloods and the Latin Kings fighting over the right to extort a business and the business trying to figure out who it wants to do the extorting."}, {"time": 6840, "text": "But don't you think, listen, there's very few people that are as good with the English language as you."}, {"time": 6845, "text": "Don't you think it's possible to draw a line in between that finds how we find our common humanity that ensures a better 2021 without having to say like Donald Trump is evil or Joe Biden is incompetent or any of that, just somehow draw a beautiful line?"}, {"time": 6868, "text": "I am seeing people in so much pain."}, {"time": 6870, "text": "This election is chewing up the integrity of everyone who comments on it, Lex."}, {"time": 6876, "text": "Maybe they're not good enough."}, {"time": 6878, "text": "They're not good enough."}, {"time": 6879, "text": "No, but the hope is... Do you believe in me?"}, {"time": 6885, "text": "Listen to me very carefully."}, {"time": 6886, "text": "My spider sense, my intuition that has allowed me to survive in the space, I've been mouthing off since the 80s, tells me this is a super dangerous time for smart people to be spending the dry powder because the election doesn't make sense."}, {"time": 6906, "text": "Doesn't mean that I don't have a sense that one outcome would be better than the other probably, but the variance on that, I'm not even positive that I'm right."}, {"time": 6916, "text": "These two options are so completely inappropriate to the world of 2020."}, {"time": 6922, "text": "What we need is so diametrically opposed to more boomers and more silent generation people trying to sort out a highly technical world being mediated through social media."}, {"time": 6936, "text": "We need more exclusion."}, {"time": 6937, "text": "We need more actual elites."}, {"time": 6939, "text": "The people we've called the elites are not the elite."}, {"time": 6942, "text": "They need to go."}, {"time": 6944, "text": "We need excellence, competence."}, {"time": 6945, "text": "We need people who can be trusted behind closed doors and we need to close the doors so we can't see what those people are doing."}, {"time": 6956, "text": "Imagine that you had a bunch of people who'd all seen action in combat, had all volunteered to be part of the armed services, had all come from backgrounds where they didn't need to."}, {"time": 6966, "text": "So you were convinced that these people had put their lives on the line for their country, not for a payday."}, {"time": 6972, "text": "Imagine you had 10 of these people with technical backgrounds, men, women, black, white, Muslim, Jew, doesn't matter."}, {"time": 6982, "text": "I would trust those people and I'd close the door."}, {"time": 6986, "text": "I don't want to know what they talked about."}, {"time": 6989, "text": "I don't want transparency into all of their negotiations."}, {"time": 6993, "text": "I want to know that they're patriotic, that they see something in the world bigger than themselves and their family fortunes."}, {"time": 7000, "text": "I want to know that they're courageous."}, {"time": 7002, "text": "I want to know that they've got all of our well being and I'm willing to roll the dice."}, {"time": 7006, "text": "And if they screw us over, I'd rather go down like that."}, {"time": 7010, "text": "So I disagree with you there because there's a difference in those and Jocko because you're not speaking to people with credentials."}, {"time": 7019, "text": "No, I'm talking about self credentialed people."}, {"time": 7022, "text": "I view Jocko as self credentialed."}, {"time": 7024, "text": "But the biggest, the powerful thing about Jocko is he's not only self credentialed, but he's been real with people."}, {"time": 7032, "text": "The magical thing about Jocko isn't his book, isn't his life story is he's been talking on a podcast for a long, there's something real that happens."}, {"time": 7042, "text": "So if you took everybody, if you took Dan Crenshaw and Tulsi Gabbard and you took Jocko Willing and maybe Jesse Ventura, right, you can take, you can take Bernie Sanders."}, {"time": 7057, "text": "Who's, you know, a lone voice."}, {"time": 7058, "text": "You take all of these people who've like really just risked, like why do we trust?"}, {"time": 7065, "text": "Why is Katherine Hepburn the best that Hollywood ever produced?"}, {"time": 7068, "text": "Because she told Hollywood to go fuck itself hard."}, {"time": 7074, "text": "They gave her four Academy awards and she said, love you, sweeties."}, {"time": 7078, "text": "I'm going to use them as the doorstop for the bathrooms in my house."}, {"time": 7081, "text": "See that skill."}, {"time": 7082, "text": "That's, uh, that's, that's just, that's what you were talking about."}, {"time": 7086, "text": "Be Katherine Hepburn."}, {"time": 7087, "text": "Audrey Hepburn is pretty amazing, but Katherine Hepburn is next level."}, {"time": 7092, "text": "Well, you, I mean, that's what you're trying to say to me."}, {"time": 7096, "text": "I'm trying to figure it out, Lex."}, {"time": 7098, "text": "I don't have the answer yet."}, {"time": 7099, "text": "What I do know is that this election is chewing people up and I mean two separate things."}, {"time": 7103, "text": "One that parties don't have enough integrity that if you comment either for or against, there's a short sequence where you make a comment that's nuanced."}, {"time": 7113, "text": "You get referenced to something, right?"}, {"time": 7116, "text": "Like, you know, take this thing about, you know, find people on both sides."}, {"time": 7121, "text": "That is non resolved after N years, whether the context should be reported or not."}, {"time": 7129, "text": "We are in some situation in which Democrats and Republicans are primed to fight each other."}, {"time": 7135, "text": "The way introducing two ants from two different ant colonies always produces a battle."}, {"time": 7141, "text": "I don't want to be in that fray because those people are going to kill each other mindlessly like robots."}, {"time": 7148, "text": "And until the election is concluded, like I, do I think this is dire?"}, {"time": 7154, "text": "Could it be make or break?"}, {"time": 7156, "text": "I'm not saying that."}, {"time": 7157, "text": "Do I know which way this goes?"}, {"time": 7158, "text": "I can make an excellent argument that we need to elect Joe Biden right now."}, {"time": 7162, "text": "We've got a situation which can only be cured by voting for Joe Biden."}, {"time": 7166, "text": "I can make another argument that we could have a situation that can only be cured by defeating Joe Biden right now."}, {"time": 7173, "text": "And all of the things that the modern democratic party represents."}, {"time": 7178, "text": "I don't have, you know, it's, it's not the lady and the tiger we're choosing between the tiger and the tiger."}, {"time": 7185, "text": "It's the Sumatran tiger versus the Siberian tiger, right?"}, {"time": 7188, "text": "I'm trying to think, well, which tiger can I, do I have a better chance against, um, the key problem for us politically is that we have to divorce the concept of the center and moderation from kleptocracy."}, {"time": 7204, "text": "Every time we try to say something like we need more moderate solutions, we need more pluralistic solution."}, {"time": 7210, "text": "People will say, wow, you just want to hand us right back into the swamp, don't you?"}, {"time": 7214, "text": "The swamp people cause the moderates and the swamp people are the same people, right?"}, {"time": 7220, "text": "So then we have these two crazy wings."}, {"time": 7223, "text": "We can't have crazy right wing people."}, {"time": 7225, "text": "I don't want any Tiki torch BS."}, {"time": 7227, "text": "We can't have crazy left wing."}, {"time": 7229, "text": "Don't attack my courthouse."}, {"time": 7232, "text": "Really don't attack my courthouse and we can't have moderates."}, {"time": 7235, "text": "It's like, okay, how do we install our children and, and rape pillage and get these speaking fees when we're out of office and become, you know, cozy with the things when we're supposed to be regulating them and then, you know, become their lobbyists, you know, immediately when we leave office, all of this stuff, we need an entirely different system."}, {"time": 7254, "text": "And I can't talk about that at the moment."}, {"time": 7257, "text": "When I talk, people say, oh wow, so you're going to sit this one out cause you're a pussy because you're a coward."}, {"time": 7262, "text": "Great to know Eric."}, {"time": 7263, "text": "We thought better of you by click."}, {"time": 7266, "text": "I don't know what to do."}, {"time": 7267, "text": "But are you thinking of what to do?"}, {"time": 7271, "text": "Oh, you better believe it."}, {"time": 7273, "text": "Look, Brett, Brett had this idea of unity 2020 and I told him it was a wrong idea."}, {"time": 7280, "text": "I didn't tell him that unity 2024 was a wrong idea."}, {"time": 7283, "text": "I didn't tell him that unity 2028 is a wrong idea."}, {"time": 7285, "text": "And if I were to make the case that he was right and I was wrong, cause he's now shuttered the thing, right?"}, {"time": 7291, "text": "I would say that the case to be made that he was correct was, is that by doing this in 2020, we found out what we were up against."}, {"time": 7299, "text": "It's good to know that Twitter can turn this off at the drop of a hat."}, {"time": 7303, "text": "Great to know."}, {"time": 7305, "text": "It's good to know as we learned that you cannot have meetings of vice of presidential candidates in a primary that are not approved of by the party, right?"}, {"time": 7319, "text": "Like they've got this thing figured out so we don't have any way in."}, {"time": 7323, "text": "And now unity 2024 makes sense because unity 2020 was tried."}, {"time": 7330, "text": "I don't know that we get to 2024 under all circumstances and some we do and some we don't."}, {"time": 7336, "text": "There's, there's a game theoretic thing that I'm not sure you're accounting for, but you, you probably are."}, {"time": 7341, "text": "But let me just make an argument is Jack Dorsey very likely listens to your podcasts and wait, this is the power of these words."}, {"time": 7354, "text": "Something deep went wrong, but we can change it with the power of words."}, {"time": 7361, "text": "Something went wrong at Twitter."}, {"time": 7364, "text": "They have so much division on their platform."}, {"time": 7366, "text": "That's what I'm trying to say."}, {"time": 7367, "text": "They've gotten, it's not wrong."}, {"time": 7368, "text": "They just don't know they're understaffed."}, {"time": 7370, "text": "No, they have an insoluble problem."}, {"time": 7373, "text": "Difficult to solve."}, {"time": 7374, "text": "They have an insoluble problem."}, {"time": 7375, "text": "This is where you and I disagree because, well, all right, I'd like to create a competitor."}, {"time": 7380, "text": "So then, you know, give it to me, create the competitor, show me that you actually have understood this because my guess is, is that most of the things that you'll think about, I mean, I can tell you things I've talked to Jack about, which I know would make Twitter much better."}, {"time": 7395, "text": "However, I, I think that this problem of instantaneous communication across the planet and you subtract off all sorts of context and mutual self knowledge, the problem is us."}, {"time": 7408, "text": "It's not the platforms."}, {"time": 7409, "text": "We're thinking about a technological solution and I'm saying the problem is, is that we are ultimately the product."}, {"time": 7417, "text": "And I just disagree with that and there's a lot of, that's probably could save that for tomorrow."}, {"time": 7421, "text": "I look forward to spending summers in your villa when you, when you debut this product and I would love to angel invest in it."}, {"time": 7430, "text": "By the way, in terms of money, I'll never have a villa."}, {"time": 7435, "text": "No, I will always give away everything I own."}, {"time": 7441, "text": "Invest into like things like you mentioned, awesome things."}, {"time": 7446, "text": "Invest fine, but a little bit of a vuncular advice."}, {"time": 7452, "text": "Don't pledge to be the person who disgorges themselves of security."}, {"time": 7460, "text": "Money is freedom."}, {"time": 7462, "text": "It's a big hunking pile of freedom."}, {"time": 7466, "text": "You can choose to use it as the freedom to imprison you if you don't, you know, so you can use it as freedom to make yourself a prisoner of your money."}, {"time": 7473, "text": "But generally speaking, Lex money is freedom and your voice is important."}, {"time": 7479, "text": "At least retain the amount of money security you need to follow Joe's advice."}, {"time": 7486, "text": "What is the point of f you money if you don't say f you, the number of people who have f you money who don't say f you indicates the number of people who chose the freedom of their wealth to create a prison."}, {"time": 7499, "text": "They built a prison with the freedom they had and they walked into it, locked the door."}, {"time": 7503, "text": "I think it's too difficult not to create it."}, {"time": 7506, "text": "The reason I want to give away the money is because I just know my own psychology and you create prisons."}, {"time": 7511, "text": "Our human mind just creates those prisons that f you money is enough for basic shelter and basic food."}, {"time": 7520, "text": "That's, that's the optimal if you don't have kids yet."}, {"time": 7523, "text": "This is a, okay, this is the problem."}, {"time": 7525, "text": "This is why I'm sitting."}, {"time": 7526, "text": "So this is me, single Lex speaking, but future Lex, future Lex."}, {"time": 7532, "text": "I'm talking to future Lex, single, single present Lex, please don't listen."}, {"time": 7538, "text": "Don't be an ass."}, {"time": 7539, "text": "You're going to need some money and don't make these pledges to say on a podcast."}, {"time": 7544, "text": "I'm saying I want to save you from yourself."}, {"time": 7547, "text": "You need money to do many of the beautiful things that we're counting on you to do."}, {"time": 7551, "text": "Don't F it up."}, {"time": 7556, "text": "Can I talk to you about Roger Penrose?"}, {"time": 7559, "text": "You've talked to Roger on the portal, but also in between the lines and offline, just everything you've said about Roger Penrose for people who don't know."}, {"time": 7569, "text": "He just recently, a few days ago, won the 2020 shared the 2020 Nobel prize for physics, but it's clear to me that he had like a deep personal impact on you, a connection with you in terms of both your love of mathematics, just the way you see the world."}, {"time": 7590, "text": "This is the Eddie Van Halen conversation."}, {"time": 7592, "text": "This was clearly somebody who's profound in your worldview."}, {"time": 7596, "text": "Can you talk about Roger?"}, {"time": 7598, "text": "Can you talk about what it means that he won this highest of prizes just in general?"}, {"time": 7603, "text": "Let's celebrate the man."}, {"time": 7606, "text": "So first of all, there are two other people who won this prize."}, {"time": 7608, "text": "I just didn't happen to know who they were before they won."}, {"time": 7614, "text": "Roger is a very, it is not Roger in particular, but the class from which Roger comes that is so important."}, {"time": 7624, "text": "So I would put Roger in the class of Feynman, Einstein, Dirac, Yang, um, put Whitten in there."}, {"time": 7635, "text": "I mean, Whitten is a special case, but Whitten is weirdly the reverse of the Roger Penrose story, right?"}, {"time": 7645, "text": "Because Whitten is the first physicist to win a mathematical Fields Medal, the highest honor in mathematics."}, {"time": 7652, "text": "Penrose is in some sense, a mathematician who's now won the Nobel prize."}, {"time": 7656, "text": "So it's a perfect sort of a couplet."}, {"time": 7661, "text": "Roger's class means everything to me."}, {"time": 7665, "text": "That's the highest achievement of the human mind."}, {"time": 7668, "text": "I would probably throw Bach in with Feynman and Dirac and company, right?"}, {"time": 7676, "text": "I think that he was so inventive."}, {"time": 7679, "text": "It was very frustrating to watch this career."}, {"time": 7681, "text": "It was a little bit frustrating to watch Feynman's career."}, {"time": 7686, "text": "Feynman was so good and had he been born slightly different and a slightly different time, I believe his claim on physics would be far greater."}, {"time": 7701, "text": "I feel like Penrose in some sense came up a very difficult path because you see Einstein effectively solved most of the most important problems in general relativity right at the beginning."}, {"time": 7712, "text": "As a result, the children of Einstein are impoverished because there wasn't as much to pick off of the trees and sell at the market."}, {"time": 7719, "text": "Whereas Bohr and Planck didn't do nearly as good of a job with quantum theory."}, {"time": 7724, "text": "So there's lots to do in quantum theory."}, {"time": 7727, "text": "I think that Roger affected me personally by a diagram that I saw in a paper of Herman Gluck at the University of Pennsylvania."}, {"time": 7738, "text": "It was the first picture I'd ever seen of the Hopf vibration sketched and that weirdly I brought that to the Rogan program in order to sort of convey the wonder."}, {"time": 7750, "text": "It was recapitulating my own journey."}, {"time": 7754, "text": "I think I probably saw that at like age 16 or something and it just flipped my mind."}, {"time": 7761, "text": "Roger is incredibly visual, he's incredibly geometric, he's incredibly sui generis, he just does his own thing."}, {"time": 7769, "text": "He's got lots of bets."}, {"time": 7771, "text": "None of them had really come through the way you would hope and I think they stretched the rules to be blunt about it."}, {"time": 7778, "text": "To give him the prize."}, {"time": 7780, "text": "You said this thing on Twitter which is beautiful that every once in a while comes a human being that gives value to the prize versus the prize giving value to the human."}, {"time": 7792, "text": "Two different kinds of prizes."}, {"time": 7794, "text": "The reason that we care about the Nobel Prize isn't because of Alfred Nobel."}, {"time": 7799, "text": "It's because it came along at the right time to reward Einstein, Dirac, Schrodinger, Feynman."}, {"time": 7810, "text": "Most of the people who should have won, won."}, {"time": 7815, "text": "Most of the awards are not good in the sense that they don't really follow."}, {"time": 7821, "text": "The prize is used to rewrite history, that's the problem."}, {"time": 7826, "text": "You should have a love hate relationship with it because on the one hand it does focus the world on what really matters and on the other hand it distorts what really matters and both of those functions take place simultaneously."}, {"time": 7838, "text": "In this case, I think that they violated their own rules slightly so it wasn't really clearly a case of a prediction and a discovery in the typical fashion."}, {"time": 7850, "text": "We better give this award to somebody of that highest caliber to make sure that the prize is fully funded with prestige going forward."}, {"time": 7859, "text": "That's sort of my weird speculative guess as to what happened."}, {"time": 7864, "text": "So Roger's getting on in years and the person should be alive so I think they bent the rules and I think they couldn't have bent it for a better person and I hope they will not bend the rules out of weakness but out of strength in the future."}, {"time": 7878, "text": "It would be great to get Madame Wu and Emmy Nerder a posthumous prize along with Doug Prasher, George Sudarshan and George Zweig as well as Ernst Stuckelberg Nobel Prizes."}, {"time": 7895, "text": "There have been some terrible omissions, the first two being females who revolutionized our view of the world and I take a very dim view of people pushing for prizes for people from ethnic groups or genders or whatever in order to make it plural and inclusive."}, {"time": 7915, "text": "If it's not following the work and I feel very clear that in a few cases we know there was a real problem with the Nobel committee because we have stunning accomplishments and try to get through a day as a physicist with that Nerder's theorem and try to imagine the universe without Madame Wu's discovery that left and right don't appear to be symmetric."}, {"time": 7936, "text": "I mean these are terrible omissions and they're a huge blot on science for not being more inclusive when it matters."}, {"time": 7945, "text": "Yeah so just like you said the Nobel Prize is plagued by omissions as much as... And distortions and dilutions."}, {"time": 7951, "text": "For example, Dirac and Schrodinger were I believe given the prize in the same year."}, {"time": 7955, "text": "There's no reason that those two people needed to dilute each other."}, {"time": 7959, "text": "The same thing with you know Dyson was an omission, Tominaga probably got included in part because we had an opportunity to show that something had happened on both sides of the Pacific after the war."}, {"time": 7973, "text": "But I don't think we needed to dilute Weinberg or Feynman or Schwinger."}, {"time": 7980, "text": "It makes me somewhat sick."}, {"time": 7981, "text": "All of these people are such important giants and it has to do with the field I think not wanting to create luminaries and superstars who could have defended the field from budget cuts and worldly pressures."}, {"time": 7994, "text": "So I think it's really important that we have absolute superstars because we produce superstars."}, {"time": 8000, "text": "We acknowledge them, we don't dilute them and that we bend the rules to make sure that the prize stays funded with the prestige that comes from giving it to the Roger Penrose's, Albert Einstein's and Paul Dirac's of the world."}, {"time": 8016, "text": "Can we talk a little bit about evil?"}, {"time": 8021, "text": "I haven't actually talked to you about this topic and it's been sitting on my mind mostly because everybody at MIT is quiet about it, which is Jeffrey Epstein."}, {"time": 8036, "text": "I didn't get a chance to experience what MIT was like at the time when Jeffrey Epstein was part of this, but I'd love to try to understand how evil was allowed to flourish in a place that I love."}, {"time": 8058, "text": "Whether you think, maybe let me ask the question this way."}, {"time": 8064, "text": "Was it the man evil or was the system evil or is evil too strong a word?"}, {"time": 8075, "text": "Because what I see is the presence of this particular human being in the eyes of many destroyed the reputations of many really strong scientists and also weakened the ability, like weakened the institution of MIT by making everybody quiet, like almost making them unable to say anything interesting or difficult."}, {"time": 8109, "text": "And what is that and what am I supposed to?"}, {"time": 8115, "text": "Why is everyone quiet about Jeff?"}, {"time": 8119, "text": "Obviously I want to scream about it too, right?"}, {"time": 8122, "text": "And I probably have said too much about Jeffrey Epstein."}, {"time": 8126, "text": "Look, something horrible happened."}, {"time": 8129, "text": "I don't know what it is, but something horrible happened."}, {"time": 8134, "text": "And you know, at the one thing that, okay, let's just do this."}, {"time": 8140, "text": "The first thing I need to do is I need to get rid of this woke crap about power differentials."}, {"time": 8147, "text": "In general, you can talk about hypergamy and power differentials are Russell conjugates of the same concept, just the way particular proportions and symmetries are mathematically provable to be attractive in females to males."}, {"time": 8168, "text": "Male attractiveness is largely determined by male competence and ability to amass power and success and all these sorts of things."}, {"time": 8178, "text": "The relationship between consenting adults is quite frankly not something I want to sort out the relationship between the sexuality of adults and minors."}, {"time": 8193, "text": "And particularly, you know, there's the 17, 18 issue that's very different than 12, 13."}, {"time": 8206, "text": "We're talking about really sick depravity with respect to what it appears that Jeffrey Epstein was involved in at some level."}, {"time": 8216, "text": "I believe this story is super complicated in part because I think one thing Jeffrey Epstein was doing was providing money, encouragement, and support to scientists."}, {"time": 8229, "text": "Another thing he was doing, I believe, was giving tax advice to very rich people."}, {"time": 8235, "text": "I believe another thing he was doing was hooking very wealthy people up with young adult females."}, {"time": 8246, "text": "Another thing he was doing, I think, was doing stuff with children that will curl your toes."}, {"time": 8256, "text": "So there's an entire spectrum of different stuff."}, {"time": 8259, "text": "And at the moment, nobody can pull apart or deconflate anything because the woke thing comes over it and says, I think it's disgusting that a 43 year old billionaire would be partying with a 23 year old."}, {"time": 8278, "text": "I don't want to adjudicate that."}, {"time": 8280, "text": "I'm worried about 12 and 14 year olds that we're not talking about."}, {"time": 8285, "text": "I don't think MIT was deep into pedophilia."}, {"time": 8288, "text": "My guess is that that did not happen."}, {"time": 8290, "text": "I don't think that the scientists were the targets of the really sick depraved stuff."}, {"time": 8298, "text": "It's my guess."}, {"time": 8299, "text": "My guess is that what you're looking at was a government construct."}, {"time": 8304, "text": "It may have been our government, it may have been a joint government project, maybe somebody else's government."}, {"time": 8311, "text": "I believe that in part, we don't really understand Robert Maxwell."}, {"time": 8317, "text": "Sorry, who's Robert Maxwell?"}, {"time": 8319, "text": "Ghislaine Maxwell's father was very active in scientific publishing."}, {"time": 8324, "text": "I don't know where peer review came from."}, {"time": 8326, "text": "I would love to run down the relationship between peer review and Robert Maxwell."}, {"time": 8330, "text": "I would love to run down the missing fortune of Robert Maxwell and the mysterious fortune of Jeffrey Epstein because I don't think Jeffrey Epstein ever ran a hedge fund."}, {"time": 8340, "text": "I don't think he was a money advisor the way people claimed."}, {"time": 8344, "text": "There's two things I want to talk about."}, {"time": 8346, "text": "One is the shallow conversations of woke identity politics that you're referring to seems to be removing everyone's ability, no, everyone's willingness to talk about like, what the hell is this person and how is he allowed?"}, {"time": 8365, "text": "Most importantly, how do we prevent it in the future?"}, {"time": 8370, "text": "From the individual perspective, the question for me is the same question I ask about 1930s Nazi Germany."}, {"time": 8377, "text": "I've been reading way too much probably or not enough about that period currently."}, {"time": 8381, "text": "If I was in Germany at that time, what is the heroic action to take?"}, {"time": 8387, "text": "When I think about MIT with Jeffrey Epstein, what is the heroic action to take?"}, {"time": 8391, "text": "We're not talking about virtue signaling action."}, {"time": 8393, "text": "You wouldn't know what to do."}, {"time": 8394, "text": "I would not know what you're up against, Lex."}, {"time": 8397, "text": "You're not hearing me."}, {"time": 8398, "text": "The problem here is what was Jeffrey Epstein?"}, {"time": 8402, "text": "Well, that question might be the heroic action to take."}, {"time": 8405, "text": "That's all I'm trying to say."}, {"time": 8406, "text": "I'm just trying to get my first question."}, {"time": 8408, "text": "You have to map the silence with Jeffrey Epstein."}, {"time": 8410, "text": "What you're describing is a map of the silence at MIT."}, {"time": 8416, "text": "Well, is there a map of the silence in Washington state around Jeffrey Epstein, the Bay Area, New York City?"}, {"time": 8426, "text": "The amount of silence around Jeffrey Epstein should be telling you everything."}, {"time": 8431, "text": "The number of dogs that don't bark is like nothing we've ever seen."}, {"time": 8436, "text": "You're exactly correct, but I want to know what is it telling us?"}, {"time": 8440, "text": "Because what it's telling me is not some kind of conspiracy, but more a disappointing weakness."}, {"time": 8449, "text": "Not some kind of conspiracy?"}, {"time": 8450, "text": "It's not some kind of conspiracy, but... You've got to be kidding."}, {"time": 8455, "text": "You're so afraid of saying the word conspiracy that you don't think it's a conspiracy?"}, {"time": 8458, "text": "I personally, I just think it's people who I thought were my heroes just being weak."}, {"time": 8466, "text": "Be of good cheer, sir."}, {"time": 8468, "text": "A cheer?"}, {"time": 8469, "text": "Be of good cheer."}, {"time": 8472, "text": "You think that there's a conspiracy?"}, {"time": 8473, "text": "I think there is a conspiracy."}, {"time": 8475, "text": "That'd be a very impressive one."}, {"time": 8478, "text": "That's the scale of it."}, {"time": 8480, "text": "I tend to believe that large scale can only be an emergent phenomena."}, {"time": 8486, "text": "I find this so fascinating."}, {"time": 8488, "text": "Because I always see you as like a logic and love drive your soul."}, {"time": 8495, "text": "You're very logical."}, {"time": 8496, "text": "You're relentless."}, {"time": 8497, "text": "You've got a lot of love in your heart."}, {"time": 8498, "text": "I believe that if you would review the video, where is it from?"}, {"time": 8501, "text": "Dubai or Abu Dhabi of the mysterious hit on the hotel guest?"}, {"time": 8507, "text": "You ever seen this thing?"}, {"time": 8510, "text": "It's the assassination in 2010, 10 years ago, of Mahmoud Al Mabou, something like that, in Dubai where I believe 26 separate individuals on multiple teams are shown converging coming in from all over the world on false passports, pretending to be tennis players or business people or vacationers."}, {"time": 8539, "text": "All of these teams have different functions and they murder this guy in his hotel room."}, {"time": 8547, "text": "The Dubai, I guess, chief of police or security officer was so angered that he put together this amazing video that says, we can completely detail what you did."}, {"time": 8559, "text": "We caught you on closed circuit TV."}, {"time": 8562, "text": "We don't know exactly who you are because your disguises and your false passports, but yeah, 26 people converged to kill one."}, {"time": 8571, "text": "No, I don't believe you."}, {"time": 8573, "text": "I don't believe after COINTELPRO and Operation Paperclip and Operation Mockingbird."}, {"time": 8582, "text": "I don't know whether I should even bring up Rex 84."}, {"time": 8587, "text": "To not believe in conspiracies is an idiocy."}, {"time": 8591, "text": "So you have a sense that evil can be as competent or more competent."}, {"time": 8598, "text": "First of all, when evil wants to operate at scale, it needs to make sure that people don't try to figure out evil."}, {"time": 8605, "text": "When evil operates at scale, from first principles, you have to realize that evil must not want it investigated."}, {"time": 8615, "text": "The most efficient way to keep yourself from being investigated, if you are an evil institutional player who needs to do this repeatedly, is to invest in a world in which no one can afford to say the word conspiracy."}, {"time": 8629, "text": "You'll notice that there is a special radioactivity around the word conspiracy."}, {"time": 8634, "text": "We have provable conspiracies."}, {"time": 8636, "text": "We have admitted to conspiracies."}, {"time": 8637, "text": "You have been invited to conspiracy."}, {"time": 8640, "text": "There is no shortage."}, {"time": 8641, "text": "Conspiracies are everywhere."}, {"time": 8642, "text": "Some of them are mundane."}, {"time": 8644, "text": "Some of them are like price fixing cartels, or trade groups, or generally speaking, conspiracies."}, {"time": 8651, "text": "So the first thing you have to realize is that all of us are in a memetic complex where you can be taken off the chessboard by saying, conspiracy theorists, get done."}, {"time": 8663, "text": "It's like a one line proof."}, {"time": 8665, "text": "We don't have to listen to Lex."}, {"time": 8666, "text": "He said he was a conspiracy theorist on this show."}, {"time": 8670, "text": "That is partially distorting our conversation."}, {"time": 8672, "text": "If you want to ask me about Jeffrey Epstein, you have to agree with me that that is a logical description of what you would have to have if you wanted to commit conspiracies is that you have to make sure that people are dissuaded from investigating this."}, {"time": 8686, "text": "But it's a fascinatingly difficult idea then because the world with conspiracy theories and the world without conspiracy theories to the shallow glance looks the same."}, {"time": 8698, "text": "Well, my point."}, {"time": 8700, "text": "There is responsible conspiracy theorize where you look at the history of unearthed conspiracies and just like you would with any other topic, just think about how different the rules in your mind are for conspiracy theorizing versus X theorizing where X can be anything, right?"}, {"time": 8720, "text": "It's like if I say to you, um, I can say the statement that average weight is not the same between widely separated populations."}, {"time": 8731, "text": "You'd say, yeah, I'd say average height is not the same between widely separated populations."}, {"time": 8737, "text": "You'd say, yeah."}, {"time": 8738, "text": "Then I say, in fact, no continuous variable that has that shows variation should be expected to be identical between widely separate."}, {"time": 8746, "text": "Of course they're like IQ, whoa, whoa, whoa, whoa, hold on, right?"}, {"time": 8752, "text": "So we have a violent reaction to specific topics."}, {"time": 8756, "text": "So the first thing I want to do is just to notice that conspiracy has that built into everyone's mind."}, {"time": 8765, "text": "That's really important to state."}, {"time": 8766, "text": "Yeah, that's, it's very interesting that, and as a prerequisite, as you're saying, that would be the first step."}, {"time": 8774, "text": "If you wanted to pull off a conspiracy in a competent way, that's, you would have to first convince the world."}, {"time": 8781, "text": "I just watched the film 1971 about my favorite conspiracy of all time, I highly recommend it 1971 well, the film is entitled 1971 and it's about the citizens committee to investigate the FBI, which was a run by a student of Murray Gelman, a physicist and broke into FBI offices in Pennsylvania to steal files, which allowed freedom of information requests that discovered a huge conspiracy."}, {"time": 8809, "text": "It was a conspiracy that unearthed a conspiracy inside the federal government, a double conspiracy story, which launched multiple conspiracies."}, {"time": 8820, "text": "I think that the problem with modern Americans is that they are so timid that they don't even learn about the history of conspiracies that we have absolutely proven."}, {"time": 8830, "text": "So with that done, Jeff Epstein, in my opinion, represented somebody's construction."}, {"time": 8839, "text": "I don't think that scary to think about."}, {"time": 8842, "text": "Well, what part of the story isn't scary?"}, {"time": 8844, "text": "I in part did something which I imagine may get me destroyed because I was more worried about being destroyed by somebody else I had a conversation with around Jeff Epstein, right?"}, {"time": 8857, "text": "So I'm just trying to like get, let it be known that I don't know anything more than I've already said."}, {"time": 8863, "text": "Now, your friends at MIT, their problem is that Jeff Epstein showed up as the only person capable of continuing US scientific tradition."}, {"time": 8878, "text": "You see, the US scientific tradition is a little bit like the Russian."}, {"time": 8884, "text": "It's combative, okay?"}, {"time": 8889, "text": "And we're a free society and we act like a free society."}, {"time": 8892, "text": "We're a rich society and we research like we're a rich society."}, {"time": 8895, "text": "That is historically, and then came the 1970s and William Proxmire and the Golden Fleece Awards and the idea that we have to, we're paying too much and these are welfare queens and lab coats and blah, blah, blah, blah."}, {"time": 8908, "text": "We need more transparency, more oversight."}, {"time": 8911, "text": "Everything went to hell and the national culture of US science was lost."}, {"time": 8917, "text": "The thing that produced all this prosperity and security and power was lost."}, {"time": 8923, "text": "And then Jeff Epstein shows up and a tiny number of funders, maybe Fred Kavli, maybe Yuri Milner, maybe who else would be in this category?"}, {"time": 8939, "text": "Peter Thiel to an extent, Howard Hughes would be the largest of these things, which has different grant structures than the NIH, gave people a modicum of risk taking ability."}, {"time": 8952, "text": "Okay, well, when Jeff Epstein showed up, everybody wanted to take risk in science."}, {"time": 8960, "text": "And suddenly a charismatic billionaire says, hey, I can make that work for you."}, {"time": 8964, "text": "Here's $100,000, go research something crazy."}, {"time": 8967, "text": "Well, that money was supposed to be provided by the federal government under the terms of the endless frontier compact between the federal government and the universities and the federal government and the taxpayers Welch."}, {"time": 8983, "text": "So that's one place to lay the blame for Jeff Epstein as at the failure of the federal government to honor its commitment."}, {"time": 8995, "text": "So the universities became psychopathic."}, {"time": 8997, "text": "It's not like everybody doesn't remember what we're supposed to be doing to be moral, but the point was there wasn't enough money to be moral."}, {"time": 9004, "text": "So it was time to, uh, to eye each other as a source of protein, as I like to say."}, {"time": 9011, "text": "And in that process, Jeffrey Epstein said, Hey, come to my world."}, {"time": 9017, "text": "We can do it like we used to do."}, {"time": 9022, "text": "So in part, my point is, is that almost none of your colleagues at MIT have that kind of religious commitment to science that they're willing to go down with ship science."}, {"time": 9035, "text": "The Galileo Galilei thing became very important to science because occasionally you just have to say, look, this isn't about me and you, there isn't enough money in the world to buy the kind of legacy I want to leave to this planet."}, {"time": 9053, "text": "This is one of the great things about science, you know, potentially it's worth dying for yeah."}, {"time": 9060, "text": "I'm glad you said it."}, {"time": 9063, "text": "Science is one of the things that is best that's worth dying for."}, {"time": 9068, "text": "I mean, I'm not eager to martyr myself, but I've certainly risked my health, my fortune, you know, I've, I've destroyed myself economically over science and, um, and my, my, my, my need to oppose these sons of bitches in chaired professorships who are destroying our system along with everyone else."}, {"time": 9092, "text": "Let me, um, bring in grandmaster into this."}, {"time": 9098, "text": "Oogway, master Oogway."}, {"time": 9101, "text": "I think he's a grandmaster."}, {"time": 9105, "text": "That would make him a chess playing turtle."}, {"time": 9106, "text": "Well, I've read some wikipedia and she was a master."}, {"time": 9112, "text": "There's apparently only one grandmaster and that's anyway, is the phrase grandmaster ever uttered in the script?"}, {"time": 9121, "text": "But there's a story."}, {"time": 9122, "text": "Oh, there's, there's off off script cannon."}, {"time": 9125, "text": "I'm going to call Glenn burger right now and find out if any of this is true."}, {"time": 9129, "text": "You're not supposed to call up my journalistic integrity, um, but master Oogway, master Oogway he says a couple of things I'd like to bring up with you."}, {"time": 9140, "text": "So one as part of a longer quote recommends, uh, that you should, uh, find a battle worth fighting."}, {"time": 9151, "text": "We've talked about several battles just now."}, {"time": 9155, "text": "What is the battle worth fighting for, for Eric Weinstein in the next few months, in the next year?"}, {"time": 9163, "text": "There's only one, well, it's, it's the Moses, it's the Moses thing."}, {"time": 9172, "text": "It's time to go."}, {"time": 9173, "text": "It's time to leave."}, {"time": 9174, "text": "This place is over to get off the planet."}, {"time": 9177, "text": "I, yeah, I, I, I freak people out when I say that, but like, look at your world."}, {"time": 9183, "text": "You just got introduced to the problem of a virus."}, {"time": 9186, "text": "Wait, wait till it's fusion devices and you understand what it means to have one interconnected planet with no uncorrelated experiments happening anywhere else."}, {"time": 9198, "text": "So do you see the foray, your work in physics and maybe like the echoes of it in a ship Elon?"}, {"time": 9208, "text": "Everybody who has a possible plan to avoid what is coming if we don't have one should work on the plan that he, she thinks best, right?"}, {"time": 9221, "text": "So Elon wants to do rockets."}, {"time": 9223, "text": "People misinterpret me."}, {"time": 9225, "text": "I meta Eric says, I don't think that's a smart plan."}, {"time": 9231, "text": "Regular Eric says all people who have hope should do that thing."}, {"time": 9240, "text": "At least it's Mars, man, at least it's the moon and Mars and maybe Titan and whatever."}, {"time": 9245, "text": "And I don't think it'll work and it doesn't make sense and it looks silly, but that's exactly the kind of fight worth fighting."}, {"time": 9249, "text": "But it's, it's the kind of fits for the same reason that I went on Brett's unity, 2020 thing when I didn't think it had a hope in hell and people are, you know, are making fun of it."}, {"time": 9258, "text": "It's like, we got to do things that make, that make us feel dumb and silly and childish that it possibly have a hope of working."}, {"time": 9265, "text": "So everybody should do something."}, {"time": 9267, "text": "My version of this, I am the most hopeful about because I wouldn't have chosen to do if I thought that Daniel Schmack did burgers wisdom project was a better hope."}, {"time": 9277, "text": "I do that."}, {"time": 9279, "text": "It's more down to earth in a certain way."}, {"time": 9281, "text": "I just think that it's more probable."}, {"time": 9283, "text": "Look, we got from a powered flight with the Wright brothers and wind tunnels to sending back images from the surface of Titan via Huygens Cassini in less than a century."}, {"time": 9296, "text": "So what we can do if we can change the laws of physics is something we can't even conceive of."}, {"time": 9303, "text": "It may be that it buys us nothing and at least we'll, we will know why we died on this planet as a small aside."}, {"time": 9313, "text": "I think this is not the right time to take the full journey, but I feel like you'll guide me like master way did."}, {"time": 9322, "text": "And I'm the Kung Fu Panda."}, {"time": 9324, "text": "They only have one conversation."}, {"time": 9327, "text": "We're on our, like, we didn't, we didn't, well, we're, we're, we're Jews and they weren't."}, {"time": 9333, "text": "So we talked too much, but the guide doesn't have to be with words."}, {"time": 9337, "text": "You don't think Poe was Jewish?"}, {"time": 9340, "text": "It's debatable."}, {"time": 9341, "text": "We'll have to go back to the Wikipedia."}, {"time": 9346, "text": "Is there, um, that you would guide me through some more intuition about the source code, the source code of our universe."}, {"time": 9358, "text": "Can you comment on where, since we last spoke, where your thinking has been, has roamed around geometric unity around that work in physics in this fight?"}, {"time": 9368, "text": "I'm trying to figure out when to release it and how, I mean, I've released the video and the video, quite honestly, I think it has a very bizarre reaction."}, {"time": 9379, "text": "I think one of the things that I've learned from the video, cause the video is coming up on half a million views on YouTube alone to say nothing of the, um, the audio, but yeah, it produced a very strange reaction."}, {"time": 9394, "text": "One of the things I don't think that I properly understood is that most physicists don't talk in this geometric language."}, {"time": 9406, "text": "I thought that more of the physics world probably had converted over into manifolds, bundles, differential forms, connections, curvature, tensors, et cetera."}, {"time": 9417, "text": "And I, I saw a lot of the comments would say things like, I have a PhD in theoretical physics and I'm not even familiar with all of these concepts."}, {"time": 9425, "text": "And I think that was probably a distortion coming from living in Cambridge, Massachusetts for almost 20 years."}, {"time": 9434, "text": "So what's the solution to that?"}, {"time": 9436, "text": "Well, I mean, I can make this make as much sense as anybody needs to."}, {"time": 9441, "text": "My problem is my calculation is that as long as the boomers are still in charge, the same people have these perverse incentives on them where they've invested in these programs that didn't work."}, {"time": 9456, "text": "So they're extremely hostile and kind of difficult to deal with."}, {"time": 9461, "text": "The fact that I'm not a physicist, um, has its own set of issues, which is that effectively it's like the hermit kingdom."}, {"time": 9468, "text": "They don't get any visitors and they don't necessarily want somebody, you know, rolling up and saying, I know how to do physics."}, {"time": 9476, "text": "So I'm, I'm always very clear."}, {"time": 9481, "text": "That said, if I wait too long, I don't know that theoretical physics is really going to exist after the boomers because everyone in you, I think you had Wolfram on your program."}, {"time": 9492, "text": "I don't remember whether he said this to you or Brian Keating, but he said something like everybody got discouraged."}, {"time": 9497, "text": "It was too hard."}, {"time": 9500, "text": "Can't do that."}, {"time": 9501, "text": "Guys."}, {"time": 9502, "text": "We cannot do that."}, {"time": 9503, "text": "There's something about the renormalization revolution that innervated the physics community because it taught them just because you can see in this energy regime doesn't mean you can extrapolate somewhere else unless you understand how, you know, coupling constants run and what kind of a UV fixed points exist, blah, blah, blah."}, {"time": 9521, "text": "Somehow that discouraged people from guessing from believing everything became an effective theory."}, {"time": 9527, "text": "The beauty of the effective theory wasn't taken to be really the beauty of the universe, just the beauty of an energy level."}, {"time": 9533, "text": "So I think that renormalization was one of the most important revolutions that ever happened in science."}, {"time": 9539, "text": "And also its interpretation by the physics community was catastrophic."}, {"time": 9544, "text": "Well, the story I'm telling myself is that in part I'm waiting for them to get weaker."}, {"time": 9550, "text": "But on the other hand, I don't know that we have any time left."}, {"time": 9552, "text": "And so are you also thinking about ways of, uh, you know, you know, the, the podcast medium is revolutionary for public for discourse for what, I mean, I don't even know the right words for it."}, {"time": 9565, "text": "Are you thinking of revolutionary ideas for re energizing the physics community?"}, {"time": 9570, "text": "So basically for communicating, look, I have a fantasy, okay?"}, {"time": 9576, "text": "My fantasy is that all of these things are the same problem."}, {"time": 9580, "text": "And it goes back to this thing that I read about in, in Fineman's, um, books about Tartaglia."}, {"time": 9586, "text": "They asked him this question, like, what's the greatest thing that ever happened in math?"}, {"time": 9590, "text": "And he says, Tartaglia is solution of the cubic."}, {"time": 9592, "text": "It's just like the weirdest answer."}, {"time": 9595, "text": "So you're like, okay, I'll bite."}, {"time": 9598, "text": "Why is it Tartaglia solution of the cubic?"}, {"time": 9600, "text": "And he said, because it was the first time a modern person had done something profound that the ancients had failed to do."}, {"time": 9606, "text": "I was like, Oh, I got it."}, {"time": 9609, "text": "It's the thing that opens up new psychology that says maybe things are possible again."}, {"time": 9614, "text": "It's a new orchard, new orchard, new farmers, new people who can find fruit that they can pick."}, {"time": 9623, "text": "And once you have one person do that, very often you get many, like one of the things that we were talking about with Eddie Van Halen."}, {"time": 9629, "text": "The reason that he created a revolution and somebody like Roy Buchanan did not is that you could follow Eddie Van Halen."}, {"time": 9636, "text": "You couldn't pioneer it."}, {"time": 9638, "text": "And maybe you couldn't play as well and as cleanly and as fast and as inventively, but you could follow once you understand that there is a tapping principle."}, {"time": 9647, "text": "It was just the beginning of something called percussive guitar."}, {"time": 9653, "text": "My belief is that once we start innovating in the present, everything will come because everything that around us is screwed up on that."}, {"time": 9664, "text": "Let me with one last question, bring back master Oogway, the probably the most famous quote of his, right, with yesterday's history, tomorrow's a mystery, but today is a gift."}, {"time": 9677, "text": "That is why it is called the present."}, {"time": 9680, "text": "It's very beautiful."}, {"time": 9681, "text": "Although I would have gone with quit, don't quit, noodles, don't noodles."}, {"time": 9687, "text": "I feel like people need to know way too much context for that to make sense."}, {"time": 9693, "text": "It's your audience."}, {"time": 9694, "text": "To hell with context."}, {"time": 9696, "text": "They'll figure it out."}, {"time": 9697, "text": "Let me ask, what are you grateful for today?"}, {"time": 9701, "text": "What is your present?"}, {"time": 9704, "text": "We've talked about a lot of dark things, but what brings you joy to your heart that I can't believe I'm lucky enough to have this?"}, {"time": 9715, "text": "You know, Nyla and Zev, my wife, Pia, the fact that we've got our health, all the little things, saying grace after meals."}, {"time": 9728, "text": "You're coming over for Friday night Shabbat dinner, so we'll bench together and say grace."}, {"time": 9733, "text": "It's important to just, like this bottle of water in front of me, I made a point of just thinking about how wonderful it is that there's a quenching bottle that happens to be placed in front of me because somebody cared."}, {"time": 9750, "text": "That small thing made a difference to me."}, {"time": 9757, "text": "I still have strength for the fight so far."}, {"time": 9760, "text": "I think that's something I'm grateful for."}, {"time": 9763, "text": "I can't believe that I'm not more beaten down after all of this nonsense."}, {"time": 9771, "text": "I have the most interesting set of friends."}, {"time": 9776, "text": "I'm not that rich by monetary standards, but if there were friend billionaires, Forbes would be all over my ass."}, {"time": 9787, "text": "I just can't believe who I can talk to, you know, at the drop of a hat."}, {"time": 9792, "text": "And I'm really grateful."}, {"time": 9802, "text": "I think this is the end of something profound, and it's the beginning of whatever is next."}, {"time": 9808, "text": "And whatever is next could be terminal."}, {"time": 9810, "text": "Whatever is next could be amazing."}, {"time": 9812, "text": "Whatever is next could be a return to the horrors of the early 20th century that doesn't manage to go totally catastrophic, but takes hundreds of millions of lives in the process."}, {"time": 9825, "text": "I'm grateful to having half of my life in the rearview mirror."}, {"time": 9830, "text": "Maybe it took place in a bubble, and maybe it was unsustainable."}, {"time": 9834, "text": "But it was nice to be able to move around the world without a mask."}, {"time": 9840, "text": "It was nice to be able to see a little bit of the world, even if it was from a cot in a hostel in some country."}, {"time": 9849, "text": "To fall in love."}, {"time": 9851, "text": "It was a good life."}, {"time": 9855, "text": "Find the last Indian Jewish girl left."}, {"time": 9857, "text": "Who knew?"}, {"time": 9859, "text": "You're a lucky guy."}, {"time": 9861, "text": "Well, let me just say... Actually, there's something I wanted to just say before you get to that."}, {"time": 9866, "text": "I forgot to say something."}, {"time": 9869, "text": "Falling in love with an intellectual collaborator is a special thing that not everybody gets a chance to do."}, {"time": 9876, "text": "I think when I met Pia, I fell deeply in love with her, all her normal characteristics."}, {"time": 9884, "text": "Pia and I had an antagonistic relationship around geometry and economics."}, {"time": 9890, "text": "And then weirdly, just like in a buddy picture where in the first half of the film they hate each other, the two fields were fighting with each other, cats and dogs, and finally the sexual tension clearly was so thick you could cut it with a knife."}, {"time": 9904, "text": "And we came up with geometric marginalism, which is this other theory, not geometric unity, which allowed me to inhabit space with somebody who I already knew intimately and had fallen in love with, and to see the quality and beauty of their mind and to play and to dance."}, {"time": 9924, "text": "It's sort of the intellectual version of the tango, one of the most romantic periods of my life that doesn't fall into most people's experience."}, {"time": 9932, "text": "So that was a chance to see something totally unexpected, haven't really had it since because she doesn't want to revisit the material, but something I'm super grateful for that's very particular and unique."}, {"time": 9945, "text": "But to flip the tables on you, for hundreds of thousands, I think millions of people, I can speak, me and them are really grateful, one, that you exist, and two, sorry, for your podcast and I do hope your voice in some form continues to reverberate, I think, at least in the 2021s and beyond, even if it takes a brief pause."}, {"time": 9979, "text": "We're pausing at the moment."}, {"time": 9981, "text": "We've recorded some for future episodes and I'm recording for you."}, {"time": 9988, "text": "But earnestness trades at a discount at the moment because it's easy to make fun of it."}, {"time": 9994, "text": "One of the things I like best about you is that you and I are both fairly earnest."}, {"time": 9998, "text": "We may joke and jab, but honestly, there's a project here and a world to win, as they say."}]}]