[{"title": "Dan Reynolds: Imagine Dragons | Lex Fridman Podcast #290", "id": "jvGZkf87aCs", "quotes": [{"time": 318, "text": "But I look at songs that I've done and wish I had done more or kept going down that road and what would have happened."}, {"time": 326, "text": "And I'm really contained to, because of what our band is and what our fans expect and there's so much more to it that it's like I'm fitting in a box always."}, {"time": 338, "text": "And it's like, this song shouldn't be longer than three minutes and 30 seconds."}, {"time": 342, "text": "And I don't know if I remember the chorus after I heard it."}, {"time": 346, "text": "Maybe I need to hear the chorus three times instead of those two times."}, {"time": 349, "text": "It's like, there's certain, especially in pop music, it's really hard to, yeah, it feels like there's confines, even though people are like, well, there's no confines, but still everybody's writing a pop song that's a few minutes."}, {"time": 366, "text": "And are those explicit in your mind or are they just kinda, the gut is, like you said, chorus."}, {"time": 372, "text": "Should you have chorus once, twice or three times?"}, {"time": 375, "text": "Is that a gut thing or is that a rule thing?"}, {"time": 377, "text": "You know, I think it's a rule."}, {"time": 378, "text": "I mean, it's obviously a rule I impose on myself."}, {"time": 380, "text": "Nobody's in my house saying, hey, Dan, if you don't do this, I'm gonna punish you."}, {"time": 386, "text": "There's no major label president that's like, Imagine Dragons needs to make pop music, Dan."}, {"time": 393, "text": "My manager doesn't even tell me that."}, {"time": 395, "text": "I do it because it's what I perceive to be enjoyable."}, {"time": 400, "text": "I grew up listening to a ton of pop music, and then I ended up being in what is quote, unquote, a rock band, which I've never perceived it as that, but that's kinda what the world has called it, and that's fine, but."}, {"time": 416, "text": "So you're a prisoner of a prison that you yourself constructed."}, {"time": 421, "text": "Well, I'm a happy, I guess what I'm trying to say is I'm a happy prisoner of the prison that I have created for myself, and I made that prison thinking that it was a mansion."}, {"time": 431, "text": "So you worked with Rick Rubin."}, {"time": 432, "text": "What does Rick think about your prison?"}, {"time": 436, "text": "Rick was, you know, it was interesting to hear his outside opinion when we first met, because my biggest focus for so much of my life, my biggest fear was, and this stems from, I think, middle schools when it started, but everyone being in on a joke except for yourself."}, {"time": 460, "text": "I really, like, the thought of thinking you're good at something, and really, you're terrible at it, and you're surrounded by people who are saying, yeah, you're good at it, and then by themselves, they're like, he's terrible at this."}, {"time": 473, "text": "Just kind of, and not just in regards to music or art, but anything in life, and I think maybe from having six older brothers, it stems from that too, like, always feeling inadequate, and like, the annoying younger brother, you know?"}, {"time": 490, "text": "But anyway, so Rick's, and that's something I've learned to let go of as I've gotten older and had life experiences, but one of the things that Rick said really early on that has stuck with me was he said, yeah, you know, we're resuming the first time we met."}, {"time": 506, "text": "He said, I'd really like to work with you because I feel like you're not confined to a sound."}, {"time": 513, "text": "You've done a lot of different sounds, and so it's exciting because I feel like your fans are forgiving more than other rock bands or bands, because most people, when they hear a band, it's like, there's a very specific sound with it."}, {"time": 527, "text": "It's like, they do folk music, or they do, like, California rock, or they do surf, or they do, you know, like, there's, and your fans kind of want that."}, {"time": 539, "text": "Like, they want them to do that thing, and then they don't do it, and sometimes that goes well, but a lot of times it doesn't, and people, you know, critics and everybody is like, go back to the thing that you did good and do that."}, {"time": 552, "text": "Rick was, felt, whether he was right or wrong, that we could do, we hopped genres so much, and that's been to our benefit and detriment, I think."}, {"time": 567, "text": "Why detriment?"}, {"time": 569, "text": "Because people want you to be something."}, {"time": 572, "text": "It's more, you can believe it more."}, {"time": 575, "text": "I, you know, it's like."}, {"time": 578, "text": "It's more authentic if you never change."}, {"time": 580, "text": "I guess, I don't know."}, {"time": 582, "text": "I mean, certainly it's not something I subscribe to because I create music, but I also grew up listening to a lot of different genres, like, cats, I would listen to, like, Cat Stevens, and the next song would be, like, Biggie, and then the next song would be Nirvana, and it was like, I like a lot of, and then Billy Joel, and then Enya."}, {"time": 603, "text": "It was like, you know what I mean?"}, {"time": 604, "text": "I was a product, and I was a product of the 90s, which, if you listen to 90s music, it really was all, a lot of reason that people say, well, 90s were terrible."}, {"time": 612, "text": "Like, a lot of people say that."}, {"time": 614, "text": "I love the 90s, they were my favorite decade of music."}, {"time": 616, "text": "It was, there was a lot of genre hopping, and I don't know, I love that."}, {"time": 624, "text": "She had the, 90s had the boy bands, and it had Pearl Jam, and Nirvana."}, {"time": 630, "text": "And it had a lot of, like, women of the 90s was probably, is probably my biggest influence, like, kind of that, like, angry rock women of the 90s, like, Lannis Morissette, Jagged Little Pills, one of my favorite records of all time."}, {"time": 645, "text": "The lyrics were so intimate, and I don't know if she was angry or not."}, {"time": 652, "text": "Sorry, if she wasn't."}, {"time": 654, "text": "Yeah, but there was an anger to it."}, {"time": 655, "text": "There was angst, yeah, it was like angstiness."}, {"time": 657, "text": "And that in hip hop of the 90s influences me, and then my dad."}, {"time": 662, "text": "So, anything my dad listened to, which my dad didn't listen to any of that."}, {"time": 665, "text": "My dad listened to, like, Harry Nelson and the Beatles, Cat Stevens, Bob Dylan, Paul Simon, Billy Joel."}, {"time": 673, "text": "It was very much like singer, songwriter."}, {"time": 675, "text": "Do you mind if we, throughout this, listen to a few songs?"}, {"time": 678, "text": "Because you mentioned Harry Nelson, and I was actually, yesterday and the day before, listening to a lot of his stuff, and it's just like, damn, he's good."}, {"time": 688, "text": "And not as known as he should be."}, {"time": 693, "text": "Like, I was getting, do you mind if I play?"}, {"time": 695, "text": "No, please, yeah."}, {"time": 697, "text": "I don't know, not to open this conversation to the love song."}, {"time": 703, "text": "I would like that, actually, Lex."}, {"time": 706, "text": "But Without You is an incredible song."}, {"time": 709, "text": "Oh, man, that's, yeah."}, {"time": 712, "text": "And the heartbreak and the longing."}, {"time": 717, "text": "No, I can't forget the feeling of your face."}, {"time": 722, "text": "He's the best to do it, in my opinion."}, {"time": 724, "text": "In my opinion, he's the best to do it."}, {"time": 726, "text": "But I guess that's just the way the story goes."}, {"time": 730, "text": "And just the sadness of, like, there's something, I don't even wanna talk over him, because this is one of my favorite songs, too, but I think people have a really good bullshit indicator."}, {"time": 750, "text": "And music, in my opinion, whenever I meet a young artist and say, well, I'm trying to make a new band, and I wanna do something like how to be successful, I really think understanding that people have a really good bullshit indicator is the most important part of being an artist."}, {"time": 770, "text": "And I'll explain what that means, at least to me."}, {"time": 775, "text": "I think that in order to have success or be a leader or whether it's an art or anything, people need to believe that you believe what you're doing."}, {"time": 791, "text": "I think the best actors, really, when they're doing their thing, it's like they, it's not acting."}, {"time": 798, "text": "They're in it, and it's how they feel, and they're expressing that sorrow or joy or whatever it is."}, {"time": 805, "text": "Harry, for me, Harry Nilsen, I just believe it."}, {"time": 810, "text": "He sings that, and I feel it."}, {"time": 813, "text": "And whether he's the greatest bullshitter of all time, I don't think that's the case."}, {"time": 817, "text": "I think he probably was singing that song, and he just could transport himself to wherever he was."}, {"time": 824, "text": "It's what makes a great live act."}, {"time": 826, "text": "It's what makes a great song."}, {"time": 829, "text": "And someone could be the best actor and sing that in the same timbre, same EQ, same compression, same everything."}, {"time": 839, "text": "And there's some unknown there that I, I think, hopefully, it will be known at some point, and it's some scientific thing, but there's something there, the energy or something, that people can perceive it and say true or false."}, {"time": 854, "text": "And if it resonates as true, it's so much more meaningful, and it lives on."}, {"time": 859, "text": "And if it doesn't, that, for me, is what is good art or bad."}, {"time": 864, "text": "For people to dispute over, well, sonics should sound like that, silly to me."}, {"time": 868, "text": "It's like a song or even a painting, like, it's just the truthfulness of it."}, {"time": 876, "text": "Yeah, the truly great art goes, has to go to that place where you really are feeling it."}, {"time": 884, "text": "Like, you forget that you're being recorded."}, {"time": 886, "text": "You forget there's an audience."}, {"time": 887, "text": "You really are feeling it."}, {"time": 890, "text": "Yeah, which I totally agree with you."}, {"time": 893, "text": "One of the things that I love about the internet is it's brought the bullshit detector of the masses to power, which is beautiful, because then the masses uplift the really authentic."}, {"time": 909, "text": "And even if you didn't write the song, I think it helps a lot, probably, if you wrote the song."}, {"time": 915, "text": "But I was a little bit, maybe a lot, since we're in Vegas, a little heartbroken that to find out that Elvis didn't write his songs."}, {"time": 924, "text": "But I like, for example, Rocketman, Elton John, like, to find out that Elton John didn't really know where the words of Rocketman came from, meaning, like, the depths of it, it's interesting."}, {"time": 939, "text": "But nevertheless, he's super authentic, because for Elton John and for Elvis, there's something in the fun and the darkness and the entertainment of it."}, {"time": 949, "text": "Like, he goes to someplace in his mind that might not be deeply connected from where the lyrics came from."}, {"time": 955, "text": "But he relates it."}, {"time": 956, "text": "He relates it to whatever is in his mind and goes to that place emotionally."}, {"time": 961, "text": "Yeah, and that's what I think it is."}, {"time": 963, "text": "And that's why an actor, like I said, can be completely honest to me."}, {"time": 967, "text": "Maybe they didn't write the script."}, {"time": 968, "text": "But I write, like, I've always written all my own lyrics."}, {"time": 972, "text": "It's a really personal thing to me."}, {"time": 974, "text": "But I will say, I see people all the time who are performers like Elton John, for instance, who didn't write the lyrics that I believe that it means just as much to them as what I wrote, because they find the meaning in it for themself."}, {"time": 993, "text": "At least the greats do."}, {"time": 994, "text": "And I think that's the difference maker."}, {"time": 997, "text": "And I think you can perceive, and I'm sure you've seen art that doesn't move you, and maybe it moves someone else."}, {"time": 1004, "text": "But for you, for some reason, you perceive it to be uninteresting to you."}, {"time": 1010, "text": "And I feel like a lot of the time, I'm saying that it's, of course, sonically, maybe it's uninteresting to you."}, {"time": 1014, "text": "But I think the majority of the time, for myself, I can find inspiration in any sonic value or painting as long as I see it and I feel truth from the person that created it."}, {"time": 1026, "text": "Yeah, and for me, the lyrics, maybe not the entirety of the lyrics, but a few words can do wonders to take you to a place."}, {"time": 1036, "text": "And sometimes those words don't need to be connected with the other words."}, {"time": 1039, "text": "That's the beauty of music."}, {"time": 1041, "text": "They're allowed to float in the space of mixed metaphors."}, {"time": 1045, "text": "They're allowed to just jump around, and somehow it paints a picture without actually, what is it, glycerine by Bush?"}, {"time": 1053, "text": "Right, but it's also how the person says it, right?"}, {"time": 1055, "text": "It's like, it's the feeling of exactly, and the same person could say that word 10 other ways and you don't care."}, {"time": 1063, "text": "But someone says glycerine or whatever it is, and it's like, oh, you know what?"}, {"time": 1068, "text": "I feel that for some reason."}, {"time": 1071, "text": "The way he said that, he meant it to me."}, {"time": 1076, "text": "No, I can't forget this evening or your face as you were leaving, but I guess that's just the way the story goes."}, {"time": 1084, "text": "You always smile, but in your eyes, your sorrow shows."}, {"time": 1087, "text": "Yes, it shows."}, {"time": 1090, "text": "Let me ask you to analyze this song."}, {"time": 1093, "text": "Do you, so there's a lady possibly who's leaving him."}, {"time": 1098, "text": "Do you think he's leaving her or she's leaving him?"}, {"time": 1102, "text": "She went to."}, {"time": 1104, "text": "When I think of all my sorrow, and I had you there, but then I let you go."}, {"time": 1114, "text": "And now it's only fair that I should let you know what you should know."}, {"time": 1123, "text": "And then the chorus says, I can't live if living is without you."}, {"time": 1126, "text": "I can't live, I can't give anymore."}, {"time": 1132, "text": "He's got a voice on him."}, {"time": 1133, "text": "Yeah, he does."}, {"time": 1134, "text": "And if you really, there's been some incredible documentation on his life and the end of his life."}, {"time": 1140, "text": "And so my answer to this is probably skewed based on what I've seen about his life too, but he was a real alcoholic at the end of his life and it destroyed his voice and ended up killing him as well."}, {"time": 1158, "text": "And so when I hear that, I perceive it as someone who is destructive and in a destructive place in life and can't love someone properly."}, {"time": 1170, "text": "And so they can't live with them, but they can't live without them type thing, which is really something that I really identify with and I think is one of the struggles of life is loving yourself enough, forgiving yourself for things and letting yourself love someone else."}, {"time": 1192, "text": "And at least when I listened out, I hear Harry being like, and maybe I'm wrong, but this is how I perceive it at least is not loving himself and feeling like he's deserving of this person, like I have to let you go."}, {"time": 1242, "text": "Love is such a complex, nuanced thing that a lot of times, there's just more going on behind the scenes, I think."}, {"time": 1249, "text": "Yeah, and a small tangent on that, just as a curious question, have you paid any attention to the Johnny Depp and Amber Heard trials?"}, {"time": 1258, "text": "I have watched quite a bit of it because my wife really loves it and she watches it in bed at night."}, {"time": 1264, "text": "So it's raw, to me it's really, because you've mentioned how complicated love can be and it's, I've never seen, I don't care about the celebrity nature of it."}, {"time": 1274, "text": "I don't care if it was, I don't care who it is, but it's just laid out in such raw form."}, {"time": 1281, "text": "For the world to see it."}, {"time": 1282, "text": "For the world to see the toxicity, but also the passion and clearly the drugs and the drinking, but also like the longing and the dreams and I will always be with you, I will die for you, the places, the rollercoaster of love and it's all there at the end, past the end."}, {"time": 1307, "text": "So it's like, I've also recently reread The Rise and Fall of the Third Reich about Hitler and Nazi Germany."}, {"time": 1313, "text": "It's the rise and the fall and it's interesting to look at the entirety of that process after it's all over, many, many decades after it's all over."}, {"time": 1322, "text": "That book in particular written by the person that was actually there and so here we're seeing two people in the context of the courtroom analyzing this rise and fall of a love affair."}, {"time": 1336, "text": "You know the truth is, I was telling my wife this actually just the other day because she was asking me what I thought about it."}, {"time": 1342, "text": "It makes me really sad."}, {"time": 1344, "text": "It's humorous, don't get me wrong."}, {"time": 1346, "text": "There's a lot of parts in it that are just really funny."}, {"time": 1350, "text": "But I look at it and I also see the internet and someone's always the villain and someone's the hero which is such a funny thing and we talked a little about this offline before we got on this but I have a real firm belief in life that it's just more complex than you think, always, always."}, {"time": 1370, "text": "Johnny for instance is very charismatic and you love him and he's funny and the way he does things and he looks certain ways and he says things."}, {"time": 1382, "text": "You really love him and I feel like, and maybe I'm wrong on this but it looks like the internet is really, Johnny is the winner, Amber is the villain and I kind of look at it and I feel like, were any of you in their bedroom?"}, {"time": 1396, "text": "Were any of you there for these things?"}, {"time": 1399, "text": "And I'm not saying one way or the other."}, {"time": 1402, "text": "All I see when I look at that is two people with a lot of deep seeded hurt, anger and that anger is so poisonous to both of them and they're getting through it in the way that they only know how and I'm not saying we shouldn't be able to look at parts of it and laugh about it and stuff and be virtuous or something but just that there's not a hero."}, {"time": 1427, "text": "Yeah, I think unless you've been living with Amber and Johnny, you don't know and just because one seems more charismatic in the moment or funnier or more believable even, doesn't mean that their truth is the truth."}, {"time": 1444, "text": "And I feel like there's still love there too, which makes the whole thing."}, {"time": 1447, "text": "Oh, that's the hardest part."}, {"time": 1448, "text": "He won't even look at her."}, {"time": 1449, "text": "He looks down the whole time and maybe people say, well, it's because anger or hurt or whatever but the way that she looks and stuff, it just feels like there's so much hurt there that it hurts me to watch it."}, {"time": 1465, "text": "I just feel like, oh, my heart just aches for them and for both of them and I don't know either of them personally and I don't know, just hurts."}, {"time": 1475, "text": "I've never seen love laid out in this raw kind of way."}, {"time": 1478, "text": "It makes me feel better about, it almost gives you, seeing people have gone through a struggle in this sort of mundane kind of way, gives you room to struggle yourself about the messiness of love."}, {"time": 1496, "text": "Like you're supposed to, like relationship is supposed to be simple and whatever but this like, oh, man, this."}, {"time": 1502, "text": "It's like art."}, {"time": 1505, "text": "And for the record, I don't feel like it shouldn't be shown."}, {"time": 1509, "text": "I think it's actually really beautiful art and I agree there's gonna be a lot of people who walk away from it and are changed in certain ways or look at things different."}, {"time": 1516, "text": "I'm not saying it's changed in the whole world, the Johnny Depp trial, but it's art."}, {"time": 1519, "text": "It's just like you would look at a painting and it might affect you."}, {"time": 1523, "text": "My only commentary is more that there's not, I think it's silly when people say who's right and who's wrong and who's the clear villain and who's the, like we love as human, we have to have an answer for every, we have to put everything in a box."}, {"time": 1536, "text": "And it's like, well, we're looking at this and we're deciding you're right and you're wrong."}, {"time": 1541, "text": "And I just think it's silly unless it's your life."}, {"time": 1544, "text": "So speaking of heroes and villains and highs and lows, you grew up in Las Vegas."}, {"time": 1549, "text": "And you said that Vegas is a performing town, a town of high stakes, drama and eccentricity."}, {"time": 1555, "text": "It's a town of high highs and low lows."}, {"time": 1558, "text": "And I'll be damned if my therapist didn't point out that correlation out to me personally a long time ago."}, {"time": 1564, "text": "So to me, Vegas from the outside is romanticized by certain movies."}, {"time": 1569, "text": "The lows define the beauty of this town."}, {"time": 1574, "text": "And certain movies, so to me, Casino with Robert De Niro, Joe Pesci and Sharon Stone, leaving Las Vegas with Nicolas Cage, Fear and Loathing in Las Vegas with the Johnny Depp play, Hunter S. Thompson."}, {"time": 1595, "text": "First of all, what's your favorite representation of Vegas from a darker side?"}, {"time": 1601, "text": "And do you draw any wisdom insight from the darkness, the lows and the highs in those movies?"}, {"time": 1609, "text": "Or is it over romanticized?"}, {"time": 1612, "text": "So I grew up in a really conservative Mormon family."}, {"time": 1616, "text": "And Vegas was established by the Mormons and the mob."}, {"time": 1620, "text": "Those were like the two very different worlds that created what Vegas is."}, {"time": 1626, "text": "And if you live in Vegas, it really shows in a lot of ways because Vegas has the strip and the parties and the craziness."}, {"time": 1634, "text": "But it also has very neighborhoods and big families and conservative people and liberal people living together in a really interesting way."}, {"time": 1647, "text": "And for me, growing up here, for instance, was a lot of driving on the freeway, my mom being like, children, close your eyes."}, {"time": 1656, "text": "There's a naked woman on that billboard and everything."}, {"time": 1658, "text": "Okay, mom, on our way to church."}, {"time": 1661, "text": "It was like, but also being like, whoa, this is crazy."}, {"time": 1664, "text": "Like taking in whatever I could when I could."}, {"time": 1669, "text": "So I saw, and I'm grateful for that."}, {"time": 1673, "text": "Like, I really love that I didn't grow up as a Mormon in for instance, like Utah or something, like the typical place, because I saw both sides and I appreciated something from both sides."}, {"time": 1683, "text": "And now as a person now who's not religious, but just spiritually minded, you know, I'm grateful for that divergent character, that juxtaposition, dual edged sword that Vegas is."}, {"time": 1697, "text": "And I try to apply that to everything in life, which is like Johnny Depp and Amber."}, {"time": 1703, "text": "It's like, there's two sides to every story."}, {"time": 1705, "text": "There's always two sides to every coin."}, {"time": 1706, "text": "There's always, and there's something to be said for both."}, {"time": 1709, "text": "Like I try to see people and even if, you know, it's just, yeah, I try to apply that to life."}, {"time": 1716, "text": "As far as a movie that personifies Vegas or something in that medium that personifies Vegas in a way that resonates with me."}, {"time": 1726, "text": "Don't say Hangover."}, {"time": 1727, "text": "No, no, yeah."}, {"time": 1729, "text": "I also like, I wasn't even allowed to watch PG 13 movies growing up."}, {"time": 1733, "text": "So a lot of the movies that you're saying, like I either didn't see, I didn't have cable television."}, {"time": 1739, "text": "You know, I wasn't like a pilgrim, but I had a really, really conservative upbringing."}, {"time": 1743, "text": "So it didn't define your intellectual like development."}, {"time": 1748, "text": "No, no, I just, I can't think of any movie that comes to mind where I'm like, that's my Vegas movie."}, {"time": 1754, "text": "Like, I'm sure I've seen some of the movies you've said now, but I don't, I can't think of one that I'm like, actually personifies Vegas in a way that feels honest to me."}, {"time": 1765, "text": "Like, or like, wasn't there a Chevy, was there a Chevy Chase?"}, {"time": 1770, "text": "I think that's maybe the only one I thought of that came to mind where I was like, cause I love Chevy Chase so much that maybe it's one of his Vegas vacation or something."}, {"time": 1778, "text": "Yeah, so, but that's more like lighthearted surge, that kind of stuff."}, {"time": 1782, "text": "Right, it's not like, I guess what I would say is there's no truth that has been, that I've seen of Vegas."}, {"time": 1788, "text": "Cause what I see of Vegas is, there's obviously like the parties and stuff and the nightlife, which I'm not big party person."}, {"time": 1796, "text": "So it's, I haven't really experienced much of that, but there's also drugs and I have a strange relationship with drugs because I've lost a few friends to drug overdoses."}, {"time": 1806, "text": "And so I don't, that's not romantic to me, but there's also like, yeah, I mean, you asked for a dark reflection of it."}, {"time": 1814, "text": "I guess I certainly see a dark reflection to Vegas."}, {"time": 1817, "text": "And I don't, I feel like Vegas is typically personified as like at the tables and everything."}, {"time": 1822, "text": "But it's also like, I have like friends who've lost all their money to gambling addiction."}, {"time": 1827, "text": "And so it's like, what I guess the whole thing."}, {"time": 1831, "text": "Yeah, somebody maybe needs to make, maybe that's an open spot."}, {"time": 1833, "text": "There needs to be a dark side to Vegas."}, {"time": 1836, "text": "Well, it's about Mormons in Vegas, dying to drug overdose or getting shot by the mob."}, {"time": 1845, "text": "So you mentioned your spirituality."}, {"time": 1848, "text": "You've, you said that having a crisis of faith or just the philosophical question of asking who is God, does God exist?"}, {"time": 1859, "text": "Or in thinking of the flip side of that, of mortality, what happens when we die?"}, {"time": 1864, "text": "Those kinds of things were extremely difficult, deep things for you in terms of your development, the whole process of figuring that out."}, {"time": 1875, "text": "Why does it hurt so much to lose faith in God?"}, {"time": 1880, "text": "Yeah, I would say that the seeking of God, let's say that, is an obsession for me and has been since I was young."}, {"time": 1887, "text": "I really feel that I'm a deep, deep, deeply committed to finding answers in life."}, {"time": 1897, "text": "And there's some answers that I don't think there's an answer to."}, {"time": 1899, "text": "And I'm also very OCD by nature, so I just don't give up to that."}, {"time": 1903, "text": "I'm like, well, there must be somewhere in Tibet, there's some teacher or there's somebody out there that has the answer, or maybe it's yet to be found, I'm gonna find it."}, {"time": 1915, "text": "I'm really, my life has been to date probably unhealthily committed to finding answers about God or the lack thereof and mortality."}, {"time": 1930, "text": "It's all I sing about."}, {"time": 1931, "text": "It's all our records have been about."}, {"time": 1933, "text": "Who do you think is God?"}, {"time": 1935, "text": "Have you ever gotten a glimpse?"}, {"time": 1937, "text": "You know, I will say the closest I feel like I have been to experiencing God is, and this sounds so, maybe, I don't know."}, {"time": 1949, "text": "I don't know how it sounds, but it's through ayahuasca for me."}, {"time": 1953, "text": "That's my honest answer for you."}, {"time": 1954, "text": "I feel like I had pretty much given up all hope of there being anything greater than, you know, us being, you know, evolving and being here and then dying and you're gone and that's it and nothingness and from nothingness we came and nothingness we go."}, {"time": 1973, "text": "To where I am now, which is there are answers to be found."}, {"time": 1977, "text": "I don't know them."}, {"time": 1978, "text": "Like, I don't know what God looks like or if God has anything to do with the word God and the way that we say it, but I do believe pretty fervently that there is more to be found."}, {"time": 1991, "text": "Is it motion sensor or no?"}, {"time": 1993, "text": "I don't know what that was."}, {"time": 1994, "text": "Looked like they've all died, actually."}, {"time": 1997, "text": "Do you know which one of it?"}, {"time": 1998, "text": "Is it this one right here?"}, {"time": 1999, "text": "Why don't I just take it out, but then it'd be too dark."}, {"time": 2004, "text": "Take it out."}, {"time": 2007, "text": "Do you want to hold this chair?"}, {"time": 2009, "text": "See if I can get it like this."}, {"time": 2015, "text": "Almost there."}, {"time": 2017, "text": "I really don't know how I'm gonna catch this though."}, {"time": 2019, "text": "It's gotta be like something saying about this."}, {"time": 2027, "text": "It's my Chinese proverb."}, {"time": 2029, "text": "How many people does it take to, what is it, unscrew a light bulb?"}, {"time": 2033, "text": "A light bulb."}, {"time": 2034, "text": "It was hot too."}, {"time": 2035, "text": "It was like I was doing the two finger technique."}, {"time": 2038, "text": "Well, I'm glad you survived that."}, {"time": 2041, "text": "That'd be pretty ironic if we're talking about mortality and then this would be it for you."}, {"time": 2045, "text": "In that moment."}, {"time": 2047, "text": "I've never done ayahuasca, so it's a mixture of two plants."}, {"time": 2051, "text": "One of them is DMT, but a lot of people I really respect."}, {"time": 2054, "text": "Very, very intelligent people had profound experiences with ayahuasca."}, {"time": 2063, "text": "Where does the mind go?"}, {"time": 2064, "text": "What the heck is up with that?"}, {"time": 2066, "text": "I'll first say that I can't even smoke weed."}, {"time": 2069, "text": "I really do not enjoy it because I hate to let go of control."}, {"time": 2077, "text": "If I feel out of control in life, it's like one of my biggest weaknesses."}, {"time": 2081, "text": "It's like very scary for me."}, {"time": 2083, "text": "And some people really enjoy letting go in that way."}, {"time": 2090, "text": "So I was pretty terrified to make the jump then to ayahuasca."}, {"time": 2093, "text": "But my wife who I deeply respect made a profound change through ayahuasca."}, {"time": 2103, "text": "And I saw it."}, {"time": 2104, "text": "She led the way."}, {"time": 2105, "text": "And it wasn't a strange, like I think most, we have a thing in America that's like a misconception, a stigma on psychedelics where it's like, it's a drug and it makes some people crazy."}, {"time": 2120, "text": "And then you're gonna be on the street and you're gonna be out of your mind or you're gonna become like a crazy person basically."}, {"time": 2128, "text": "And I think I really bought into that notion because again, I was raised, I wasn't even raised with cable TV."}, {"time": 2135, "text": "Like ayahuasca is very, I didn't, you know."}, {"time": 2138, "text": "You can imagine what that was like for a Mormon kid."}, {"time": 2140, "text": "I didn't know anything about it and I never touched drugs at all and never even touched a cigarette, you know."}, {"time": 2147, "text": "Anyway, so I think we have this misconception about it where Americans are quick to go to their doctor and take any medication or drug, but you know, whoa, when it comes to like psychedelics."}, {"time": 2165, "text": "Anyway, that being said, so I had that trepidation going into it, but I really love and respect my wife and I saw it make a profound impact in her life where she suddenly was able to heal from a lot of trauma that she had."}, {"time": 2179, "text": "She had a really, she went through a lot in her life and it really helped her heal, but it also set her in a new path spiritually that seemed really like a place that I wanted to be."}, {"time": 2192, "text": "So I did it and I did it twice."}, {"time": 2195, "text": "The first time it didn't really have an effect on me, which happens to a lot of people, I guess."}, {"time": 2200, "text": "I drank this little thing and there was like this shaman who came over from overseas that was really, had been in the plant world for decades and was a really incredible, I don't even know if he likes to be called shaman, but."}, {"time": 2217, "text": "So it's supposed to be like 30, 60 minute to take effect and a few hours, the journey lasts."}, {"time": 2225, "text": "About four hours."}, {"time": 2225, "text": "Four hours."}, {"time": 2227, "text": "Yeah, so the second time I took it, I took it in, I would say 20, 30 minutes in exactly."}, {"time": 2232, "text": "I started to feel like I was like the dimension of what is reality, the curtain was pulled open and there was a lot more to discover and it really blew my mind in a way that I think it would probably blow anybody's mind if for instance, God descended or some Christian God or whatever it is."}, {"time": 2258, "text": "We all think it'd be this beautiful thing, but in reality, it would probably make people super fearful and think that they've lost their mind."}, {"time": 2265, "text": "Like I've always, yeah, I've always like joked that if the Mormon God came down and told my mom like, if God himself came down and told my mom, Mormonism is incorrect, she would say, Satan."}, {"time": 2277, "text": "You know, it's like, we're never, I think our minds are just not prepared for a lot of anything that's really extreme and it was very extreme."}, {"time": 2317, "text": "And just in that, it's like this kind of profoundness."}, {"time": 2320, "text": "It wasn't like, there was nothing at least for me that was, that felt like just like psychedelic, funny cartoons or something."}, {"time": 2329, "text": "It was like, I'm about to go on a journey and I'm gonna communicate, I'm communicating with something that feels incredibly wise, showed me a lot of things in my life, kind of almost like from a bird's eye, almost like I was looking through a video camera at a younger me."}, {"time": 2345, "text": "There was a particular thing that it communicated to me."}, {"time": 2351, "text": "I really have a hard time with accepting success and not feeling like feeling undeserving or something."}, {"time": 2361, "text": "I can't quite put it into words, but of my position and what I've been given, I've been given so much."}, {"time": 2370, "text": "And it showed me this thing from when I was young and explained to me why I am where I am now."}, {"time": 2375, "text": "And I, to this day, it did not feel like myself telling myself that."}, {"time": 2381, "text": "That's the only way I can explain it."}, {"time": 2382, "text": "And there was a lot more that it showed me and that was incredibly healing for me."}, {"time": 2387, "text": "But just to be like, to put it into a short thing because there's so much to this."}, {"time": 2395, "text": "It felt, I walked away feeling very convinced that there is more to be known, for sure."}, {"time": 2404, "text": "And a lot of my deep things that were traumatic for me didn't feel traumatic anymore, specifically crisis of faith."}, {"time": 2414, "text": "I was very angry at my parents and my community for raising me in what I perceived to be falsehoods."}, {"time": 2425, "text": "And that, I felt like the bedrock of everything I believed was ripped out for me in my 20s."}, {"time": 2432, "text": "And then it was like, good luck in life."}, {"time": 2435, "text": "But really my parents had given me everything that they could."}, {"time": 2438, "text": "And they believed that very much so, still."}, {"time": 2441, "text": "But a naive young me was angry and felt like they had been duped and thus I had been duped."}, {"time": 2449, "text": "But Ayahuasca really showed me this roadmap of like, this is truth and you're concerning yourself about a grain of sand, which is Mormonism or whatever it is."}, {"time": 2459, "text": "And there may be some truths in that tiny grain of sand and there may be falsities."}, {"time": 2464, "text": "But so is all these other grains of sand, like focus on the truth."}, {"time": 2467, "text": "Stop focusing on these little details that are meaningless and forgive and let go of people believing in those things to begin with."}, {"time": 2475, "text": "I don't know if that makes sense, but that was like the core thing I was taught and to let go of control, stop needing to control everything."}, {"time": 2484, "text": "And it felt like the wisdom was coming from elsewhere."}, {"time": 2486, "text": "Like it's really, I do not believe, at least in my current self, I don't have that, the mindfulness that I believe that exists in me to reach a lot of the conclusions that I did."}, {"time": 2499, "text": "And there was a lot more to it that would be for like a late night conversation with you."}, {"time": 2503, "text": "But it's so hard to put it into, you feel like a crazy person."}, {"time": 2508, "text": "Any, at least anytime I talk about ayahuasca to someone who hasn't done it, I'm like, I don't even know where to begin."}, {"time": 2513, "text": "Like, how do you explain to someone that you felt like that a multiple dimension type thing happened in a way that like putting it into words is, and none of it was words, by the way, that was communicated to me."}, {"time": 2525, "text": "It was like, you know how people talk about telepathy."}, {"time": 2529, "text": "And if it existed, it would be like, I could communicate to you in such a deeper way."}, {"time": 2534, "text": "I'm so confined by me having to articulate these words and put them in a sentence to you, Lex, and then tell you like, if only I could just be like, and emotions do that sometimes, right?"}, {"time": 2544, "text": "You could see my emotions and be like, oh, that communicates a lot."}, {"time": 2548, "text": "So that's what it felt like to me with ayahuasca is it felt like it was communicating to me very clear things, but it wasn't like, Daniel, it's me, Mother Earth."}, {"time": 2558, "text": "Let me relax, sit back, let me show you."}, {"time": 2561, "text": "But it was very clear to me what was being said."}, {"time": 2564, "text": "And no, it did not feel like me, but maybe smarter people than me who've done it would say, well, it was you and blah, blah, blah."}, {"time": 2571, "text": "I don't know, but it was very convincing."}, {"time": 2573, "text": "There's a lot of stuff in that subconscious that we haven't explored."}, {"time": 2579, "text": "Like we haven't explored the depths of the ocean."}, {"time": 2581, "text": "We haven't really figured out what's that, the younging shadow, what's going on underneath the surface of our conscious mind."}, {"time": 2588, "text": "And what is that connecting to?"}, {"time": 2590, "text": "Is that just inside our mind or is it some kind of, is there some kind of collective intelligence going on where all humans are connected to one kind of greater organism?"}, {"time": 2600, "text": "Like what is consciousness?"}, {"time": 2602, "text": "We have a lot of hubris in thinking we understand any of it, like how the mind works at all."}, {"time": 2608, "text": "Like what is it, like where, what is the origin of consciousness?"}, {"time": 2614, "text": "What is the origin of intelligence?"}, {"time": 2617, "text": "There's a lot of hubris about this."}, {"time": 2619, "text": "We give each other PhDs and Nobel prizes and congratulate ourselves as if we figured it all out."}, {"time": 2626, "text": "But humility is helpful here."}, {"time": 2628, "text": "Nevertheless, that is the question that humans have been asking for ever since humans were humans, which is the question of mortality, the question of God."}, {"time": 2642, "text": "So whether it's Hamlet to be or not to be, I think that's the hardest, the most important question."}, {"time": 2648, "text": "Albert Camus asked, why live?"}, {"time": 2657, "text": "So in terms of crisis of faith, in terms of your search for truth, in terms of some of the dark places you've gone in your mind, what's a good answer to this question?"}, {"time": 2667, "text": "So for Camus with Mithos Sisyphus, it was the question of suicide."}, {"time": 2673, "text": "Is, what's the purpose?"}, {"time": 2676, "text": "Like, what's a good answer to why keep going, especially when you're struggling, especially when you're not, when you're feeling hopeless, when you're feeling like a burden in this search for truth, where you feel like you're surrounded by lies, what's a good answer to why live?"}, {"time": 2700, "text": "You ever found one?"}, {"time": 2702, "text": "Well, the simple answer right now is to say for, it's very easy once you have kids to say, the right answer is you just, of course you brought these kids into the world, so you have a responsibility that I feel deeply as a father to them to always be there for as long as I humanly can and to take care of them and protect them."}, {"time": 2723, "text": "It's the most innate sense in me, just, it's wired in my animal existence."}, {"time": 2731, "text": "So if I take that away, right, because that's kind of cheating."}, {"time": 2735, "text": "Let's put that aside because it is cheating."}, {"time": 2737, "text": "It's cheating."}, {"time": 2738, "text": "There's still some fundamental way in which you're alone."}, {"time": 2742, "text": "And to that, that actually has been a real struggle for me for many years."}, {"time": 2749, "text": "I had a real turning point early in my career where we were flying somewhere overseas and we were in a really small plane and the lights went out and like all these red lights were flashing and the plane just started to dive."}, {"time": 2768, "text": "Completely like scariest plane experience I've ever been in."}, {"time": 2773, "text": "My manager was next to me, who's my brother."}, {"time": 2776, "text": "He was crying and texting his wife a goodbye."}, {"time": 2780, "text": "That's how like crazy this moment was."}, {"time": 2783, "text": "Was it real like genuine?"}, {"time": 2784, "text": "Like genuine engine went out, plane is going down, pilots looking like crazy in the front and it was a really tiny jet."}, {"time": 2796, "text": "And like I said, my brother next to me crying, typing a text to his wife."}, {"time": 2800, "text": "Really, really scary."}, {"time": 2802, "text": "And I felt nothing."}, {"time": 2805, "text": "I genuinely sat there and I was like, this might actually be nice."}, {"time": 2812, "text": "Like I really felt like this goes down and like, ah man, life sucks and it's hard."}, {"time": 2820, "text": "And that sounds so ridiculous I know to say because again, I'm in a different place now and I see my life for what it is."}, {"time": 2827, "text": "But at that moment I did not."}, {"time": 2829, "text": "So life was primarily defined by suffering, it was a burden."}, {"time": 2832, "text": "It was, I felt I was incredibly depressed."}, {"time": 2836, "text": "I had been trying different medications since I was young and I just had not found anything that was working for me."}, {"time": 2844, "text": "And then I was in a faith crisis, lost all my faith, started a band that's just became, I wasn't ever thinking that this band."}, {"time": 2853, "text": "I was like, when you call your band Imagine Dragons, you're not thinking that band's gonna be big, okay?"}, {"time": 2858, "text": "It was like, I was like, this was like a side project that was fun for me."}, {"time": 2863, "text": "It was like art in college."}, {"time": 2865, "text": "I was in school and I was like, man, I hate this biology class."}, {"time": 2869, "text": "I'm gonna write down band names."}, {"time": 2870, "text": "Like, you know what I mean?"}, {"time": 2871, "text": "Like it was not, hey, put everything aside, this is my career, let's go."}, {"time": 2876, "text": "Like it just, it happened."}, {"time": 2880, "text": "And I'm an introvert by nature."}, {"time": 2883, "text": "I'm really not an extroverted person who likes to go out and like, I like to be at home with a couple of friends and have a late night conversation over good food."}, {"time": 2892, "text": "Like that to me is a perfect night."}, {"time": 2894, "text": "Read a good book, listen to a podcast, go on a walk."}, {"time": 2897, "text": "You know, those are things that I really, really enjoy."}, {"time": 2901, "text": "And suddenly I'm in this life where I'm like supposed to be something that I really don't wanna be."}, {"time": 2906, "text": "Except for on stage, which is a really fast, like strange thing to me, which is on stage, I feel so free and exuberant and like an extrovert."}, {"time": 2915, "text": "And then I come off and I just feel like shrivel back into a shell."}, {"time": 2918, "text": "Like it's, music does that for me and performing on a stage does that for me."}, {"time": 2923, "text": "Can we take a small tangent on that?"}, {"time": 2925, "text": "What's the high, can we go through that the introvert that wants to cuddle up and read a book?"}, {"time": 2932, "text": "You're the front man of one of the, if not the biggest rock bands today, playing in front of huge crowds."}, {"time": 2942, "text": "What's the high of that and how can you land back on Earth?"}, {"time": 2950, "text": "The high of it, it's incredibly beautiful to walk on a stage, sing these songs that you wrote and see it resonate with people around you and sing with them."}, {"time": 2967, "text": "Different cultures, different places, celebrate life."}, {"time": 2970, "text": "It's suddenly the world seems like a fantastic place."}, {"time": 2974, "text": "It feels like we're all on the same team."}, {"time": 2977, "text": "It's like one big hug."}, {"time": 2978, "text": "Yeah, it's like everybody in that room gets it and they all, like it just, it feels like what you want the world to be, which is just like this coexisting unit of people and it's not even about like, it's incredible, for sure, it's incredible and I love it and I wouldn't do it unless I loved it."}, {"time": 2999, "text": "And then you walk off stage and you turn on the news and it's like, you see, we're all against each other, everybody hates each other and it feels that way in the world."}, {"time": 3007, "text": "So music really, that's why live music is so important to people, that's why music is so important to people."}, {"time": 3013, "text": "Because even if it's just you and that person that wrote the song, you're listening to it and the two of you feel connected."}, {"time": 3019, "text": "You know, it's like you're hearing Tracy Chapman sing like Fast Car or something, you're just like, oh my gosh, like yes, I get it."}, {"time": 3027, "text": "And you feel connected to that person, you don't feel alone."}, {"time": 3031, "text": "So that's the high of it, for sure."}, {"time": 3033, "text": "And then you get off stage and then, you know, as my, like my uncle is a heart surgeon, incredible heart surgeon who like writes the book."}, {"time": 3042, "text": "Like he's like the guy that the heart surgeons talk to, he's out of Nashville, Tennessee, he's just an incredible genius man."}, {"time": 3048, "text": "He always worries and always reached out to me."}, {"time": 3053, "text": "He's like, musicians die all the time and the reason they die, you know, is because you're getting on stage and your heart's doing this and your cortisol levels are doing this, you're getting off stage and then you're just doing this."}, {"time": 3063, "text": "And it's a really real thing."}, {"time": 3065, "text": "Like you get off stage and you feel like you need drugs because you're like, the world feels like, oh, incredibly daunting."}, {"time": 3072, "text": "And it's also, I'm sure, has to do with like some like health things in your heart and the cortisol levels that are so crazy and then you come off and it's like, I know people are like, well, then nothing's enough, except meth, you know what I mean, right?"}, {"time": 3087, "text": "Nothing's enough except heroin."}, {"time": 3088, "text": "And that's why a lot of artists turn to that stuff."}, {"time": 3090, "text": "And I don't say it in a preachy way, like I've struggled with drug abuse in my life."}, {"time": 3096, "text": "And I really, I understand why artists turn to it."}, {"time": 3103, "text": "But also the fact that you're an introvert."}, {"time": 3106, "text": "So the other side of it, the fame."}, {"time": 3110, "text": "That's something that you also said is a double edged sword for you."}, {"time": 3113, "text": "The interesting thing about fame, is that you also mentioned, is it something you can't take back?"}, {"time": 3120, "text": "It's the thing, you can't just like go on vacation in Hawaii and it's like, consider, do I like it or not?"}, {"time": 3126, "text": "No, you're staying in Hawaii for the rest of your life and you've never been there before, whether you like it or not."}, {"time": 3132, "text": "So what's that like being loved by millions and millions and millions of people, which is perhaps the best kind of fame in terms of if you have to choose the kinds of fame that there are."}, {"time": 3149, "text": "And still being an introvert and all that kind of stuff."}, {"time": 3152, "text": "So what, do you feel alone?"}, {"time": 3157, "text": "More alone being famous?"}, {"time": 3160, "text": "Is there a loneliness to it?"}, {"time": 3161, "text": "Yeah, I mean, it's such a funny thing."}, {"time": 3164, "text": "Okay, if you had asked, if we were having this conversation a couple of years ago, I'd be incredibly guarded about this because the last thing I wanna ever do is sound ungrateful or unaware of how much I have and woe is the famous celebrity with money."}, {"time": 3182, "text": "Oh, is your life hard?"}, {"time": 3183, "text": "Is it really telling me about how hard it is?"}, {"time": 3185, "text": "But I'm also at a place in life now where I just like, I'm gonna always just speak my truth because that's the only reason I'm here is I'm here to speak my truth to you."}, {"time": 3191, "text": "So I'm gonna tell you my truth, whether it's whatever it is."}, {"time": 3194, "text": "But you're human and feelings are real."}, {"time": 3197, "text": "And so, and that's the interesting thing."}, {"time": 3200, "text": "You win a lottery, what's that gonna feel like?"}, {"time": 3202, "text": "It's not about complaining, oh, it's so hard to win a lottery because you get a lot of money."}, {"time": 3205, "text": "No, it's still, you're human."}, {"time": 3207, "text": "You get to experience these feelings and it's fascinating."}, {"time": 3210, "text": "You put humans in different situations."}, {"time": 3213, "text": "And it's also fascinating because a lot of people think, well, I would like to be famous."}, {"time": 3218, "text": "That's a big thing now on social media and Instagram and so on."}, {"time": 3221, "text": "The whole world wants to be famous."}, {"time": 3222, "text": "Or rich or famous."}, {"time": 3223, "text": "And then it's very interesting to think, all right, well, once you arrive, are all the problems solved?"}, {"time": 3230, "text": "So I will tell you, according to me, what the pitfalls are, whether it's true or not."}, {"time": 3234, "text": "And there are certainly some pitfalls."}, {"time": 3236, "text": "One, it's once you're there, you can't go back."}, {"time": 3240, "text": "Whatever, maybe that's fine."}, {"time": 3241, "text": "Cause maybe you love it."}, {"time": 3242, "text": "But the real pitfall for me is that you're now you're Lex and you're what everybody's perception is that Lex is."}, {"time": 3253, "text": "And that's what you are."}, {"time": 3255, "text": "Now Lex is probably a lot more complex and complicated and has a lot more to Lex than the Lex that is the celebrity."}, {"time": 3264, "text": "So, but anybody who meets you, that's who you are to them."}, {"time": 3272, "text": "And you may, you may not feel this way, but you may feel confined to actually have to be that person to that person."}, {"time": 3279, "text": "Like I've early in my career for a long time, anytime I met someone, I suddenly felt like I had to be Dan Reynolds from Imagine Dragons."}, {"time": 3286, "text": "Anytime I met someone, including my family now, who are also like, whoa, this is crazy."}, {"time": 3290, "text": "You're like Dan Reynolds from Imagine Dragons."}, {"time": 3292, "text": "And I wanted to just be the goofball that I have been my whole life with my brothers and family."}, {"time": 3298, "text": "But suddenly I found myself feeling like, no, I have to be this."}, {"time": 3302, "text": "Like, cause that's who, that's who this is."}, {"time": 3305, "text": "So you're almost like playing a role."}, {"time": 3306, "text": "And it's like, I've heard a lot of actors talk about this where they'll take on a role and then it's like, they feel like they have to, they like become that."}, {"time": 3312, "text": "And it's a really scary thing."}, {"time": 3314, "text": "Like you alter who you are almost to fit the notion of other people."}, {"time": 3319, "text": "Cause especially if a lot of artists are empaths, it, you know, a lot of people get into art in a deep way are empaths."}, {"time": 3327, "text": "And so you feel a lot of what people are feeling and you're never wanting to burden people."}, {"time": 3333, "text": "And you're always wanting to deliver to that person, you know, what they want is like people pleasing is very, goes hand in hand with a lot of like these famous people."}, {"time": 3342, "text": "And they get to where they were because they know how to do that."}, {"time": 3345, "text": "They know how to be in a room with someone and look them in the eye and make them feel like they're the only person in the room."}, {"time": 3351, "text": "And then now they got that role in that movie because they sat with the casting director and they were like, oh, you're so funny."}, {"time": 3357, "text": "Oh, has anybody told, like put on the charisma, do it all."}, {"time": 3360, "text": "And it's like, anyway, I'm like, I'm going on a different tangent here, but long story short, there's a lot of things that are really unhealthy about it."}, {"time": 3368, "text": "And then a lot of people who want the fame, then the second it starts to go away, then they're like, who am I anymore?"}, {"time": 3374, "text": "Like that was everything."}, {"time": 3376, "text": "And now I'm like on the down and now I'm not a famous person anymore."}, {"time": 3379, "text": "And now I hate myself and I'm going to do drugs."}, {"time": 3381, "text": "And it's like, it's like this vicious cycle, like you could never be famous enough."}, {"time": 3385, "text": "You're always going to get like, there's just so much to it that I've just, and again, like I've lost friends in this career to do that for sure."}, {"time": 3396, "text": "And there's a certain element to sort of just on the losing fame of interacting with a lot of folks, especially young folks like on YouTube."}, {"time": 3406, "text": "So fame is a thing that has levels."}, {"time": 3411, "text": "You're always trying to be a little more famous."}, {"time": 3412, "text": "A lot of folks who are chasing fame, it doesn't matter how famous you are, you're always trying to chase more."}, {"time": 3416, "text": "And when you start to lose it, interesting things can happen if you're not self aware, which is like, like you mentioned, you might be trying to grasp back at where you were by leaning into the formula that got you there."}, {"time": 3431, "text": "And so the constraints of the image that you mentioned becomes the thing that you're now trying to lean into."}, {"time": 3439, "text": "And that's actually walking away from who you really are."}, {"time": 3442, "text": "Like you lean further into being that person."}, {"time": 3445, "text": "That's true for acting."}, {"time": 3446, "text": "That's true for even on like YouTube, which is people acting, they have a role."}, {"time": 3452, "text": "They got them to the table somehow."}, {"time": 3454, "text": "Yeah, it's dark, but I think those are, that's just put for everybody to see, but that's a very human struggle even when you're not famous."}, {"time": 3467, "text": "Finding yourself, being yourself, of not letting, not doing the people pleasing at any scale and being trapped by that."}, {"time": 3476, "text": "Yeah, and also feeling like it's never enough."}, {"time": 3478, "text": "I think that's something all, like it's not just a famous thing, but it's like in the whole, like everybody deals with feeling like when I'm here, I'll be happy."}, {"time": 3488, "text": "When I get that job, I'll be happy."}, {"time": 3490, "text": "When I have that money, then I'll be happy."}, {"time": 3492, "text": "When I get that surgery and my nose looks like this, I will be happy then."}, {"time": 3497, "text": "It's like a constant chase of happiness instead of happiness."}, {"time": 3505, "text": "It's like the opposite, it's opposite of self love."}, {"time": 3507, "text": "It's the opposite of happiness."}, {"time": 3510, "text": "There's no presence to it."}, {"time": 3511, "text": "You're constant, you're never going to find it."}, {"time": 3514, "text": "You're never gonna arrive and you're just gonna live your life and then you're gonna be on your death bed and be like, I was chasing the wrong thing my whole life."}, {"time": 3523, "text": "I should say that podcasts are interesting in that way."}, {"time": 3526, "text": "So for me personally, because you just talk a lot, you can't, people that meet you, they know you and they know the evolution of you."}, {"time": 3534, "text": "And that's the same thing for like you right now, Dan of Imagine Dragons, just being on a podcast like long form reveals a side that liberates you more to be yourself, to like, people see, oh, there's a human."}, {"time": 3552, "text": "They, cause they, music, they have a deep connection with you, they have experiences with you the way they experienced it and that's who you are with them through the songs."}, {"time": 3562, "text": "But now you get to see, oh, that's a human being."}, {"time": 3566, "text": "He probably gets angry, he gets sad, he's excited, he's hopeful and there's a core, there's a good human being with the whole roller coaster of emotions all there."}, {"time": 3576, "text": "It's a giant, beautiful mess."}, {"time": 3577, "text": "And podcasts reveal that, that's why I love podcasts like long form, you get to hear some artists and actors and so on and some of them you get to see, oh, you've lost yourself in the surface."}, {"time": 3593, "text": "That's a tragedy with some actors, some great actors."}, {"time": 3597, "text": "They've left so much of themselves in the roles they've played that they can no longer be the thing they were before, those great roles."}, {"time": 3608, "text": "That's for sure, it's hard, it's hard to see."}, {"time": 3611, "text": "So you get to see that with Johnny Depp with, I don't know, Pirates, he was talking about that with Pirates of the Caribbean, that was a shift."}, {"time": 3618, "text": "Like he's not that guy, he's forever, forever that guy."}, {"time": 3625, "text": "But the point is to remember that you're not into your family, which is interesting you said with your family, when I see people close to me, they also, there is an element like that while you're that, they start treating you like the famous person."}, {"time": 3638, "text": "Yeah, I'm fortunate to have my manager who's my brother, my older brother, and my lawyer is my other older brother."}, {"time": 3648, "text": "And that's been helpful because it's weird, it gets weird with everyone no matter what."}, {"time": 3655, "text": "One of the best advice I was given was by Charlie Sheen."}, {"time": 3659, "text": "You got advice from Charlie Sheen."}, {"time": 3660, "text": "Yeah, we were playing."}, {"time": 3662, "text": "The wise sage of our generation."}, {"time": 3664, "text": "Wise sage Charlie Sheen, but it was, it was really wise."}, {"time": 3667, "text": "I was sitting next to him and we were playing some late night television and he said, this was right at the beginning, and he just said, boys, just mark my words, your life is about to get really weird, that's all he said."}, {"time": 3681, "text": "But it stuck with me forever and it's Charlie Sheen, so of course it sticks with you."}, {"time": 3685, "text": "And I remember being like, right, okay, Charlie Sheen, I'm not Charlie Sheen, it's not gonna get weird, like, you know."}, {"time": 3689, "text": "But it got really, really weird, really quick, because suddenly you've existed your whole life in this way where everybody just, everything you get, you achieved, it was because you got it."}, {"time": 3704, "text": "And every conversation you had, like, if someone liked you at the end of that conversation, well, it's because they liked you."}, {"time": 3711, "text": "If they didn't like you, it's because they didn't like you."}, {"time": 3713, "text": "And you can make complete peace with that."}, {"time": 3715, "text": "At least I could my whole life."}, {"time": 3716, "text": "I was like, life is a challenge."}, {"time": 3718, "text": "And be myself and I'm gonna go through it and find some people along the way that I connect with and others, no."}, {"time": 3725, "text": "And that social integrity is so important to us."}, {"time": 3731, "text": "And we think it would be nice to have this, and this is going back to the pitfalls of fame."}, {"time": 3736, "text": "We think it would be nice to walk into a room and have everyone be like, and you could be like, dumpster fire."}, {"time": 3744, "text": "And everybody's like, oh my gosh, dumpster fire, that was amazing."}, {"time": 3748, "text": "Well, you said dumpster fire was amazing."}, {"time": 3750, "text": "It's like, it's incredibly, incredibly lonely."}, {"time": 3754, "text": "And it just breaks everything that you knew about humanness."}, {"time": 3759, "text": "And it sucks."}, {"time": 3759, "text": "So then you're seeking out people who, that it doesn't exist with."}, {"time": 3764, "text": "And family is the closest you can get to that for sure."}, {"time": 3766, "text": "But even your family, it's gonna take a little bit where they're like, oh, this is a little weird."}, {"time": 3769, "text": "Like all my friends at work are now asking about you and you're my young, stupid brother."}, {"time": 3773, "text": "But now you're suddenly like the young, stupid brother that they want an autograph from and stuff."}, {"time": 3776, "text": "And it still makes, like they have to get over that and figure that out."}, {"time": 3783, "text": "And then you meet people too who know about this whole concept and they're like, well, I'm gonna be an asshole to him to show him that I don't subscribe."}, {"time": 3791, "text": "And you're dealing with like people who are like, dumpster fire, the person who's like, you could say something actually profound and nice and they'd be like, that's stupid and you're an idiot."}, {"time": 3802, "text": "Cause it's like an actual attempt to like show you how much they don't care."}, {"time": 3807, "text": "So you live in this very, like this."}, {"time": 3809, "text": "Still, nevertheless, even when nobody knew you, you were seeking for deep human connection with a small number of people."}, {"time": 3817, "text": "And now when a lot of people know you, you're still looking for deep connection with a small number of people."}, {"time": 3823, "text": "The struggle is the same."}, {"time": 3826, "text": "Can you speak to, cause you mentioned some of the dark moments."}, {"time": 3829, "text": "What advice would you give to people who are struggling with depression?"}, {"time": 3833, "text": "And maybe for the people who love the people who are struggling with depression."}, {"time": 3840, "text": "So what I have found to be most successful for me, it's back to the basics of everything that the therapist or psychologist will tell you, psychiatrist will tell you right when you meet them, which is exercise every day, eat healthy for sure, find time, make time every day to do something that you love, whatever that may be, whatever brings you joy."}, {"time": 3870, "text": "And when you're really depressed, that actually feels like nothing."}, {"time": 3874, "text": "Cause the things that brought you joy, don't bring you joy anymore."}, {"time": 3877, "text": "When I'm really in the thick of it."}, {"time": 3879, "text": "But for me, like this is the cycle that I'll go through is I'll look at my life and I'll say, okay, what can I clean up?"}, {"time": 3888, "text": "All right, well, for me it was cutting out alcohol actually helped me a lot."}, {"time": 3895, "text": "I know that sounds like a big, I'm not judging anybody for that."}, {"time": 3899, "text": "And I still drink on occasion, but I felt like alcohol has been very unhelpful to my mental state."}, {"time": 3906, "text": "Feel less drive and less happiness the next day for things that I wanna do."}, {"time": 3910, "text": "I feel like it plays a lot with your serotonin."}, {"time": 3912, "text": "So look for stuff to change."}, {"time": 3914, "text": "Clean living, yeah, clean living, but also understanding that sometimes it just is, and you just keep breathing and it will get better with time."}, {"time": 3927, "text": "Like I really think that in the winter, I'm pretty sure, I mean, I've had a lot of, I've seen a lot of therapists and all of them say the same thing, which is like, you have major depressive disorder and this is what it is, but it's certainly worse for me in the winter months."}, {"time": 3941, "text": "So I know there's like, I can't think of the term for it, but there's a term for like seasonal depression."}, {"time": 3949, "text": "So I'll get to the winter and suddenly I'm like, geez, everything really sucks on a deeper level."}, {"time": 3955, "text": "And then, so it's like this too shall pass is another thing."}, {"time": 3958, "text": "It's like, just practice those things."}, {"time": 3961, "text": "Absolutely see a therapist."}, {"time": 3962, "text": "That's my biggest, like my biggest emphasis of life is to like on stage, like my goal, like I have a few things that I really, really care about."}, {"time": 3969, "text": "One is mental health and destigmatizing therapy."}, {"time": 3973, "text": "Cause for me, I didn't go to therapy for a long time because I felt that it would be admitting that I was broken."}, {"time": 3978, "text": "It'd be admitting that I was weaker than Lex who doesn't have to go to a therapist because Lex is stronger."}, {"time": 3985, "text": "So be strong like Lex."}, {"time": 3987, "text": "I would like look at all my older brothers and I looked up to them so much and they're all these incredibly successful people, plastic surgeon, an anesthesiologist, a dentist, two attorneys, Stanford, NYU, like just like incredible high standards, Eagle Scouts, you know, like they valedictorians, like they just did it all."}, {"time": 4007, "text": "So for me, I was very, really did not want to admit and none of them went to therapy."}, {"time": 4015, "text": "So it was like, what are you going to be?"}, {"time": 4016, "text": "Are you, oh, you're broken."}, {"time": 4018, "text": "Are you like the weak one who can't hack life?"}, {"time": 4021, "text": "And I think that's incredibly dangerous."}, {"time": 4023, "text": "And I feel like it almost cost me my life because I took so long to finally go to therapy."}, {"time": 4028, "text": "So I really want kids to know, hey, like the great people that achieve great things that are doing amazing things, they probably have help, almost all of them."}, {"time": 4038, "text": "It's like going to the gym, but it's a mental gym."}, {"time": 4041, "text": "What, so I, unfortunately, I wanted to be a psychiatrist when I was growing up."}, {"time": 4047, "text": "Maybe that's why I like podcasts."}, {"time": 4049, "text": "Maybe that's."}, {"time": 4049, "text": "I think you'd be a good one."}, {"time": 4050, "text": "Maybe, I would."}, {"time": 4052, "text": "I think you are a psychiatrist, pretty much, right?"}, {"time": 4055, "text": "Sounds like you're a psychiatrist."}, {"time": 4056, "text": "I think I need more."}, {"time": 4057, "text": "I think actually, to be a good psychiatrist, you also need to be seeking therapy from the, like you also need to be, have some stuff to work through in your mind."}, {"time": 4070, "text": "I think, yeah, you have to have gone to some dark places."}, {"time": 4076, "text": "The empathize."}, {"time": 4077, "text": "The empathy."}, {"time": 4078, "text": "It's the ability to empathize, and especially if you've directly experienced it, you can go to those places in your mind."}, {"time": 4084, "text": "Like you said, it's with the music, to be authentic, you have to really go there."}, {"time": 4088, "text": "What, why did therapy help so much?"}, {"time": 4092, "text": "What is the process of therapy, if you can just educate a little more?"}, {"time": 4096, "text": "Is it, are you basically bringing to the surface and talking through things that you, because of the momentum of life, you just never allow yourself to speak through, to think through?"}, {"time": 4112, "text": "Is that what therapy is?"}, {"time": 4113, "text": "Or is there some more systematic thing?"}, {"time": 4116, "text": "So I've been to a lot of strange, different kinds of therapy."}, {"time": 4119, "text": "So I'll tell you my first therapist."}, {"time": 4121, "text": "If I could sort of interrupt, how hard is it to find a therapist that connected with you?"}, {"time": 4127, "text": "It is, it's actually pretty hard, I think."}, {"time": 4130, "text": "I think, I think it for, well, actually I have a skewed view of that, because going back to the beginning of my therapy was with a Mormon therapist."}, {"time": 4141, "text": "So it was very much like, well, are you reading your book of Mormon?"}, {"time": 4145, "text": "And are you praying at night?"}, {"time": 4148, "text": "Like, that was a big focus of my therapy to begin with."}, {"time": 4150, "text": "And you're having a faith crisis in the distance somewhere."}, {"time": 4153, "text": "Yes, I was like, well, and then."}, {"time": 4157, "text": "You're making it worse."}, {"time": 4158, "text": "Yes, the next therapist I went to was a Scientology therapist."}, {"time": 4165, "text": "I met my wife and she was Scientologist at the time, and she's not anymore."}, {"time": 4169, "text": "She's like, it's such a funny thing to look back on, because we met, and I was like this Mormon missionary who had just got home from his mission, and I met her, and she's a Scientologist."}, {"time": 4180, "text": "I was like, wow, that's batshit crazy."}, {"time": 4181, "text": "Like, that stuff's crazy."}, {"time": 4183, "text": "And she's like, what are you talking about?"}, {"time": 4184, "text": "That's your crazy, you're a Mormon."}, {"time": 4187, "text": "That's batshit crazy."}, {"time": 4188, "text": "And the two of us were like, huh, maybe there's something to this, to both of us here."}, {"time": 4194, "text": "Yeah, the tension actually forces you to think through, oh, well, what is true?"}, {"time": 4198, "text": "Yeah, and we really fell in love through that, which was like, maybe we're both on the wrong track."}, {"time": 4205, "text": "Let's figure this out."}, {"time": 4206, "text": "But before that happened, we went to a Scientologist therapist, who that therapy consisted of, what have you done wrong to Asia?"}, {"time": 4217, "text": "And they would ask me that question over and over and over and over, until I'm like thinking of the deepest, darkest things that were in the recesses of my mind."}, {"time": 4225, "text": "This was marriage therapy."}, {"time": 4228, "text": "Anyway, I'm not gonna get into that, but it was Scientology therapy."}, {"time": 4232, "text": "So that was a different thing."}, {"time": 4233, "text": "And then I went to therapy therapy, like no, not attached to any religion."}, {"time": 4239, "text": "And that was a really great experience for me."}, {"time": 4240, "text": "And since then I've been through a couple of different therapists, but that was more because where I was and moving and things like that."}, {"time": 4247, "text": "So is it that hard to find a great therapist?"}, {"time": 4250, "text": "Probably not, but maybe don't go to your Mormon therapist versus that Scientology therapist."}, {"time": 4255, "text": "Or maybe that's the route for you."}, {"time": 4257, "text": "Maybe it's the route for you, I don't know."}, {"time": 4259, "text": "Yeah, but what is, so is it bringing stuff to the surface, basically?"}, {"time": 4262, "text": "Oh yeah, sorry, I didn't even answer your question."}, {"time": 4264, "text": "What's the effect, why is it so effective?"}, {"time": 4266, "text": "Just, is there something you could put words to?"}, {"time": 4270, "text": "Yeah, I mean, I think it's, obviously, there's the common things you would think of, which is like, oh, I've been holding these things in that I don't wanna tell anybody, and then I tell this person, and oh, there's relief in that."}, {"time": 4279, "text": "But that's really not where the real work comes from."}, {"time": 4281, "text": "I think the real work is meeting with someone who is well versed and educated and understands."}, {"time": 4289, "text": "It's like coding."}, {"time": 4316, "text": "You put in work, and you have hard conversations and do difficult things, and if, so if your therapy's not difficult, I actually think that's not good therapy."}, {"time": 4325, "text": "Good therapy is, it's gonna be a little difficult, it's work, like."}, {"time": 4330, "text": "During and after."}, {"time": 4331, "text": "Yes, like I had this incredible therapist who was, I told him when I was gonna do ayahuasca, he was like, geez, you know, he had actually was a doctor before and a really well educated studied person who had walked away from brain doctor, what's the word for that, brain doctor?"}, {"time": 4348, "text": "Brain surgeon?"}, {"time": 4348, "text": "Neurologist."}, {"time": 4349, "text": "Oh yeah, neurologist, yep."}, {"time": 4350, "text": "And he said, well basically his belief was that ayahuasca was like basically doing therapy like 50 sessions."}, {"time": 4359, "text": "He was like, it's like really intensive."}, {"time": 4362, "text": "He was like, I don't know if you wanna do that, if you do, you can make some big steps forward, but I prefer just to do one session at a time."}, {"time": 4371, "text": "And so yeah, it's hard work."}, {"time": 4373, "text": "And that, I typically like, it's really hard for me to even talk about ayahuasca by the way, going back to that, because I'm not looking to tell everybody to go do ayahuasca."}, {"time": 4381, "text": "It's incredibly hard."}, {"time": 4383, "text": "It was the scariest experience of my entire life."}, {"time": 4387, "text": "It felt like I went to heaven, but it also felt like I went to the darkest, deepest hell that was incredibly scary, incredibly scary, yeah."}, {"time": 4396, "text": "So you told the story of how you wrote the song Believer or like your childhood friend, I guess, Donald, like bullying and that kind of stuff."}, {"time": 4411, "text": "This song, I mean, a lot of your songs are super interesting sort of in terms of percussion, super interesting, super interesting lyrically, just how it flows and also pain is at the center of it."}, {"time": 4425, "text": "I mean, a lot of, like you said, the crisis of faith, some of these existential questions are basically behind a lot of your songs, funny enough."}, {"time": 4435, "text": "Maybe they're covered in metaphor, so it's hard to see, but it's there."}, {"time": 4441, "text": "And this song is really interesting in that way that it puts pain, you made me a believer."}, {"time": 4450, "text": "You break me down, you build me up, Believer."}, {"time": 4458, "text": "Maybe can you tell the story of how the song came to be?"}, {"time": 4462, "text": "I'd love to listen to it too."}, {"time": 4463, "text": "I have some questions musically about it too."}, {"time": 4465, "text": "Yeah, yeah, I mean, it's exactly what we're talking about with therapy."}, {"time": 4470, "text": "I just feel like the greatest things in my life have come from the deepest hurt, like losing someone, that you love is maybe the hardest part of the human path for me, at least thus far."}, {"time": 4491, "text": "When I think of, okay, what was the hardest thing?"}, {"time": 4492, "text": "There's like, you think of physical pain or maybe like going through financial pain or whatever."}, {"time": 4498, "text": "I think losing someone that you really love to death is one of the hardest, for me, I would say it was the hardest."}, {"time": 4508, "text": "But it also makes you look at your life completely differently and alter your life, at least for me in ways that were really healthy."}, {"time": 4516, "text": "Being more present, letting go of things that were meaningless, trying to control what other people think about you, like wasting your time on things like that."}, {"time": 4525, "text": "And you suddenly see like, wow, like time, I got small amount of time, like how do I wanna spend it?"}, {"time": 4531, "text": "I'm gonna spend it in the best way I know how and that's it."}, {"time": 4534, "text": "So, yeah, I mean, it's a basic concept that's been said a million times over in a million different ways."}, {"time": 4539, "text": "But that's pretty much what I was trying to say with Believer which is like, I've lost faith in everything at that time period or previous to that time period."}, {"time": 4551, "text": "And then I was rebuilding my faith or my spiritual thought process."}, {"time": 4557, "text": "And it was after ayahuasca and it was like, finding, being a Believer and that's not necessarily like a Believer in God or a Believer in heaven and hell or anything like that, but a Believer in more."}, {"time": 4572, "text": "Believing in goodness, believing in that there is some light like, and again, those words like, they're just words and I wish there were better words to formulate the thought that I'm trying to express, but just more, like the thought of me dying, for me, I don't fear it, I don't fear it, but actually I really fear not seeing my kids again."}, {"time": 4602, "text": "I'll say that, that is fearful for me."}, {"time": 4604, "text": "I feel like I love so deeply these children that the thought of like leaving them for me is a scary thought or something."}, {"time": 4615, "text": "They're kind of good reminder how much you love life actually."}, {"time": 4620, "text": "And you don't always remember that."}, {"time": 4624, "text": "Yeah, and I think having kids is not for everyone for absolutely for sure, but for me, and especially you shouldn't be having kids to give yourself a reason to live."}, {"time": 4634, "text": "I feel like dying, I'm gonna have a kid."}, {"time": 4636, "text": "You might feel more like dying after having a kid actually."}, {"time": 4640, "text": "It's pretty stressful, but it is a place to like, I've changed a lot of people that I've known that it gave them a new intensity of gratitude for life, for sure."}, {"time": 4652, "text": "Guy, do you mind if we, I'll return to the pain and the belief, do you mind if we listen to a little bit of songs?"}, {"time": 4664, "text": "Do you write the music first or the words first?"}, {"time": 4667, "text": "Uh, the same time, which is very typical for me."}, {"time": 4671, "text": "By just the way it opens, intensity of openings."}, {"time": 4676, "text": "You ever think about what the first few seconds sound like?"}, {"time": 4680, "text": "Is that something that, like when you imagine a song, is it the opening you imagine?"}, {"time": 4686, "text": "No, it's kind of a, I never think opening, I never think final, I think soundscape of how I'm feeling right now."}, {"time": 4696, "text": "So it could be the middle of the song for all I know when I'm doing that, but my process for me is very much lyrics and melody and music really come at the same time."}, {"time": 4707, "text": "Like I, by same time, I mean, I'm, I'm, as I'm expressing maybe, you know, I'm feeling like."}, {"time": 4722, "text": "Like, it's not that simple, but it's like, I'll hear it, like, it's like, here's all the orchestra and you're kind of just pressing all the buttons at once and melody and my voice is just one of those instruments."}, {"time": 4734, "text": "It's just utilizing one instrument."}, {"time": 4736, "text": "So you've seen the landscape and that landscape includes melody, includes percussion, lyrics a little bit, or lyrics?"}, {"time": 4742, "text": "I will be words to begin with, like a word here and there."}, {"time": 4745, "text": "Like, I'll be like."}, {"time": 4750, "text": "You know, I'm like, what's a word that I'm thinking of when I'm feeling this soundscape?"}, {"time": 4754, "text": "And I always create with no theme in mind."}, {"time": 4759, "text": "I'm never, for better or for worse, just my process is I'm sitting down and I'm writing a journal entry."}, {"time": 4766, "text": "Simple as that."}, {"time": 4767, "text": "It's like, when you sit down to write a journal entry, are you sitting down and you're like, Kev, I've had all these words here that I'm gonna put on the page and I'm gonna order it in this way."}, {"time": 4775, "text": "And my theme for my journal entry today is gonna be this."}, {"time": 4778, "text": "Maybe some people do, but I don't."}, {"time": 4779, "text": "My journal entry is, I don't know what I'm gonna say."}, {"time": 4782, "text": "Oh, how was today?"}, {"time": 4783, "text": "Well, man, today was this and feeling this."}, {"time": 4785, "text": "And now that I think about that, I'm really angry about that."}, {"time": 4787, "text": "That hurt my feelings when this happened."}, {"time": 4789, "text": "I mean, you're like, you're formulating it as you go and that's the joy of it."}, {"time": 4793, "text": "And for me, that's what music is."}, {"time": 4795, "text": "So I'll sit down, not thinking, hey, I've been wanting to write a song that has a hard beat or I've been wanting to write a song that's anthemic or I've been wanting to write a song that's, it's like, how am I feeling right now?"}, {"time": 4806, "text": "And it's joyful?"}, {"time": 4807, "text": "Is the feeling joyful to you or is it struggle?"}, {"time": 4810, "text": "You just made it sound like it's joyful."}, {"time": 4815, "text": "Or at least fulfilling."}, {"time": 4817, "text": "I wouldn't use that."}, {"time": 4818, "text": "Yeah, fulfilling is the word I was kind of looking for, but there was."}, {"time": 4821, "text": "There's a lot of artists talk about really struggle, like you talk about writers."}, {"time": 4824, "text": "Cathartic, that's the word I was looking for."}, {"time": 4826, "text": "It feels like having a good moment with a therapist where you're like, okay, I'm expressing this thing that I just need to express."}, {"time": 4836, "text": "For whatever reason, I need to express this."}, {"time": 4838, "text": "The majority of the songs I write, for the record, are never heard."}, {"time": 4841, "text": "I write over 100 songs a year."}, {"time": 4843, "text": "I release 20 songs every three years."}, {"time": 4847, "text": "So, I don't know, what's that percent?"}, {"time": 4849, "text": "20 out of 300."}, {"time": 4851, "text": "Come on, Lex."}, {"time": 4853, "text": "It's less than 10%."}, {"time": 4855, "text": "Less than 10%, yeah."}, {"time": 4856, "text": "Eight, seven or something?"}, {"time": 4859, "text": "Anyway, so it's."}, {"time": 4861, "text": "And then getting together with the band and getting them selected down is really what the process has."}, {"time": 4866, "text": "So you're really writing a song per one to three days."}, {"time": 4871, "text": "Three days, maybe a song that you can't quite figure out the puzzle of that's gonna last a little longer."}, {"time": 4880, "text": "Is it worth the struggle?"}, {"time": 4880, "text": "I finish every idea."}, {"time": 4882, "text": "Yeah, you finish every idea."}, {"time": 4883, "text": "I do, I finish every idea."}, {"time": 4885, "text": "So it's not just like laying completely unfinished."}, {"time": 4888, "text": "I could open my computer for you right now and I would show you hundreds and hundreds of songs that you would listen to and think, that sounds like a song."}, {"time": 4896, "text": "It's like there's rhythm, there's melody, there's multiple instruments, there's lyrics."}, {"time": 4900, "text": "Like I, it's the same thing as for coding for me, which is music, which is I can't walk away until I've completed it."}, {"time": 4908, "text": "But it's finished."}, {"time": 4910, "text": "Well, finished is."}, {"time": 4911, "text": "Yeah, yeah, yeah, but it sounds like a song."}, {"time": 4912, "text": "I certainly do a lot more with it after, with the band, we'll pull it all apart."}, {"time": 4916, "text": "But it's a song."}, {"time": 4918, "text": "It'll be like, you know, you'll listen to it and say, okay, that was a song."}, {"time": 4921, "text": "I get, you understand what it is, for sure."}, {"time": 4925, "text": "Do you think, this is a painful question from a fan perspective."}, {"time": 4930, "text": "Do you think there's genius on your computer that you walked away from that you just didn't notice it?"}, {"time": 4939, "text": "Like, do you think there's truly great songs that you've written that you just didn't notice how great they are?"}, {"time": 4946, "text": "I think greatness is something that I feel I'm, I don't feel like I've achieved greatness."}, {"time": 4954, "text": "Genuine, I'm not saying that to you in a way of like humility, falseness."}, {"time": 4958, "text": "Like Michael Jordan type."}, {"time": 4959, "text": "No, genuinely, I feel like I am on a journey right now to find who I am."}, {"time": 4966, "text": "And I'm 34 and it's like, I don't even, I haven't begun that journey."}, {"time": 4970, "text": "I feel like I'm just starting that."}, {"time": 4972, "text": "But that being said, I certainly don't know the right answer to what songs are, you know, beloved or good to the masses."}, {"time": 4984, "text": "Like Imagine Dragons is such a massive entity."}, {"time": 4986, "text": "It's like, there have been a, I will say this, there are a couple of times where I fought really hard to decide on the single, really hard."}, {"time": 4995, "text": "Or I always fight for what goes on the record, always."}, {"time": 4997, "text": "I always put the record together and that's the record that I wanted to be and me and the guys come up with that."}, {"time": 5002, "text": "And it's nobody else has influenced, no manager, no label."}, {"time": 5005, "text": "The single, everybody wants to have a saying."}, {"time": 5009, "text": "Your label wants to have a saying in it."}, {"time": 5010, "text": "Your manager wants to have a saying in it."}, {"time": 5012, "text": "And I have fought really hard over that."}, {"time": 5015, "text": "And I've been wrong before and I've been right before."}, {"time": 5017, "text": "But as far as songs that I haven't put out, I mean."}, {"time": 5023, "text": "Because you can imagine so many songs, you think of so many Beatles songs that are like some of their greats, while my guitar gently weeps."}, {"time": 5031, "text": "I'm trying to imagine weird sounding, not that interesting possibly songs."}, {"time": 5037, "text": "The majority of what we put them."}, {"time": 5038, "text": "Honestly, it may be our best stuff is that we don't put out for instance."}, {"time": 5043, "text": "Because our band is such a, it's such a complex question."}, {"time": 5049, "text": "I really don't know actually."}, {"time": 5051, "text": "I don't know, maybe one day I'll die and people will look and be like, I hated Imagine Dragons, but now I listen to that song."}, {"time": 5056, "text": "I really liked that, wish they would put that out."}, {"time": 5057, "text": "Or maybe they'll be like, oh, it's all sounds like shit."}, {"time": 5061, "text": "Well, that's, sorry, it is a tragic thing."}, {"time": 5064, "text": "That's why I asked it, which is like, there could be some great, incredible things that will take you a long time to rediscover, to realize how great they are."}, {"time": 5076, "text": "And it's also the tragic aspect of being an artist is you don't know, forget fame or all that kind of stuff."}, {"time": 5085, "text": "You don't know what's going to really move people."}, {"time": 5086, "text": "Cause ultimately what you want is to connect with people and you don't know what that's going to be."}, {"time": 5094, "text": "It's hard, I mean, to me it's tragic just as a fan of yours to see, maybe I wonder if there's like incredible stuff there."}, {"time": 5101, "text": "Just as it is tragic to see great artists throughout history who didn't get recognition until they died."}, {"time": 5106, "text": "It's like, cause they basically held on, Franz Kafka was extremely self critical."}, {"time": 5114, "text": "A lot of these folks had an idea of what's good and not, and they were wrong."}, {"time": 5119, "text": "They had genius, they weren't entirely wrong cause they became sufficiently popular, but it's interesting."}, {"time": 5127, "text": "I try to genuinely to release the songs that move me the most."}, {"time": 5132, "text": "You're your own audience."}, {"time": 5134, "text": "Yeah, I try to put out the songs that make me feel the most."}, {"time": 5139, "text": "Like I feel that, that's my only gauge because it's so subjective of like, what is good?"}, {"time": 5145, "text": "What's this?"}, {"time": 5146, "text": "Nobody knows the song the masses are going to like."}, {"time": 5148, "text": "Nobody knows that formula, nobody knows it."}, {"time": 5151, "text": "So for me, it's always what makes me feel something."}, {"time": 5153, "text": "One of the main lessons Rick Rubin taught me when we worked with him on this record was he would say, his main point that he would continually bring up when like, cause he's not the type of person to be like, that's a bad song or that's good."}, {"time": 5166, "text": "It's just not who Rick Rubin is."}, {"time": 5167, "text": "It's more like, there's more nuance to it."}, {"time": 5169, "text": "He would say, I don't really believe you on that song."}, {"time": 5175, "text": "That's what he would say."}, {"time": 5176, "text": "He would say, and I knew that was like, that song's a no go."}, {"time": 5181, "text": "He would say, and I would genuinely, there was a time he said it and it was about a song that I really like, I really felt it and meant it when I said it."}, {"time": 5189, "text": "But he didn't believe it when he heard it."}, {"time": 5192, "text": "And that was enough for, I was like, man, well, at the end of the day, like I can believe it all I want, but if the listener doesn't feel the honesty in it, just like we were talking about earlier, I think the most important ingredient is, is this truth, perceived as truth to someone else?"}, {"time": 5205, "text": "And if it's not, the bullshit indicator goes, and you're like, I don't care, I don't throw it away."}, {"time": 5209, "text": "I don't care about it."}, {"time": 5210, "text": "You said that he made you go through, like line by line, the lyrics."}, {"time": 5216, "text": "Every single, it was excruciating for me."}, {"time": 5219, "text": "Why was that excruciating?"}, {"time": 5222, "text": "Well, first of all, it's Rick Rubin."}, {"time": 5223, "text": "So you're in the room with like Rick Rubin, who's done a lot of the greatest of all time."}, {"time": 5229, "text": "And so I had to first just put that aside and be like, okay, well, you've done a lot of my favorite records, but still you're human and not everything you say is gonna be right."}, {"time": 5240, "text": "And I'm a strongly opinionated person, and so is Rick."}, {"time": 5243, "text": "And so when the two of us were sitting down in a room together, it was, you know."}, {"time": 5248, "text": "But the lyrics, which is interesting."}, {"time": 5250, "text": "So it's not the entire composition, but just like, let's look at the lyrics."}, {"time": 5254, "text": "What do you mean here?"}, {"time": 5255, "text": "Yeah, oh yeah, cause he would look over every, there was like, and there were battles he won, battles that he didn't win, and maybe he was right."}, {"time": 5266, "text": "I mean, there was, for instance, I'll give you an example."}, {"time": 5268, "text": "There was a song on the record called Number One."}, {"time": 5270, "text": "Rick will probably laugh when he hears this."}, {"time": 5274, "text": "Cause this was a big one that we kept going back and forth on."}, {"time": 5277, "text": "But this will give you a good insight of what it was like."}, {"time": 5281, "text": "And there's a line in it that says, I don't know, the chorus is, I don't know what I'm meant to be."}, {"time": 5286, "text": "I don't need no one to believe."}, {"time": 5288, "text": "When it's all been said and done, I'm still my number one."}, {"time": 5292, "text": "And he was like, nah, it just makes me cringe when I hear that."}, {"time": 5295, "text": "He's like, I just, like, do you have to be like, can it not be like, you're still my number one?"}, {"time": 5301, "text": "And I was like, no, it's not about anybody else."}, {"time": 5303, "text": "Like, you know, it's about like self love."}, {"time": 5305, "text": "He's like, yeah, but like, do you need to like talk about self love like that?"}, {"time": 5309, "text": "And I was like, well, I feel like I need to."}, {"time": 5311, "text": "He's like, well, maybe, you know, there's something else we could say there."}, {"time": 5314, "text": "Like we just kept, you know, we kept coming back to this song, okay?"}, {"time": 5318, "text": "I was like, and I changed it."}, {"time": 5320, "text": "I tried changing it."}, {"time": 5321, "text": "What did I change it to?"}, {"time": 5322, "text": "It was like, it wasn't you're still my number one, it just made no sense."}, {"time": 5325, "text": "It wasn't about some love thing or like someone else."}, {"time": 5329, "text": "I changed it to something else."}, {"time": 5330, "text": "And it just, it was the one thing that I was like, I'm really sorry, Rick."}, {"time": 5337, "text": "And if it sounds cringy to you, it's definitely sounding cringy to other people too."}, {"time": 5339, "text": "And that sucks."}, {"time": 5340, "text": "But I don't know how else to say this in a way that I want to put that song out anymore."}, {"time": 5345, "text": "But there were other songs for sure where Rick was like, that or this, that word feels a little trite."}, {"time": 5351, "text": "You already said that once."}, {"time": 5353, "text": "Can you say it in a different way?"}, {"time": 5354, "text": "It was really helpful."}, {"time": 5356, "text": "It's really interesting because you're trying to say something so simply and yet not make it cringe."}, {"time": 5365, "text": "That's a strange art form because you want to say some of the greatest love songs."}, {"time": 5370, "text": "I mean, we looked at the Without You song."}, {"time": 5373, "text": "I mean, that's the whole thing is cringy."}, {"time": 5375, "text": "If you just read it on paper, like it's a court report or something, but yet it's not, especially when sung maybe."}, {"time": 5385, "text": "But no, there's something about, yeah, maybe."}, {"time": 5389, "text": "Sung in a way you believe it."}, {"time": 5390, "text": "When you believe it, but also written in a way that's singable in the way you believe it."}, {"time": 5399, "text": "It rolls off."}, {"time": 5400, "text": "It just comes out in a way that just feels like silky."}, {"time": 5402, "text": "No word catches your mind as cringy."}, {"time": 5408, "text": "But then music, I think great speeches are like that too, or just conveying, communicating ideas simply."}, {"time": 5419, "text": "That's the art form is to not be cringy."}, {"time": 5423, "text": "And then yet, because like when you're raw and real, it might at first feel cringy."}, {"time": 5432, "text": "So the battle there, and that's where you see people fail."}, {"time": 5439, "text": "Like just regular artists."}, {"time": 5440, "text": "Like, I don't know, at open mic, I got open mic, so I just listen to musicians."}, {"time": 5445, "text": "Like when they write songs, like they fail that test."}, {"time": 5448, "text": "They write simple stuff, but it's cringy."}, {"time": 5451, "text": "I wonder what was that?"}, {"time": 5452, "text": "Like, what is that?"}, {"time": 5453, "text": "I'm telling you, Lex, I tried to explain this to my brother the other day, because it's the same thing with a live performance."}, {"time": 5460, "text": "If I'm not in my right head space and I walk on stage and I walk up and let's say I say something and I do this, because I'm like, this is the move, right?"}, {"time": 5470, "text": "I'm like, this is the move."}, {"time": 5472, "text": "The crowd doesn't care."}, {"time": 5473, "text": "In fact, the crowd's like, that's cringy when you did this."}, {"time": 5476, "text": "But if I wasn't thinking about doing this and I went up there and I said something and I really meant it and my body was like, I can't explain this to you, and it's so silly to say out loud, but people will resonate to it when it's real."}, {"time": 5493, "text": "And when it's acted, it doesn't, you could do it the exact, the motion could look the same, your eyes look the same, but there's something about the energy that people know."}, {"time": 5502, "text": "They know if it's real or not."}, {"time": 5504, "text": "Yeah, people have, like you said, incredible bullshit detectors."}, {"time": 5506, "text": "That's why I love people."}, {"time": 5507, "text": "I'll go on a stage and if I'm not in the right head space to be real, it won't be a good show."}, {"time": 5512, "text": "If I'm real, then it's a good show."}, {"time": 5514, "text": "It's as simple as that."}, {"time": 5515, "text": "Let's go through the song."}, {"time": 5519, "text": "Like I said, great opener."}, {"time": 5522, "text": "So you had this in your mind, this landscape?"}, {"time": 5531, "text": "The beat was first on this."}, {"time": 5533, "text": "What about the first and the second, like first thing's first, second thing's second?"}, {"time": 5537, "text": "The first line I wrote was first thing's first."}, {"time": 5541, "text": "I don't know why, it just was like, and then I was like, oh, that principle of, you know."}, {"time": 5548, "text": "Second thing's second."}, {"time": 5550, "text": "Don't you tell me what you think that I could be."}, {"time": 5553, "text": "I'm the one at the sail, I'm the master of my sea."}, {"time": 5555, "text": "I'm the master of my sea."}, {"time": 5557, "text": "My dad had that in his office."}, {"time": 5559, "text": "He had this saying that was something about the sailor and being the master of his sea that I always loved."}, {"time": 5567, "text": "There you go, simple statement."}, {"time": 5570, "text": "Zero cringe in it."}, {"time": 5571, "text": "It's so powerful."}, {"time": 5576, "text": "This whole song is just trivial, but in terms of lyrically, but extremely powerful and original, unique sounding, something about the words."}, {"time": 5588, "text": "Just even, you don't have to actually sing them, you just read them."}, {"time": 5592, "text": "And then raw, I was broken from a young age, tuck myself into the masses, writing my poems for the few that look at me, took to me, shook at me, feeling me, singing from the heartache, from the pain, taking my message from the thing."}, {"time": 5604, "text": "I can't, why am I reciting your words to you?"}, {"time": 5607, "text": "But the percussionist throughout it, and that was there in the beginning."}, {"time": 5614, "text": "The percussion is almost in the lyrics, yeah."}, {"time": 5616, "text": "And I'm a very percussive singer because I was a drummer first before I, I think same with Dave Grohl, probably a similar thing, which is I think in percussive sense a lot when I'm writing and I also was, before I could play an instrument, I would beatbox."}, {"time": 5634, "text": "And I think Michael Jackson did this too, actually."}, {"time": 5636, "text": "I've heard in the studio that he was very similar, but a lot of what I do is percussive because my brain thinks in percussively first."}, {"time": 5647, "text": "A little more, because it's so good."}, {"time": 5648, "text": "It's almost like a drum, like, dka, dka, dka, dka, dka, dka, dka, dka, dka, dka, dka, dka."}, {"time": 5654, "text": "And then you lay words on that."}, {"time": 5658, "text": "Yeah, this."}, {"time": 5659, "text": "Tuck myself into the masses, writing my poems for the few that look at me, took to me, shook at me, feeling me, it's almost like drums, dka, dka, dka, dka, dka, dka, dka, dka."}, {"time": 5670, "text": "It's all building to the chorus."}, {"time": 5674, "text": "Hey, you made me a, you made me a believer, believer."}, {"time": 5680, "text": "Hey, hey."}, {"time": 5683, "text": "What about the word pain?"}, {"time": 5685, "text": "When did that come to you?"}, {"time": 5688, "text": "Pain, you made me, you made me a believer."}, {"time": 5691, "text": "Yeah, just the idea of, I just wanted to, I really, one of the things that a lot of the songs that I like, I like divisiveness, for instance, not always, but there's times where I want someone to hear a song and I want them to either love it or hate it."}, {"time": 5709, "text": "I really don't want them to be in the middle ground."}, {"time": 5711, "text": "A lot of the songs that, like a lot of my favorite songs are divisive songs."}, {"time": 5719, "text": "And so for instance, with pain, I want you to hear that in almost like, it's like, whoa."}, {"time": 5727, "text": "It's something either somebody is going to hear and they'll be like, man, I just don't want to hear that like that."}, {"time": 5731, "text": "Or it's like, oh, I felt that so deeply when he said that in that way, because it sounded like this."}, {"time": 5735, "text": "And when you think of the word pain, it's like, that's a, at least for me, when I hear that word, it carries a lot of weight, carries a lot of weight."}, {"time": 5748, "text": "So I wanted to sing it with a lot of weight and to come into that chorus with like, like it's a striking moment."}, {"time": 5756, "text": "And I'm also a tenor singing as, sorry, I'm a baritone singing as a tenor."}, {"time": 5761, "text": "So that's where that natural, like gruffness comes from is that I'm singing out of my range really, up in my head voice."}, {"time": 5768, "text": "And it carries a lot of weight with it because of the baritone."}, {"time": 5772, "text": "Can I ask you a specific sort of the pause before the pain?"}, {"time": 5778, "text": "Cause it's like a double."}, {"time": 5780, "text": "What is that, how much work does that take to get that right?"}, {"time": 5789, "text": "Cause it's like a, so you're kind of seeing the beauty through the, and then that, whatever that sound is."}, {"time": 5796, "text": "Right, the bass being rolled off."}, {"time": 5799, "text": "Yeah, I actually, when I first was approaching the chorus, it was actually seeing, taking my message from the veins, taking my lesson from the veins, seeing the beauty through the, seeing the beauty through the pain."}, {"time": 5813, "text": "You made me a, like it came in on one."}, {"time": 5816, "text": "I'm not seeing it right right now, but it did not wait."}, {"time": 5819, "text": "And it felt like it didn't hit in the way that it was supposed to hit."}, {"time": 5824, "text": "Because the, you predict that, right?"}, {"time": 5827, "text": "You're like, you're waiting to see the beauty through the pain, you made me a, right?"}, {"time": 5831, "text": "It was like the beauty through the pain."}, {"time": 5833, "text": "You made me a, made me."}, {"time": 5835, "text": "So I wanted to feel a little more like striking, like, again, it's like that thing that makes you kind of do this a little bit."}, {"time": 5840, "text": "You're like, huh?"}, {"time": 5842, "text": "But once you hear it a few times, you're like, ah, ah."}, {"time": 5845, "text": "And you predict, you know what I mean?"}, {"time": 5846, "text": "It's like, I'd rather someone hear our song the first time and be confused by it."}, {"time": 5851, "text": "So they play it the second time."}, {"time": 5853, "text": "And then they're like, oh, okay."}, {"time": 5855, "text": "Like, I really don't want, you know, I'd rather turn some people off along the way."}, {"time": 5861, "text": "And then the people who come along for you are gonna feel more committed, I think."}, {"time": 5866, "text": "It's just an interesting, like, it feels gutsy to insert silence, you know?"}, {"time": 5873, "text": "Yeah, that's what makes it, you know, it's like the greatest speakers of all time are like, and I told you."}, {"time": 5880, "text": "You would know, I mean, it's like, you're like, oh."}, {"time": 5884, "text": "Yeah, what is that?"}, {"time": 5885, "text": "Yeah, that's so interesting to do that just at the right time."}, {"time": 5889, "text": "And then, and then pain, right?"}, {"time": 5893, "text": "Man, it's a brilliant song."}, {"time": 5895, "text": "Did you know it was a good song when you wrote it?"}, {"time": 5898, "text": "Out of the thousands of songs you've written?"}, {"time": 5900, "text": "You know, it's always the same thing for me, which is like, if I wanna listen to the song and I wanna listen to it a lot of times, then those are the songs we put out."}, {"time": 5911, "text": "And I only wanna listen to the songs that make me feel something."}, {"time": 5915, "text": "Whether or not it's like, our single that did the very worst of all our singles was the song that I wanted to listen to the least, but it made the most sense as a single, which was all the wrong reason to choose it, right?"}, {"time": 5926, "text": "It was, I Bet My Life is the single off our second album."}, {"time": 5930, "text": "And that song was originally written, it was just a guitar and a vocal, and it was very just quiet and laid back."}, {"time": 5936, "text": "And we were like, well, let's try to dial it up, let's try to produce it."}, {"time": 5940, "text": "And we overproduced that song."}, {"time": 5941, "text": "We self produced it as a band and we overproduced."}, {"time": 5945, "text": "And that song, I mean, it did good in terms of a song, but for us, it did not do good compared to other songs."}, {"time": 5954, "text": "And I really look back at that and learned a lesson from that."}, {"time": 5957, "text": "It's like, if I don't wanna listen to the song, that's a sign already."}, {"time": 5961, "text": "If you don't wanna listen to your own song, it's probably not a good song."}, {"time": 5966, "text": "You said your dad, elsewhere and today, just said that your dad early on was a kind of the early Rick Rubin."}, {"time": 5978, "text": "So when you were starting out, he gave you feedback, you listened."}, {"time": 5984, "text": "What did you learn about music about life from your dad?"}, {"time": 5988, "text": "My dad is a really quiet farm, grew up on a farm, very humble."}, {"time": 5994, "text": "And I think he starts every sentence by saying, this is just my two cents, pretty much."}, {"time": 6003, "text": "It's like, take it or leave it."}, {"time": 6006, "text": "He's that kind of a sense, like there's humility in everything and it's real for him."}, {"time": 6009, "text": "It's not like false humility."}, {"time": 6012, "text": "I really feel like when he's saying things, he really is like, maybe this isn't any worth to you son."}, {"time": 6017, "text": "And he means it, but here it is."}, {"time": 6019, "text": "And it's always gold."}, {"time": 6020, "text": "And I'm like, wow, dad, that's incredible."}, {"time": 6022, "text": "So what, in those early days of you like, so you were like 12 or something like that, like starting to write songs."}, {"time": 6027, "text": "I was 12, I wasn't showing my music to anyone."}, {"time": 6030, "text": "I started writing right when I was 12 and I probably wrote for at least, let's say six months or something."}, {"time": 6034, "text": "And I had written probably, I don't know, like a lot of songs during that time."}, {"time": 6038, "text": "What was the topic by the way?"}, {"time": 6039, "text": "Love, anger?"}, {"time": 6040, "text": "It was all sad."}, {"time": 6041, "text": "No, it was, the first song I ever wrote went, and it was like a bluesy thing."}, {"time": 6054, "text": "It was like, there was my voice doing that."}, {"time": 6055, "text": "And then it was like, all by himself, no other one around."}, {"time": 6061, "text": "And he stood all alone."}, {"time": 6064, "text": "When would he be found?"}, {"time": 6067, "text": "Did he want company?"}, {"time": 6070, "text": "Or was he fine on his own?"}, {"time": 6073, "text": "Everyone needs a friend."}, {"time": 6075, "text": "So why was he all alone?"}, {"time": 6081, "text": "You know, it is like, but I was like a 12 year old with, I just felt like depressed for the first time."}, {"time": 6088, "text": "And I was, and I just was like, so."}, {"time": 6091, "text": "I think he discovered the blues as a 12 year old."}, {"time": 6094, "text": "It really was, it was like my sense of the blues at that time for sure, like bad version of the blues."}, {"time": 6098, "text": "But it was like 12 year old kid with a bunch of acne."}, {"time": 6100, "text": "And like, I just like, I hated going to school."}, {"time": 6103, "text": "I felt like that I just had not found myself."}, {"time": 6106, "text": "Sounds like a great song, by the way."}, {"time": 6108, "text": "But anyway, I wanted to keep listening."}, {"time": 6109, "text": "I forgot I was."}, {"time": 6110, "text": "Yeah, I don't know about that, but yeah."}, {"time": 6115, "text": "Yeah, what was your dad, at which point did you begin to share it with your dad?"}, {"time": 6118, "text": "A lot of the songs that I wrote in the beginning were very much like Bobby McFerrin like that, because our, Mike was in a part of the house where I couldn't bring over the piano."}, {"time": 6126, "text": "And the only instrument I played at the time was the piano."}, {"time": 6129, "text": "So I would do everything with my voice."}, {"time": 6131, "text": "But then I started teaching myself the guitar in those, in that beginning, like six month period, just watching my brothers play in their garage bands in the basement."}, {"time": 6138, "text": "And then I started to write songs a little bit more like Enya vibes, like stack my voice like 20, 30 times."}, {"time": 6142, "text": "And like Enya meets like Jaray, which is who my dad would listen to a lot."}, {"time": 6148, "text": "John Michael Jaray, he's an incredible synth genius."}, {"time": 6151, "text": "But anyway, so I finally got my like gall up enough to show it to my dad one day after work."}, {"time": 6158, "text": "And I got very little of my dad because there were nine kids and he worked from 8 a.m. till 6 p.m. We'll come home very tired."}, {"time": 6164, "text": "And here's nine kids that are like, dad, you know, and you're the young one."}, {"time": 6168, "text": "You're not, you're just gonna miss."}, {"time": 6169, "text": "I was in the middle kind of too."}, {"time": 6170, "text": "So it's even, you know, middle child thing."}, {"time": 6173, "text": "But I sat him down and I was like, hey dad, I just wanna like kind of show you a song."}, {"time": 6177, "text": "And he was like, oh, you know, he didn't know I was writing anything."}, {"time": 6180, "text": "And I showed it to him and he listened and he took it off and he really looked at me."}, {"time": 6184, "text": "And he was like, that was really good."}, {"time": 6186, "text": "He was like, I've thought, and this, when you said this, it made me feel this."}, {"time": 6190, "text": "He was like, and that did it."}, {"time": 6192, "text": "I probably would have given up music."}, {"time": 6194, "text": "Like I look back, that was a very pivotal moment for me."}, {"time": 6197, "text": "I was like in a place where I was like, is this good, bad?"}, {"time": 6200, "text": "I don't know, maybe it's so embarrassing and terrible."}, {"time": 6203, "text": "And I was already writing lyrics that were a little like overly metaphorical to hide that I was dealing with faith crisis."}, {"time": 6209, "text": "Cause I thought, okay, I'm gonna show this to dad."}, {"time": 6211, "text": "I don't want my dad to know I'm like questioning the truthfulness of Joseph Smith."}, {"time": 6215, "text": "So I'm not gonna be like, is Joseph Smith a real prophet?"}, {"time": 6218, "text": "Is Mormonism true?"}, {"time": 6221, "text": "I was like writing way overly metaphorical, but because my dad really validated it and he was a no bullshit person."}, {"time": 6227, "text": "So I knew when my dad said that, I was like, you know what?"}, {"time": 6230, "text": "At least my dad really actually thinks this is cool."}, {"time": 6232, "text": "And I really trusted my dad's taste and thought everything he listened to was cool."}, {"time": 6236, "text": "So I was like, wow, I'm gonna keep doing this."}, {"time": 6239, "text": "And I just showed it to my dad for years and years."}, {"time": 6241, "text": "And still to this day, I send every song to my dad."}, {"time": 6243, "text": "So he underneath it with the feedback is always like, Ooh, I like this idea."}, {"time": 6248, "text": "It's just a positive, like a."}, {"time": 6249, "text": "Not always positive, no."}, {"time": 6250, "text": "But like underneath it, do you sense the positivity?"}, {"time": 6253, "text": "Cause I think that's."}, {"time": 6255, "text": "Never mean, never malicious."}, {"time": 6259, "text": "You know, there's like, there's two types of criticism."}, {"time": 6261, "text": "There's like criticism that's just like, you're looking to be hurtful to someone."}, {"time": 6264, "text": "And then there's criticism that's like really important for art."}, {"time": 6268, "text": "It's the type of criticism that's like, you see the value in what's happening."}, {"time": 6272, "text": "And if it's honest, then you can, you maybe communicate with that person."}, {"time": 6275, "text": "Like I, I see what you're trying to do with that."}, {"time": 6279, "text": "You know, it's not even like you have to say that or whatever, like butter it up."}, {"time": 6282, "text": "But it's like, my dad would just give me the, this honest criticism that would be like, you know, it certainly wasn't always good, but I knew it was always well intentioned."}, {"time": 6293, "text": "I guess that's, that's how I would say."}, {"time": 6295, "text": "You mentioned, made me re listen to it."}, {"time": 6297, "text": "I'm a big fan of Cass Stevens."}, {"time": 6298, "text": "You made me re listen to father and son."}, {"time": 6300, "text": "I probably all sons have issues to work through with their fathers."}, {"time": 6307, "text": "And you said that you connect with this song in particular."}, {"time": 6310, "text": "I think, so you're a father now."}, {"time": 6313, "text": "What is it about the song that connects with you?"}, {"time": 6316, "text": "For people, let me play it, let me play a little bit."}, {"time": 6319, "text": "People should educate themselves on Cass Stevens."}, {"time": 6322, "text": "Right on the peace train."}, {"time": 6323, "text": "The best, the best, right on the peace train."}, {"time": 6327, "text": "You think this is a hopeful, a sad song?"}, {"time": 6329, "text": "I hear it as hopeful."}, {"time": 6331, "text": "I hear it as a loving father saying just what his son needs to hear."}, {"time": 6334, "text": "It's not time to make a change."}, {"time": 6338, "text": "Just relax, take it easy."}, {"time": 6342, "text": "You're still young."}, {"time": 6343, "text": "That's your fault."}, {"time": 6345, "text": "There's so much you have."}, {"time": 6347, "text": "It's like that calm wisdom."}, {"time": 6351, "text": "This time."}, {"time": 6352, "text": "It wise."}, {"time": 6353, "text": "If you want, you can marry, look at me."}, {"time": 6357, "text": "I am old, but I'm happy."}, {"time": 6361, "text": "And just the way he says that, like that should be a corny line, but it's not corny at all."}, {"time": 6365, "text": "Once like you are now."}, {"time": 6367, "text": "Look at me, I'm old, but I'm happy."}, {"time": 6369, "text": "It's not easy to be calm when you found something going on."}, {"time": 6375, "text": "Yeah, I mean, the simplicity there, and it's such a contrast with, what's his name?"}, {"time": 6384, "text": "Harry Chapman with the cats in the cradle, which is like the sadness of, so this feels like there's a wise, calm connection between father and son, right?"}, {"time": 6402, "text": "With cats in the cradle."}, {"time": 6404, "text": "I don't know if you remember that song."}, {"time": 6407, "text": "He learned to walk while I was away and he was talking before I knew it."}, {"time": 6411, "text": "And as he grew, he'd say, I'm going to be like you dad."}, {"time": 6414, "text": "You know, I'm going to be like you."}, {"time": 6416, "text": "And the idea of that song is that he does become like his dad, which is funny, you know, something you've said."}, {"time": 6425, "text": "But in a different way, you become too busy to make that connection."}, {"time": 6429, "text": "His dad was too busy to make a connection with his son."}, {"time": 6432, "text": "And in a, not in a dramatic way, in a very kind of calm, natural way."}, {"time": 6436, "text": "Like you don't, you just don't have time."}, {"time": 6439, "text": "You're busy at work, you're providing for the family and so on, there's connection."}, {"time": 6443, "text": "But if you don't really get, form that like depth of connection."}, {"time": 6447, "text": "And then the father, when the son shows up from college and all that kind of stuff, he doesn't spend any time with the father."}, {"time": 6454, "text": "All that, and just the calm sadness of that, that we live, we can live parallel lives and never quite connect."}, {"time": 6462, "text": "And there is a little bit of that in father and son with Cat Stevens too, you know, like when the son is saying, from the moment that I could talk, I was ordered to listen."}, {"time": 6471, "text": "I always remember listening to that line, feeling like that really moved me."}, {"time": 6476, "text": "But the beauty of that song is it shows, it's kind of like the theme of what I feel like we've talked about since the second you got here, which is something I really like."}, {"time": 6485, "text": "I don't know why it's such an important theme in my life right now, but the duality of just understanding that you don't understand someone else's situation."}, {"time": 6494, "text": "And there's truth to both sides."}, {"time": 6496, "text": "Like there's truth to what the father is saying to the son."}, {"time": 6499, "text": "He's like saying these things and he's like, I'm looking out for you, I love you."}, {"time": 6503, "text": "Take your time with these things."}, {"time": 6504, "text": "If you want to get married, you know you can."}, {"time": 6506, "text": "Like these things will bring you up."}, {"time": 6507, "text": "And then the son saying, listen, like I want to pave my own path."}, {"time": 6512, "text": "Like, why are you telling me this?"}, {"time": 6513, "text": "Like the son's not wrong."}, {"time": 6516, "text": "Cause there's a lot of parents who tell their kids what to do and they're wrong, you know what I mean?"}, {"time": 6520, "text": "Like, and they don't let the kid form the path that they need to, but should you not be a parent?"}, {"time": 6528, "text": "There's just two sides to it."}, {"time": 6529, "text": "There's a thing, it is annoying when you're older, you get to see people do all the same things."}, {"time": 6538, "text": "You could say, well, this is a phase and you'll see that this actually will end up in this way."}, {"time": 6548, "text": "You can like predict how the life unrolls."}, {"time": 6550, "text": "And it's very annoying for young people to hear, especially cause it's probably going to be true."}, {"time": 6554, "text": "It's like, no, it's not going to be like this."}, {"time": 6556, "text": "No, I'm going to be different."}, {"time": 6557, "text": "But then you become that person."}, {"time": 6558, "text": "But that doesn't mean they also let them live that life."}, {"time": 6562, "text": "Let them make the mistakes, but they're not mistakes actually."}, {"time": 6566, "text": "They're like beautiful deviations from the path that they end up on."}, {"time": 6574, "text": "And those make the path."}, {"time": 6578, "text": "Do you have advice for young folks today?"}, {"time": 6583, "text": "You've had like an incredible dark journey and a successful one, a loving one, and one of the most successful artists in the world."}, {"time": 6595, "text": "Is there advice you can give to young people today that would like to find themselves to that way, especially if they're struggling?"}, {"time": 6602, "text": "I thought you said device at first."}, {"time": 6604, "text": "And I was like, honestly, I feel like that device is not helping."}, {"time": 6607, "text": "Maybe everybody should get away, throw away their devices."}, {"time": 6612, "text": "Advice."}, {"time": 6613, "text": "I would just say like what I emphasize to my kids is I really, really want my kids to just learn to love themself."}, {"time": 6627, "text": "It's easier said than done."}, {"time": 6629, "text": "It's really easy to pick on yourself in life."}, {"time": 6633, "text": "It's really easy to look in the mirror and wish you looked different, wish you were more successful like that person over there, wish that, you know, wish a lot of things."}, {"time": 6645, "text": "And people that I see that really succeed at life really succeed truly."}, {"time": 6653, "text": "And that doesn't mean they're making money necessarily or they're succeeding."}, {"time": 6656, "text": "And, you know, they're talking to a lot of people like their success, success to me is like happy and real, they have real self love."}, {"time": 6666, "text": "You meet, you know, when you meet someone, you meet Rick, for instance, you meet Rick Rubin."}, {"time": 6670, "text": "Rick has a calmness about him."}, {"time": 6672, "text": "And it's funny because everybody sees him as this like Zen master."}, {"time": 6676, "text": "Like Rick is just a really loving person who also loves himself and has self confidence because you just see it and it resonates."}, {"time": 6686, "text": "And that's why he draws people."}, {"time": 6688, "text": "And that's why he's so great in the studio because you know his intentions, always."}, {"time": 6691, "text": "As an artist, when a producer comes in, you're like, whoa, whoa, whoa, what are your intentions?"}, {"time": 6696, "text": "Are you trying to get a hit out of me for the label?"}, {"time": 6698, "text": "Are you trying to make me something?"}, {"time": 6700, "text": "Are you trying to like make me this so you can prove this about yourself?"}, {"time": 6702, "text": "Like there's a lot in that dynamic."}, {"time": 6704, "text": "And the reason that Rick is so good is because you know his intentions and his intentions come because Rick has that self love."}, {"time": 6712, "text": "So for me, find the things about yourself because they're there that you love and really focus in on them."}, {"time": 6721, "text": "And it's not selfish."}, {"time": 6722, "text": "Like I feel like I was brought up in a family too where it was like, never look inward, like be selfless."}, {"time": 6729, "text": "Like serve, serve, serve."}, {"time": 6731, "text": "Which by the way, is a true principle of life."}, {"time": 6734, "text": "I think you love yourself more when you serve more."}, {"time": 6736, "text": "I think that's really evident in life."}, {"time": 6739, "text": "But also spend time doing the things that make you happy."}, {"time": 6742, "text": "Take time every day to go on that walk that you need to go on."}, {"time": 6745, "text": "Listen to that book tape that you need to listen to."}, {"time": 6748, "text": "Like for me, that's something I need."}, {"time": 6749, "text": "I know if I do that, I'm gonna be a better dad because I gave myself some love back in life."}, {"time": 6757, "text": "And just forgive yourself."}, {"time": 6759, "text": "I think forgive yourself because everybody messes up."}, {"time": 6762, "text": "Everybody hurts others."}, {"time": 6763, "text": "Everybody says unkind words at times."}, {"time": 6765, "text": "Everybody fails all the time."}, {"time": 6769, "text": "And if you think that you're gonna not, you're wrong."}, {"time": 6772, "text": "And you're eventually going to and you're either gonna punish yourself for it every day and be a lesser version of what you could be or you're gonna forgive yourself for it."}, {"time": 6781, "text": "And if you learned that that's not something you want then try not to do it again."}, {"time": 6784, "text": "If you do it again and you're probably gonna do it again, whatever that is, you're gonna gossip about that person."}, {"time": 6789, "text": "You're gonna feel bad because then you gossiped about someone."}, {"time": 6792, "text": "Is there something you could say in terms of self love?"}, {"time": 6794, "text": "Is there a role for being critical?"}, {"time": 6797, "text": "Like those demons of self criticism, do you need a little bit of that?"}, {"time": 6801, "text": "Tom Waits talks about, I like my Tom with a little drop of poison."}, {"time": 6805, "text": "Need a little poison?"}, {"time": 6807, "text": "Or is that silly?"}, {"time": 6809, "text": "Or a mental situation of poison?"}, {"time": 6811, "text": "Look, my biggest thing in life that has been the thing that I've worked on the hardest for the last few years is to not be overly critical."}, {"time": 6822, "text": "And to let go of control."}, {"time": 6825, "text": "I think it's really easy to kill an artist."}, {"time": 6833, "text": "It's really easy to kill an artist."}, {"time": 6835, "text": "Like if my dad would have sat down with me that day and even if he would have just sat down and been like, good job son, okay."}, {"time": 6842, "text": "It's not silly, right?"}, {"time": 6843, "text": "Like I didn't, not everybody has a dad who's gonna ever do something or put in the time or whatever."}, {"time": 6849, "text": "But that might've altered everything for me."}, {"time": 6854, "text": "Like my dad taking the extra time to just give me a thoughtful response opposed to, kids know, kids know when you're just like trying to get out of the room or whatever."}, {"time": 6863, "text": "I knew he wasn't and that did a lot."}, {"time": 6866, "text": "But is that a huge, isn't that what makes the artist?"}, {"time": 6870, "text": "It's the fragility of it that like, would you have it any other way?"}, {"time": 6877, "text": "No, no, I agree with you."}, {"time": 6880, "text": "I think that that's what, that's the beauty of art."}, {"time": 6885, "text": "But I think also on the same token, it's like, I went to Music Cares recently, which is a charity for musicians that are down on their luck."}, {"time": 6898, "text": "That maybe were successful at one point or have never been successful and they can't even pay the bills and this charity contributes money to these artists, aspiring artists or artists who've had drug issues."}, {"time": 6908, "text": "And like, there's a lot that they do, but, and there was a statistic that they told it was staggering to me, which is, I think it was 75% of artists, musicians, say they struggle with severe depression."}, {"time": 6920, "text": "That's really high."}, {"time": 6922, "text": "I don't know what the national average is, but I would guess that that's higher than national average per occupation."}, {"time": 6929, "text": "So I just think there's a tricky balance."}, {"time": 6933, "text": "There's a tricky balance in art."}, {"time": 6938, "text": "So yeah, of course, like it's a necessary thing, the fragility of it all, but."}, {"time": 6946, "text": "Yeah, I wonder, cause I'm extremely self critical and I sometimes ask myself the question, I've romanticized it or rather I've learned to be, for it to be productive, to channel it into productivity."}, {"time": 6961, "text": "But I wonder if there's better ways to do that."}, {"time": 6965, "text": "And I also wonder if it's eventually the thing that destroys me."}, {"time": 6968, "text": "Like if longterm, if it's a healthy thing, it might be useful when you're sort of actively fighting the battles of the day, for me it's engineering challenges and all that kind of stuff."}, {"time": 6983, "text": "But then when you're sitting back and enjoying life with family and so on, is that going to be, like, do you need to find that self love, like ability to kind of silence the voice of criticism in your head?"}, {"time": 6999, "text": "You know what, I really, there's a good, you're making a good point."}, {"time": 7002, "text": "And I think that the middle ground is you need, you need self doubt to push you to be better."}, {"time": 7015, "text": "I do believe that like, for instance, if I believed I've hit my, like when you're like, is there a song on there that you think is genius?"}, {"time": 7024, "text": "If I think I've written a genius song ever, I think I'd probably stop."}, {"time": 7029, "text": "I think I'd be like, you know what?"}, {"time": 7031, "text": "Did it, I wrote, what's that perfect song?"}, {"time": 7041, "text": "Imagine, yeah."}, {"time": 7042, "text": "If I'd written imagine, I'd probably be like, that's it, did it, all right, perfect song has been written."}, {"time": 7048, "text": "That's the best thing I'll ever do."}, {"time": 7051, "text": "So the fact that there is like self criticism and criticism outside, I think is necessary."}, {"time": 7059, "text": "A hundred percent for sure."}, {"time": 7061, "text": "It pushes you, it pushes you, it pushes you."}, {"time": 7064, "text": "It's just finding the right middle ground for that young aspiring artist to also not feel squashed and to be heard and to love, just to not even to feel squashed, just to love themself."}, {"time": 7076, "text": "So that when they're in the room playing the song, they'll believe it because they believe themself."}, {"time": 7083, "text": "They love themself enough that they believe it and then they'll do a great, and then the song will come out great and they'll do a great performance."}, {"time": 7090, "text": "I have to ask, it's one of the very interesting aspects of your life of the way you put love out there in the world."}, {"time": 7098, "text": "What is at the core of your support for the LGBT community?"}, {"time": 7104, "text": "So one, growing up in, from a young age in the artist community, a lot of my closest friends were LGBTQ, starting in middle school."}, {"time": 7118, "text": "And I think a lot of the best artists in the world are LGBTQ and that's just, it's not a secret."}, {"time": 7124, "text": "Like it just is, like the artist community is filled with lots of LGBTQ people."}, {"time": 7130, "text": "So I think being raised in that community in that my friends struggled with their faith and their sexuality really opened up my eyes to how incredibly hard that path is."}, {"time": 7148, "text": "For instance, okay, when I was in high school, there was someone who went in front of, who was LGBTQ and was Mormon and felt like there was not a place for them in the church."}, {"time": 7161, "text": "They felt like the path, when you're being told that it's evil and you believe it because you believe in your faith and you feel like it's unchangeable, you're putting a kid in a situation where there's really no good resolution."}, {"time": 7176, "text": "It's either be alone for the rest of your life or marry outside your sexual preference, which I don't wanna marry a man."}, {"time": 7183, "text": "Like if I was forced to marry a man, I'm like, I don't want to marry a man because I'm heterosexual."}, {"time": 7189, "text": "So you're forcing a kid into a situation where it's very dangerous."}, {"time": 7194, "text": "Long story short, this kid went in front of the Las Vegas Mormon temple and shot himself, killed himself."}, {"time": 7200, "text": "That impacted our community."}, {"time": 7201, "text": "Like, and not just that, but it was like severe bullying to LGBTQ kids in the 90s, it was especially different."}, {"time": 7210, "text": "Like there's still bullying, don't get me wrong, but man, like bullying in school, I don't really know actually what it's like in schools now."}, {"time": 7216, "text": "Maybe the bullying is just as bad as it was in the 90s, but there was like, it was like, I would hear all the time, like the F slur being slung out at people who were LGBTQ all the time and I wasn't even LGBTQ."}, {"time": 7233, "text": "So I, you know, it's just seeing that, I think that every, any social justice issue takes all sides."}, {"time": 7248, "text": "It takes all pieces of the puzzle."}, {"time": 7250, "text": "If only the pieces of the puzzle contributed are from the side that is affected, I don't believe that we'll ever have resolution."}, {"time": 7257, "text": "We're doing a shit job and we need to do better."}, {"time": 7265, "text": "So that was part of the reason I also have family who's LGBTQ and it's just something that's been part of my path."}, {"time": 7272, "text": "And I feel like I'm a big believer and take the path that is presented to you."}, {"time": 7276, "text": "And this was just something that came up in my life a lot."}, {"time": 7278, "text": "When I met my wife, she was living with her two best friends who were LGBTQ who really didn't want her to marry me because I was Mormon."}, {"time": 7285, "text": "And at the time it was prop eight, which was Mormons were fighting against LGBT gay marriage."}, {"time": 7291, "text": "And so that, then they didn't come to our wedding and that really broke my wife's heart."}, {"time": 7298, "text": "So it was just like, because Mormonism represented everything that was against their community."}, {"time": 7306, "text": "So you felt you had to say something."}, {"time": 7308, "text": "Yeah, I felt like by not saying anything, I was saying everything."}, {"time": 7312, "text": "I felt like by not speaking up and being like, hey, Dan Reynolds is Mormon singer."}, {"time": 7318, "text": "Here's this new band, Magic Dragons and they're Mormons."}, {"time": 7321, "text": "It was like, okay, well, what do Mormons represent?"}, {"time": 7323, "text": "They represent prop eight."}, {"time": 7324, "text": "What does prop eight represent?"}, {"time": 7326, "text": "Bigotry towards the LGBTQ community."}, {"time": 7330, "text": "Okay, I can speak in every interview and be like, well, that's not me."}, {"time": 7333, "text": "I don't believe that too."}, {"time": 7335, "text": "Or I could just be more active about it."}, {"time": 7337, "text": "And especially when it's affecting my family and friends throughout my entire life, it was like, all right, this seems like a path that you need to go down."}, {"time": 7345, "text": "So long story short is a path that just presented itself through things in my life."}, {"time": 7350, "text": "So just on that topic that religion and God give a lot of meaning to a lot of people."}, {"time": 7355, "text": "It gives a tradition that brings people together across the generations, but it also can hurt people."}, {"time": 7367, "text": "What do you make about that tension?"}, {"time": 7370, "text": "So source of meaning, but also a source of pain for people."}, {"time": 7376, "text": "The reality is, at least to me, again, this is just my reality."}, {"time": 7380, "text": "I feel like I'm doing my dad's thing every time I'm talking to him."}, {"time": 7383, "text": "Or I'm like, I don't really know, here's my two cents."}, {"time": 7385, "text": "You have become your father."}, {"time": 7390, "text": "The reality and it's my reality and it is the reality for sure is there's, I think that religion has brought a lot of hurt and pain to a lot of people."}, {"time": 7404, "text": "Absolutely it has."}, {"time": 7406, "text": "I don't think anybody can dispute that on either side, whether it's war, whether it's slaughtering of entire peoples, there's been a lot of pain and suffering that has come from religion."}, {"time": 7424, "text": "So my little thing that has been hard for me is a faith crisis, right?"}, {"time": 7427, "text": "I had religion and then I lost it and then I had nothing."}, {"time": 7430, "text": "So that's for me, I was like, well, religion did that to me, right?"}, {"time": 7435, "text": "But then at one point it's kind of like, how much of my life am I just gonna complain about being raised Mormon or being depressed?"}, {"time": 7444, "text": "As I get older, I'm like, okay, so what?"}, {"time": 7447, "text": "Okay, it's really hurt me, but were there any good things that came out of Mormonism?"}, {"time": 7452, "text": "Well, yeah, there's a lot of good things that have come to my family through Mormonism."}, {"time": 7456, "text": "Closeness, we're really, really close."}, {"time": 7458, "text": "Mormon culture is that you live together forever, right?"}, {"time": 7461, "text": "The teaching is that your families are forever."}, {"time": 7464, "text": "We die and then we go to heaven together and we're together forever."}, {"time": 7467, "text": "My family really believes that principle, all of them do."}, {"time": 7471, "text": "And that instills a certain way of living that's kind of beautiful, even if it's naivety."}, {"time": 7479, "text": "There's something kind of beautiful about believing that we're forming these bonds together as a family and that like, we're gonna be together forever."}, {"time": 7486, "text": "It brings a lot of comfort to a kid too."}, {"time": 7488, "text": "When I was little, I was like, wow, it's gonna be okay if I die because I get to see my mom again, you know what I mean?"}, {"time": 7493, "text": "I really believe that."}, {"time": 7495, "text": "Is the right answer that you tell that kid, actually when you die, you're not gonna see your mom again."}, {"time": 7501, "text": "Maybe, it might be, I don't know."}, {"time": 7504, "text": "And anybody who has a kid is gonna face that moment."}, {"time": 7508, "text": "I've already faced it where you sit down and my kid was like, hey dad, when you die, am I gonna see you again?"}, {"time": 7514, "text": "That was actually a really hard moment for me because I was suddenly faced with, okay, do I give the answer that I thought was bullshit?"}, {"time": 7522, "text": "Or do I give the answer of what I think it is?"}, {"time": 7525, "text": "Or do I give the real answer, which is, I don't know."}, {"time": 7529, "text": "And that's what I chose, which as a father, that's not always the easiest answer because your kid, it's a wonderful thing that you feel like you can give your kid the comfort of like, hey, your parents are gonna take care of everything."}, {"time": 7540, "text": "We know everything."}, {"time": 7541, "text": "We've been around."}, {"time": 7542, "text": "My kid's always like, are you the strongest?"}, {"time": 7543, "text": "I'm like, yeah, I am the strongest."}, {"time": 7545, "text": "I'm stronger than everybody."}, {"time": 7546, "text": "Yeah, I'm stronger than everybody."}, {"time": 7548, "text": "So when you're faced with that moment, it's like, it kind of sucks to tell your kid like, you know what?"}, {"time": 7555, "text": "I don't know if you're gonna see me after I die, but I hope."}, {"time": 7559, "text": "That's why I said, I was like, I don't know, but I hope."}, {"time": 7561, "text": "I really hope, because that would be awesome if we can hang out forever."}, {"time": 7566, "text": "And if there's any way for it to happen, I'll make it happen."}, {"time": 7569, "text": "That's kind of what my answer was."}, {"time": 7571, "text": "So long story short, sorry, I know that I'm being lengthy on this."}, {"time": 7575, "text": "Is there like, what is my thought on religion?"}, {"time": 7579, "text": "It's been here forever."}, {"time": 7580, "text": "It's coping."}, {"time": 7582, "text": "Maybe it's, I can't say whether it's true or false."}, {"time": 7584, "text": "How the hell am I supposed to know?"}, {"time": 7588, "text": "Like I've lived 34 years on this planet."}, {"time": 7591, "text": "A lot of people have been around a lot longer than me and they really believe very deeply."}, {"time": 7595, "text": "And a lot of them are smarter than me."}, {"time": 7598, "text": "Like I look at my older brothers, for instance, who are very practicing Mormons."}, {"time": 7603, "text": "These guys are hyper intelligent."}, {"time": 7605, "text": "My younger sister, hyper intelligent."}, {"time": 7607, "text": "All of them start smarter than me."}, {"time": 7609, "text": "They all believe it still."}, {"time": 7610, "text": "So what am I supposed to say?"}, {"time": 7612, "text": "Well, you're all stupid."}, {"time": 7614, "text": "Like you're all wrong."}, {"time": 7616, "text": "Like maybe it's the South Park episode where everybody dies and then they're like, well, the right answer was Mormonism."}, {"time": 7622, "text": "And everybody's like, aww."}, {"time": 7624, "text": "Like Mormons love that moment in South Park."}, {"time": 7628, "text": "They're like, hey, that day may come."}, {"time": 7629, "text": "That day may come."}, {"time": 7633, "text": "Yeah, so maybe I don't know is the honest answer for everybody around the table."}, {"time": 7638, "text": "But the biggest question for which I don't know is the right answer is what's the meaning of this whole thing?"}, {"time": 7649, "text": "No, you're not allowed to say I don't know."}, {"time": 7653, "text": "You can be just like your dad and say, let me just give my two cents."}, {"time": 7658, "text": "Take it or leave it."}, {"time": 7660, "text": "Whatever it's worth, take it or leave it."}, {"time": 7661, "text": "It's probably worth nothing."}, {"time": 7662, "text": "It's piddled on the ground."}, {"time": 7664, "text": "I mean, why are we here?"}, {"time": 7670, "text": "It's just busily creating all these kinds of things, worrying about things, having kids."}, {"time": 7679, "text": "My purpose, at least right now, is to wake up and try to to bring light love to the world, light love to myself and have integrity."}, {"time": 7698, "text": "That's my purpose."}]}]