[{"title": "Cal Newport: Deep Work, Focus, Productivity, Email, and Social Media | Lex Fridman Podcast #166", "id": "y3Umo_jd5AA", "quotes": [{"time": 256, "text": "Like I often feel for many reasons, like a fraud, but I definitely feel like a fraud when I hang out with like either mathematicians or physicists."}, {"time": 265, "text": "It's like, it feels like they're doing the legit work because when you talk closer in computer science, you get to programming or like machine learning, like the experimental machine learning or like just the engineering version of it."}, {"time": 281, "text": "It feels like you're gone so far away from what's required to solve something fundamental about this universe."}, {"time": 289, "text": "It feels like you're just like cheating your way into like some kind of trick to figure out how to solve a problem in this one particular case."}, {"time": 299, "text": "I'd be interested to hear what you think about that because programming doesn't always feel like you need to think deeply to work deeply, but sometimes it does."}, {"time": 312, "text": "So it's a weird dance."}, {"time": 314, "text": "For sure code does, right?"}, {"time": 315, "text": "I mean, especially if you're coming up with original algorithmic designs, I think it's a great example of deep work."}, {"time": 322, "text": "I mean, yeah, the hardcore theoreticians, they push it to an extreme."}, {"time": 326, "text": "I mean, I think it's like knowing that athletic endeavor is good and then hanging out with a Olympic athlete, you're like, oh, I see that's what it is."}, {"time": 335, "text": "Now for the grad students like me, we're not anywhere near that level, but the faculty in that group, these were the cognitive Olympic athletes."}, {"time": 344, "text": "But coding I think is a classic example of deep work because I got this problem I wanna solve, I have all of these tools and I have to combine them somehow creatively and on the fly."}, {"time": 356, "text": "But so basically I had been exposed to that."}, {"time": 359, "text": "So I was used to this notion when I was in grad school and I was writing my blog, I'd write about hard focus."}, {"time": 363, "text": "That was the term I used."}, {"time": 365, "text": "Then I published this book, So Good They Can't Ignore You, which came out in 2012."}, {"time": 369, "text": "So like right as I began as a professor."}, {"time": 372, "text": "And that book had this notion of skill being really important for career satisfaction, that it's not just following your passion."}, {"time": 379, "text": "You have to actually really get good at something and then you use that skills as leverage."}, {"time": 382, "text": "And there was this big followup question to that book of, okay, well, how do I get really good at things?"}, {"time": 387, "text": "And then I look back to my grad school experience, I was like, huh, there was this focus thing that we used to do."}, {"time": 392, "text": "And I wonder how generally applicable that is into the knowledge sector."}, {"time": 396, "text": "And so as I started thinking about it, it became clear, there's this interesting storyline that emerged that, okay, actually undistracted concentration is not just important for esoteric theoreticians, it's important here, it's important here, it's important here."}, {"time": 408, "text": "And that involved into the deep work hypothesis, which is across the whole knowledge work sector."}, {"time": 415, "text": "Focus is very important and we've accidentally created circumstances where we just don't do a lot of it."}, {"time": 420, "text": "So focus is the sort of prerequisite for basically, you say knowledge work, but basically any kind of skill acquisition, any kind of major effort in this world."}, {"time": 429, "text": "Can we break that apart a little bit?"}, {"time": 431, "text": "Yeah, so a key aspect of focus is not just that you're concentrating hard on something, but you do it without distraction."}, {"time": 440, "text": "So a big theme of my work is that context shifting kills the human capacity to think."}, {"time": 447, "text": "So if I change what I'm paying attention to to something different, really, even if it's brief and then try to bring it back to the main thing I'm doing, that causes a huge cognitive pile up that makes it very hard to think clearly."}, {"time": 458, "text": "So even if you think, okay, look, I'm writing this code or I'm writing this essay and I'm not multitasking and all my windows are closed and I have no notifications on, but every five or six minutes you quickly check like an inbox or your phone, that initiates a context shift in your brain, right?"}, {"time": 474, "text": "We're gonna start to suppress some neural networks, we're gonna try to amplify some others."}, {"time": 477, "text": "It's a pretty complicated process actually."}, {"time": 479, "text": "There's a sort of neurological cascade that happens."}, {"time": 482, "text": "You rip yourself away from that halfway through and go back to what you're doing and now it's trying to switch back to the original thing even though it's also your brain's in the process of switching to these emails and trying to understand those contexts."}, {"time": 491, "text": "And as a result, your ability to think clearly just goes really down."}, {"time": 496, "text": "And it's fatiguing too."}, {"time": 497, "text": "I mean, you do this long enough and you get midday and you're like, okay, I can't think anymore."}, {"time": 502, "text": "You've exhausted yourself."}, {"time": 503, "text": "Is there some kind of perfect number of minutes, would you say?"}, {"time": 508, "text": "So we're talking about focusing on a particular task for one minute, five minutes, 10 minutes, 30 minutes."}, {"time": 517, "text": "Is it possible to kind of context switch while maintaining deep focus every 20 minutes or so?"}, {"time": 524, "text": "So if you're thinking of like this, again, maybe it's a selfish kind of perspective, but if you think about programming, you're focused on a particular design of a little bit, maybe a small scale on a particular function or large scale on a system."}, {"time": 539, "text": "And then the shift of focus happens like this, which is like, wait a minute, is there a library that can achieve this little task or something like that?"}, {"time": 548, "text": "And then you have to look it up."}, {"time": 550, "text": "This is the danger zone."}, {"time": 551, "text": "You go to the internets."}, {"time": 553, "text": "And so you have to, now it is a kind of context switch because as opposed to thinking about the particular problem, you now have switch thinking about like consuming and integrating knowledge that's out there that can plug into your solution to a particular problem."}, {"time": 571, "text": "It definitely feels like a context switch, but is that a really bad thing to do?"}, {"time": 575, "text": "So should you be setting it aside always and really trying to as much as possible go deep and stay there for like a really long period of time?"}, {"time": 585, "text": "Well, I mean, I think if you're looking up a library that's relevant to what you're doing, that's probably okay."}, {"time": 591, "text": "And I don't know that I would count that as a full context shift because the semantic networks involved are relatively similar, right?"}, {"time": 598, "text": "You're thinking about this type of solution."}, {"time": 600, "text": "You're thinking about coding."}, {"time": 601, "text": "You're thinking about this type of functions."}, {"time": 603, "text": "Where you're really gonna get hit is if you switch your context to something that's different."}, {"time": 608, "text": "And if there's unresolved obligations."}, {"time": 609, "text": "So really the worst possible thing you could do would be to look at like an email inbox, right?"}, {"time": 614, "text": "Cause here's 20 emails."}, {"time": 616, "text": "I can't answer most of these right now."}, {"time": 618, "text": "They're completely different."}, {"time": 619, "text": "Like the context of these emails, like, okay, there's a grant funding issue or something like this."}, {"time": 623, "text": "It's very different than the coding I'm doing."}, {"time": 625, "text": "And I'm leaving it unresolved."}, {"time": 627, "text": "So like someone needs something from me and I'm gonna try to pull my attention back."}, {"time": 630, "text": "The second worst would be something that's emotionally arousing."}, {"time": 633, "text": "So if you're like, let me just glance over at Twitter."}, {"time": 635, "text": "I'm sure it's nice and calm and peaceful over there, right?"}, {"time": 637, "text": "That could be devastating because you're gonna expose yourself to something that's emotionally arousing."}, {"time": 641, "text": "That's gonna completely mess up the cognitive plateau there."}, {"time": 643, "text": "And then when you come back to, okay, let me try to code again."}, {"time": 646, "text": "It's really difficult."}, {"time": 647, "text": "So it's both the information and the emotion."}, {"time": 650, "text": "Yeah, both can be killers if what you're trying to do."}, {"time": 653, "text": "So I would recommend at least an hour at a time because it could take up to 20 minutes to completely clear out the residue from whatever it was you were thinking about before."}, {"time": 662, "text": "So if you're coding for 30 minutes, you might only be getting 10 or 15 minutes of actual sort of peak lacks going on there, right?"}, {"time": 668, "text": "So an hour at least you get a good 40, 45 minutes plus."}, {"time": 671, "text": "I'm partial to 90 minutes as a really good chunk."}, {"time": 675, "text": "We can get a lot done."}, {"time": 676, "text": "But just before you get exhausted, you can sort of pull back a little bit."}, {"time": 681, "text": "Yeah, and one of the beautiful, people can read about it in your book, Deep Work."}, {"time": 687, "text": "And I know this has been out for a long time and people are probably familiar with many of the concepts, but it's still pretty profound and it has stayed with me for a long time."}, {"time": 696, "text": "There's something about adding the terms to it that actually solidifies the concepts."}, {"time": 702, "text": "Like words matter, it's pretty cool."}, {"time": 704, "text": "And just for me, sort of as a comment, there's, it's a struggle and it's very difficult to maintain focus for a prolonged period of time."}, {"time": 716, "text": "But the days on which I'm able to accomplish several hours of that kind of work, I'm happy."}, {"time": 723, "text": "So forget being productive and all that."}, {"time": 725, "text": "I'm just satisfied with my life."}, {"time": 727, "text": "I feel fulfilled, it's like joyful."}, {"time": 731, "text": "And then I can be, I'm less of a dick to other people in my life afterwards."}, {"time": 739, "text": "And I find the opposite when I don't do that kind of thing, I'm much more irritable."}, {"time": 745, "text": "Like I feel like I didn't accomplish anything and there's this stress that then the negative emotion builds up to where you're no longer able to sort of enjoy the hell out of this amazing life."}, {"time": 755, "text": "So in that sense, Deep Work has been a source of a lot of happiness."}, {"time": 759, "text": "I'd love to ask you, how do you, again, you cover this in the book, but how do you integrate Deep Work into your life?"}, {"time": 766, "text": "What are different scheduling strategies that you would recommend just at a high level?"}, {"time": 771, "text": "What are different ideas there?"}, {"time": 772, "text": "Well, I mean, I'm a big fan of time blocking, right?"}, {"time": 775, "text": "So if you're facing your workday, don't allow like your inbox or a to do list to sort of drive you."}, {"time": 782, "text": "Don't just come into your day and think, what do I wanna do next?"}, {"time": 785, "text": "I mean, I'm a big planner saying, here's the time available, let me make a plan for it."}, {"time": 791, "text": "So I have a meeting here, I have an appointment here, here's what's left, what do I actually wanna do with it?"}, {"time": 795, "text": "So in this half hour, I'm gonna work on this."}, {"time": 797, "text": "For this 90 minute block, I'm gonna work on that."}, {"time": 799, "text": "And during this hour, I'm gonna try to fit this in."}, {"time": 801, "text": "And then actually I have this half hour gap between two meetings."}, {"time": 803, "text": "So why don't I take advantage of that to go run five errands, I can kind of batch those together."}, {"time": 807, "text": "But blocking out in advance, this is what I wanna do with the time available."}, {"time": 812, "text": "I mean, I find that's much more effective."}, {"time": 813, "text": "Now, once you're doing this, once you're in a discipline of time blocking, it's much easier to actually see, this is where I want, for example, the Deep Work."}, {"time": 820, "text": "And I can get a handle on the other things that need to happen and find better places to fit them so I can prioritize this."}, {"time": 826, "text": "And you're gonna get a lot more of that done than if it's just going through your day and saying, what's next?"}, {"time": 831, "text": "I schedule every single day kind of thing."}, {"time": 833, "text": "So as I could try to do in the morning to try to have a plan."}, {"time": 837, "text": "Yeah, so I do a quarterly, weekly, daily planning."}, {"time": 840, "text": "So at the semester or quarterly level, I have a big picture vision for what I'm trying to get done during the fall, let's say, or during the winter."}, {"time": 848, "text": "Like there's a deadline coming up for academic papers at the end of the season, here's what I'm working on."}, {"time": 853, "text": "I wanna have this many chapters done of a book, something like this."}, {"time": 856, "text": "Like you have the big picture vision of what you wanna get done."}, {"time": 860, "text": "Then weekly, you look at that, and then you look at your week and you put together a plan for like, okay, what's my week gonna look like?"}, {"time": 867, "text": "What do I need to do?"}, {"time": 868, "text": "How am I gonna make progress on these things?"}, {"time": 869, "text": "Maybe I need to do an hour every morning or I see that Monday is my only really empty day."}, {"time": 874, "text": "So that's gonna be the day that I really need to nail on writing or something like this."}, {"time": 878, "text": "And then every day, you look at your weekly plan and say, let me block off the actual hours."}, {"time": 882, "text": "So you do that three scales, the quarterly, down to weekly, down to daily."}, {"time": 887, "text": "And we're talking about actual times of day versus, so the alternative is what I end up doing a lot, and I'm not sure it's the best way to do it, is scheduling the duration of time."}, {"time": 901, "text": "This is called the luxury when you don't have any meetings."}, {"time": 904, "text": "I'm like, religiously don't do meetings."}, {"time": 907, "text": "All other academics are jealous of you, by the way."}, {"time": 911, "text": "No Zoom meetings."}, {"time": 913, "text": "I find those are, that's one of the worst tragedies of the pandemic, is both the opportunity to, the positive thing is to have more time with your family, sort of reconnect in many ways."}, {"time": 929, "text": "Be able to remotely sort of not waste time on travel and all those kinds of things."}, {"time": 935, "text": "The negative is, actually both those things are also sourced from the negative."}, {"time": 940, "text": "But the negative is like, it seems like people have multiplied the number of meetings because they're so easy to schedule."}, {"time": 946, "text": "And there's nothing more draining to me intellectually, philosophically, just my spirit is destroyed by even a 10 minute Zoom meeting."}, {"time": 957, "text": "Like, what are we doing here?"}, {"time": 961, "text": "Yeah, I have, every Zoom meeting is, I have an existential crisis, so."}, {"time": 965, "text": "Kierkegaard with the internet connection."}, {"time": 968, "text": "So, what the hell are we talking about?"}, {"time": 973, "text": "Oh, so when you don't have meetings, there's a luxury to really allow for certain things if they need to, like the important things, like deep work sessions to last way longer than you maybe planned for."}, {"time": 990, "text": "I mean, that's my goal is to try to schedule, the goal is to schedule, to sit and focus for a particular task for an hour and hope I can keep going and hope I can get lost in it."}, {"time": 1001, "text": "And do you find that this is at all an okay way to go and the time blocking is just something you have to do to actually be an adult and operate in this real world?"}, {"time": 1014, "text": "Or is there some magic to the time blocking?"}, {"time": 1017, "text": "Well, I mean, there's magic to the intention."}, {"time": 1021, "text": "There's magic to it if you have varied responsibilities."}, {"time": 1025, "text": "So I'm often juggling multiple jobs, essentially."}, {"time": 1028, "text": "There's academic stuff, there's teaching stuff, there's book stuff, there's the business surrounding my book stuff."}, {"time": 1036, "text": "But I'm of your same mindset."}, {"time": 1038, "text": "If a deep work session is going well, you just rock and roll and let it go on."}, {"time": 1044, "text": "So like one of the big keys of time block, at least the way I do it, so I even sell this planner to help people time block, it has many columns because the discipline is, oh, if your initial schedule changes, you just move over one."}, {"time": 1056, "text": "Next time you get a chance, you move over one column and then you just fix it for the time that's remaining."}, {"time": 1061, "text": "So in other words, there's no bonus for I made a schedule and I stuck with it."}, {"time": 1066, "text": "Like there's actually, it's not like you get a prize for it, right?"}, {"time": 1068, "text": "Like for me, the prize is I have an intentional plan for my time and if I have to change that plan, that's fine."}, {"time": 1074, "text": "Like the state I wanna be is basically at any point in the day, I've thought about what time remains and gave it some thought for what to do because I'll do the same thing, even though I have a lot more meetings and other types of things I have to do in my various jobs and I basically prioritize the deep work and they get yelled at a lot."}, {"time": 1091, "text": "So that's kind of my strategy is like, just be okay, just be okay getting yelled at a lot because I feel you, if you're rolling, yeah."}, {"time": 1122, "text": "So I'm willing to get yelled at by almost everyone."}, {"time": 1125, "text": "Of course, there is also a positive effect to pulling yourself out of it when things are going great because then you're kind of excited to resume."}, {"time": 1136, "text": "Like stopping on a dead end."}, {"time": 1143, "text": "There's an extra force of procrastination that comes with if you stop on a dead end to return to the task."}, {"time": 1148, "text": "Yeah, or a cold start."}, {"time": 1151, "text": "Whenever I feel like I'm in a stage now, I submitted a few papers recently."}, {"time": 1155, "text": "So now we're sort of starting something up from cold and it takes way too long to get going because it's very hard to get the motivation to schedule a time when it's not, yeah, we're in it."}, {"time": 1165, "text": "Like here's where we are."}, {"time": 1166, "text": "We feel like something's about to give here."}, {"time": 1168, "text": "We need the very early stages where it's just, I don't know, I'm gonna read hard papers and it's gonna be hard to understand them and I'm gonna have no idea how to make progress."}, {"time": 1175, "text": "It's not motivating."}, {"time": 1179, "text": "Can we, okay, so this is like a therapy session."}, {"time": 1186, "text": "It seems like I only get stuff done that has deadlines."}, {"time": 1190, "text": "And so one of the implied powerful things about time blocking is there's a kind of deadline or there's a artificial or real sense of urgency."}, {"time": 1199, "text": "Do you think it's possible to get anything done in this world without deadlines?"}, {"time": 1204, "text": "Why do deadlines work so well?"}, {"time": 1206, "text": "Well, I mean, it's a clear motivational signal, but in the short term, you do get an effect like that in time blocking."}, {"time": 1212, "text": "I think the strong effect you get by saying, this is the exact time I'm gonna work on this, is that you don't have the debate with yourself every three minutes about, should I take a break now?"}, {"time": 1223, "text": "This is the big issue with just saying, I'm gonna go write."}, {"time": 1226, "text": "I'm gonna write for a while and that's it because your mind is saying, well, obviously we're gonna take some breaks."}, {"time": 1230, "text": "We're not just gonna write forever."}, {"time": 1232, "text": "And so why not right now?"}, {"time": 1234, "text": "You have to be like, well, not right now."}, {"time": 1235, "text": "Let's go a little bit longer, five minutes."}, {"time": 1236, "text": "So why don't we just take a break now?"}, {"time": 1237, "text": "We should probably look at the internet."}, {"time": 1238, "text": "Now you have to constantly have this battle."}, {"time": 1240, "text": "On the other hand, if you're in a time block schedule, I've got these two hours put aside for writing."}, {"time": 1244, "text": "That's what I'm supposed to be doing."}, {"time": 1246, "text": "I have a break scheduled over here."}, {"time": 1248, "text": "I don't have to fight with myself, right?"}, {"time": 1250, "text": "And maybe at a larger scale, deadlines give you a similar sort of effect."}, {"time": 1253, "text": "I know this is what I'm supposed to be working on because it's due."}, {"time": 1257, "text": "Perhaps, but will you describe it as much healthier sort of giving yourself over, and you talk about this in the new email book, the process, I mean, in general, you talk about it all over, is creating a process and then giving yourself over to the process."}, {"time": 1275, "text": "But then you have to be strict with yourself."}, {"time": 1277, "text": "Yeah, but what are the deadlines you're talking about?"}, {"time": 1279, "text": "It's like with papers, like what's the main type of deadline work?"}, {"time": 1284, "text": "Well, so papers, definitely, but publications, like say this podcast, I have to publish this podcast early next week, one, because your book is coming out."}, {"time": 1296, "text": "I'd love to sort of support this amazing book, but the other is I have to fly to Vegas on Thursday to run 40 miles with David Goggins."}, {"time": 1307, "text": "And so I want this podcast, this conversation we're doing now to be out of my life."}, {"time": 1314, "text": "Like I don't wanna be in a hotel in Vegas, like freaking out while David Goggins is yelling."}, {"time": 1320, "text": "On hour 43 of your Tarathon thing."}, {"time": 1325, "text": "But actually it's possible that I still will be doing that because that's not a hard, that's a softer deadline, right?"}, {"time": 1331, "text": "But those are sort of, life imposes these kinds of deadlines."}, {"time": 1336, "text": "I'm not, so yeah, papers are nice because there's an actual deadline."}, {"time": 1340, "text": "But I am almost referring to like the pressure that people put on you."}, {"time": 1345, "text": "Hey man, you said you're gonna get this done two months ago."}, {"time": 1348, "text": "Why haven't you gotten it done?"}, {"time": 1350, "text": "I don't see, I don't like that pressure."}, {"time": 1352, "text": "First of all, I think we can all."}, {"time": 1353, "text": "I hate it too."}, {"time": 1354, "text": "We can agree, by the way, having David Goggins yell at you is probably the top productivity technique."}, {"time": 1359, "text": "I think we'd all get a lot more done if he was yelling, but see, I don't like that."}, {"time": 1365, "text": "So I will try to get things done early."}, {"time": 1367, "text": "I like having flex."}, {"time": 1369, "text": "I also don't like the idea of this has to get done today."}, {"time": 1373, "text": "Like it's due at midnight and we've got a lot to do as the night before, because then I get in my head about what if I get sick?"}, {"time": 1379, "text": "Or like, what if, you know, what if I don't get a bad night's sleep and I can't think clearly?"}, {"time": 1384, "text": "So I like to have the flex."}, {"time": 1385, "text": "So I'm all process."}, {"time": 1387, "text": "And that's like the philosophical aspect of that book, Deep Work, is that there's something very human and deep about just wrangling with the world of ideas."}, {"time": 1395, "text": "I mean, Aristotle talked about this."}, {"time": 1396, "text": "If you go back and read the ethics, he's trying to understand the meaning of life and he eventually ends up ultimately at the human capacity to contemplate deeply."}, {"time": 1406, "text": "It's kind of like a teleological argument."}, {"time": 1407, "text": "It's the things that only humans can do and therefore it must be somehow connected to our ends."}, {"time": 1411, "text": "And he said, ultimately that's where he found his meaning, but, you know, he's touching on some sort of intimation there that's correct."}, {"time": 1417, "text": "And so what I try to build my life around is regularly thinking hard about stuff that's interesting."}, {"time": 1424, "text": "Just like if you get a fitness habit going, you feel off when you don't do it."}, {"time": 1430, "text": "I try to get that cognitive habit."}, {"time": 1431, "text": "So it's like, I got it."}, {"time": 1432, "text": "I mean, look, I have my bag here somewhere, I have my notebook in it because I was thinking on the Uber ride over, I was like, you know, I could get some, I'm working on this new proof and it just, so you train yourself."}, {"time": 1442, "text": "You train yourself to appreciate certain things."}, {"time": 1444, "text": "And then over time, the hope is that it accretes."}, {"time": 1448, "text": "Well, let's talk about some demons because I wonder there's like deep work, which and the world without email books that to me symbolize the life I want to live."}, {"time": 1464, "text": "And then there is, I'm like, despite appearances and adult at this point, and this is the life I actually live."}, {"time": 1473, "text": "And I'm in constant chaos."}, {"time": 1476, "text": "You said you don't like that anxiety."}, {"time": 1478, "text": "But it seems like I'm always in it."}, {"time": 1481, "text": "It's a giant mess."}, {"time": 1482, "text": "It's like, it's almost like whenever I establish, whenever I have successful processes for doing deep work, I'll add stuff on top of it just to introduce the chaos."}, {"time": 1492, "text": "And like, I don't want to."}, {"time": 1494, "text": "But you have to look in the mirror at a certain point and you have to say like, who the hell am I?"}, {"time": 1500, "text": "Like, I keep doing this."}, {"time": 1502, "text": "Is this something that's fundamental to who I am or do I really need to fix this?"}, {"time": 1506, "text": "What's the chaos right now?"}, {"time": 1507, "text": "Like, I've seen your video about like your routine."}, {"time": 1509, "text": "It seemed very structured and deep."}, {"time": 1512, "text": "In fact, I was really envious of it."}, {"time": 1513, "text": "So like, what's the chaos now that's not in that video?"}, {"time": 1517, "text": "Many of those sessions go way longer."}, {"time": 1519, "text": "I don't get enough sleep."}, {"time": 1521, "text": "And then I, the main introduction of chaos is, it's taking on too many things on the to do list."}, {"time": 1527, "text": "It's, I mean, I suppose it's a problem that everybody deals with, which is saying, not saying no."}, {"time": 1533, "text": "But it's not like I have trouble saying no."}, {"time": 1536, "text": "It's that there's so much cool shit in my life."}, {"time": 1539, "text": "Okay, listen, there's nothing I love more in this world than the Boston Dynamics robots."}, {"time": 1545, "text": "Spot and the other, yeah."}, {"time": 1546, "text": "And they're giving me spot."}, {"time": 1548, "text": "So there's a to do, what am I gonna say?"}, {"time": 1552, "text": "So they're getting me spot and I wanna do some computer vision stuff for the hell of it."}, {"time": 1555, "text": "Okay, so that's now a to do item."}, {"time": 1557, "text": "And then you go to Texas for a while."}, {"time": 1559, "text": "There's Texas."}, {"time": 1560, "text": "Everything's happening."}, {"time": 1560, "text": "There's all the interesting people down there."}, {"time": 1562, "text": "And then there's surprises, right?"}, {"time": 1563, "text": "There are power outages in Texas."}, {"time": 1565, "text": "There's constant changes to plans and all those kinds of things."}, {"time": 1568, "text": "And you sleep less."}, {"time": 1569, "text": "And then there's personal stuff, like just people in your life, sources of stress, all those kinds of things."}, {"time": 1576, "text": "But it does feel like if I'm just being introspective, that I bring it onto myself."}, {"time": 1582, "text": "I suppose a lot of people do this kind of thing."}, {"time": 1585, "text": "Is they flourish under pressure."}, {"time": 1590, "text": "And I wonder if that's just a hack I've developed as a habit early on in life that you need to let go of, you need to fix."}, {"time": 1602, "text": "But it's all interesting things."}, {"time": 1605, "text": "Yeah, because these are all interesting things."}, {"time": 1607, "text": "Well, one of the things you talked about in Deep Work, which is really important, is having an end to the day."}, {"time": 1614, "text": "Like putting it down."}, {"time": 1616, "text": "Like that, I don't think I've ever done that in my life."}, {"time": 1619, "text": "Well, see, I started doing that early because I got married early."}, {"time": 1624, "text": "So I didn't have a real job."}, {"time": 1625, "text": "I was a grad student, but my wife had a real job."}, {"time": 1627, "text": "And so I just figured I should do my work when she's at work."}, {"time": 1632, "text": "Because hey, when work's over, she'll be home, and I don't wanna be on campus or whatever."}, {"time": 1637, "text": "And so real early on, I just got in that habit of this is when you end work."}, {"time": 1642, "text": "And then when I was a postdoc, which is kind of an easy job, right?"}, {"time": 1646, "text": "I put artificial, I was like, I wanna train."}, {"time": 1649, "text": "I was like, when I'm a professor, it's gonna be busier because there's demands that professors have beyond research."}, {"time": 1654, "text": "And so as a postdoc, I added artificial large time consuming things into the middle of my day."}, {"time": 1658, "text": "I basically exercise for two hours in the middle of the day and do all this productive meditation and stuff like this, while still maintaining the nine to five."}, {"time": 1666, "text": "So it's like, okay, I wanna get really good at putting artificial constraints on so that I stay, I didn't wanna get flabby when my job was easy."}, {"time": 1674, "text": "So that when I became a professor, and now all of that's paying off because I have a ton of kids."}, {"time": 1679, "text": "So now I don't really have a choice."}, {"time": 1681, "text": "That's what's probably keeping me away from cool things is I just don't have time to do them."}, {"time": 1686, "text": "And then after a while people stop bothering."}, {"time": 1689, "text": "Well, but that's how you have a successful life."}, {"time": 1693, "text": "Otherwise you're going to, it's too easy to then go into the full Hunter S. Thompson."}, {"time": 1697, "text": "Like to where nobody wants, nobody functional wants to be in your vicinity."}, {"time": 1705, "text": "Like you're driving, you attract the people that have a similar behavior pattern as you."}, {"time": 1713, "text": "So if you live in chaos, you're going to attract chaotic people."}, {"time": 1717, "text": "And then it becomes like this self fulfilling prophecy."}, {"time": 1722, "text": "And it feels like I'm not bothered by it, but I guess this is all coming around to exactly what you're saying, which is like, I think one of the big hacks for productive people that I've met is to get married and have kids, honestly."}, {"time": 1737, "text": "It's very perhaps counterintuitive, but it gets, it's like the ultimate timetable enforcer."}, {"time": 1745, "text": "Yeah, it enforces a lot of timetables, though it has a huge, kids have a huge productivity hit those, you gotta weigh it."}, {"time": 1753, "text": "But okay, here's the complicated thing though."}, {"time": 1755, "text": "Like you could think about in your own life, starting the podcast as one of these just cool opportunities that you put on yourself, right?"}, {"time": 1762, "text": "Like I could have been talking to you at MIT four years ago and be like, don't do that."}, {"time": 1765, "text": "Like your research is going well, right?"}, {"time": 1768, "text": "But then everyone who watches you is like, okay, this podcast is, the direction that's taking you is like a couple of years from now, it's gonna, it'll be something really monumental that you're probably, that's gonna probably lead to, right?"}, {"time": 1778, "text": "There'll be some really, it just feels like your life is going somewhere."}, {"time": 1781, "text": "It's going somewhere."}, {"time": 1783, "text": "Unexpected, yeah."}, {"time": 1784, "text": "Yeah, so how do you balance those two things?"}, {"time": 1786, "text": "And so what I try to throw at it is this motto of do less, do better, know why, right?"}, {"time": 1790, "text": "So do less, do better, know why."}, {"time": 1795, "text": "It used to be the motto of my website years ago."}, {"time": 1798, "text": "So do a few things, but like an interesting array, right?"}, {"time": 1801, "text": "So I was doing MIT stuff, but I was also writing, you know?"}, {"time": 1806, "text": "So a couple of things are, you know, they were interesting."}, {"time": 1808, "text": "Like I have a couple bets placed on a couple of different numbers on the roulette table, but not too many things."}, {"time": 1814, "text": "And then really try to do those things really well and see where it goes."}, {"time": 1816, "text": "Like with my writing, I just spent years and years and years just training."}, {"time": 1819, "text": "I was like, I wanna be a better writer, I wanna be a better writer."}, {"time": 1821, "text": "I started writing student books when I was a student."}, {"time": 1824, "text": "I really wanted to write hardcover idea books."}, {"time": 1825, "text": "I started training."}, {"time": 1826, "text": "I would use like New Yorker articles to train myself."}, {"time": 1830, "text": "I'd break them down and then I'd get commissions with much smaller magazines and practice the skills."}, {"time": 1834, "text": "And it took forever until, you know, but now today, like I actually get to write for the New Yorker, but it took like a decade."}, {"time": 1840, "text": "So a small number of things, try to do them really well."}, {"time": 1842, "text": "And then the know why is have a connection to some sort of value."}, {"time": 1845, "text": "Like in general, I think this is worth doing and then seeing where it leads."}, {"time": 1850, "text": "And so the choice of the few things is grounded in what?"}, {"time": 1855, "text": "Like a little flame of passion, like a love for the thing, like a sense that you say you wanted to write, get good at writing."}, {"time": 1864, "text": "You had that kind of introspective moment of thinking, this actually brings me a lot of joy and fulfillment."}, {"time": 1870, "text": "Yeah, I mean, it gets complicated because I wrote a whole book about following your passion being bad advice, which is like the first thing I kind of got infamous for."}, {"time": 1878, "text": "I wrote that back in 2012."}, {"time": 1880, "text": "But the argument there is like passion cultivates, right?"}, {"time": 1883, "text": "So what I was pushing back on was the myth that the passion for what you do exists full intensity before you start, and then that's what propels you."}, {"time": 1892, "text": "Or actually the reality is as you get better at something, as you gain more autonomy, more skill and more impact, the passion grows along with it."}, {"time": 1898, "text": "So that when people look back later and say, oh, follow your passion, what they really mean is I'm very passionate about what I do, and that's a worthy goal."}, {"time": 1907, "text": "But how you actually cultivate that is much more complicated than just introspection is gonna identify, like for sure you should be a writer or something like this."}, {"time": 1914, "text": "So I was actually quoting you."}, {"time": 1915, "text": "I was on a social network last night in a clubhouse."}, {"time": 1920, "text": "I don't know if you've heard of it."}, {"time": 1921, "text": "Wait, I have to ask you about this because I'm invited to do a clubhouse."}, {"time": 1927, "text": "A tech reporter has invited me to do a clubhouse about my new book."}, {"time": 1932, "text": "Well, let me know when, because I'll show up."}, {"time": 1934, "text": "But what is it?"}, {"time": 1935, "text": "Okay, so first of all, let me just mention that I was in a clubhouse room last night, and I kept plugging exactly what you said about passion."}, {"time": 1944, "text": "So we'll talk about it."}, {"time": 1945, "text": "It was a room that was focused on burnout."}, {"time": 1949, "text": "But first, clubhouse is a kind of fascinating place in terms of your mind would be very interesting to analyze this place because we talk about email, talk about social networks, but clubhouse is something very different."}, {"time": 1965, "text": "And I've encountered it in other places, Discord and so on, that's voice only communication."}, {"time": 1972, "text": "So it's a bunch of people in a room."}, {"time": 1973, "text": "They're just, their eyes closed."}, {"time": 1976, "text": "All you hear is their voices."}, {"time": 1977, "text": "In real time."}, {"time": 1978, "text": "Real time, live."}, {"time": 1979, "text": "It only happens live."}, {"time": 1981, "text": "You're technically not allowed to record, but some people still do, and especially when it's big conversations."}, {"time": 1987, "text": "But the whole point is it's there live."}, {"time": 1989, "text": "And there's different structures."}, {"time": 1990, "text": "Like on Discord, it was so fascinating."}, {"time": 1993, "text": "I have this Discord server that would have hundreds of people in a room together, right?"}, {"time": 1999, "text": "We're all just little icons that can mute and unmute our mics."}, {"time": 2003, "text": "And so you're sitting there, so it's just voices, and you're able with hundreds of people to not interrupt each other."}, {"time": 2013, "text": "Well, first of all, like as a dynamic system, like."}, {"time": 2017, "text": "You see icons just like mics muted or not muted basically."}, {"time": 2020, "text": "Yeah, well, so everyone's muted and they unmute and it starts flashing."}, {"time": 2024, "text": "Oh, so you're like, okay, let me get precedence."}, {"time": 2028, "text": "So it's the digital equivalent of when you're in a conversation, like at a faculty meeting, and you sort of like kind of make some noises, like while the other person's finishing."}, {"time": 2036, "text": "And so people realize like, okay, this person wants to talk next, but now it's purely digital."}, {"time": 2040, "text": "You see a flashing."}, {"time": 2041, "text": "But in a faculty meeting, which is very interesting, like even as we're talking now, there's a visual element that seems to increase the probability of interruption."}, {"time": 2052, "text": "It's just darkness."}, {"time": 2053, "text": "You actually listen better and you don't interrupt."}, {"time": 2057, "text": "So like if you create a culture, there's always gonna be assholes, but they're actually exceptions."}, {"time": 2063, "text": "Everybody adjusts."}, {"time": 2064, "text": "They kind of evolve to the beat of the room."}, {"time": 2068, "text": "Okay, that's one fascinating aspect."}, {"time": 2070, "text": "It's like, okay, that's weird."}, {"time": 2072, "text": "Cause it's different than like a Zoom call where there's video."}, {"time": 2076, "text": "It's just audio."}, {"time": 2078, "text": "You think video adds, but actually seems like it subtracts."}, {"time": 2082, "text": "The second aspect of it that's fascinating is when it's no video, just audio, there's an intimacy."}, {"time": 2091, "text": "Because with strangers, you connect in a much more real way."}, {"time": 2097, "text": "It's similar to podcasts."}, {"time": 2099, "text": "But with a lot of people."}, {"time": 2101, "text": "With a lot of people and new people."}, {"time": 2103, "text": "And they bring, okay, first of all, different voices, like low voices and like high voices."}, {"time": 2110, "text": "And it's more difficult to judge."}, {"time": 2114, "text": "In Discord, you couldn't even see the people."}, {"time": 2118, "text": "It was a culture where you do funny profile pictures as opposed to your actual face."}, {"time": 2123, "text": "In clubhouse, it's your actual face."}, {"time": 2124, "text": "So you can tell like as an older person, younger person."}, {"time": 2127, "text": "In Discord, you couldn't."}, {"time": 2128, "text": "You just have to judge based on the voice."}, {"time": 2131, "text": "But there's something about the listening and the intimacy of being surprised by different strangers that feels almost like a party with friends."}, {"time": 2143, "text": "And friends of friends you haven't met yet, but you really like."}, {"time": 2147, "text": "Now clubhouse also has an interesting innovation where there's a large crowd that just listens and there's a stage."}, {"time": 2154, "text": "And you can bring people up onto stage."}, {"time": 2156, "text": "So only people on stage are talking."}, {"time": 2159, "text": "And you can have like five, six, seven, eight, sometimes 20, 30 people on stage."}, {"time": 2163, "text": "And then you can also have thousands of people just listening."}, {"time": 2166, "text": "So there's a, I don't know, a lot of people are being surprised by this."}, {"time": 2170, "text": "Why is it called a social network?"}, {"time": 2172, "text": "It seems like it doesn't have, there's not social links."}, {"time": 2174, "text": "There's not a feed that's trying to harvest attention."}, {"time": 2177, "text": "It feels like a communication."}, {"time": 2180, "text": "So the social network aspect is you follow people."}, {"time": 2184, "text": "And the people you follow, now this is like the first social network that is actually correct use of follow, I think."}, {"time": 2190, "text": "You're more likely to see the rooms they're in."}, {"time": 2195, "text": "So there's a, your feed is a bunch of rooms that are going on right now."}, {"time": 2199, "text": "And the people you follow are the ones that will increase the likelihood that you'll see the room they're in."}, {"time": 2206, "text": "And so the final result is like, there's a list of really interesting rooms."}, {"time": 2210, "text": "Like I have all these, I've been speaking Russian quite a bit, there's practicing, but also just like talking politics and philosophy in Russian."}, {"time": 2220, "text": "I've never done that before, but it allows me to connect with that community."}, {"time": 2223, "text": "And then there's a community of people, like it's funny, but like I'll go in a community of all African American people talking about race and I'll be welcomed."}, {"time": 2233, "text": "I've never had, like I've literally never been in a difficult conversation about race, like with people from all over the place."}, {"time": 2242, "text": "It's like fascinating."}, {"time": 2243, "text": "And then musicians, jazz musicians, I don't know."}, {"time": 2246, "text": "You could say that a lot of other places could have created that culture, I suppose."}, {"time": 2251, "text": "Twitter and Facebook a lot for that culture, but there's something about this network as it stands now, cause no Android users."}, {"time": 2260, "text": "It's probably just because it's iPhone people."}, {"time": 2264, "text": "Less conspiratorial or something."}, {"time": 2265, "text": "Well, like less, listen, I'm an Android person."}, {"time": 2267, "text": "So I got an iPhone just for this network, which is funny."}, {"time": 2272, "text": "For now it's all like, there's very few trolls."}, {"time": 2275, "text": "There's very few people that are trying to manipulate the system and so on."}, {"time": 2279, "text": "So I don't know, it's interesting."}, {"time": 2280, "text": "Now the downside, the reason you're going to hate it is because it's so intimate, because it pulls you in and pulls in very successful people like you, just like really successful, productive, very busy people."}, {"time": 2300, "text": "It's a huge time sink."}, {"time": 2301, "text": "It's very difficult to pull yourself out."}, {"time": 2303, "text": "Interesting, you mean once you're in a room?"}, {"time": 2305, "text": "Well, no, leaving the room is actually easy."}, {"time": 2307, "text": "The beautiful thing about a stage with multiple people, there's a little button that says leave quietly."}, {"time": 2313, "text": "So culture, no etiquette wise, it's okay to just leave."}, {"time": 2318, "text": "So you and I in a room, when it's just you and I, it's a little awkward to leave."}, {"time": 2322, "text": "If you're asking questions, I'm just gone."}, {"time": 2324, "text": "But, and actually if you're being interviewed for the book, that's weird because you're now in the event and you're supposed to, but usually the person interviewing would be like, okay, it's time for you to go."}, {"time": 2363, "text": "And there's the addicting aspect to it."}, {"time": 2366, "text": "The reason it's a time sink is you don't wanna leave."}, {"time": 2370, "text": "What I've noticed about exceptionally busy people that they love this."}, {"time": 2375, "text": "I think it might have to do with the pandemic."}, {"time": 2377, "text": "It might be a little bit, yeah."}, {"time": 2378, "text": "There's a loneliness."}, {"time": 2379, "text": "They're all starved, yeah."}, {"time": 2380, "text": "But also it's really cool people."}, {"time": 2383, "text": "Like when was the last time you talked to Sam Harris or whoever, like think of anybody, Tyler Copeland, like any faculty."}, {"time": 2392, "text": "This is like what universities strive to create, but it's taken hundreds of years of cultural evolution to try to get a lot of interesting, smart people together that run into each other."}, {"time": 2400, "text": "We have really strong faculty in a room together with no scheduling."}, {"time": 2405, "text": "This is the power of it."}, {"time": 2407, "text": "It's like you just show up, there's none of that baggage of scheduling and so on and there's no pressure to leave, sorry, no pressure to stay."}, {"time": 2415, "text": "It's very easy for you to leave."}, {"time": 2416, "text": "You realize that there's a lot of constraints on meetings and like faculty, like even stopping by before the pandemic, a friend or faculty or colleague and so on, there's a weirdness about leaving."}, {"time": 2431, "text": "But here there's not a weirdness about leaving."}, {"time": 2433, "text": "So they've discovered something interesting."}, {"time": 2436, "text": "But the final result when you observe it is it's very fulfilling."}, {"time": 2441, "text": "I think it's very beneficial, but it's very addicting."}, {"time": 2444, "text": "So you have to make sure you moderate."}, {"time": 2450, "text": "Okay, well, so maybe I'll try it."}, {"time": 2452, "text": "I mean, look, there's no, the things that make me suspicious about other platforms aren't here."}, {"time": 2456, "text": "So the feed is not full of user generated content that is going through some sort of algorithmic rating process with all the weird incentives and nudging that does."}, {"time": 2465, "text": "And you're not producing content that's being harvested to be monetized by another company."}, {"time": 2471, "text": "I mean, it seems like it's more ephemeral, right?"}, {"time": 2474, "text": "You're here, you're talking."}, {"time": 2475, "text": "The feed is just actually just showing you here's interesting things happening, right?"}, {"time": 2479, "text": "You're not jockeying in the feed for, look, I'm being clever or something and I'm gonna get a light count that goes up and that's gonna influence."}, {"time": 2486, "text": "And there's more friction."}, {"time": 2487, "text": "There's more cognitive friction, I guess, involved in listening to smart people versus scrolling through."}, {"time": 2493, "text": "Yeah, there's something there."}, {"time": 2494, "text": "So there's no."}, {"time": 2495, "text": "Why are people so, I see all, there's all these articles that seem, I haven't really read them."}, {"time": 2500, "text": "Why are reporters negative about this?"}, {"time": 2502, "text": "Competition."}, {"time": 2503, "text": "The New York Times wrote this article called Unfettered Conversations Happening on Clubhouse is."}, {"time": 2509, "text": "So I'm right in picking up a tone even from the headlines that there's some like negative vibes from the press."}, {"time": 2515, "text": "No, so I can say, let's say, well, I'll tell you what the article was saying, which is they're having cancellable conversations, like the biggest people in the world almost trolling the press."}, {"time": 2529, "text": "And the press is desperately."}, {"time": 2530, "text": "Like foreshanning the press."}, {"time": 2531, "text": "Yeah, foreshanning the press."}, {"time": 2533, "text": "By saying that you guys are looking for click bait from our genuine human conversations."}, {"time": 2539, "text": "And so I think the, honestly, the press is just like, what do we do with this?"}, {"time": 2545, "text": "We can't, first of all, it's a lot of work for them."}, {"time": 2549, "text": "It's what Naval says, which is like, this is skipping the journalist."}, {"time": 2554, "text": "Like the interview you, if you go on Clubhouse, the interview you might do for the book will be with somebody who's like a journalist and interviewing you."}, {"time": 2563, "text": "That's more traditional."}, {"time": 2565, "text": "It'd be a good introduction for you to try it."}, {"time": 2567, "text": "But like the way to use Clubhouse is you just show up and it's like, again, like me, I'm sorry, I'm like, boy, I keep mentioning Sam Harris as if it's like the only person I know, but like a lot of these major faculty, I don't know, Max Tegmark."}, {"time": 2584, "text": "Like just major faculty just sitting there and then you show up and then I'll ask like, oh, don't you have a book coming out or something?"}, {"time": 2592, "text": "And then you'll talk about the book and then you'll leave five minutes later because you have to go get coffee included."}, {"time": 2598, "text": "So like that's the, it's not the journalistic, you're not gonna actually enjoy the interview as much because it'll be like the normal thing."}, {"time": 2606, "text": "Like you're there 40 minutes or an hour and there'll be questions from the audience."}, {"time": 2611, "text": "Like I'm doing an event next week for the book launch where it's like Jason Fried and I are talking about email, but it's using some more like a thousand people who are there to watch virtually, but it's using some sort of traditional webinar."}, {"time": 2624, "text": "Clubhouse would be a situation where that could just happen informally."}, {"time": 2627, "text": "Like I jump in like Jason's there and then someone else jumps in and yeah, that's interesting."}, {"time": 2631, "text": "But for now it's still closed."}, {"time": 2633, "text": "So even though there's a lot of excitement and there'll be quite famous people just sitting there listening to you."}, {"time": 2641, "text": "But the numbers aren't exactly high."}, {"time": 2644, "text": "So you're talking about rooms, like even the huge rooms are like just a few thousand."}, {"time": 2650, "text": "And this is probably like Soho in the 50s or something too."}, {"time": 2652, "text": "Just because of the exponential growth, give it seven more months."}, {"time": 2657, "text": "And if you let one invite be, it gets two invites, it gets four invites, because pretty soon it'll be everyone."}, {"time": 2662, "text": "And then the rooms in your feed are gonna be whatever, marketing, performance enhancing drugs or something like that."}, {"time": 2669, "text": "But then in a bunch of competitors, there's already like 30 plus competitors sprung up, Twitter spaces."}, {"time": 2674, "text": "So Twitter is creating a competitor that's going to likely destroy Clubhouse because they just have a much larger user base and they already have a social network."}, {"time": 2682, "text": "So I would be very cautious, of course, with the addictive element, but it doesn't just like you said, this particular implementation in its early stages doesn't have the like, it doesn't have the context switching problem."}, {"time": 2698, "text": "You'll just switch to it and you'll be stuck."}, {"time": 2701, "text": "Yeah, to keep a context is great."}, {"time": 2704, "text": "But then I think the best way I've found to use it is to acknowledge that these things pull you in."}, {"time": 2713, "text": "So I've used it in the past, like almost, I'll go get a coffee and I'll tune into a conversation as if that's how I use podcasts sometimes."}, {"time": 2724, "text": "I'll just like play a little bit of a podcast and then I can just turn it off."}, {"time": 2729, "text": "The problem with these is it pulls you in, it's really interesting."}, {"time": 2732, "text": "And then the other problem that you'll experience is like somebody will recognize you."}, {"time": 2738, "text": "And then they'll be like, oh, Lex."}, {"time": 2740, "text": "Come on up."}, {"time": 2742, "text": "Oh, hey, I had a question for you."}, {"time": 2743, "text": "And then it takes a lot for you to go like, to ignore that."}, {"time": 2749, "text": "And then you pulled in and it's fascinating and it's really cool people."}, {"time": 2752, "text": "So it's like a source of a lot of joy, but you have to be very, very careful."}, {"time": 2758, "text": "The reason I brought it up is we, there's a room, there's an entire club actually on burnout."}, {"time": 2764, "text": "And I brought you up and I brought David Goggins as the process I go through, which is, my passion goes up and down, it dips."}, {"time": 2774, "text": "And I don't think I trust my own mind to tell me whether I'm getting close to burnout or exhaustion or not."}, {"time": 2784, "text": "I kind of go with the David Goggins model of, I mean, he's probably more applying it to running, but when it feels like your mind can't take any more, that you're just 40% at your capacity."}, {"time": 2798, "text": "I mean, it's just like an arbitrary level."}, {"time": 2801, "text": "It's the Navy SEAL thing, right?"}, {"time": 2801, "text": "The Navy SEAL thing."}, {"time": 2803, "text": "I mean, you could put that at any percent, but it is remarkable that if you just take it one step at a time, just keep going, it's similar to this idea of a process."}, {"time": 2813, "text": "If you just trust the process and you just keep following, even if the passion goes up and down and so on, then ultimately, if you look in aggregate, the passion will increase."}, {"time": 2824, "text": "Your self satisfaction will increase."}, {"time": 2826, "text": "And if you have two things, this has been a big strategy of mine, so that what you hope for is off phase, off phase alignment."}, {"time": 2834, "text": "Sometimes it's in phase and that's a problem, but off phase alignment's good."}, {"time": 2838, "text": "So, okay, my research, I'm struggling, but my book stuff is going well, right?"}, {"time": 2842, "text": "And so when you add those two waves together, like, oh, we're doing pretty well."}, {"time": 2845, "text": "And then in other periods, like on my writing, I feel like I'm just not getting anywhere, but I've had some good papers, I'm feeling good over there."}, {"time": 2852, "text": "So having two things that can counteract each other."}, {"time": 2855, "text": "Now, sometimes they fall into sync and then it gets rough."}, {"time": 2858, "text": "Then when, you know, when everything, because everything for me is cyclical, good periods, bad periods with all this stuff."}, {"time": 2863, "text": "So typically they don't coincide, so it helps compensate."}, {"time": 2867, "text": "When they do coincide, you get really high highs, like where everything's clicking, and then you get these really low lows where like your research is not working, your program's not clicking, you feel like you're nowhere with your writing, and then it's a little rougher."}, {"time": 2880, "text": "Is, do you think about the concept of burnout?"}, {"time": 2884, "text": "Because I personally have never experienced burnout in the way that folks talk about, which is like, it's not just the up and down."}, {"time": 2891, "text": "It's like, you don't want to do anything ever again."}, {"time": 2895, "text": "It's like, for some people it's like physical, like to the hospital kind of thing."}, {"time": 2899, "text": "Yeah, so I do worry about it."}, {"time": 2902, "text": "So when I used to do student writing, like writing about students and student advice, it came up a lot with students at elite schools, and I used to call it deep procrastination, but it was a real, really vivid, very replicatable syndrome where they stop being able to do schoolwork."}, {"time": 2920, "text": "Like this is due, and the professor gives you an extension, and the professor gives you an incomplete, and says, you got it, you were gonna fail the course, you have to hand this in, and they can't do it, right?"}, {"time": 2928, "text": "It's like a complete stop on the ability to actually do work."}, {"time": 2932, "text": "And so I used to counsel students who had that issue, and often it was a combination of, this is my best analysis, is you have just the physical and cognitive difficulties of they're usually under a very hard load, right?"}, {"time": 2943, "text": "They're doing too many majors, too many extracurriculars, just really pushing themselves, and the motivation is not sufficiently intrinsic."}, {"time": 2952, "text": "So if you have a motivational center that's not completely on board, so a lot of these kids, like when I'm dealing with MIT kids, they would be, their whole town was shooting off fireworks that they got in."}, {"time": 2961, "text": "Everyone's hoped that they were going there, and that they're in three majors, they don't wanna let people down, but they're not really interested in being a doctor or whatever."}, {"time": 2968, "text": "So your motivation's not in the right place."}, {"time": 2970, "text": "The motivational psychologist would say the locus of control was more towards the extrinsic end of the spectrum, and you have hardship."}, {"time": 2976, "text": "And you could just fritz out the whole system."}, {"time": 2978, "text": "And so I would always be very worried about that."}, {"time": 2980, "text": "So I think about that a lot."}, {"time": 2981, "text": "I do a lot of multi phase or multi scale seasonality."}, {"time": 2985, "text": "So I'll go hard on something for a while, and then for a few weeks, go easy."}, {"time": 2990, "text": "I'll have semesters that are hard, and semesters that are easy."}, {"time": 2993, "text": "Or I'll take the summer really low."}, {"time": 2994, "text": "So on multiple scales, and in the day I'll go really hard on something, but then have a hard cut off at five."}, {"time": 2997, "text": "So like every scale, it's all about rest and recovery."}, {"time": 3001, "text": "Because I really wanna avoid that."}, {"time": 3002, "text": "And I do burn out."}, {"time": 3003, "text": "I burnt out, pretty recently I get minor burnt outs."}, {"time": 3006, "text": "I got a couple papers that I was trying to work through for a deadline a few weeks ago, and I wasn't sleeping well, and there's some other things going on."}, {"time": 3017, "text": "And it just knocks out and I get sick usually, is how I know I've pushed myself too far."}, {"time": 3022, "text": "And so I kind of pulled it back."}, {"time": 3023, "text": "Now I'm doing this book launch."}, {"time": 3024, "text": "Then after this book launch, I'm pulling it back again."}, {"time": 3026, "text": "So I like seasonality for rest and recovery, I think it's crucial."}, {"time": 3030, "text": "And at every scale, daily, monthly, and then at the annual scale."}, {"time": 3034, "text": "An easy summer, for example, I think is like a great idea if that's possible."}, {"time": 3038, "text": "Okay, you just made me realize that that's exactly what I do."}, {"time": 3043, "text": "Because I feel like I'm not even close to burnout or anything."}, {"time": 3046, "text": "Even though I'm in chaos, I feel the right exact way is the seasonality, is the, not even the seasonality, but like you always have multiple seasons operating."}, {"time": 3059, "text": "It's like you said, because when you have a lot of cool shit going on, there's always at least one thing that's a source of joy, that there's always a reason."}, {"time": 3068, "text": "I suppose the fundamental thing, and I've known people that suffer from depression too, the fundamental problem with the experience of depression and burnout is why do, life is meaningless."}, {"time": 3081, "text": "And I always have an answer of why today could be cool."}, {"time": 3088, "text": "And you have to contrive it, right?"}, {"time": 3089, "text": "If you don't have it, you have to contrive it."}, {"time": 3093, "text": "Like, okay, well, this is going bad, so now is the time to start thinking about, I mean, look, I started a podcast during the pandemic."}, {"time": 3099, "text": "It's like, this is going pretty bad, but you know what?"}, {"time": 3103, "text": "This could be something really interesting."}, {"time": 3106, "text": "Deep questions with Kyle Newport."}, {"time": 3109, "text": "I do it all in that voice."}, {"time": 3110, "text": "I love the podcast, by the way."}, {"time": 3113, "text": "But yeah, I think David Foster Wallace said, the key to life is to be unboreable."}, {"time": 3119, "text": "I've always kind of taken that to heart, which is like, you should be able to maybe artificially generate anything."}, {"time": 3128, "text": "Like, find something in your environment, in your surroundings, that's a source of joy."}, {"time": 3136, "text": "Like, everything is fun."}, {"time": 3138, "text": "Did you read The Pale King?"}, {"time": 3140, "text": "It goes deep on boredom."}, {"time": 3141, "text": "It's like uncomfortable."}, {"time": 3142, "text": "It's like an uncomfortable meditation on boredom."}, {"time": 3145, "text": "Like, the characters in that are just driven to the extremes of, I just bought three books on boredom the other day, so now I'm really interested in this topic."}, {"time": 3155, "text": "Because I was anxious about my book launch happening this week."}, {"time": 3158, "text": "So I was like, okay, I need something else."}, {"time": 3159, "text": "So I have this idea for, I might do it as an article first, but as a book."}, {"time": 3163, "text": "Like, okay, I need something cool to be thinking about."}, {"time": 3166, "text": "Because I was worried about, like, I don't know if the launch's gonna work, the pandemic, what's gonna happen, I don't know if it's gonna get there."}, {"time": 3172, "text": "So this is exactly what we're talking about."}, {"time": 3174, "text": "So I went out and I bought a bunch of books, and I'm beginning like a whole intellectual exploration."}, {"time": 3180, "text": "Well, I think that's one of the profound ideas in deep work that you don't expand on too much is boredom."}, {"time": 3188, "text": "Yeah, well, so deep work had a superficial idea about boredom, which was, I had this chapter called Embrace Boredom, and a very functionalist idea was basically, you have to have some boredom in your regular schedule, or your mind is gonna form a Pavlovian connection between as soon as I feel boredom, I get stimuli."}, {"time": 3208, "text": "And once it forms that connection, it's never gonna tolerate deep work."}, {"time": 3210, "text": "So there's this very pragmatic treatment of boredom of your mind better be used to the idea that sometimes you don't get stimuli because otherwise you can't write for three hours, like it's just not gonna tolerate it."}, {"time": 3221, "text": "But more recently, what I'm really interested in boredom is it as a fundamental human drive, right?"}, {"time": 3227, "text": "Because it's incredibly uncomfortable."}, {"time": 3229, "text": "And think about the other things that are incredibly uncomfortable, like hunger or thirst, they serve a really important purpose for a species, right?"}, {"time": 3236, "text": "Like if something is really distressing, there's a reason."}, {"time": 3238, "text": "Pain is really uncomfortable because we need to worry about getting injured."}, {"time": 3242, "text": "Thirst is really uncomfortable because we need water to survive."}, {"time": 3245, "text": "So what's boredom?"}, {"time": 3247, "text": "Why is that uncomfortable?"}, {"time": 3248, "text": "And I've been interested in this notion that boredom is about driving us towards productive action."}, {"time": 3257, "text": "Like as a species, I mean, think about it, like what got us to actually take advantage of these brains?"}, {"time": 3262, "text": "What got us to actually work with fire?"}, {"time": 3264, "text": "What got us to start shaping stones and the hand axes and figuring out if we could actually sharpen a stick sharp enough that we could throw it as a melee weapon or a distance weapon for hunting mammoth, right?"}, {"time": 3275, "text": "Boredom drives us towards action."}, {"time": 3277, "text": "So now I'm fascinated by this fundamental action instinct because I have this theory that I'm working on that we're out of sync with it."}, {"time": 3285, "text": "Just like we have this drive for hunger, but then we introduced junk food and got out of sync with hunger and it makes us really unhealthy."}, {"time": 3292, "text": "We have this drive towards action, but then we overload ourselves and we have all of these distractions."}, {"time": 3296, "text": "And then that causes, it's like a cognitive action obesity type things because it short circuits this system that wants us to do things, but we put more things on our plate than we can possibly do and then we're really frustrated we can't do them and we're short circuiting all of our wires."}, {"time": 3309, "text": "So it all comes back to this question, well, what would be the ideal sort of amount of stuff to do and type of things to do?"}, {"time": 3318, "text": "Like if we wanted to look back at our ancestral environment and say, if I could just build from scratch, how much work I do and what I work on to be as in touch with that as like paleo people are trying to get their diets in touch with that."}, {"time": 3330, "text": "And so now I'm just, well, see, this is, it's something I made up, but now I'm going deep on it."}, {"time": 3336, "text": "And one of my podcast listeners I was talking about on the show and I was like, well, I get trying to learn about animals and boredom."}, {"time": 3341, "text": "And she sent me this cool article from an animal behaviorist journal about what we know about human boredom versus animal boredom."}, {"time": 3348, "text": "So trying to figure out that puzzle is the wave that's high."}, {"time": 3352, "text": "So I can get through the wave that's low of like, I don't know about this pandemic book launch."}, {"time": 3355, "text": "And my research is stumbling a little bit because of the pandemic."}, {"time": 3360, "text": "And so I needed a nice, you know, high."}, {"time": 3363, "text": "So there we go, there's a case study."}, {"time": 3365, "text": "Well, it's both a case study and a very interesting set of concepts because I didn't even realize that it's so simple."}, {"time": 3372, "text": "I'm one of the people that has a interesting push and pull dynamic with hunger, trying to understand the hunger with myself."}, {"time": 3381, "text": "Like I probably have an unhealthy relationship with food."}, {"time": 3384, "text": "I don't know, but there's probably a perfect, that's a nice way to think about diet as action."}, {"time": 3392, "text": "There's probably an optimal diet response to the experience that our body's telling us, the signal that our body's sending, which is hunger."}, {"time": 3403, "text": "And in that same way, boredom is sending a signal."}, {"time": 3406, "text": "And most of our intellectual activities in this world, our creative activities, are essentially a response to that signal."}, {"time": 3416, "text": "Yeah, and think about this analogy that we have this hunger instinct that junk food short circuits, right?"}, {"time": 3423, "text": "It's like, oh, we'll satisfy that hyper palatably and it doesn't end up well."}, {"time": 3428, "text": "Now think about modern attention engineered, digitally mediated entertainment."}, {"time": 3434, "text": "We have this boredom instinct."}, {"time": 3436, "text": "Oh, we can take care of that with a hyper palatable alternative."}, {"time": 3440, "text": "Is that gonna lead to a similar problem?"}, {"time": 3442, "text": "So I've been fasting a lot lately, like I'm doing eating once a day."}, {"time": 3447, "text": "I've been doing that for over a month, just eating one meal a day and primarily meat."}, {"time": 3453, "text": "But it's very, fasting has been incredible for me, for focus, for wellbeing, for, I don't know, just for feeling good, okay?"}, {"time": 3463, "text": "We'll put on a chart what makes me feel good."}, {"time": 3465, "text": "And that fasting and eating primarily a meat based diet makes me feel really good."}, {"time": 3472, "text": "And so, but that ultimately what fasting did, I haven't fasted super long yet, like a seven day diet, which I really like to do."}, {"time": 3482, "text": "But even just fasting for a day for 24 hours gets you in touch with your, with the signal."}, {"time": 3490, "text": "Like you get to listen to your, learn to listen to your body that like, it's okay to be hungry."}, {"time": 3497, "text": "It's like a little signal that sends you stuff."}, {"time": 3499, "text": "And then I get to listen to how it responds when I put food in my body."}, {"time": 3507, "text": "Like, and I get to like, okay, cool."}, {"time": 3510, "text": "So like food is a thing that pacifies the signal."}, {"time": 3513, "text": "Like it sounds ridiculous, okay?"}, {"time": 3515, "text": "And you could do that with."}, {"time": 3516, "text": "And do different types of food."}, {"time": 3518, "text": "It feels different."}, {"time": 3519, "text": "So you learn about what your body wants."}, {"time": 3521, "text": "For some reason fasting, it's similar to the deep work, embrace boredom."}, {"time": 3527, "text": "Fasting allowed me to go into mode of listening, of trying to understand the signal that I could say, I have an unhealthy appreciation of fruit, okay?"}, {"time": 3537, "text": "I love apples and cherries."}, {"time": 3539, "text": "Like, I don't know how to moderate them."}, {"time": 3541, "text": "So if you take just same amount of calories, I don't know calories matter, but they say calories."}, {"time": 3545, "text": "2000 calories of cherries versus 2000 calories of steak."}, {"time": 3551, "text": "If I eat 2000 calories of steak, maybe just a little bit of like green beans or cauliflower, I'm going to feel really good, fulfilled, focused and happy."}, {"time": 3562, "text": "If I eat cherries, I'm going to be, I'm going to wake up behind a dumpster crying with like naked and like, it's just."}, {"time": 3569, "text": "Pits all around."}, {"time": 3570, "text": "Yeah, with everything."}, {"time": 3571, "text": "Over your face, yeah."}, {"time": 3572, "text": "And it's just like bloated, just not and unhappy."}, {"time": 3576, "text": "And also the mood swings up and down."}, {"time": 3581, "text": "And I'll be much hungrier the next day."}, {"time": 3584, "text": "Sometimes it takes a couple of days."}, {"time": 3586, "text": "But when I introduce carbs into the system, too many carbs, it starts, it's just unhealthy."}, {"time": 3593, "text": "I go into this roller coaster as opposed to a calm boat ride along the river in the Amazon or something like that."}, {"time": 3598, "text": "And so fasting was the mechanism for me to start listening to the body."}, {"time": 3603, "text": "I wonder if you can do that same kind of, I guess that's what meditation a little bit is."}, {"time": 3607, "text": "A little bit, but yeah, listen to boredom."}, {"time": 3610, "text": "But so two years ago, I had a book out called Digital Minimalism."}, {"time": 3613, "text": "And one of the things I was recommending that people do is basically a 30 day fast."}, {"time": 3618, "text": "But from digital personal entertainment, social media, online videos, anything that captures your attention and dispels boredom."}, {"time": 3626, "text": "And people were thinking like, oh, this is a detox."}, {"time": 3629, "text": "Like, I just wanna teach your body not to need the distraction, this or that."}, {"time": 3632, "text": "But it really wasn't what I was interested in."}, {"time": 3634, "text": "I wanted there to be space that you could listen to your boredom."}, {"time": 3639, "text": "Like, okay, I can't just dispel it."}, {"time": 3641, "text": "I can't just look at the screen and revel in it a little bit and start to listen to it and say, what is this really pushing me towards?"}, {"time": 3648, "text": "And you take the new stuff, the new technology off the table and sort of ask, what is this?"}, {"time": 3652, "text": "What am I craving?"}, {"time": 3653, "text": "Like, what's the activity equivalent of 2000 calories of meat with a little bit of green beans on the side?"}, {"time": 3659, "text": "And I had 1700 people go through this experiment, like spend 30 days doing this."}, {"time": 3663, "text": "And it's hard at first, but then they get used to listening to themselves and sort of seeking out, what is this really pushing me towards?"}, {"time": 3669, "text": "And it was pushing people towards connection."}, {"time": 3672, "text": "It was pushing people towards, I just wanna go be around other people."}, {"time": 3675, "text": "It was pushing people towards high quality leisure activities."}, {"time": 3679, "text": "Like I wanna go do something that's complicated."}, {"time": 3681, "text": "And it took weeks sometimes for them to get in touch with their boredom, but then it completely rewired how they thought about, what do I wanna do with my time outside of work?"}, {"time": 3690, "text": "And then the idea is when you're done with that, then it was much easier to go back and completely change your digital life because you have alternatives, right?"}, {"time": 3697, "text": "You're not just trying to abstain from things you don't like, but that's basically a listening to boredom experiment."}, {"time": 3702, "text": "Like just be there with the boredom and see where it drives you when you don't have the digital Cheez Its."}, {"time": 3708, "text": "Okay, so if I can't do that, where is it gonna drive me?"}, {"time": 3711, "text": "Well, I guess I kinda wanna go to the library, which came up a lot, by the way, a lot of people rediscovered the library."}, {"time": 3717, "text": "With physical books."}, {"time": 3718, "text": "Physical books, so like you can just go borrow them."}, {"time": 3720, "text": "And there's like low pressure and you can explore and you bring them home and then you read them and you can like sit by the window and read them and it's nice weather outside."}, {"time": 3727, "text": "And I used to do that 20 years ago, they're listening to boredom."}, {"time": 3730, "text": "So can you maybe elaborate a little bit on the different experiences that people had when they quit social media for 30 days?"}, {"time": 3737, "text": "Like if you were to recommend that process, what is ultimately the goal?"}, {"time": 3742, "text": "Yeah, digital minimalism, that's my philosophy for all this tech."}, {"time": 3747, "text": "And it's working backwards from what's important."}, {"time": 3750, "text": "So it's you figure out what you're actually all about, like what you wanna do, what you wanna spend your time doing."}, {"time": 3755, "text": "And then you can ask, okay, is there a place that tech could amplify or support some of these things?"}, {"time": 3760, "text": "And that's how you decide what tech to use."}, {"time": 3762, "text": "And so the process is, let's actually get away from everything, let's be bored for a while, let's really spend a month getting really figuring out what do I actually wanna do?"}, {"time": 3770, "text": "What do I wanna spend my time doing?"}, {"time": 3772, "text": "What's important to me?"}, {"time": 3773, "text": "What makes me feel good?"}, {"time": 3774, "text": "And then when you're done, you can bring back in tech very strategically to help those things, right?"}, {"time": 3778, "text": "And that was the goal."}, {"time": 3779, "text": "That turns out to be much more successful than when people take a abstention only approach."}, {"time": 3785, "text": "So if you come out your tech life and say, you know, whatever, I look at Instagram too much."}, {"time": 3790, "text": "Like I don't like how much I'm on Instagram, that's a bad thing."}, {"time": 3793, "text": "I wanna reduce this bad thing."}, {"time": 3795, "text": "So here's my new thing, I'm gonna spend less time looking at Instagram, much less likely to succeed in the longterm."}, {"time": 3800, "text": "So we're much less likely at trying to reduce this sort of amorphous negative because in the moment you're like, yeah, but it's not that bad and it would be kind of interesting to look at it now."}, {"time": 3809, "text": "When you're instead controlling behavior because you have a positive that you're aiming towards, it's very powerful for people."}, {"time": 3813, "text": "Like I want my life to be like this, here's the role that tech plays in that life."}, {"time": 3819, "text": "The connection to wanting your life to be like that is very, very strong."}, {"time": 3822, "text": "And then it's much, much easier to say, yeah, like using Instagram is not part of my plan for how I have that life."}, {"time": 3826, "text": "And I really wanna have that life, so of course I'm not gonna use Instagram."}, {"time": 3829, "text": "So it turns out to be a much more sustainable way to tame what's going on."}, {"time": 3833, "text": "So if you quit social media for 30 days, you kinda have to do the work."}, {"time": 3838, "text": "You have to do the work."}, {"time": 3839, "text": "Of thinking like, what am I actually, what makes me happy in terms of these tools that I've previously used and when you try to integrate them back, how can I integrate them to maximize the thing that actually makes me happy?"}, {"time": 3851, "text": "Yeah, or what makes me happy unrelated to technology?"}, {"time": 3854, "text": "Like what do I actually, what do I want my life to be like?"}, {"time": 3856, "text": "Well, maybe what I wanna do is be like outside of nature two hours a day and spend a lot more time like helping my community and sacrificing on behalf of my connections and then have some sort of intellectually engaging leisure activity like I'm reading or trying to read the great books and having more calm and seeing the sunset."}, {"time": 3871, "text": "Like you create this picture and then you go back and say, well, I still need my Facebook group because that's how I keep up with my cycling group."}, {"time": 3879, "text": "But Twitter is just, you know, toxic, it's not helping any of these things."}, {"time": 3882, "text": "And well, I'm an artist, so I kinda need Instagram to get inspiration."}, {"time": 3886, "text": "But if I know that's why I'm using Instagram, I don't need it on my phone, it's just on my computer and I just follow 10 artists and check it once a week."}, {"time": 3891, "text": "Like you really can start deploying."}, {"time": 3894, "text": "It was the number one thing that differentiated in that experiment, the people who ended up sustainably making changes and getting through the 30 days and those who didn't, was the people who did the experimentation and the reflection."}, {"time": 3904, "text": "Like let me try to figure out what's positive."}, {"time": 3907, "text": "They were much more successful than the people that just said, I'm sick of using my phone so much."}, {"time": 3911, "text": "So I'm just gonna white knuckle it."}, {"time": 3912, "text": "Just 30 days will be good for me."}, {"time": 3914, "text": "I just gotta get away from it or something."}, {"time": 3916, "text": "It doesn't last."}, {"time": 3917, "text": "So you don't use social media currently."}, {"time": 3921, "text": "Do you find that a lot of people going through this process will seek to basically arrive at a similar place to not use social media primarily?"}, {"time": 3930, "text": "About half."}, {"time": 3932, "text": "Right, so about half when they went through this exercise, and these aren't quantified numbers."}, {"time": 3936, "text": "This is just, they sent me reports and yeah."}, {"time": 3940, "text": "That's pretty good though, 1700?"}, {"time": 3942, "text": "So roughly half probably got rid of social media altogether."}, {"time": 3947, "text": "Once they did this exercise, they realized these things I care about, I don't, social media's not the tools that's really helping."}, {"time": 3953, "text": "The other half kept some, there were some things in their life where some social media was useful."}, {"time": 3959, "text": "But the key thing is if they knew why they were deploying social media, they could put fences around it."}, {"time": 3964, "text": "So for example, of those half that kept some social media, almost none of them kept it on their phone."}, {"time": 3970, "text": "Yeah, you can't optimize if you don't know what the function you're trying to optimize."}, {"time": 3973, "text": "So it's like this huge hack."}, {"time": 3974, "text": "Like once you know this is why I'm using Twitter, then you can have a lot of rules about how you use Twitter."}, {"time": 3979, "text": "And suddenly you take this cost benefit ratio and it goes like way from the company's advantage and then way over towards your advantage."}, {"time": 3985, "text": "It's kind of fascinating because I've been torn with social media, but I did this kind of process."}, {"time": 3990, "text": "I haven't actually done it for 30 days, which I probably should."}, {"time": 3993, "text": "I'll do it for like a week at a time and regularly and thinking what kind of approach to Twitter works for me."}, {"time": 4003, "text": "I'm distinctly aware of the fact that I really enjoy posting once or twice a day."}, {"time": 4011, "text": "And at that time checking from the previous post, it makes me feel even when there's like negative comments, they go right past me."}, {"time": 4021, "text": "And when there's positive comments, it makes you smile."}, {"time": 4023, "text": "I feel like love and connection with people, especially with people I know, but even just in general, it's like, it makes me feel like the world is full of awesome people."}, {"time": 4032, "text": "Okay, when you increase that from checking from two to like, I don't know what the threshold is for me, but probably like five or six per day, it starts going to anxiety world."}, {"time": 4041, "text": "Like where negative comments will actually stick to me mentally and positive comments will feel more shallow."}, {"time": 4054, "text": "So I've been trying to, there's been long stretches of time, I think December and January where I did just post and check, post and check."}, {"time": 4066, "text": "That makes me really happy."}, {"time": 4069, "text": "Most of 2020 I did that, it made me really happy."}, {"time": 4072, "text": "Recently I started like, I'll go, you go right back in like a drug addict, where you check it like, I don't know what that number is, but that number is high."}, {"time": 4081, "text": "Not good, you don't come out happy."}, {"time": 4083, "text": "No one comes out of a day full of Twitter celebrating humanity."}, {"time": 4087, "text": "And it's not even, cause I'm very fortunate to have a lot of just positivity in the Twitter, but there's just a general anxiety."}, {"time": 4096, "text": "I wouldn't even say it's, it's probably the thing that you're talking about with the contact switching."}, {"time": 4102, "text": "It's almost like an exhaustion."}, {"time": 4105, "text": "I wouldn't even say it's like a negative feeling."}, {"time": 4107, "text": "It's almost just an exhaustion to where I'm not creating anything beautiful in my life, just exhausted."}, {"time": 4113, "text": "Like an existential exhaustion."}, {"time": 4115, "text": "Existential exhaustion."}, {"time": 4116, "text": "But I wonder, do you think it's possible to use from the people you've seen from yourself to use social media in the way I'm describing moderation?"}, {"time": 4125, "text": "Or is it always going to become?"}, {"time": 4128, "text": "When people do this exercise, you get lots of configurations."}, {"time": 4132, "text": "So for people that have a public presence, for example, like what you're doing is not that unusual."}, {"time": 4138, "text": "Okay, I post one thing a day and my audience likes it and that's kind of it."}, {"time": 4144, "text": "But you've thought through like, okay, this supports something I value, which is like having a sort of informal connection with my audience and being exposed to some sort of positive randomness."}, {"time": 4155, "text": "Okay, then you could say if that's my goal, what's the right way to do it?"}, {"time": 4159, "text": "Well, I don't need to be on Twitter on my phone all day."}, {"time": 4160, "text": "Maybe what I do is every day at five, I do my post and check on the day."}, {"time": 4165, "text": "So I have a writer friend, Ryan Holiday, who writes about the Stoics a lot."}, {"time": 4170, "text": "And he has this similar strategy."}, {"time": 4172, "text": "He posts one quote every day usually from a famous Stoic and sometimes from a contemporary figure."}, {"time": 4177, "text": "And that's just what he does."}, {"time": 4178, "text": "He just posts it and it's a very positive thing."}, {"time": 4181, "text": "Like his readers really love it because it's just like a dose of inspiration."}, {"time": 4184, "text": "He doesn't spend time."}, {"time": 4186, "text": "He's never interacting with anyone on social media, right?"}, {"time": 4188, "text": "But that's an example of I figured out what's important to me, what's the best way to use tools to amplify it."}, {"time": 4194, "text": "And then you get advantages out of the tools."}, {"time": 4196, "text": "So I like what you're doing."}, {"time": 4197, "text": "I looked you up, I looked up your Twitter feed before I came over here."}, {"time": 4200, "text": "I was curious, you're not on there a lot."}, {"time": 4202, "text": "I don't see you yelling at people."}, {"time": 4204, "text": "Now, do you think social media as a medium changed the cultural standards?"}, {"time": 4209, "text": "And I mean it in a, have you read Neil Postman at all?"}, {"time": 4211, "text": "Have you read like a Amusing Ourselves to Death?"}, {"time": 4214, "text": "He was a social critic, technology critic and wrote a lot about sort of technological determinism."}, {"time": 4219, "text": "So the ways, which is a really influential idea to a lot of my work, which is actually a little out of fashion right now in academia."}, {"time": 4225, "text": "But the ways that the properties and presence of technologies change things about humans in a way that's not really intended or planned by the humans themselves."}, {"time": 4233, "text": "And that book is all about how different communication medium, like fundamentally just changed the way the human brain understands and operates."}, {"time": 4242, "text": "And so he sort of gets into the, what happened when the printed word was widespread and how television changed it."}, {"time": 4247, "text": "And this was all pre social media."}, {"time": 4249, "text": "But this is one of these ideas I'm having is like what's the degree to which, and I get into it sometimes on my show, I get into a little bit, like the degree to which like Twitter in particular just changed the way that people conceptualized what for example, debate and discussion was."}, {"time": 4263, "text": "Like it introduced a rhetorical dunk culture where it's sort of more about tribes not giving ground to other tribes."}, {"time": 4270, "text": "And it's like, it's a complete, there's different places and times when that type of discussion was thought of differently."}, {"time": 4277, "text": "Well, yeah, absolutely."}, {"time": 4279, "text": "But I tend to believe, I don't know what you think, that there's the technological solutions."}, {"time": 4283, "text": "Like there's literally different features in Twitter that could completely reverse that."}, {"time": 4289, "text": "There's so much power in the different choices that are made."}, {"time": 4293, "text": "And it could still be highly engaging and have very different effects."}, {"time": 4297, "text": "Perhaps more negative or hopefully more positive."}, {"time": 4300, "text": "Yeah, so I'm trying to pull these two things apart."}, {"time": 4302, "text": "So there's these two ways social media, let's say could change the experience of reading a major newspaper today."}, {"time": 4309, "text": "One could be a little bit more economic, right?"}, {"time": 4310, "text": "So the internet made it cheaper to get news."}, {"time": 4313, "text": "The newspapers had to retreat to a paywall model because it was the only way they were gonna survive."}, {"time": 4316, "text": "But once you're in a paywall model, then what you really wanna do is make your tribe, which is within the paywall, very, very happy with you."}, {"time": 4323, "text": "So you wanna work to them."}, {"time": 4324, "text": "But then there's the sort of determinist point of view, which is the properties of Twitter, which were arbitrary."}, {"time": 4330, "text": "Jack and Evan just, whatever, let's just do it this way."}, {"time": 4333, "text": "Influenced the very way that people now understand and think about the world."}, {"time": 4336, "text": "So the one influenced the other, I think."}, {"time": 4339, "text": "They kind of started adjusting together."}, {"time": 4341, "text": "I did this thing, I mean, I'm trying to understand this."}, {"time": 4345, "text": "Part of the, I've been playing with the entrepreneurial idea."}, {"time": 4350, "text": "That's a very particular dream I've had of a startup."}, {"time": 4354, "text": "That this is a longer term thing, it has to do with artificial intelligence."}, {"time": 4359, "text": "But more and more, it seems like there's some trajectory through creating social media type of technologies."}, {"time": 4367, "text": "Very different than what people are thinking I'm doing."}, {"time": 4369, "text": "But it's a kind of challenge to the way the Twitter is done."}, {"time": 4375, "text": "But it's not obvious what the best mechanisms are to still make an exceptionally engaging platform."}, {"time": 4381, "text": "My clubhouse is very engaging."}, {"time": 4383, "text": "And not have any other negative effects."}, {"time": 4386, "text": "For example, there's Chrome extensions that allow you to turn off all likes and dislikes and all of that from Twitter."}, {"time": 4394, "text": "So all you're seeing is just the content."}, {"time": 4398, "text": "On Twitter, that to me creates, that's not a compelling experience at all."}, {"time": 4403, "text": "Because I still need, I would argue, I still need the likes to know what's a tweet worth reading."}, {"time": 4410, "text": "Because I don't only have a limited amount of time, so I need to know what's valuable."}, {"time": 4414, "text": "It's like great Yelp reviews on tweets or something."}, {"time": 4416, "text": "But I've turned off on, for example, on my account on YouTube, I wrote a Chrome extension that turns off all likes and dislikes and just views."}, {"time": 4430, "text": "I don't know how many views the video gets and so on."}, {"time": 4433, "text": "Unless it's on my phone."}, {"time": 4433, "text": "Did you take off the recommendations?"}, {"time": 4438, "text": "On YouTube, some people, distraction for YouTube is a big one for people."}, {"time": 4442, "text": "No, I'm not worried about the distraction because I'm able to control myself on YouTube."}, {"time": 4446, "text": "You don't rabbit hole."}, {"time": 4447, "text": "No, I don't rabbit hole."}, {"time": 4449, "text": "So you have to know your demons or your addictions or whatever."}, {"time": 4452, "text": "On YouTube, I'm okay."}, {"time": 4453, "text": "I don't keep clicking."}, {"time": 4454, "text": "The negative feelings come from seeing the views on stuff you've created."}, {"time": 4462, "text": "Oh, so you don't want to see your views."}, {"time": 4464, "text": "So I'm just speaking to the things that I'm aware of of myself that are helpful and things that are not helpful emotionally."}, {"time": 4471, "text": "And I feel like there should be, we need to create actually tooling for ourselves."}, {"time": 4477, "text": "That's not me with JavaScript, but anybody is able to create, sort of control the experience that they have."}, {"time": 4485, "text": "Well, so my big unified theory on social media is I'm very bearish on the big platforms having a long future."}, {"time": 4494, "text": "I think the moment of three or four major platforms is not gonna last, right?"}, {"time": 4503, "text": "This is just perspective, right?"}, {"time": 4503, "text": "So you can start shorting these stocks on my, don't tell."}, {"time": 4507, "text": "It's not financial advice."}, {"time": 4510, "text": "Don't do it Robinhood."}, {"time": 4511, "text": "So here's, I think the big mistake the major platforms made as when they took out the network effect advantage, right?"}, {"time": 4519, "text": "So the original pitch, especially if something like Facebook or Instagram was the people you know are on here, right?"}, {"time": 4526, "text": "So like what you use this for is you can connect to people that you already know."}, {"time": 4529, "text": "This is what makes the network useful."}, {"time": 4531, "text": "So therefore the value of our network grows quadratically with the number of users."}, {"time": 4535, "text": "And therefore it's such a headstart that there's no way that someone else can catch up."}, {"time": 4540, "text": "But when they shifted and when Facebook took the lead of say we're gonna shift towards a newsfeed model, they basically said we're going to try to in the moment get more data and get more likes."}, {"time": 4550, "text": "Like what we're gonna go towards is actually just seeing interesting stuff."}, {"time": 4554, "text": "Like seeing different information."}, {"time": 4555, "text": "So people took this social internet impulse to connect to people digitally, to other tools like group text messages and WhatsApp and stuff like this, right?"}, {"time": 4563, "text": "So you don't think about these tools as oh, this is where I connect with people."}, {"time": 4566, "text": "Once it's just a feed that's kind of interesting, now you're competing with everything else that can produce interesting content that's diverting."}, {"time": 4573, "text": "And I think that is a much fiercer competition because now for example, you're going up against podcasts, right?"}, {"time": 4579, "text": "I mean like, okay, I guess the Twitter feed is interesting right now, but also a podcast is interesting or something else could be interesting too."}, {"time": 4585, "text": "I think it's a much fiercer competition when there's no more network effects, right?"}, {"time": 4589, "text": "And so my sense is we're gonna see a fragmentation into what I call long tail social media, where if I don't need everyone I know to be on a platform, then why not have three or four bespoke platforms I use where it's a thousand people and we're all interested in whatever, AI or comedy."}, {"time": 4607, "text": "And we've perfected this interface and maybe it's like Clubhouse, it's audio or something."}, {"time": 4612, "text": "And we all pay $2 so that we don't have to worry about attention harvesting."}, {"time": 4615, "text": "And that's gonna be wildly more entertaining."}, {"time": 4617, "text": "Like, I mean, I'm thinking about comedians on Twitter."}, {"time": 4620, "text": "It's not the best internet possible format for them expressing themselves and being interesting."}, {"time": 4626, "text": "That you have all these comedians that are trying to like, well, I can do like little clips and little whatever."}, {"time": 4630, "text": "Like, I don't know if there was a long tail social media."}, {"time": 4633, "text": "I mean, it's really, this is where the comedians are and there's podcasts and the comedians are on podcasts now."}, {"time": 4636, "text": "So this is my thought is that there's really no, there's really no strong advantage to having one large platform that everyone is on."}, {"time": 4645, "text": "If all you're getting from it is, I now have different options for diversion and like uplifting aspirational or whatever types of entertainment, that whole thing could fragment."}, {"time": 4654, "text": "And I think the glue that was holding together was network effects."}, {"time": 4656, "text": "I don't think they realized that when network effects have been destabilized, they don't have the centrifugal force anymore and they're spinning faster and faster."}, {"time": 4663, "text": "But is a Twitter feed really that much more interesting than all of these streaming services?"}, {"time": 4668, "text": "Is it really that much more interesting than Clubhouse, is it that much more interesting than podcast?"}, {"time": 4674, "text": "I feel like they don't realize how unstable their ground actually is."}, {"time": 4678, "text": "But the thing that makes Twitter and Facebook work, I mean, the newsfeed, you're exactly right."}, {"time": 4687, "text": "Like you can just duplicate the news."}, {"time": 4688, "text": "Like if it's not the social network and it's the newsfeed, then why not have multiple different feeds that are more, that are better at satisfying."}, {"time": 4697, "text": "There's a dopamine gamification that they've figured out."}, {"time": 4701, "text": "And so you have to, whatever you create, you have to at least provide some pleasure in that same gamification kind of way."}, {"time": 4709, "text": "It doesn't have to have to do with scale of large social networks."}, {"time": 4713, "text": "But I mean, I guess you're implying that you should be able to design that kind of mechanism in other forms."}, {"time": 4720, "text": "Or people are turning on that gamification."}, {"time": 4722, "text": "I mean, so people are getting wise to it and are getting uncomfortable about it, right?"}, {"time": 4726, "text": "So if I'm offering something, these exist out here."}, {"time": 4729, "text": "Like sugar."}, {"time": 4729, "text": "People realize sugar's bad for you."}, {"time": 4730, "text": "Yeah, sugar's great."}, {"time": 4731, "text": "They're gonna stop eating it."}, {"time": 4732, "text": "Yeah, drinking a lot's great too, but also after a while you realize there's problems."}, {"time": 4736, "text": "So some of the long tail social media networks that are out there that I've looked at, they offer usually like a deeper sense of connection."}, {"time": 4742, "text": "Like it's usually interesting people that you share some affinity and you have these carefully cultivated."}, {"time": 4748, "text": "I wrote this New Yorker piece a couple of years ago about the indie social media movement that really got into some of these different technologies."}, {"time": 4754, "text": "But I think the technologies are a distraction."}, {"time": 4757, "text": "We focus too much on Macedon versus whatever."}, {"time": 4760, "text": "Like forget, or Discord."}, {"time": 4761, "text": "Like actually let's forget the protocols right now."}, {"time": 4763, "text": "It's the idea of, okay."}, {"time": 4766, "text": "And there's a lot of these long tail social media groups, what people are getting out of it, which I think can outweigh the dopamine gamification is strong connection and motivation."}, {"time": 4775, "text": "Like you're in a group with other guys that are all trying to be better dads or something like this."}, {"time": 4780, "text": "And you talk to them on a regular basis and you're sharing your stories and there's interesting talks."}, {"time": 4785, "text": "And that's a powerful thing too."}, {"time": 4787, "text": "One interesting thing about scale of Twitter is you have these viral spread of information."}, {"time": 4793, "text": "So sort of Twitter has become a newsmaker in itself."}, {"time": 4797, "text": "Yeah, I think it's a problem."}, {"time": 4798, "text": "Well, yes, but I wonder what replaces that because then you immediately."}, {"time": 4803, "text": "Reporting?"}, {"time": 4805, "text": "Reporters have to do some work again, I don't know."}, {"time": 4807, "text": "The problem with reporters and journalism is that they're intermediary."}, {"time": 4812, "text": "They have control."}, {"time": 4814, "text": "I mean, this is the problem in Russia currently is that it creates a shield between the people and the news."}, {"time": 4822, "text": "The interesting thing and the powerful thing about Twitter is that the news originates from the individual that's creating the news."}, {"time": 4829, "text": "Like you have the former president of the United States on Twitter creating news."}, {"time": 4834, "text": "You have Elon Musk creating news."}, {"time": 4836, "text": "You have people announcing stuff on Twitter as opposed to talking to a journalist."}, {"time": 4841, "text": "And that feels much more genuine and it feels very powerful, but actually coming to realize it doesn't need the social network."}, {"time": 4853, "text": "You can just put that announcement on a YouTube type thing."}, {"time": 4856, "text": "This is what I'm thinking."}, {"time": 4856, "text": "Right, so this is my point about that because that's right."}, {"time": 4859, "text": "The democratizing power of the internet is fantastic."}, {"time": 4861, "text": "I mean, I'm an old school internet nerd, a guy that was telemeting in the servers and gophering before the World Wide Web was around, right?"}, {"time": 4868, "text": "So I'm a huge internet booster."}, {"time": 4870, "text": "And that's one of its big power."}, {"time": 4872, "text": "But when you put everything on Twitter, I think the fact that you've taken, you homogenized everything, right?"}, {"time": 4878, "text": "So everything looks the same, moves with the same low friction is very difficult."}, {"time": 4882, "text": "You have no what I call distributed curation, right?"}, {"time": 4885, "text": "The only curation that really happens, there's a little bit with likes and also the algorithm."}, {"time": 4916, "text": "So if you think like the 2004 presidential election, most of the information people are getting from the internet was one of the first big internet news driven elections was from, you had like the daily costs and drudge, but there was like blogs that were out there and this was back, Ezra Klein was just running a blog out of his dorm room at this point, right?"}, {"time": 4975, "text": "So everything you've said up until the very last statement, I would agree with."}, {"time": 4981, "text": "This is a topic I don't know a ton about, I guess, QAnon."}, {"time": 4983, "text": "There's, I think, I'll forget QAnon."}, {"time": 4987, "text": "Yeah, no, we can."}, {"time": 4988, "text": "But QAnon is, QAnon could be that, I also don't know, I should know more, I apologize, I don't know more."}, {"time": 4993, "text": "I mean, that's a power and the downside, you can have, I mean, Hitler could have a blog today and you would have potentially a very large following if he's charismatic, if he's as good with words, is able to express the ideas, whatever maybe he's able to channel, the frustration, the anger that people have about a certain thing."}, {"time": 5014, "text": "And so I think that's the power of blogs, but it's also the limitation, but that doesn't, we're not trying to solve that."}, {"time": 5020, "text": "You can't solve that, yeah."}, {"time": 5021, "text": "The fundamental problem you're saying is not the problem."}, {"time": 5025, "text": "Your thesis is that there's nothing special about large scale social networks that guarantees that they will keep existing."}, {"time": 5033, "text": "And it's important to remember for a lot of the older generation of internet activists or the people who are very pro internet in the early days, they were completely flabbergasted by the rise of these platforms."}, {"time": 5045, "text": "Say, why would you take the internet and then build your own version of the internet where you own all the servers?"}, {"time": 5052, "text": "And we built this whole distributed, the whole thing, we had open protocols."}, {"time": 5056, "text": "Everyone anywhere in the world could use the same protocols."}, {"time": 5058, "text": "Your machine can talk to any other machine."}, {"time": 5060, "text": "It's the most democratic communication system that's ever been built."}, {"time": 5064, "text": "And then these companies came along and said, we're gonna build our own, we'll just own all the servers and put them in buildings that we own."}, {"time": 5069, "text": "And the internet will just be the first mile that gets you into our private internet where we owned the whole thing."}, {"time": 5073, "text": "It went completely against the entire motivation of the internet was like, yes, it's not gonna be one person owns all the servers and you pay to access them."}, {"time": 5082, "text": "It's any one server that they own could talk to anyone else's server because we all agree on a standard set of protocols."}, {"time": 5088, "text": "And so the old guard of pro internet people never understood this move towards let's build private versions of the internet."}, {"time": 5097, "text": "We'll build three or four private internets and that's what we'll all use."}, {"time": 5100, "text": "It was the opposite basically."}, {"time": 5101, "text": "Well, it's funny enough, I don't know if you follow, but Jack Dorsey is also as a proponent and is helping to fund, create fully distributed versions of Twitter, essentially, I think that would potentially destroy Twitter."}, {"time": 5115, "text": "But I think there might be financial, like business cases to be made there, I'm not sure."}, {"time": 5121, "text": "But that seems to be another alternative as opposed to creating a bunch of like the long tail, creating like the ultimate long tail of like fully distributed."}, {"time": 5133, "text": "Yeah, which is what the internet is."}, {"time": 5135, "text": "But that's sort of my long, when I'm thinking about long tail social media, I'm thinking it's like the tech's not so important."}, {"time": 5140, "text": "Like there's groups out there, right?"}, {"time": 5142, "text": "I know where the tech they use to actually implement their digital only social group, whatever, they might use Slack, they might use some combination of Zoom or it doesn't matter."}, {"time": 5151, "text": "I think in the tech world, we wanna build the beautiful protocol that okay, everyone's gonna use as just a federated server protocol in which we've worked out X, Y, and Z, and no one understands it because then the engineers need it all to make, I get it because I'm a nerd like this, like, okay, every standard has to fit with everything else and no one understands what's going on."}, {"time": 5167, "text": "Meanwhile, you have this group of bike enthusiasts that are like, yeah, we'll just jump on to Zoom and have some Slack and put up a blog."}, {"time": 5174, "text": "The tech doesn't really matter."}, {"time": 5175, "text": "Like we built a world with our own curation, our own rules, our own sort of social ecosystem that's generating a lot of value."}, {"time": 5183, "text": "I mean, I don't know if it'll happen."}, {"time": 5184, "text": "There's a lot of money at stake with obviously these large, but I just think they're more, they're so, I mean, look how quickly Americans left Facebook, right?"}, {"time": 5193, "text": "I mean, Facebook was savvy to buy other properties and to diversify, right?"}, {"time": 5196, "text": "But how quick did that take for just standard Facebook news feed?"}, {"time": 5200, "text": "Everyone under the age of something were using it and no one under a certain age is using it now."}, {"time": 5204, "text": "It took like four years."}, {"time": 5205, "text": "I mean, this stuff is really."}, {"time": 5207, "text": "I believe people can leave Facebook overnight."}, {"time": 5211, "text": "Like I think Facebook hasn't actually messed up like enough to, there's two things."}, {"time": 5217, "text": "They haven't messed up enough for people to really leave aggressively and there's no good alternative for them to leave."}, {"time": 5223, "text": "I think if good alternatives pop up, it would just immediately happen."}, {"time": 5227, "text": "The stuff is a lot more culturally fragile, I think."}, {"time": 5230, "text": "I mean, Twitter's having a moment because it was feeding a certain type of, I mean, there's a lot of anxieties that was in the sort of political sphere anyways that Twitter was working with, but its moment could go to as well."}, {"time": 5241, "text": "I mean, it's a really arbitrary thing."}, {"time": 5243, "text": "Short little things."}, {"time": 5244, "text": "I read a Wired article about this earlier in the pandemic."}, {"time": 5247, "text": "This is crazy that the way that we're trying to communicate information about the pandemic is all these weird arbitrary rules where people are screenshotting pictures of articles that are part of a tweet thread where you say one slash in under it."}, {"time": 5260, "text": "We have the technology guys to really clearly convey long form information to people."}, {"time": 5267, "text": "Why do we have these?"}, {"time": 5268, "text": "And I know this because it's the gamified dopamine hits, but what a weird medium."}, {"time": 5272, "text": "There's no reason for us to have to have these threads that you have to find and pin with your screenshot."}, {"time": 5277, "text": "I mean, we have technology to communicate better using the internet."}, {"time": 5280, "text": "I mean, why are epidemiologists having to do tweet threads?"}, {"time": 5285, "text": "Because there's mechanisms of publishing that make it easier on Twitter."}, {"time": 5288, "text": "I mean, we're evolving as a species and the internet is a very fresh thing."}, {"time": 5292, "text": "And so it's kind of interesting to think that as opposed to Twitter, this is what Jack also complains about is Twitter's not innovating fast enough."}, {"time": 5303, "text": "And so it's almost like the people are innovating and thinking about their productive life faster than the platforms on which they operate can catch up."}, {"time": 5313, "text": "And so at the point the gap grows sufficiently, they'll jump."}, {"time": 5318, "text": "A few people, a few innovative folks will just create an alternative and perhaps distributed perhaps just many little silos and then people will jump and then we'll just continue this kind of way."}, {"time": 5330, "text": "Yeah, but see, I think like Substack, for example, what they're gonna pull out of Twitter, among other things, is the audience that was, let's say, like slightly left of center, but slightly left of center, don't like Trump, uncomfortable with like postmodern critical theories made into political action, right?"}, {"time": 5347, "text": "And they're like, yeah, Twitter, there was people on there talking about this and it made me feel sort of hurt because I was feeling a little bit like a nerd about it."}, {"time": 5354, "text": "But honestly, I'd probably rather subscribe to the four subs, you know, I'm gonna have like Barry's and Andrew Sullivan's, I'll have like a Jesse Signals, like I'll have a few substacks I can subscribe to and honestly, I'm a knowledge worker who's 32 anyways, probably that's an email all day."}, {"time": 5368, "text": "And so like, there's an innovation that's gonna, that group, you know, it's gonna suck them off."}, {"time": 5372, "text": "Which is actually a very large group."}, {"time": 5374, "text": "Yeah, that's a lot of energy."}, {"time": 5376, "text": "And then once Trump's gone, I guess that's probably gonna drive, that drove a lot of more like Trump people off Twitter."}, {"time": 5382, "text": "Like this stuff is fragile, I think."}, {"time": 5384, "text": "I, but the fascinating thing to me, because I've hung out on Parler for a short amount enough to know that the interface matters."}, {"time": 5392, "text": "It's so fascinating like that, that it's not just about ideas."}, {"time": 5397, "text": "It's about creating like Substack 2, creating a pleasant experience, a dicting experience."}, {"time": 5404, "text": "No, you're right, you're right about that."}, {"time": 5406, "text": "And it's why the, this is one of the conclusions from that indie social media article is it's just the ugliness matters."}, {"time": 5412, "text": "And I don't mean even just aesthetically, it's just the clunkiness of the interfaces."}, {"time": 5417, "text": "And I don't know, it's, to some degree, the social media companies have spent a lot of money on this."}, {"time": 5421, "text": "And to some degree, it's a survivorship bias, right?"}, {"time": 5424, "text": "I think Twitter, every time I hear Jack talks about this, it seems like he's as surprised as anyone else, the way Twitter is being used."}, {"time": 5431, "text": "I mean, it's basically the way, you know, they had it years ago."}, {"time": 5436, "text": "And then, you know, it was like, great, there'll be statuses, right?"}, {"time": 5439, "text": "This is what I'm doing, you know?"}, {"time": 5441, "text": "And my friends can follow me and see it."}, {"time": 5442, "text": "Without really changing anything, it just happened to hit everything right to support this other type of interaction."}, {"time": 5447, "text": "Well, there's also the JavaScript model, which Brendan Eich talked about."}, {"time": 5451, "text": "He just implemented JavaScript, like the crappy version of JavaScript in 10 days, threw it out there and just changed it really quickly, evolved it really quickly."}, {"time": 5461, "text": "And now it's become, according to Stack Exchange, the most popular programming language in the world that drives like most of the internet and even the backend and now mobile."}, {"time": 5470, "text": "And so that's an argument for the kind of thing you're talking about where like the bike club people could literally create the thing that would, you know, run most of the internet in 10 years from now."}, {"time": 5485, "text": "So there's something to that, like as opposed to trying to get lucky or trying to think through stuff is just to solve a particular problem."}, {"time": 5493, "text": "Do stuff, yeah."}, {"time": 5494, "text": "And then do stuff."}, {"time": 5495, "text": "Do stuff, keep tinkering until you love it."}, {"time": 5497, "text": "And then, and of course the sad thing is timing and luck matter and that you can't really control."}, {"time": 5505, "text": "But you can't go back to 2007."}, {"time": 5508, "text": "That's like the number one thing you could do to have a lot of success with a new platform is go back in time 14 years."}, {"time": 5513, "text": "So the thing you have to kind of think about is what is the like, what's the totally new thing that 10 years from now would seem obvious."}, {"time": 5523, "text": "I mean, some people saying clubhouses that, there's been a lot of stuff like clubhouse before, but it hit the right kind of thing."}, {"time": 5532, "text": "Similar to Tesla actually, what clubhouse did is it got a lot of relatively famous people on there quickly."}, {"time": 5539, "text": "And then the other effect is like, it's invite only."}, {"time": 5544, "text": "So like, oh, all the smart, like famous people are on there."}, {"time": 5547, "text": "I wonder what's, it's the FOMO, like fear that you're missing something really profound as exciting happening there."}, {"time": 5554, "text": "So those social effects."}, {"time": 5556, "text": "And then once they actually show up, I'm a huge fan of this."}, {"time": 5560, "text": "It's the JavaScript model is like, clubhouse is so dumb, like so simple in its interface."}, {"time": 5566, "text": "Like you literally can't do anything except mute, unmute."}, {"time": 5570, "text": "There's a mute button."}, {"time": 5572, "text": "And there's a leave quietly button."}, {"time": 5575, "text": "And it's kinda."}, {"time": 5576, "text": "I love single use technology that sense, yeah."}, {"time": 5579, "text": "There's no like, there's no, it's just like trivial."}, {"time": 5584, "text": "And Twitter kinda started like that."}, {"time": 5588, "text": "Facebook started like that."}, {"time": 5590, "text": "But they've evolved quickly to add all these features and so on."}, {"time": 5593, "text": "And I do hope clubhouse stays that way."}, {"time": 5597, "text": "Or there's alternatives."}, {"time": 5598, "text": "I mean, even with clubhouse though, so one of the issues with a lot of these platforms I think is bits are cheap enough now that we don't really need a unicorn investor model."}, {"time": 5610, "text": "I mean, the investors need that model."}, {"time": 5612, "text": "There's really not really an imperative of we need something that can scale to a hundred million plus a year revenue."}, {"time": 5622, "text": "So, because it was gonna require this much seed and angel investment, and you're not gonna get this much seed angel investment unless you can have a potential exit this wide because you have to be part of a portfolio that depends on one out of 10 exiting here."}, {"time": 5635, "text": "If you don't actually need that and you don't need to satisfy that investor model, which I think is basically the case."}, {"time": 5641, "text": "I mean, bits are so cheap."}, {"time": 5642, "text": "Everything is so cheap."}, {"time": 5644, "text": "So even like with clubhouse, it's investor backed, right?"}, {"time": 5647, "text": "This notion of like, this needs to be a major platform, but the bike club doesn't necessarily need a major platform."}, {"time": 5654, "text": "That's where I'm interested."}, {"time": 5655, "text": "There's so much money."}, {"time": 5656, "text": "That's the only problem that bets against me is that you can concentrate a lot of capital if you do these things, right?"}, {"time": 5662, "text": "I mean, so Facebook was like a fantastic capital concentration machine."}, {"time": 5666, "text": "It's crazy how much, where it even found that capital in the world that it could concentrate and ossify in the stock price that a very small number of people have access to, right?"}, {"time": 5675, "text": "That's incredibly powerful."}, {"time": 5677, "text": "So when there is a possibility to consolidate and gather a huge amount of capital, that's a huge imperative that's very hard for the bike club to go up against, so."}, {"time": 5685, "text": "But there's a lot of money in the bike club."}, {"time": 5687, "text": "If you see what the Wall Street bets on that when a bunch of people get together, I mean, it doesn't have to be a bike."}, {"time": 5694, "text": "It could be a bunch of different bike clubs just kind of team up to overtake."}, {"time": 5699, "text": "That's what we're doing now, yeah."}, {"time": 5700, "text": "Or we're gonna repurpose off the shelf stuff."}, {"time": 5703, "text": "That's not, yeah, we're gonna repurpose whatever it was for office productivity or something, and like the clubs using Slack just to build out these, you know."}, {"time": 5712, "text": "Let's talk about email."}, {"time": 5715, "text": "I wrote a book."}, {"time": 5716, "text": "You wrote yet another amazing book, A World Without Email."}, {"time": 5722, "text": "Maybe one way to enter this discussion is to ask what is the hyperactive hive mind, which is the concept you opened the book with?"}, {"time": 5729, "text": "Yeah, and the devil."}, {"time": 5731, "text": "And the devil."}, {"time": 5732, "text": "It's the scourge of hundreds of millions."}, {"time": 5735, "text": "So I think, so I called this book A World Without Email."}, {"time": 5740, "text": "The real title should be A World Without the Hyperactive Hive Mind Workflow, but my publisher didn't like that, right?"}, {"time": 5745, "text": "So we had to get a little bit more pithy."}, {"time": 5747, "text": "I was trying to answer the question after deep work, why is it so hard to do this?"}, {"time": 5752, "text": "Like, if this is so valuable, if we can produce much higher, if people are much happier, why do we check email a day?"}, {"time": 5758, "text": "Why are we on Slack all day?"}, {"time": 5760, "text": "And so I started working on this book immediately after deep work."}, {"time": 5764, "text": "And so my initial interviews were done in 2016."}, {"time": 5766, "text": "So it took five years to pull the threads together."}, {"time": 5768, "text": "I was trying to understand why is it so hard for most people to actually find any time to do the stuff that actually moves the needle?"}, {"time": 5776, "text": "And the story was, and I thought this was, I hadn't heard this reported anywhere else."}, {"time": 5780, "text": "That's why it took me so long to pull it together, is email arrives on the scene, email spreads, I trace it, it really picks up steam in the early 1990s, between like 1990 and 1995, it makes its move, right?"}, {"time": 5792, "text": "And it does so for very pragmatic reasons."}, {"time": 5794, "text": "It was replacing existing communication technologies that it was better than."}, {"time": 5797, "text": "It was mainly the fax machine, voicemail, and memos, right?"}, {"time": 5799, "text": "So this was just better, right?"}, {"time": 5801, "text": "So it was a killer app because it was useful."}, {"time": 5804, "text": "In its wake came a new way of collaborating, and that's the Hyperactive Hive Mind."}, {"time": 5809, "text": "So it's like the virus that follows the rats that went through Western Europe for the Black Pig."}, {"time": 5815, "text": "As email spread through organizations, in its wake came the Hyperactive Hive Mind workflow, which says, okay, guys, here's the way we're gonna collaborate."}, {"time": 5823, "text": "We'll just work things out on the fly with unscheduled back and forth messages."}, {"time": 5827, "text": "Just boom, boom, boom, let's go back and forth."}, {"time": 5829, "text": "Hey, what about this?"}, {"time": 5829, "text": "Did you see this?"}, {"time": 5830, "text": "What about that client?"}, {"time": 5831, "text": "What's going on over here?"}, {"time": 5833, "text": "That followed email."}, {"time": 5834, "text": "It completely took over office work."}, {"time": 5838, "text": "And the need to keep up with all of these asynchronous back and forth unscheduled messages, as those got more and more and more, and we had more of those to service, the need to service those required us to check more and more and more and more, right?"}, {"time": 5850, "text": "And so by the time, and I go through the numbers, but by the time you get to today, now the average knowledge worker has to check one of these channels once every six minutes."}, {"time": 5857, "text": "Because every single thing you do in your organization, how you talk to your colleagues, how you talk to your vendors, how you talk to your clients, how you talk to the HR department, it's all this asynchronous unscheduled back and forth messaging."}, {"time": 5867, "text": "And you have to service the conversations."}, {"time": 5869, "text": "And it spiraled out of control, and it has sort of devolved a lot of work in the office now to all I do is constantly tend communication channels."}, {"time": 5878, "text": "So it's fascinating what you're describing is nobody ever paused in this whole evolution to try to create a system that actually works."}, {"time": 5888, "text": "That it was kind of like a huge fan of cellular automata."}, {"time": 5893, "text": "So it's just kind of started a very simple mechanism, just like cellular automata."}, {"time": 5898, "text": "It just kind of grew to overtake all the fundamental communication of how we do business and also personal life."}, {"time": 5905, "text": "Yeah, and that's one of the big ideas is that the unintentionality, right?"}, {"time": 5909, "text": "So this goes back to technological determinism."}, {"time": 5911, "text": "I mean, this is a weird business book because I go deep on philosophy."}, {"time": 5915, "text": "I go deep on, for some reason, we get into paleoanthropology for a while."}, {"time": 5919, "text": "We do a lot of neuroscience."}, {"time": 5920, "text": "It's kind of a weird book."}, {"time": 5922, "text": "But I got real into this technological determinism, right?"}, {"time": 5924, "text": "This notion that just the presence of a technology can change how people act."}, {"time": 5928, "text": "That's my big argument about what happened with the hive mind."}, {"time": 5931, "text": "And I can document specific examples, right?"}, {"time": 5934, "text": "So I document this example in IBM, 1987, maybe 85, but it's in like the mid to late eighties, IBM, R. Monk headquarters."}, {"time": 5943, "text": "We're gonna put an internal email, right?"}, {"time": 5945, "text": "Because it's convenient."}, {"time": 5947, "text": "And so they ran a whole study."}, {"time": 5949, "text": "And so I talked to the engineer who ran the study, Adrian Stone, like we're gonna run this study to figure out how much do we communicate because it was still an era where it's expensive, right?"}, {"time": 5957, "text": "So you have to provision a mainframe."}, {"time": 5959, "text": "So you can't over provision."}, {"time": 5960, "text": "Like we wanna know how much communication actually happened."}, {"time": 5962, "text": "So they went and figured it out."}, {"time": 5964, "text": "How many memos, how many calls, how many notes, great."}, {"time": 5966, "text": "We'll provision a mainframe to handle email that can handle all of that."}, {"time": 5969, "text": "So if all of our communication moves to email, the mainframe will still be fine."}, {"time": 5974, "text": "In three days, they had melted it down."}, {"time": 5976, "text": "People were communicating six times more than that estimate."}, {"time": 5979, "text": "So just in three days, the presence of a low friction digital communication tool drastically changed how everyone collaborated."}, {"time": 5986, "text": "So that's not enough time for an all hands meeting."}, {"time": 5989, "text": "Guys, we figured it out."}, {"time": 5991, "text": "This is what we need to communicate a lot more is what's gonna make us more productive."}, {"time": 5994, "text": "We need more emails."}, {"time": 5995, "text": "It's emergent."}, {"time": 5997, "text": "Isn't that just on the positive end, amazing to you?"}, {"time": 6000, "text": "Like, isn't email amazing?"}, {"time": 6003, "text": "Like in those early days, like just the frictionless communication."}, {"time": 6007, "text": "I mean, email is awesome."}, {"time": 6009, "text": "Like people say that there's a lot of problems with emails, just like people say a lot of problems with Twitter and so on."}, {"time": 6015, "text": "It's kind of cool that you can just send a little note."}, {"time": 6018, "text": "It was a miracle, right?"}, {"time": 6020, "text": "So I wrote a, there's originally was a New Yorker piece from a year or two ago called, was email a mistake?"}, {"time": 6026, "text": "And then it's in the book too."}, {"time": 6028, "text": "But I go into the history of email, like why did it come along?"}, {"time": 6032, "text": "And it solved a huge problem."}, {"time": 6034, "text": "It was the problem of fast asynchronous communication."}, {"time": 6037, "text": "And it was a problem that did not exist until we got large offices."}, {"time": 6041, "text": "We got large offices, synchronous communication, like let's get on the phone at the same time."}, {"time": 6044, "text": "There's too much overhead to it."}, {"time": 6045, "text": "There's too many people you might have to talk to."}, {"time": 6048, "text": "Asynchronous communication, like let me send you a memo when I'm ready and you can read it when you're ready, took too long."}, {"time": 6053, "text": "And so it was like a huge problem."}, {"time": 6055, "text": "So one of the things I talked about is the way that when they built the CIA headquarters, there was such a need for fast asynchronous communication that they built a pneumatic powered email system."}, {"time": 6065, "text": "They had these pneumatic tubes all throughout the headquarters with electromagnetic routers."}, {"time": 6069, "text": "So you would put your message in a plexiglass tube and you would turn these brass dials about the location."}, {"time": 6075, "text": "You would stick it in these things and pneumatic tubes and it would shoot and sort and work its way through these tubes to show up in just a minute or something at the floor and at the general office suite where you wanted to go."}, {"time": 6086, "text": "And my point is the fact that they spent so much money to make that work, to show how important fast asynchronous communication was to large offices."}, {"time": 6093, "text": "So when email came along, it was a productivity silver bullet."}, {"time": 6097, "text": "It was a miracle."}, {"time": 6097, "text": "I talked to the researchers who were working on computer supported collaboration in the late 80s, trying to figure out how are we gonna use computer networks to be more productive?"}, {"time": 6105, "text": "And they were building all these systems and tools."}, {"time": 6107, "text": "Email showed up, it just wiped all that research off the map."}, {"time": 6110, "text": "There was no need to build these custom intranet applications."}, {"time": 6113, "text": "There was no need to build these communication platforms."}, {"time": 6116, "text": "Email could just do everything."}, {"time": 6118, "text": "So it was a miracle application, which is why it spread everywhere."}, {"time": 6122, "text": "That's one of these things where, okay, on into the consequences, right?"}, {"time": 6125, "text": "You had this miracle productivity silver bullet."}, {"time": 6127, "text": "It spread everywhere, but it was so effective."}, {"time": 6130, "text": "It just, I don't know, like a drug."}, {"time": 6132, "text": "I'm sure there's some pandemic metaphor here, analogy here of a drug that like it's so effective at treating this that it also blows up your whole immune system and then everyone gets sick."}, {"time": 6141, "text": "Well, ultimately it probably significantly increased the productivity of the world, but there's a kind of hump that it now has plateaued."}, {"time": 6148, "text": "And then the fundamental question you're asking is like, okay, how do we take the next, how do we keep increasing the productivity?"}, {"time": 6155, "text": "Now, I think it brought it down."}, {"time": 6156, "text": "So my contention, and so again, there's a little bit in the book, but I have a more recent Wired article that puts some newer numbers to this."}, {"time": 6167, "text": "I subscribed to the hypothesis that the hyperactive hive mind was so detrimental."}, {"time": 6171, "text": "So yeah, it helped productivity at first, right?"}, {"time": 6173, "text": "When you could do fast asynchronous communication, but very quickly there was a sort of exponential rise in communication amounts."}, {"time": 6181, "text": "Once we got to the point where the hive mind meant you had to constantly check your email, I think that made us so unproductive that it actually was pulling down non industrial productivity."}, {"time": 6189, "text": "And I think the only reason why, so it certainly has not been going up."}, {"time": 6192, "text": "That metric has been stagnating for a long time now while all of this was going on."}, {"time": 6196, "text": "I think the only reason why it hasn't fallen is that we added these extra shifts off the books."}, {"time": 6202, "text": "I'm gonna work for three hours in the morning, I'm gonna work for three hours at night."}, {"time": 6205, "text": "And only that I think has allowed us to basically maintain a stagnated non industrial growth."}, {"time": 6211, "text": "We should have been shooting up the charts."}, {"time": 6213, "text": "I mean, this is miraculous innovations, the computer networks."}, {"time": 6216, "text": "And then we built out these hundred billion dollar ubiquitous worldwide high speed wireless internet infrastructure with supercomputers in our pockets where we could talk to anyone at any time."}, {"time": 6224, "text": "Like why did our productivity not shoot off the charts?"}, {"time": 6227, "text": "Because our brain can't context switch once every six minutes."}, {"time": 6229, "text": "So it's fundamentally back to the context switching."}, {"time": 6231, "text": "Context switching is poison."}, {"time": 6234, "text": "What is it about email that forces context switching?"}, {"time": 6238, "text": "Is it both our psychology that drags us in?"}, {"time": 6240, "text": "Or is it the expectation?"}, {"time": 6243, "text": "Because it's not, I think we've seen this through a personal will or failure lens recently."}, {"time": 6248, "text": "Like, oh, am I addicted to email?"}, {"time": 6251, "text": "I have bad etiquette about my email."}, {"time": 6254, "text": "No, it's the underlying workflow."}, {"time": 6256, "text": "So the tool itself I will exonerate."}, {"time": 6259, "text": "I think I would rather use POP3 than a fax protocol."}, {"time": 6263, "text": "I think it's easier."}, {"time": 6264, "text": "The issue is the hyperactive hive mind workflow."}, {"time": 6267, "text": "So if I am now collaborating with 20 or 30 different people with back and forth unscheduled messaging, I have to tend those conversations, right?"}, {"time": 6275, "text": "It's like you have 30 metaphorical ping pong tables."}, {"time": 6278, "text": "And when the balls come back across, you have to pretty soon hit it back or stuff actually grinds to a halt."}, {"time": 6283, "text": "So it's the workflow that's the problem."}, {"time": 6285, "text": "It's not the tools, the fact that we use it to do all of our collaboration."}, {"time": 6288, "text": "Let's just send messages back and forth, which means you can't be far from checking that."}, {"time": 6292, "text": "Cause if you take a break, if you batch, if you try to have better habits, it's gonna slow things down."}, {"time": 6298, "text": "So my whole villain is this hyperactive hive mind workflow."}, {"time": 6302, "text": "The tool is fine."}, {"time": 6303, "text": "I don't want the tool to go away, but I wanna replace the hyperactive hive mind workflow."}, {"time": 6307, "text": "I think this is gonna be one of the biggest value generating productivity revolutions of the 21st century."}, {"time": 6314, "text": "I quote an anonymous CEO who's pretty well known who says this is gonna be the moonshot of the 21st century."}, {"time": 6319, "text": "It's gonna be of that importance."}, {"time": 6320, "text": "There's so much latent productivity that's being suppressed because we just figure things out on the fly in email that as we figure that out, I think it's gonna be hundreds of billions of dollars."}, {"time": 6332, "text": "You're so absolutely right."}, {"time": 6335, "text": "The question is, what is a world without email look like?"}, {"time": 6339, "text": "How do we fix email?"}, {"time": 6340, "text": "So what happens is, at least in my vision, you identify, well, actually there's these different processes that make up my workday."}, {"time": 6349, "text": "Like these are things that I do repeatedly, often in collaboration with other people that do useful things for my company or whatever."}, {"time": 6356, "text": "Right now, most of these processes are implicitly implemented with the hyperactive hive mind."}, {"time": 6360, "text": "How do we do this thing?"}, {"time": 6361, "text": "Like answering client questions to shoot messages back and forth."}, {"time": 6365, "text": "Posting podcast episodes, we'll just figure it out on the fly."}, {"time": 6367, "text": "My main argument is we actually have to do like they did in the industrial sector, take each of these processes and say, is there a better way to do this?"}, {"time": 6374, "text": "And by better, I mean a way that's gonna minimize the need to have unscheduled back and forth messaging."}, {"time": 6379, "text": "So we actually have to do process engineering."}, {"time": 6382, "text": "This created a massive growth and productivity in the industrial sector during the 20th century."}, {"time": 6385, "text": "We have to do it in knowledge work."}, {"time": 6386, "text": "We can't just rock and roll an inbox as we actually have to say, how do we deal with client questions?"}, {"time": 6391, "text": "Well, let's put in place a process that doesn't require us to send messages back and forth."}, {"time": 6395, "text": "How do we post podcast episodes?"}, {"time": 6396, "text": "Let's automate this to a degree where I don't have to just send you a message on the fly."}, {"time": 6400, "text": "And you do this process by process and the pressure on that inbox is released."}, {"time": 6405, "text": "And now you don't have to check it every six minutes."}, {"time": 6406, "text": "So you still have email."}, {"time": 6407, "text": "I mean, like I need to send you a file."}, {"time": 6409, "text": "Sure, I'll use email, but we're not coordinating or collaborating over email or Slack, which is just a faster way of doing the hive mind."}, {"time": 6415, "text": "I mean, Slack doesn't solve anything there."}, {"time": 6417, "text": "You have better structured bespoke processes."}, {"time": 6420, "text": "I think that's what's gonna unleash this massive productivity."}, {"time": 6423, "text": "Bespoke, so the interesting thing is like, for example, you and I exchange some emails."}, {"time": 6427, "text": "So obviously I, let's just say in my particular case, I schedule podcasts."}, {"time": 6431, "text": "There's a bunch of different tasks, fascinatingly enough, that I do that can be converted into processes."}, {"time": 6439, "text": "Is it up to me to create that process?"}, {"time": 6441, "text": "Or do you think we also need to build tools just like email was a protocol for helping us create processes for the different tasks?"}, {"time": 6451, "text": "I mean, I think ultimately the whole organization, the whole team has to be involved."}, {"time": 6455, "text": "I think ultimately there's certainly a lot of investor money being spent right now to try to figure out those tools, right?"}, {"time": 6460, "text": "So I think Silicon Valley has figured this out in the past couple of years."}, {"time": 6463, "text": "This is the difference between when I was talking to people after Deep Work and now five years later is this scent is in the air, right?"}, {"time": 6471, "text": "Because there's so much latent productivity."}, {"time": 6473, "text": "So yes, there are gonna be new tools, which I think could help."}, {"time": 6475, "text": "There are already tools that exist."}, {"time": 6477, "text": "I mean, in the different groups I profiled use things like Trello or Basecamp or Asana or Flow and our schedule wants and acuity, like there's a lot of tools out there."}, {"time": 6488, "text": "The key is not to think about it in terms of what tool do I replace email with?"}, {"time": 6492, "text": "Instead, you think about it with, we're trying to come up with a process that reduces back and forth messages."}, {"time": 6497, "text": "Oh, what tool might help us do that?"}, {"time": 6501, "text": "Yeah, and I would push, it's not about necessarily efficiency."}, {"time": 6504, "text": "In fact, some of these things are gonna take more time."}, {"time": 6506, "text": "So writing a letter to someone is like a high value activity it's probably worth doing."}, {"time": 6511, "text": "The thing that's killer is the back and forth because now I have to keep checking, right?"}, {"time": 6515, "text": "So we scheduled this together because I knew you from before, but like most of the interviews I was scheduling for this actually I have a process with my publicist where we use a shared document and she puts stuffs in there and then I check it twice a week and there's scheduling options."}, {"time": 6530, "text": "I say, here's when I wanna do this one or this will work for this one or whatever."}, {"time": 6532, "text": "And it takes more time in the moment than just, but it means that we have almost no back and forth messaging for podcast scheduling, which without this, so like with my UK publisher, I didn't put this process in the place because we're not doing as many interviews, but it's all the time."}, {"time": 6547, "text": "And I'm like, oh, I could really feel the difference, right?"}, {"time": 6550, "text": "It's the back and forth that's killer."}, {"time": 6551, "text": "I suppose it is up to the individual people involved, like you said, knowledge workers, like they have to carry the responsibility of creating processes."}, {"time": 6563, "text": "Like how always asking the first principles question, how can this be converted into a process?"}, {"time": 6568, "text": "Yeah, so you can start by doing this yourself, like just with what you can control."}, {"time": 6572, "text": "I think ultimately once the teams are doing that, I think that's probably the right scale."}, {"time": 6576, "text": "If you try to do this at the organizational scale, you're gonna get bureaucracy, right?"}, {"time": 6579, "text": "So if it's, if Elon Musk is gonna dictate down to everyone at Tesla or something like this, that's too much remove and you get bureaucracy."}, {"time": 6588, "text": "But if it's, we're a team of six that's working together on whatever powertrain software, then we can figure out on our own, what are our processes?"}, {"time": 6597, "text": "How do we wanna do this?"}, {"time": 6598, "text": "So it's ultimately also creating a culture where saying like an email, sending an email just for the hell of it, it should be taboo."}, {"time": 6605, "text": "So you are being, you're being destructive to the productivity of the team by sending this email."}, {"time": 6612, "text": "As opposed to helping develop a process and so on that will ultimately automate this."}, {"time": 6620, "text": "That's why I'm trying to spread this message of the context switches as poison."}, {"time": 6624, "text": "I get so much into the science of it."}, {"time": 6625, "text": "I think we underestimate how much it kills us to have to wrench away our context, look at a message and come back."}, {"time": 6630, "text": "And so once you have the mindset of, it's a huge thing to ask of someone to have to take their attention off something and look back at this."}, {"time": 6638, "text": "And if they have to do that for three or four times, like we're just gonna figure this out on the fly and every message is gonna require five checks of the inbox while you wait for it."}, {"time": 6645, "text": "Now you've created whatever it is at this point, 25 or 30 context shifts."}, {"time": 6650, "text": "Like you've just done a huge disservice to someone's day."}, {"time": 6652, "text": "This would be like, if I had a professional athlete, like, hey, do me a favor."}, {"time": 6655, "text": "I need you to go do this press interview, but to get there, you're gonna have to carry this sandbag and sprint up this hill, like completely exhaust your muscles and then you have to go play a game."}, {"time": 6663, "text": "Like, of course I'm not gonna ask an athlete to do like an incredibly physically demanding thing right before a game, but something as easy as thoughts, question mark, or like, hey, do you wanna jump on a call and it's gonna be six back and forth messages to figure it out."}, {"time": 6675, "text": "It's kind of the cognitive equivalent, right?"}, {"time": 6677, "text": "You're taking the wind out of someone."}, {"time": 6679, "text": "Yeah, and by the way, for people who are listening, because I recently posted a few job openings for us so I wanted to help with this thing."}, {"time": 6686, "text": "And one of the things that people are surprised when they work with me is how many spreadsheets and processes are involved."}, {"time": 6692, "text": "Yeah, it's like Claude Shannon, right?"}, {"time": 6693, "text": "I talked about communication theory or information theory."}, {"time": 6696, "text": "It takes time to come up with a clever code upfront."}, {"time": 6698, "text": "So you spend more time upfront figuring out those spreadsheets and trying to get people on board with it."}, {"time": 6702, "text": "But then your communication going forward is all much more efficient."}, {"time": 6706, "text": "So over time, you're using much less bandwidth, right?"}, {"time": 6709, "text": "So you do pain upfront."}, {"time": 6712, "text": "It's quicker just right now to send an email."}, {"time": 6714, "text": "But if I spend a half day to do this over the next six months, I've saved myself 600 emails."}, {"time": 6720, "text": "Now, here's a tough question for, you know, from the computer science perspective, we often over optimize."}, {"time": 6727, "text": "So you've create processes and you, okay, just like you're saying, it's so pleasurable to increase in the longterm productivity that sometimes you just enjoy that process in itself by just creating processes and you actually never, like it has a negative effect on productivity longterm because you're too obsessed with the processes."}, {"time": 6753, "text": "Is that a nice problem to have essentially?"}, {"time": 6757, "text": "I mean, it's a problem."}, {"time": 6758, "text": "I mean, because let's look at the one sector that does do this, which is developers, right?"}, {"time": 6764, "text": "So agile methodologies like Scrum or Kanban are basically workflow methodologies that are much better than the hyperactive hive mind."}, {"time": 6772, "text": "But man, some of those programmers get pretty obsessive."}, {"time": 6775, "text": "I don't know if you've ever talked to a whatever level three Scrum master."}, {"time": 6779, "text": "They get really obsessive about like, it has to happen exactly this way and it's probably seven times more complex than it needs to be."}, {"time": 6787, "text": "I'm hoping that's just because nerds like me, you know, like to do that, but it's a broadly probably an issue, right?"}, {"time": 6794, "text": "We have to be careful because you can just go down that fiddling path."}, {"time": 6798, "text": "Like, so it needs to be, here's how we do it."}, {"time": 6799, "text": "Let's reduce the messages and let's roll, you know?"}, {"time": 6802, "text": "You can't save yourself through, if you can get the process just right, right?"}, {"time": 6808, "text": "So I wrote this article kind of recently called The Rise and Fall of Getting Things Done."}, {"time": 6812, "text": "And I profiled this productivity guru named Merlin Mann."}, {"time": 6844, "text": "So you have to have this sort of balance between, context switches are poison."}, {"time": 6850, "text": "So we got to get rid of the context switches."}, {"time": 6852, "text": "Once like something's working good enough to get rid of the context switches, then get after it."}, {"time": 6857, "text": "Yeah, there's a psychological process there for me."}, {"time": 6859, "text": "The OCD nature, like I've literally, embarrassing enough, have lost my shit before when, so in many of the processes that involve Python scripts, the rule is to not use spaces."}, {"time": 6874, "text": "Underscores, there's like rules for like how you format stuff, okay?"}, {"time": 6879, "text": "And like, I should not lose my shit when somebody had a space and maybe capital letters, like it's okay to have a space because there's this feeling like something's not perfect."}, {"time": 6891, "text": "And as opposed to in the Python script, allowing some flexibility around that, you create this programmatic way that's flawless and when everything's working perfectly, it's perfect."}, {"time": 6901, "text": "But actually, if you strive for perfection, it has the same stress, like has a lot of the stress that you were seeking to escape with the context switching because you're almost stressing about errors."}, {"time": 6918, "text": "Like when the process is functioning, there's always this anxiety of like, I wonder if it's gonna succeed."}, {"time": 6925, "text": "I wonder if it's gonna succeed."}, {"time": 6926, "text": "Yeah, no, no, I think some of that's just you and I probably."}, {"time": 6929, "text": "I mean, it's just our mindset, right?"}, {"time": 6930, "text": "We're in, we do computer science, right?"}, {"time": 6932, "text": "So chicken and egg, I guess."}, {"time": 6934, "text": "And a lot of the processes end up working here much rougher."}, {"time": 6937, "text": "It's like, okay, instead of letting clients just email me all the time, we have a weekly call and then we send them a breakdown of everything we committed to, right?"}, {"time": 6947, "text": "That's a process that works."}, {"time": 6948, "text": "Okay, I get asked a lot of questions because I'm the JavaScript guy in the company."}, {"time": 6951, "text": "Instead of doing it by email, I have office hours."}, {"time": 6953, "text": "This is what Basecamp does."}, {"time": 6954, "text": "All right, so you come to my office hours, that cuts down a lot of back and forth."}, {"time": 6957, "text": "All right, we're gonna, instead of emailing about this project, we'll have a Trello board and we'll do a weekly really structured status meeting real quick, what's going on, who needs what, let's go."}, {"time": 6967, "text": "And now everything's on there and on our inboxes, we don't have to send as many messages."}, {"time": 6970, "text": "So like that rough level of granularity, that gets you most of the way there."}, {"time": 6974, "text": "So the parts that you can't automate and turn into a process."}, {"time": 6978, "text": "So how many parts like that do you think should remain in a perfect world?"}, {"time": 6984, "text": "And for those parts where email is still useful, what do you recommend those emails look like?"}, {"time": 6992, "text": "How should you write emails?"}, {"time": 6994, "text": "When should you send them?"}, {"time": 6995, "text": "Yeah, I think email is good for delivering information."}, {"time": 7000, "text": "Right, so I think of it like a fax machine or something."}, {"time": 7003, "text": "It's a really good fax machine."}, {"time": 7004, "text": "So if I need to send you something and you just send you a file, I need to broadcast a new policy or something, like email is a great way to do it."}, {"time": 7011, "text": "It's bad for collaboration."}, {"time": 7013, "text": "So if you're having a conversation, like we're trying to reach a decision on something, I'm trying to learn about something, I'm trying to clarify what this is, that's more than just like a one answer type question, then I think that you shouldn't be doing an email."}, {"time": 7027, "text": "But see, here's the thing."}, {"time": 7028, "text": "Like you and I don't talk often and so we have a kind of new interaction."}, {"time": 7033, "text": "It's not, so sure, yeah, you have a book coming out, so there's a process and so on, but say there, don't you think there's a lot of novel interactive experiences?"}, {"time": 7044, "text": "Yeah, I think it's fine."}, {"time": 7045, "text": "So you could, just for every novel experience, it's okay to have a little bit of exchange."}, {"time": 7050, "text": "Like I think it's fine if stuff comes in over the transom or you hear from someone you haven't heard from in a while."}, {"time": 7056, "text": "I think all that's fine."}, {"time": 7057, "text": "I mean, that's email at its best."}, {"time": 7059, "text": "Where it starts to kill us is where all of our collaboration is happening with the back and forth."}, {"time": 7063, "text": "So when you've moved the bulk of that out of your inbox, now you're back in that Meg Ryan movie, like You Got Mail, where it's like, all right, load this up and you wait for the boat and be like, oh, we got a message."}, {"time": 7073, "text": "Yeah, Lex sent me a message."}, {"time": 7074, "text": "This is interesting, right?"}, {"time": 7075, "text": "You're back to the AOL days."}, {"time": 7076, "text": "So you're talking about the bulk of the business world where email has replaced the actual communication, all of the communication protocols required to accomplish anything."}, {"time": 7086, "text": "Everything is just happening with messages."}, {"time": 7088, "text": "So if you now get most stuff done, repeatable collaborations with other processes that don't require you to check these inboxes, then the inbox can serve like an inbox, which includes hearing from interesting people, right?"}, {"time": 7100, "text": "Or sending something, hey, I don't know if you saw this, I thought you might like it."}, {"time": 7103, "text": "I think it's great for that."}, {"time": 7104, "text": "So there's probably a bunch of people listening to this."}, {"time": 7107, "text": "They're like, yeah, but I work on a team and all they use is email."}, {"time": 7113, "text": "How do you start the revolution from the ground up?"}, {"time": 7115, "text": "Yeah, well, do asymmetric optimization first."}, {"time": 7119, "text": "So identify all your processes and then change what you can change and be socially very careful about it."}, {"time": 7124, "text": "So don't necessarily say like, okay, this is a new process we all have to do."}, {"time": 7128, "text": "You're just, hey, we gotta get this report ready."}, {"time": 7131, "text": "Here's what I think we should do."}, {"time": 7132, "text": "I'll get a draft into our Dropbox folder by noon on Monday, grab it."}, {"time": 7137, "text": "I won't touch it again until Tuesday morning and then I'll look at your changes."}, {"time": 7141, "text": "I have this office hours always scheduled Tuesday afternoon."}, {"time": 7143, "text": "So if there's anything that catches your attention, grab me then."}, {"time": 7147, "text": "But I've told the designer who CC'd on this that by COB Tuesday, the final version will be ready for them to take and polish or whatever."}, {"time": 7154, "text": "Like the person on the other end is like, great, I'm glad Cal has a plan."}, {"time": 7158, "text": "So what do I need to do?"}, {"time": 7159, "text": "I need to edit this tomorrow, whatever, right?"}, {"time": 7161, "text": "But you've actually pulled them into a process."}, {"time": 7162, "text": "That means we're gonna get this report together without having to just go back and forth."}, {"time": 7165, "text": "So you just asymmetrically optimize these things and then you can begin the conversation."}, {"time": 7171, "text": "And maybe that's where my book comes in place."}, {"time": 7172, "text": "You just sort of slide it across the desk."}, {"time": 7176, "text": "Buy the book and just leave it, give it to everybody on your team."}, {"time": 7180, "text": "Okay, so we solved the bulk of the email problem with this."}, {"time": 7182, "text": "Is there a case to be made that even for communication between you and I, we should move away from email?"}, {"time": 7190, "text": "And for example, there's a guy, I recently, I don't know if you know comedians, but there's a guy named Joey Diaz that I've had an interaction with recently."}, {"time": 7197, "text": "And that guy, first of all, the sweetest human, despite what his comedy sounds like, is the sweetest human being."}, {"time": 7204, "text": "And he's a big proponent of just pick up the phone and call."}, {"time": 7208, "text": "And it makes me so uncomfortable when people call me."}, {"time": 7211, "text": "It's like, I don't know what to do with this thing."}, {"time": 7214, "text": "But it kind of gets everything done quicker, I think, if I remove the anxiety from that."}, {"time": 7219, "text": "Is there a case to be made for that?"}, {"time": 7221, "text": "Or is email could still be the most efficient way to do this?"}, {"time": 7225, "text": "No, look, if you have to interact with someone, there's a lot of efficiency and synchrony, right?"}, {"time": 7230, "text": "And this is something from distributed system theory where you know if you go from synchronous to asynchronous networks, there's a huge amount of overhead to the asynchrony."}, {"time": 7236, "text": "So actually the protocols required to solve things in asynchronous networks are significantly more complicated and fragile than synchronous protocols."}, {"time": 7244, "text": "So if we can just do real time, it's usually better."}, {"time": 7246, "text": "And also from an interaction, like social connection standpoint, there's a lot more information in the human voice and the back and forth."}, {"time": 7253, "text": "Yeah, if you just call, so very generational, right?"}, {"time": 7256, "text": "Our generation will be comfortable talking on the phone in a way that a younger generation isn't, but an older generation is more comfortable with, well, you just call people."}, {"time": 7265, "text": "Whereas we, so there's a happy medium, but most of my good friends, we just talk, we have regular phone calls."}, {"time": 7271, "text": "Yeah, it's not, I don't just call them, we schedule it, we schedule it, yeah."}, {"time": 7274, "text": "Just on text, like, yeah, you wanna talk sometime soon."}, {"time": 7277, "text": "Do you ever have a process around friends?"}, {"time": 7280, "text": "Not really, no."}, {"time": 7282, "text": "I feel like I should, I feel like."}, {"time": 7284, "text": "Well, you have like a lot of interesting friend possibilities."}, {"time": 7287, "text": "You have like an interesting problem, right?"}, {"time": 7289, "text": "Like really interesting people you can talk to."}, {"time": 7292, "text": "Well, that's one problem."}, {"time": 7293, "text": "The other one is the introversion where I'm just afraid of people and get really stressed."}, {"time": 7297, "text": "Like I freak out."}, {"time": 7299, "text": "You picked a good line of work."}, {"time": 7301, "text": "Yeah, now perhaps it's the Goggins thing."}, {"time": 7303, "text": "It's like facing your fears or whatever, but it's almost like there's, it has to do with the timetables thing and the deep work that the nice thing about the processes is it not only automates sort of, automates away the context switching, it ensures you do the important things too."}, {"time": 7326, "text": "It's like prioritize."}, {"time": 7327, "text": "So the thing is with email, because everything is done over email, you can be lazy in the same way with like social networks and do the easy things first that are not that important."}, {"time": 7340, "text": "So the process also enforces that you do the important things."}, {"time": 7344, "text": "And for me, the important things is like, okay, that sounds weird, but like social connection."}, {"time": 7350, "text": "No, that's one of the most important things in all of human existence."}, {"time": 7354, "text": "And doing it, the paradoxical thing, I got into this for digital minimalism, the more you sacrifice on behalf of the connection, the stronger the connection feels, right?"}, {"time": 7364, "text": "So sacrificing non trivial time and attention on behalf of someone is what tells your brain that this is a serious relationship, which is why social media had this paradoxical effect making people feel less social because it took the friction out of it."}, {"time": 7378, "text": "And so the brain just doesn't like, like, yeah, you've been commenting on this person's, whatever, you've been retweeting them or sending them some text."}, {"time": 7385, "text": "You haven't, it's not hard enough."}, {"time": 7387, "text": "And then the perceived strength of that social connection diminishes where if you talk to them or go spend time with them or whatever, you're gonna feel better about it."}, {"time": 7396, "text": "So the friction is good."}, {"time": 7397, "text": "I have a thing with some of my friends where at the end of each call, we take a couple minutes to schedule the next."}, {"time": 7403, "text": "Then you never have to, it's like I do with haircuts or something, right?"}, {"time": 7405, "text": "Like if I don't schedule it then, I'm never gonna get my haircut, right?"}, {"time": 7409, "text": "And so it's like, okay, when do you wanna talk next?"}, {"time": 7412, "text": "Yeah, that's a really good idea."}, {"time": 7414, "text": "I just don't call friends."}, {"time": 7416, "text": "And like every 10 years I do something dramatic for them so that we maintain the friendship."}, {"time": 7420, "text": "We're like, I'd murder somebody that they really don't like."}, {"time": 7424, "text": "Careful, man, Joey might ask you to do that."}, {"time": 7426, "text": "Yeah, that's why, that's one of my favorite things."}, {"time": 7429, "text": "Lex, I need you to come down to New Jersey."}, {"time": 7431, "text": "That's exactly what we're gonna do."}, {"time": 7432, "text": "With that robot dog of yours."}, {"time": 7435, "text": "We're gonna go down to New Jersey."}, {"time": 7436, "text": "There's a special human."}, {"time": 7437, "text": "I love the comedian world."}, {"time": 7440, "text": "They've been shaking up."}, {"time": 7441, "text": "I don't know if you listen to Joe Rogan, all those folks."}, {"time": 7444, "text": "They kind of are doing something interesting for MIT and academia."}, {"time": 7450, "text": "They're shaking up this world a little bit."}, {"time": 7453, "text": "Like podcasting, because comedians are paving the way for podcasting."}, {"time": 7457, "text": "And so you have like Andrew Huberman, who's a neuroscientist at Stanford, friend of mine now."}, {"time": 7463, "text": "He's like into podcasting now and you're into podcasting."}, {"time": 7467, "text": "Of course, you're not necessarily podcasting about computer science currently, right?"}, {"time": 7470, "text": "But that, it feels like you could have a lot of the free spirit of the comedians implemented by the people who are academically trained."}, {"time": 7483, "text": "Who actually have a niche specialty."}, {"time": 7486, "text": "Yeah, and then that results, I mean, who knows what the experiment looks like, but that results me being able to talk about robotics with Joey Diaz when he says, you know, drops F bombs every other sentence."}, {"time": 7498, "text": "And I, the world is like, I've seen actually a shift within colleagues and friends within MIT where they're becoming much more accepting of that kind of thing."}, {"time": 7511, "text": "So you're seeing, okay."}, {"time": 7512, "text": "Because they're seeing how popular it is."}, {"time": 7514, "text": "They're like, wait a minute."}, {"time": 7515, "text": "Well, you're really popular."}, {"time": 7516, "text": "I don't know how they think about it at Georgetown, for example."}, {"time": 7519, "text": "It's interesting, but I think what happens is the popularity of it combined with just good conversations with people they respect."}, {"time": 7529, "text": "It's like, oh, wait, this is the thing."}, {"time": 7533, "text": "And this is more fun to listen to than a shitty Zoom lecture about their work."}, {"time": 7540, "text": "It's like, there's something here."}, {"time": 7540, "text": "There's something interesting."}, {"time": 7541, "text": "And we don't, nobody actually knows what that is."}, {"time": 7544, "text": "Just like with like Clubhouse or something, nobody's figured out like, where does this medium take?"}, {"time": 7549, "text": "Is this a legitimate medium of education?"}, {"time": 7552, "text": "Or is this just like a fun?"}, {"time": 7554, "text": "Well, that's your innovation, I think, was we can bring on professors."}, {"time": 7558, "text": "And I know Joe Rogan did some of that too, but your professors in your field."}, {"time": 7565, "text": "You bring on all these MIT guys who I remember."}, {"time": 7568, "text": "Well, that's been the big challenge for me is, I don't, is I feel, I would ask big like philosophical questions of people like yourself."}, {"time": 7580, "text": "They're like really well public."}, {"time": 7583, "text": "Like, so for example, you have a lot of excellent papers on, you know, that has a lot of theory in it, right?"}, {"time": 7591, "text": "And there's some temptation to just go through papers."}, {"time": 7595, "text": "And I think it's possible to actually do that."}, {"time": 7597, "text": "I haven't done that much, but I think it's possible."}, {"time": 7599, "text": "It just requires a lot of preparation."}, {"time": 7601, "text": "And I can probably only do that with things that I'm actually like in the field I'm aware of."}, {"time": 7608, "text": "But there's a dance that I would love to be able to try to hit right where it's actually getting to the core of some interesting ideas as opposed to just talking about philosophy."}, {"time": 7616, "text": "At the same time, there's a large audience of people that just want to be inspired by disciplines where they don't necessarily know the details."}, {"time": 7627, "text": "But there's a lot of people that are like, hmm, I'm really curious."}, {"time": 7630, "text": "I've been thinking about pivoting careers into software engineering."}, {"time": 7634, "text": "They would love to hear from people like you about computer science."}, {"time": 7637, "text": "Even if it's like theory."}, {"time": 7639, "text": "Yeah, but just like the idea that you can have big ideas, you push them through and it's interesting, you fight for it, yeah."}, {"time": 7645, "text": "Well, there's some, there's what is it?"}, {"time": 7647, "text": "Computerphile and Numberphile, these YouTube channels."}, {"time": 7653, "text": "There's channels I watch on like chess, exceptionally popular where I don't understand maybe 80% of the time what the hell they're talking about because they're talking about like why this move is better than this move."}, {"time": 7665, "text": "But I love the passion and the genius of those people and just overhearing it."}, {"time": 7670, "text": "I don't know why that's so exciting."}, {"time": 7672, "text": "Do you look at like Scott Aaronson's blog at all?"}, {"time": 7673, "text": "The Settled, Optimized?"}, {"time": 7675, "text": "Yeah, it's like hardcore complexity theory."}, {"time": 7677, "text": "But it's just an enthusiasm or like Terry Tao's blog."}, {"time": 7681, "text": "A little bit of humor about it."}, {"time": 7682, "text": "Terry Tao has a blog?"}, {"time": 7683, "text": "He used to, yeah."}, {"time": 7685, "text": "And it would just be, I'm going all in on, here's a new affine group with which you can do whatever."}, {"time": 7691, "text": "Whatever, it was just equations."}, {"time": 7692, "text": "Well, in the case of Scott Aaronson, he's good, he's able to turn on like the inner troll and comedian and so on."}, {"time": 7701, "text": "He keeps the fun, which is the best of kinds of books."}, {"time": 7702, "text": "And he's a philosophical guy."}, {"time": 7704, "text": "He wrote that."}, {"time": 7704, "text": "He turns on the philosophy."}, {"time": 7707, "text": "Yeah, so we're exploring these different ways of communicating science and exciting the world."}, {"time": 7713, "text": "Speaking of which, I gotta ask you about computer science."}, {"time": 7716, "text": "Yeah, that's right, I do some of that."}, {"time": 7719, "text": "So, I mean, a lot of your work is what inspired this deep thinking about productivity from all the different angles, because some of the most rigorous work is mathematical work."}, {"time": 7732, "text": "And in computer science, the theoretical computer science, let me ask the Scott Aaronson question of like, is there something to you that stands out in particular that's beautiful or inspiring, or just really insightful about computer science or maybe mathematics?"}, {"time": 7748, "text": "I mean, I like theory."}, {"time": 7751, "text": "And in particular, what I've always liked in theory is the notion of impossibilities."}, {"time": 7754, "text": "That's kind of my specialty."}, {"time": 7756, "text": "So within the context of distributed algorithms, my specialty is impossibility results."}, {"time": 7761, "text": "So the idea that you can argue nothing exists that solves this, or nothing exists that can solve this faster than this."}, {"time": 7770, "text": "And I think that's really interesting."}, {"time": 7772, "text": "And that goes all the way back to Turing."}, {"time": 7774, "text": "His original paper on computable numbers with their connection to the German Eichsturzungen problem, but basically the German name that Hilbert called the decision problem."}, {"time": 7783, "text": "This was precomputers, but he's English, so it's written in English."}, {"time": 7787, "text": "So it's a very accessible paper."}, {"time": 7788, "text": "And it lays the foundation for all of theoretical computer science."}, {"time": 7791, "text": "He just has this insight."}, {"time": 7793, "text": "He's like, well, if we think about like an algorithm, I mean, he figures out like all effective procedures or Turing machines are basically algorithms."}, {"time": 7799, "text": "We could really describe a Turing machine with a number, which we can now imagine with like computer code, you could just take a source file and just treat the binary version of the file as like a really long number, right?"}, {"time": 7809, "text": "But he's like, every program is just a finite number."}, {"time": 7812, "text": "It's a natural number."}, {"time": 7814, "text": "And then he realized like one way to think about a problem is you have, and this is like kind of the Mike Sipser approach, but you have a sort of, it's a language."}, {"time": 7821, "text": "So of an infinite number of strings, some of them are in the language and some of them aren't, but basically you can imagine a problem is represented as an infinite binary string, where in every position, like a one means that string is in the language and a zero means it isn't."}, {"time": 7833, "text": "And then he applied Cantor from the 19th century and said, okay, the natural numbers are countable."}, {"time": 7839, "text": "So it's countably infinite and infinite binary strings, you can use a diagonalization argument and show they're uncountable."}, {"time": 7847, "text": "So there's just vastly more problems than there are algorithms."}, {"time": 7851, "text": "So basically anything you can come up with for the most part almost certainly is not solvable by a computer."}, {"time": 7856, "text": "And then he was like, let me give a particular example."}, {"time": 7858, "text": "And he figured out the very first computability proof."}, {"time": 7861, "text": "Let's just walk through with a little bit of simple logic to halting problem can't be solved by an algorithm."}, {"time": 7865, "text": "And that kicked off the whole enterprise of some things can't be solved by algorithms, some things can't be solved by computers."}, {"time": 7874, "text": "And we've just been doing theory on that since that was the 30s he wrote that."}, {"time": 7878, "text": "So proving that something is impossible is sort of a stricter version of that."}, {"time": 7883, "text": "Is it like proving bounds on the performance of different algorithms?"}, {"time": 7887, "text": "Yeah, so bounds are upper bounds, right?"}, {"time": 7889, "text": "So you say, this algorithm does at least this well and no worse than this, but you're looking at a particular algorithm and possibility proof say no algorithm ever could ever solve this problem."}, {"time": 7900, "text": "So no algorithm could ever solve the halting problem."}, {"time": 7902, "text": "So it's problem centric."}, {"time": 7903, "text": "It's making something different, making a conclusive statement about the problem."}, {"time": 7909, "text": "And that's somehow satisfying because it's..."}, {"time": 7911, "text": "It's just philosophically interesting."}, {"time": 7914, "text": "I mean, it all goes back to, you get back to Plato, it's all reductio ad absurdum."}, {"time": 7918, "text": "So all these arguments have to start."}, {"time": 7919, "text": "The only way to do it is because there's an infinite number of solutions you can't go through them."}, {"time": 7922, "text": "You say, let's assume for the sake of contradiction that there existed something that solves this problem."}, {"time": 7929, "text": "And then you turn to crank a logic until you blow up the universe."}, {"time": 7931, "text": "And then you go back and say, okay, our original assumption that this solution exists can't be true."}, {"time": 7936, "text": "I just think philosophically, it's like a really exciting kind of beautiful thing."}, {"time": 7939, "text": "It's what I specialize in within distributed algorithms is more like time bound and possibility results."}, {"time": 7944, "text": "Like no algorithm can solve this problem faster than this in this setting."}, {"time": 7949, "text": "Of all the infinite number of ways you might ever do it."}, {"time": 7952, "text": "So you have many papers, but the one that caught my eye is Smooth Analysis of Dynamic Networks, in which you write, a problem with the worst case perspective is that it often leads to extremely strong lower bounds."}, {"time": 7965, "text": "These strong results motivate a key question."}, {"time": 7968, "text": "Is this bond robust in the sense that it captures the fundamental difficulty introduced by dynamism?"}, {"time": 7973, "text": "Or is the bond fragile in the sense that the poor performance it describes depends on an exact sequence of adversarial changes."}, {"time": 7982, "text": "Fragile lower bounds leave open the possibility of algorithms that might still perform well in practice."}, {"time": 7988, "text": "That's in the sense of the impossible and the bounds discussion presents the interesting question."}, {"time": 7995, "text": "I just like the idea of robust and fragile bounds, but what do you make about this kind of tension between what's provably, like what bounds you can prove that are like robust and something that's a bit more fragile."}, {"time": 8012, "text": "And also by way of answering that for this particular paper, can you say what the hell are dynamic networks?"}, {"time": 8021, "text": "What are distributed algorithms?"}, {"time": 8022, "text": "You don't know this?"}, {"time": 8023, "text": "Come on now."}, {"time": 8023, "text": "And I have no idea."}, {"time": 8024, "text": "And what is Smooth Analysis?"}, {"time": 8026, "text": "Yeah, well, okay."}, {"time": 8027, "text": "So Smooth Analysis, so it wasn't my idea."}, {"time": 8029, "text": "So Spielman and Tang came up with this in the context of sequential algorithms."}, {"time": 8034, "text": "So just like the normal world of an algorithm that runs on a computer."}, {"time": 8038, "text": "And they were looking at, there's a well known algorithm called the simplex algorithm, but basically you're trying to find a hole around a group of points."}, {"time": 8047, "text": "And there was an algorithm that worked really well in practice."}, {"time": 8050, "text": "But when you analyze it, you would say, I can't guarantee it's gonna work well in practice because if you have just the right inputs, this thing could run really long."}, {"time": 8058, "text": "But in practice, it seemed to be really fast."}, {"time": 8060, "text": "So Smooth Analysis is they came in and they said, let's assume that a bad guy chooses the inputs."}, {"time": 8065, "text": "It could be anything like really bad ones."}, {"time": 8067, "text": "And all we're gonna do, because in simplex they're numbers, we're gonna just randomly put a little bit of noise on each of the numbers."}, {"time": 8074, "text": "And they said, if you put a little bit of noise on the numbers, suddenly simplex algorithm goes really fast."}, {"time": 8079, "text": "Like, oh, that explains this lower bound, this idea that it could sometimes run really long was a fragile bound because it could only run a really long time if you had exactly the worst pathological input."}, {"time": 8089, "text": "So then my collaborators and I brought this over to the world of distributed algorithms."}, {"time": 8093, "text": "We brought them over the general lower bounds, right?"}, {"time": 8095, "text": "So in the world of dynamic networks, so distributed algorithm is a bunch of algorithms on different machines talking to each other, trying to solve a problem."}, {"time": 8103, "text": "And sometimes they're in a network."}, {"time": 8105, "text": "So you imagine them connected with network links and a dynamic network, those can change, right?"}, {"time": 8110, "text": "So I was talking to you, but now I can't talk to you anymore."}, {"time": 8112, "text": "Now I'm connected to a person over here."}, {"time": 8114, "text": "It's a really hard environment mathematically speaking."}, {"time": 8116, "text": "And there's a lot of really strong lower bounds, which you could imagine if the network can change all the time and a bad guy is doing it, it's like hard to do things well."}, {"time": 8124, "text": "So there's an algorithm running on every single node in the network."}, {"time": 8128, "text": "And then you're trying to say something of any kind that makes any kind of definitive sense about the performance of that algorithm."}, {"time": 8134, "text": "Yeah, so I just submitted a new paper on this a couple of weeks ago."}, {"time": 8138, "text": "And we were looking at a very simple problem."}, {"time": 8139, "text": "There's some messages in the network."}, {"time": 8142, "text": "We want everyone to get them."}, {"time": 8144, "text": "If the network doesn't change, you can do this pretty well."}, {"time": 8147, "text": "You can pipeline them."}, {"time": 8148, "text": "There's some basic algorithms that work really well."}, {"time": 8152, "text": "If the network can change every round, there's these lower bounds that says, it takes a really long time."}, {"time": 8158, "text": "There's a way that no matter what algorithm you come up with, there's a way the network can change in such a way that just really slows down your progress basically, right?"}, {"time": 8165, "text": "So smooth analysis there says, yeah, but that seems like you'd have really bad luck if your network was changing exactly in the right way that you needed to screw your algorithm."}, {"time": 8175, "text": "So we said, what if we randomly just add or remove a couple of edges in every round?"}, {"time": 8180, "text": "So the adversary is trying to choose the worst possible network."}, {"time": 8182, "text": "And we're just tweaking it a little bit."}, {"time": 8184, "text": "And in that case, this is a new paper."}, {"time": 8185, "text": "I mean, it's a blinded submission, so maybe I shouldn't, it's not, whatever."}, {"time": 8190, "text": "We basically showed."}, {"time": 8191, "text": "An anonymous friend of yours submitted a paper."}, {"time": 8193, "text": "An anonymous friend of mine, yeah, whose paper should be accepted."}, {"time": 8197, "text": "Showed that even just adding like one random edge per round, and here's the cool thing about it, the simplest possible solution to this problem blows away that lower bound and does really well."}, {"time": 8207, "text": "So that's like a very fragile lower bound because we're like, it's almost impossible to actually keep things slow."}, {"time": 8215, "text": "I wonder how many lower bounds you can smash open with this kind of analysis and show that they're fragile."}, {"time": 8222, "text": "It's my interest, yeah."}, {"time": 8223, "text": "Because in distributed algorithms, there's a ton of really famous strong lower bounds, but things have to go wrong, really, really wrong for these lower bound arguments to work."}, {"time": 8234, "text": "And so I like this approach."}, {"time": 8235, "text": "So this whole notion of fragile versus robust, I was like, well, let's go in and just throw a little noise in there."}, {"time": 8241, "text": "And if it becomes solvable, then maybe that lower bound wasn't really something we should worry about."}, {"time": 8245, "text": "You know, that's gonna embarrass, that's really uncomfortable."}, {"time": 8248, "text": "That's really embarrassing to a lot of people."}, {"time": 8251, "text": "Because, okay, this is the OCD thing with the spaces, is it feels really good when you can prove a nice bound."}, {"time": 8259, "text": "And if you say that that bound is fragile, that's like, there's gonna be a sad kid that walks with their lunchbox back home, like, my lower bound doesn't matter."}, {"time": 8272, "text": "No, I don't think they care."}, {"time": 8273, "text": "It's all, I don't know, it feels like to me, a lot of this theory is just math machismo."}, {"time": 8277, "text": "It's like, whatever, this was a hard bound to prove."}, {"time": 8282, "text": "So if you show that something is fragile, that's really important in practice, right?"}, {"time": 8288, "text": "So do you think kind of theoretical computer science is living its own world, just like mathematics, and their main effort, which I think is very valuable, is to develop ideas that's not necessarily interesting, whether it's applicable in the real world."}, {"time": 8301, "text": "Yeah, we don't care about the applicability."}, {"time": 8302, "text": "Yeah, we kind of do, but not really."}, {"time": 8304, "text": "And we're terrible with computers, and can't do anything useful with computers, and we don't know how to code."}, {"time": 8308, "text": "And, you know, we're not productive members of like technological society, but I do think things percolate."}, {"time": 8317, "text": "You percolate from the world of theory into the world of algorithm design, where it will pull on the theory, and now suddenly it's useful, and then the algorithm design gets pulled into the world of practice, where they say, well, actually, we can make this algorithm a lot better, because in practice, really, these servers do X, Y, Z, and now we can make this super efficient."}, {"time": 8331, "text": "And so I do think, I mean, I teach theory to the PhD students at Georgetown."}, {"time": 8336, "text": "I show them the sort of funnel of like, okay, we're over here doing theory, but it eventually, some of this stuff will percolate down in effect at the very end, you know, a phone, but it's a long tunnel."}, {"time": 8348, "text": "But the very question you're asking, at the highest philosophical level, is fascinating."}, {"time": 8352, "text": "Like, if you take a system, a distributed system, or a network, and introduce a little bit of noise into it, like, how many problems of that nature are fundamentally changed by that little introduction of noise?"}, {"time": 8367, "text": "Yeah, because it's all, especially in distributed algorithms, the model is everything."}, {"time": 8371, "text": "Like, the way we work is we're incredibly precise about, here's exactly, it's mathematical, here's exactly how the network works, and it's a state machine, algorithms are state machines, there's rounds and schedulers, we're super precise so we can prove lower bounds."}, {"time": 8384, "text": "But yeah, often those lower, those impossibility results really get at the hard edges of exactly how that model works."}, {"time": 8390, "text": "So we'll see if this, so we published a paper on this, that paper you mentioned, that kind of introduced the idea to the distributed algorithms world."}, {"time": 8398, "text": "And I think that's got some traction and there's been some followup."}, {"time": 8402, "text": "So we've just submitted our next."}, {"time": 8405, "text": "I mean, honestly, the issue with the next that like the result fell out so easily, and this shows the mathematical machismo problem in these fields is there's a good chance the paper won't be accepted because there wasn't enough mathematical self flagellation."}, {"time": 8418, "text": "That's such a nice finding."}, {"time": 8420, "text": "So even showing that very few, just very little bit of noise, can have a dramatic, make a dramatic statement about the."}, {"time": 8428, "text": "It was a big surprise to us, but once we figured out how to show it, it's not too hard."}, {"time": 8434, "text": "And these are venues for theoretical work."}, {"time": 8438, "text": "Okay, so the fascinating tension that exists in other disciplines, like one of them is machine learning, which despite the power of machine learning and deep learning and all like the impact of it, in the real world, the main conferences on machine learning are still resistant to application papers."}, {"time": 8461, "text": "And application papers broadly defined, meaning like finding almost like you would, like Darwin did by like going around, collecting some information, saying, huh, isn't this interesting?"}, {"time": 8476, "text": "Like those are some of the most popular blogs, and yet as a paper, it's not really accepted."}, {"time": 8481, "text": "I wonder what you think about this whole world of deep learning from a perspective of theory."}, {"time": 8489, "text": "What do you make of this whole discipline of the success of Neon Networks, of how to do science on them?"}, {"time": 8494, "text": "Are you excited by the possibilities of what we might discover about Neon Networks?"}, {"time": 8500, "text": "Do you think it's fundamental in engineering discipline, or is there something theoretical that we might crack open one of these days in understanding something deep about how system optimization and how systems learn?"}, {"time": 8512, "text": "I am convinced by, is it Tegmark at MIT?"}, {"time": 8516, "text": "Tegmark?"}, {"time": 8516, "text": "Yeah, Tegmark, right."}, {"time": 8543, "text": "Yeah, and tweaking constants and hoping that the classifier fitness, for God's sakes, before the submission deadline actually gets above some, it feels like it's linear algebra and tedium, right?"}, {"time": 8557, "text": "But anyways, I'm really convinced with his idea that once we understand better and better what's going on from a theory perspective, it's gonna make it into an engineering discipline."}, {"time": 8564, "text": "So in my mind, where we're gonna end up is, okay, forget these metaphors of neurons, and these things are gonna be put down into these mathematical kind of elegant equations, differentiable equations that just kind of work well, and then it's gonna be when I need a little bit of AI in this thing, plumbing."}, {"time": 8582, "text": "Like, let's get a little bit of a pattern recognizer with a noise module and let's connect."}, {"time": 8586, "text": "I mean, you know this feel better than me, so I don't know if this is like a reasonable prediction, but it's gonna become less inscrutable, and then it's gonna become more engineerable, and then we're gonna have AI in more things because we're gonna have a little bit more control over how we piece together these different classification black boxes."}, {"time": 8605, "text": "So one of the problems, and there might be some interesting parallels that you might provide intuition on is, you know, neural networks are very large, and they have a lot of, you know, we were talking about, you know, dynamic networks and distributed algorithms."}, {"time": 8621, "text": "One of the problems with the analysis of neural networks is, you know, you have a lot of nodes, and you have a lot of edges."}, {"time": 8630, "text": "To be able to interpret and to control different things is very difficult."}, {"time": 8633, "text": "There's fields in trying to figure out like mathematically how you form clean representations that are like, like one node contains all the information about a particular thing, and no other nodes is correlated to it."}, {"time": 8650, "text": "So like it has unique knowledge and like, but that ultimately boils down to trying to simplify this thing into, that goes against this very nature, which is like deeply connected, and like dynamic and just, you know, hundreds of millions, billions of nodes."}, {"time": 8670, "text": "And in a distributed sense, like when you zoom out, the thing has a representation and understanding of something, but the individual nodes are just doing their little exchanging thing."}, {"time": 8680, "text": "And it's the same thing with Stephen Wolfram when you talk about cellular automata, it's very difficult to do math when you have a huge collection of distributed things, each acting on their own."}, {"time": 8690, "text": "And it's almost like, it feels like it's almost impossible to do any kind of theoretical work in the traditional sense."}, {"time": 8698, "text": "It almost becomes completely like a biology, you become a biologist as opposed to a theoretician."}, {"time": 8706, "text": "You just study it experimentally."}, {"time": 8707, "text": "Yeah, I think that's the big question, I guess, right?"}, {"time": 8710, "text": "Yeah, so is the large size and interconnectedness of the like a deep learning network fundamental to that task, or are we just not very good at it yet because we're using the wrong metaphor?"}, {"time": 8723, "text": "I mean, the human brain learns with much fewer examples and with much less tuning of the whatever, whatever, whatever probably that requires to get those like deep mind networks up and running."}, {"time": 8734, "text": "But yeah, so I don't really know, but the one thing I have observed is that the, yeah, there's the mundane nature of some of the working with these models tends to lead people to think that, to do it like, it could be Skynet or it could be like a lot of pain to get the thermostat to do what we want it to do."}, {"time": 8754, "text": "And there's a lot of open questions in between there."}, {"time": 8756, "text": "And then of course, the distributed network of humans that use these systems."}, {"time": 8764, "text": "So like you can have the system itself, then your network, but you can also have like little algorithms controlling the behavior of humans, which is what you have with social networks."}, {"time": 8774, "text": "It's possible that a very, what is it, a toaster or whatever, the opposite of Skynet when taken at scale while used by individual humans and controlling their behavior can actually have the Skynet effect."}, {"time": 8785, "text": "So the scale there."}, {"time": 8787, "text": "We might have that now."}, {"time": 8789, "text": "We might have that now, we just don't know."}, {"time": 8791, "text": "As it's happening."}, {"time": 8792, "text": "Is Twitter creating a little mini Skynet?"}, {"time": 8793, "text": "I mean, because of what happens, it twirls out ramifications in the world."}, {"time": 8798, "text": "And is it really that much different if it's a robot with tentacles or a bunch of servers that."}, {"time": 8804, "text": "Yeah, and the destructive effects could be, I mean, it could be political, but it could also be like, you could probably make an interesting case that the virus, the coronavirus spread on Twitter too, in the minds of people."}, {"time": 8820, "text": "Like the fear and the misinformation in some very interesting ways mixed up."}, {"time": 8826, "text": "And maybe this pandemic wasn't sufficiently dangerous to where that could have created a weird like an instability, but maybe other things might create instability."}, {"time": 8835, "text": "Like somebody, God forbid, detonates a nuclear weapon somewhere."}, {"time": 8839, "text": "And then maybe the destructive aspect of that would not as much be the military actions, but the way those news are spread on Twitter and the panic that creates."}, {"time": 8850, "text": "I mean, I think that's a great case study, right?"}, {"time": 8852, "text": "Like what happened, not, but I'm not suggesting that Lexi go let off a nuclear bomb."}, {"time": 8856, "text": "I meant the coronavirus, but yeah, I think that's a really interesting case study."}, {"time": 8863, "text": "I'm interested in the counterfactual of 1995, like do the same virus in 1995."}, {"time": 8868, "text": "So first of all, it would have been, I get to hear whatever the nightly news, we'll talk about it."}, {"time": 8874, "text": "And then there'll be my local health board, we'll talk about it."}, {"time": 8878, "text": "That mitigation decisions would probably necessarily be very sort of localized."}, {"time": 8884, "text": "Okay, our community is trying to figure out what are we gonna do?"}, {"time": 8887, "text": "Like we see this with schools, like where I grew up in New Jersey, there's very localized school districts."}, {"time": 8892, "text": "So even though they had sort of really bad viral numbers there, my school I grew up in has been open since the fall because it's very localized."}, {"time": 8900, "text": "It's like these teachers and these parents, what do we wanna do?"}, {"time": 8902, "text": "What are we comfortable with?"}, {"time": 8903, "text": "I live in a school district right now in Montgomery County that's a billion dollar a year budget, 150,000 kid school district."}, {"time": 8909, "text": "It just can't, it's closed because it's too."}, {"time": 8912, "text": "So I'm interested in that counterfactual."}, {"time": 8913, "text": "Yeah, so you have all this information moving around and then you have the effects on discourse that we were talking about earlier, that the Neil Postman style effects of Twitter, which shifts people into a sort of a dunk culture mindset of don't give an inch to the other team."}, {"time": 8929, "text": "And we're used to this and was fired up by politics and the unique attributes of Twitter."}, {"time": 8956, "text": "That's like very Twittery in a way that in 1995 is probably not the way public health officials would be thinking."}, {"time": 8963, "text": "Where now it's like, well, this is, if we said this about masks, but the other team said that about masks, we can't give an inch to this."}, {"time": 8969, "text": "So we gotta be careful."}, {"time": 8970, "text": "And like, we can't tell people it's okay after they're vaccinated because that might, we're giving them an inch on this and that's very Twittery in my mind, right?"}, {"time": 8976, "text": "That is the impact of Twitter on the way we think about discourse, which is a dunking culture of don't give any inch to the other team and it's all about slam dunks where you're completely right and they're completely wrong."}, {"time": 8986, "text": "It's as a rhetorical strategy, it's incredibly simplistic, but it's also the way that we think right now about how we do debate."}, {"time": 8992, "text": "It combined terribly with election year pandemic."}, {"time": 8996, "text": "Yeah, election year pandemic."}, {"time": 8998, "text": "I wonder if we could do some smooth analysis."}, {"time": 9000, "text": "Let's run the simulation over a few times."}, {"time": 9001, "text": "A little bit of noise, yeah."}, {"time": 9003, "text": "See if it can dramatically change the behavior of the system."}, {"time": 9007, "text": "Okay, we talked about your love for proving that something is impossible."}, {"time": 9011, "text": "So there's quite a few still open problems and complexity of algorithms."}, {"time": 9017, "text": "So let me ask, does P equal NP?"}, {"time": 9023, "text": "If P equals NP, what kind of, and you'd be really surprised somebody proves it."}, {"time": 9032, "text": "What would that proof look like and why would that even be?"}, {"time": 9035, "text": "What would that mean?"}, {"time": 9036, "text": "What would that proof look like?"}, {"time": 9038, "text": "And what possible universe could P equals NP?"}, {"time": 9040, "text": "Is there something in size that you could say there?"}, {"time": 9043, "text": "It could be true."}, {"time": 9045, "text": "I mean, I'm not a complexity theorist, but every complexity theorist I know is convinced they're not equal and are basically not working on it anymore."}, {"time": 9053, "text": "I mean, there is a million dollars at stake if you can solve the proof."}, {"time": 9055, "text": "It's one of the millennium prizes."}, {"time": 9057, "text": "Okay, so here's how I think the P not equals NP proof is gonna eventually happen."}, {"time": 9062, "text": "I think it's gonna fall out and it's gonna be not super simple, but not as hard as people think, because my theory about a lot of theoretical computer science based on just some results I've done, so this is a huge extrapolation, is that a lot of what we're doing is just obfuscating deeper mathematics."}, {"time": 9103, "text": "So this has happened to me."}, {"time": 9104, "text": "I had this paper I was quite fond of a while ago."}, {"time": 9107, "text": "It was looking at this problem called contention resolution where you put an unknown set of people on a shared channel and they're trying to break symmetry."}, {"time": 9115, "text": "So it's like an ethernet, whatever."}, {"time": 9117, "text": "Only one person can use it at a time."}, {"time": 9118, "text": "You try to break symmetry."}, {"time": 9119, "text": "There's all these bounds people have proven over the years about how long it takes to do this, right?"}, {"time": 9125, "text": "And like I discovered at some point, there's this one combinatorial result from the early 1990s."}, {"time": 9132, "text": "All of these lower bound proofs all come from this and in fact, it improved a lot of them and simplified a lot."}, {"time": 9137, "text": "You could put it all in one paper."}, {"time": 9139, "text": "It's like, are we really?"}, {"time": 9140, "text": "And then, okay, so this new paper that I submitted a couple of weeks ago, I found you could take some of these same lower bound proofs for this contention resolution problem."}, {"time": 9148, "text": "You could reprove them."}, {"time": 9149, "text": "Using Shannon's source code theorem that actually when you're breaking contention, what you're really doing is building a code over, if you have a distribution on the network sizes, it's a code over that source."}, {"time": 9161, "text": "And if you plug in a high entropy information source and plug in from 1948, the source code theorem that says on a noiseless channel, you can't send things at a faster rate than the entropy allows, the exact same lower bounds fall back out again, right?"}, {"time": 9174, "text": "So like this type of thing happens."}, {"time": 9175, "text": "There's some famous lower bounds and distributed algorithms that turned out to all be algebraic topology underneath the covers."}, {"time": 9182, "text": "And they won the Girdle Prize for working on that."}, {"time": 9185, "text": "So my sense is what's gonna happen is at some point, someone really smart to be very exciting is gonna realize there's some sort of other representation of what's going on with these Turing machines trying to sort of efficiently compute."}, {"time": 9198, "text": "And there'll be an existing mathematical result that apply."}, {"time": 9203, "text": "Someone or something, I guess."}, {"time": 9205, "text": "It could be AI theorem provers kind of thing."}, {"time": 9208, "text": "It could be, yeah."}, {"time": 9208, "text": "I mean, not a, well, yeah."}, {"time": 9210, "text": "I mean, there's theorem provers, like what that means now, which is not fun."}, {"time": 9215, "text": "It's just a bunch of..."}, {"time": 9217, "text": "Very carefully formulated postulates that, but I take your point, yeah."}, {"time": 9224, "text": "On a small tangent on that, then you're kind of implying that mathematics, it almost feels like a kind of weird evolutionary tree that ultimately leads back to some kind of ancestral, few fundamental ideas that all are just like, they're all somehow connected."}, {"time": 9241, "text": "In that sense, do you think math is fundamental to our universe and we're just like slowly trying to understand these patterns or is it discovered?"}, {"time": 9255, "text": "Or is it just a little game that we play amongst ourselves to try to fit little patterns to the world?"}, {"time": 9263, "text": "Yeah, that's the question, right?"}, {"time": 9264, "text": "That's the physicist question."}, {"time": 9266, "text": "I mean, I'm probably, I'm in the discovered camp, but I don't do theoretical physics."}, {"time": 9270, "text": "So I know they have a, they feel like they have a stronger claim to answering that question."}, {"time": 9277, "text": "But everything comes back to it."}, {"time": 9278, "text": "Everything comes back to it."}, {"time": 9279, "text": "I mean, all the physics, the fact that the universe is, well, okay."}, {"time": 9285, "text": "It's a complicated question."}, {"time": 9287, "text": "So how often do you think, how deeply does this result describe the fundamental reality of nature?"}, {"time": 9297, "text": "So the reason I hesitated, because it's something I'm, I taught this seminar and did a little work on what are called biological algorithms."}, {"time": 9305, "text": "So there's this notion of, so physicists use mathematics to explain the universe, right?"}, {"time": 9314, "text": "And it was unreasonable that mathematics works so well."}, {"time": 9318, "text": "All these differential equations, why does that explain all we need to know about thermodynamics and gravity and all these types of things?"}, {"time": 9324, "text": "Well, there's this movement within the intersection of computer science and biology, just kind of Wolframium, I guess, really, that algorithms can be very explanatory, right?"}, {"time": 9335, "text": "Like if you're trying to explain parsimoniously something about like an ant colony or something like this, you're not going to, ultimately it's not gonna be explained as a equation, like a physics equation."}, {"time": 9346, "text": "It's gonna be explained by an algorithm."}, {"time": 9348, "text": "So like this algorithm run distributedly is going to explain the behavior."}, {"time": 9353, "text": "So that's mathematical, but not quite mathematical, but it is if you think about an algorithm like a Lambda calculus, which brings you back to the world of mathematics."}, {"time": 9361, "text": "So I'm thinking out loud here, but basically abstract math is sort of like unreasonably effective at explaining a lot of things."}, {"time": 9370, "text": "And that's just what I feel like I glimpse."}, {"time": 9371, "text": "I'm not like a super well known theoretician."}, {"time": 9374, "text": "I don't have really famous results."}, {"time": 9376, "text": "So even as a sort of middling career theoretician, I keep encountering this where we think we're solving some problem about computers and algorithms, and it's some much deeper underlying math."}, {"time": 9391, "text": "It's Shannon, but Shannon is entropy, but entropy was really goes all the way back to whatever it was, Boyle or all the way back to looking at the early physics."}, {"time": 9400, "text": "And it's, anyways, to me, I think it's amazing."}, {"time": 9404, "text": "Yeah, but it could be the flip side of that could be just our brains draw so much pleasure from the deriving generalized theories and simplifying the universe that we just naturally see that kind of simplicity in everything."}, {"time": 9418, "text": "Yeah, so that's the whole Newton to Einstein, right?"}, {"time": 9421, "text": "So you can say this must be right because it's so predictive."}, {"time": 9424, "text": "Well, it's not quite predictive because Mercury wobbles a little bit, but I think we have it set and then you turn out, no, Einstein."}, {"time": 9430, "text": "And then you get Bohr like, no, not Einstein."}, {"time": 9433, "text": "It's actually statistical."}, {"time": 9435, "text": "And yeah, so that would be interesting."}, {"time": 9436, "text": "It's hard to also know where a smooth analysis fits into all that or a little bit of noise."}, {"time": 9441, "text": "Like you can say something very clean about a system and then a little bit of noise, like the average case is actually very different."}, {"time": 9449, "text": "And so, I mean, that's where the quantum mechanics comes in."}, {"time": 9452, "text": "It's like, ugh, why does it have to be randomness in this?"}, {"time": 9456, "text": "Yeah, I would have to do this complex statistics."}, {"time": 9461, "text": "So to be determined."}, {"time": 9462, "text": "Yeah, that'll be my next book."}, {"time": 9464, "text": "That'd be ambitious."}, {"time": 9465, "text": "The fundamental core of reality, comma, and some advice for being more productive at work."}, {"time": 9473, "text": "Can I ask you just, if it's possible to do an overview and just some brief comments of wisdom on the process of publishing a book, what's that process entail?"}, {"time": 9484, "text": "What are the different options and what's your recommendation for somebody that wants to write a book like yours, a nonfiction book that discovers something interesting about this world?"}, {"time": 9497, "text": "So what I usually advise is follow the process as is."}, {"time": 9505, "text": "Don't try to reinvent."}, {"time": 9507, "text": "I think that happens a lot where you'll try to reinvent the way the publishing industry should work."}, {"time": 9513, "text": "Like this is kind of not like in a business model ways, but just like, this is what I want to do."}, {"time": 9518, "text": "I want to write a thousand words a day and I want to do this and I'm gonna put it on the internet and the publishing industry is very specific about how it works."}, {"time": 9526, "text": "And so like when I got started writing books, which at a very young age, so I sold my first book at the age of 21."}, {"time": 9532, "text": "The way I did that is I found a family friend that was an agent and I said, I'm not trying to make you be my agent."}, {"time": 9540, "text": "Just explain to me how this works."}, {"time": 9542, "text": "Not just how the world works, but give me the hard truth about how would a 21 year old, under what conditions could a 21 year old sell a book and what would that look like?"}, {"time": 9549, "text": "And she just explained it to me."}, {"time": 9550, "text": "You know, you have to do this and have to be a subject that it made sense for you to write."}, {"time": 9554, "text": "And you would have to do this type of writing for the publications to validate it and blah, blah, blah."}, {"time": 9557, "text": "And you have to get the agent first."}, {"time": 9558, "text": "And I learned the whole game plan and then I executed."}, {"time": 9562, "text": "And so the rough game plan is with nonfiction, you get the agent first and the agent's gonna sell it to the publishers."}, {"time": 9568, "text": "So like you're never sending something directly to the publishers."}, {"time": 9571, "text": "In nonfiction, you're not writing the book first, right?"}, {"time": 9574, "text": "You're gonna get an advance from the publisher once sold and then you're gonna do the primary writing of the book."}, {"time": 9580, "text": "In fact, it will, in most circumstances, hurt you if you've already written it."}, {"time": 9583, "text": "If you've already written it."}, {"time": 9585, "text": "So you're trying to sell, well, I guess the agent, first you sell it to the agent and then the agent sells it to the publishers."}, {"time": 9590, "text": "It's much easier to get an agent than a book deal."}, {"time": 9592, "text": "So the thought is, if you can't get an agent, then why would you?"}, {"time": 9595, "text": "So you start with, and also the way this works with a good agent is they know all the editors and they have lunch with the editors and they're always just like, okay, what projects do you have coming?"}, {"time": 9604, "text": "Here's one of my authors."}, {"time": 9604, "text": "That's the way all these deals happen."}, {"time": 9606, "text": "It's not, you're not emailing a manuscript to a slush pile."}, {"time": 9609, "text": "Yeah, and so first of all, the agent takes a percentage and then the publishers, this is where the process comes in."}, {"time": 9614, "text": "They take also a cut that's probably ridiculous."}, {"time": 9617, "text": "So if you try to reinvent the system, you'll probably be frustrated by the percentage that everyone takes relative to how much bureaucracy and efficiency ridiculousness there is in the system."}, {"time": 9628, "text": "Your recommendation is like, you're just one ant."}, {"time": 9631, "text": "Stop trying to build your own ant colony."}, {"time": 9634, "text": "Well, or if you create your own process for how it should work, the book's not gonna get published."}, {"time": 9639, "text": "So there's the separate question, the economic question of like, should I create my own, like self publish it or do something like that?"}, {"time": 9645, "text": "But putting that aside, there's a lot of people I encounter that wanna publish a book with a main publisher, but they invent their own rules for how it works, right?"}, {"time": 9654, "text": "So then the alternative though is self publishing and the downside, there's a lot of downsides."}, {"time": 9660, "text": "It's almost like publishing an opinion piece in the New York Times versus writing on a blog."}, {"time": 9665, "text": "There's no reason why writing a blog post on Medium can't get way more attention and legitimacy and long lasting prestige than a New York Times article."}, {"time": 9676, "text": "But nevertheless, for most people, writing in a prestigious newspaper, quote unquote prestigious, is just easier."}, {"time": 9686, "text": "And well, and depends on your goal."}, {"time": 9689, "text": "So, you know, like I push you towards a big publisher because I think your goal, it's huge ideas, you want impact."}, {"time": 9696, "text": "You're gonna have more impact."}, {"time": 9697, "text": "Even though, like actually, so there's different ways to measure impact, right?"}, {"time": 9701, "text": "In the world of ideas."}, {"time": 9704, "text": "And also, yeah, in the world of ideas, it's kind of like the clubhouse thing now, even if the audience is not large, the people in the audience are very interesting."}, {"time": 9714, "text": "It's like the conversation feels like that has long lasting impact among the people in different and disparate industries that are also then starting their own conversations and all that kind of stuff."}, {"time": 9727, "text": "Yeah, because you have other, so like self publishing a book, the goals that would solve, you have much better ways of getting to those goals, might be part of it, right?"}, {"time": 9736, "text": "So if there's the financial aspect of well, you get to keep more of it, I mean, the podcast is probably gonna crush what the book's gonna do anyways, right?"}, {"time": 9743, "text": "Yeah, if it's, I wanna get directly to certain audiences or crowds, it might be harder through a traditional publisher."}, {"time": 9750, "text": "There's better ways to talk to those crowds."}, {"time": 9752, "text": "It could be on clubhouse with all these new technologies, self published books not gonna be the most effective way to find your way to a new crowd."}, {"time": 9759, "text": "But if the idea is like, I wanna have a, leave a dent in the world of ideas, then to have a vulnerable old publisher, put out your book in a nice hardcover and do the things they do, that goes a long way."}, {"time": 9772, "text": "And they do do a lot."}, {"time": 9773, "text": "I mean, it's very difficult actually."}, {"time": 9775, "text": "There's so much involved in putting together a book."}, {"time": 9777, "text": "They get books into bookstores and all that kind of stuff."}, {"time": 9779, "text": "And from an efficiency standpoint, I mean, just the time involved in trying to do this yourself is."}, {"time": 9785, "text": "They have a process, right?"}, {"time": 9786, "text": "Like you said, they have a process."}, {"time": 9788, "text": "They've got a process."}, {"time": 9789, "text": "I mean, I know like Jocko did this recently, he started his own imprint and I have a couple other."}, {"time": 9793, "text": "But it's a huge overhead."}, {"time": 9795, "text": "I mean, if you run a business and you, so like Jocko is a good case study, right?"}, {"time": 9799, "text": "So he got fed up with Simon and Schuster dragging their feet and said, I'm gonna start my own imprint then, if you're not gonna publish my kid's book."}, {"time": 9808, "text": "But he, what does he do, he runs businesses, right?"}, {"time": 9810, "text": "So I think in his world, like I already run, I'm a partner in whatever, in Origin, and I have this and that."}, {"time": 9815, "text": "And so it's like, yeah, we can run businesses."}, {"time": 9817, "text": "That's what we know how to do."}, {"time": 9818, "text": "That's what I do."}, {"time": 9819, "text": "I run businesses, I have people."}, {"time": 9820, "text": "But for like you or I, we don't run businesses."}, {"time": 9823, "text": "It'd be terrible."}, {"time": 9824, "text": "Yeah, well, especially these kinds of businesses, right?"}, {"time": 9827, "text": "So I do wanna launch a business with very different technology business."}, {"time": 9831, "text": "Yeah, it's very, very different, yeah."}, {"time": 9833, "text": "I mean, this is like, okay, I need copy editors and graphic book binders, and I need to contract with the printer, but oh, the printer doesn't have slots."}, {"time": 9840, "text": "And so now I have to try to, I mean, it's."}, {"time": 9842, "text": "I get so, I need to shut this off in my room, but I get so frustrated when the system could clearly be improved."}, {"time": 9848, "text": "It's the thing that you're mentioning."}, {"time": 9850, "text": "It's like, this is so inefficient."}, {"time": 9852, "text": "Every time I go to the DMV or something like that, you think like, ah, this could be done so much better."}, {"time": 9858, "text": "But, and the same thing as the worry with an editor, which I guess would come from the publisher, like who would, how much supervision on your book did you receive like, hey, do you think this is too long?"}, {"time": 9874, "text": "Or do you think the title, like title, how much choice do you have in the title, in the cover, in the presentation and the branding and all that kind of stuff?"}, {"time": 9882, "text": "Yeah, I mean, all of it depends, right?"}, {"time": 9883, "text": "So when it comes on the relationship with the editor on the writing, it depends on the editor and it depends on you."}, {"time": 9891, "text": "So like at this point, I'm on my seventh book and I write for a lot of major publications."}, {"time": 9896, "text": "And at this point I have what I feel like is a voice and a level of craft that I'm very comfortable with, right?"}, {"time": 9903, "text": "So my editor is not gonna be, she kind of is gonna trust me and it's gonna be more big picture."}, {"time": 9908, "text": "Like I'm losing the thread here or this seems like it could be longer."}, {"time": 9912, "text": "Whereas the first book I wrote when I was 21, I had notes such as you start a lot of sentences with so, you don't use any contractions because I've been doing scientific writing, we don't use contractions."}, {"time": 9923, "text": "Like you should probably use contractions."}, {"time": 9925, "text": "It was way more, I had to go back and rewrite the whole thing, yeah."}, {"time": 9929, "text": "But ultimately the recommendation, I mean, we talked offline and sort of, I was thinking loosely, not really sure, but I was thinking of writing a book and there's a kind of desire to go self publishing, not for financial reasons."}, {"time": 9942, "text": "And the money can be good by the way, right?"}, {"time": 9943, "text": "I mean, it's very power law type distributed, right?"}, {"time": 9948, "text": "So the money on a hardcover is somewhere between one or $2 a book."}, {"time": 9952, "text": "So the thing is, I personally don't."}, {"time": 9953, "text": "But then you give up 15% to the agent, so."}, {"time": 9956, "text": "I personally don't care about money as I've mentioned before, but I for some reason really don't like spending money on things that are not worth it."}, {"time": 9965, "text": "Like I don't care if I get money, I just don't like spending money on like feeding a system that's inefficient."}, {"time": 9972, "text": "It's like I'm contributing to the problem."}, {"time": 9974, "text": "That's my biggest problem."}, {"time": 9976, "text": "Right, so you're worried about the inefficiencies of the opportunity."}, {"time": 9979, "text": "Yeah, the fact that."}, {"time": 9981, "text": "Like the overheads, the number of people involved."}, {"time": 9983, "text": "Or the overheads."}, {"time": 9984, "text": "The emails again."}, {"time": 9986, "text": "The fact that they have this way of speaking, which I'm allergic to many people, like that's very marketing speak."}, {"time": 9994, "text": "Like you could tell they've been having Zoom meetings all day."}, {"time": 9997, "text": "It's like as opposed to a sort of creative collaborators that are like also a little bit crazy."}, {"time": 10006, "text": "I suppose some of that is finding the right people."}, {"time": 10008, "text": "Finding the right people."}, {"time": 10008, "text": "That's what I would say."}, {"time": 10009, "text": "I'd say there's definitely, and maybe it's just good fortune."}, {"time": 10013, "text": "Good fortune in terms of like my agents and editors I've worked with."}, {"time": 10016, "text": "There's really good people who see the vision are smart or incredibly literary."}, {"time": 10022, "text": "And they actually help you."}, {"time": 10024, "text": "Like psychologically."}, {"time": 10025, "text": "Yeah, I had a great editor when I was first moving into hardcover books, for example."}, {"time": 10028, "text": "It was my first big book advance and my first sort of big deal and he was like a senior editor and it was very useful, you know?"}, {"time": 10039, "text": "He was like, we had a lot of long talks, right?"}, {"time": 10041, "text": "I was, so this was my fourth book, So Good They Can't Ignore You was my first, my big hardcover idea book."}, {"time": 10048, "text": "And we had a lot of talks, like even before I started writing it, just let's talk about books and his philosophy."}, {"time": 10054, "text": "He'd been in the business for a long time."}, {"time": 10055, "text": "He was the head of the imprint."}, {"time": 10057, "text": "It was useful."}, {"time": 10058, "text": "Yeah, but I mean, the other frustrating thing is how long the whole thing takes."}, {"time": 10062, "text": "Makes a long time."}, {"time": 10065, "text": "But I suppose that's, you just have to accept that."}, {"time": 10066, "text": "Well, yeah, I handed in this manuscript for the book that comes out now, like when this, I handed it in, I mean, over the summer, like during the pandemic."}, {"time": 10074, "text": "So it's not, it's not terrible, right?"}, {"time": 10076, "text": "And we were editing during the pandemic and I finished it in the spring."}, {"time": 10080, "text": "We've talked most of the day, except for a little bit computer science, most of the day about a productive life."}, {"time": 10087, "text": "How does love, friendship and family fit into that?"}, {"time": 10091, "text": "Is there, do you find that there's a tension?"}, {"time": 10097, "text": "Is it possible for relationships to energize the whole process, to benefit?"}, {"time": 10102, "text": "Or is it ultimately a trade off?"}, {"time": 10105, "text": "But because life is short and ultimately we seek happiness, not productivity, that we have to accept that tension."}, {"time": 10116, "text": "I mean, I think relationships is the, that's the whole deal."}, {"time": 10121, "text": "Like I thought about this the other day, I don't know what the context was."}, {"time": 10124, "text": "I was thinking about if I was gonna give like an advice speech, like a commencement address or like giving advice to young people."}, {"time": 10131, "text": "And like the big question I have for young people is if they haven't already, bad things are gonna happen that you don't control, so what's the plan, right?"}, {"time": 10141, "text": "Like, let's start figuring that out now because it's not all, you know, some people get off better than others, but eventually stuff happens, right?"}, {"time": 10149, "text": "You get sick, something falls apart, the economy craters, someone you know dies, like all sorts of bad stuff is gonna happen, right?"}, {"time": 10159, "text": "So how are we gonna do this?"}, {"time": 10160, "text": "Like, how do we like live life when life is hard?"}, {"time": 10163, "text": "And in ways that is unfair and unpredictable, then relationships is the, that's the buffer for all of that."}, {"time": 10170, "text": "Cause we're wired for it, right?"}, {"time": 10171, "text": "I went down this rabbit hole with digital minimalism."}, {"time": 10174, "text": "I went down this huge rabbit hole about the human brain and sociality."}, {"time": 10178, "text": "It's all we're wired to do."}, {"time": 10179, "text": "It's like all of our brain is for this."}, {"time": 10181, "text": "Like everything, all of our mechanisms, everything is made to service the social connections because it's what kept you alive, you know?"}, {"time": 10187, "text": "I mean, you had the, your tribal connections is how you didn't starve during a famine, people would share food, et cetera."}, {"time": 10194, "text": "And so you can't neglect that."}, {"time": 10196, "text": "And it's like everything and people feel it, right?"}, {"time": 10198, "text": "Like there's no, our social networks are hooked up to the pain center."}, {"time": 10201, "text": "That's why it feels so terrible when you miss someone or like someone dies or something, right?"}, {"time": 10205, "text": "That's like how seriously we take it."}, {"time": 10207, "text": "There's a pretty accepted theory that the default mode network, like a lot of what the default mode network is doing."}, {"time": 10212, "text": "So that's sort of the default state our brain goes into when we're not doing something in particular is practicing sociality, practicing interactions thing, because it's so crucial to what we do."}, {"time": 10222, "text": "It's like at the core of human thriving."}, {"time": 10225, "text": "So I've more recently, the way I think about it is like relationships first."}, {"time": 10230, "text": "Given that foundation of putting like, and I don't think we put nearly enough time into it."}, {"time": 10233, "text": "I worry that social media is reducing relationships, strong relationships."}, {"time": 10237, "text": "Strong relationships where you're sacrificing non trivial time and attention and resources, whatever on behalf of other people."}, {"time": 10244, "text": "That's the net that is gonna allow you to get through anything."}, {"time": 10248, "text": "Then, all right."}, {"time": 10250, "text": "Now what do we wanna do with the surplus that remains?"}, {"time": 10253, "text": "Maybe I wanna build some fire, build some tools."}, {"time": 10255, "text": "So put relationships first."}, {"time": 10257, "text": "I like the worst case analysis from the computer science perspective."}, {"time": 10261, "text": "Put relationships first."}, {"time": 10263, "text": "Yeah, because everything else is just assuming average case, assuming things kind of keep going as they were going."}, {"time": 10270, "text": "And you're neglecting the fundamental human drive."}, {"time": 10273, "text": "Like we have this, we talked about the boredom instinct."}, {"time": 10275, "text": "We wanna build things, we wanna have impact, we wanna do productivity."}, {"time": 10277, "text": "That's not nearly as clear cut of a drive of we need people."}, {"time": 10281, "text": "But if we look at the real worst case analysis here is one day you're pretty young now, but that's not gonna last very long."}, {"time": 10291, "text": "You're gonna die one day."}, {"time": 10295, "text": "Little bit."}, {"time": 10297, "text": "Well, I'm of the mindset of, let's make that a productivity hack."}, {"time": 10301, "text": "I'm of the mindset of we need to confront that soon."}, {"time": 10307, "text": "So let's do what we can now so that when we really confront and think about it, we're more likely to feel better about it."}, {"time": 10312, "text": "So in other words, let's focus now on living and doing things in such a way that we're proud of so that when it really comes time to confront that, we're more likely to say, like, okay, I feel kind of good about the situation."}, {"time": 10325, "text": "So what, when you're laying on your deathbed, would you, in looking back, what would make you think like, oh, I did okay, I'm proud of that."}, {"time": 10333, "text": "I optimized the hell out of that."}, {"time": 10335, "text": "That's a good, I mean, it's a good question to go backwards on."}, {"time": 10339, "text": "I mean, this is like David Brooks's eulogy virtues versus resume virtues."}, {"time": 10346, "text": "Right, so his argument is that, and that's another interesting DC area person."}, {"time": 10350, "text": "I keep thinking of interesting DC area people."}, {"time": 10352, "text": "All right, David Brooks is here too."}, {"time": 10356, "text": "His argument, he thinks eulogy virtues is, so what we eulogize is different than what we promote on the resume."}, {"time": 10363, "text": "That's his whole thing now, right?"}, {"time": 10364, "text": "His Suckin Mountain wrote the character."}, {"time": 10366, "text": "Both these books are, he has this whole premise of there's like this professional phase and there's a phase of giving of yourself and sacrificing on behalf of other people."}, {"time": 10375, "text": "I don't know, maybe it's all mixed together, right?"}, {"time": 10377, "text": "You wanna, I think living by a code is important, right?"}, {"time": 10380, "text": "I mean, this is something that's not emphasized enough."}, {"time": 10383, "text": "I always think of advice that my undergrad should be given that they're not given, especially at a place like Georgetown that has this like deep history of trying to promote human flourishing because of the Jesuit connection."}, {"time": 10394, "text": "There's such resiliency and pride that comes out of living well, even when it's hard, like living according to a code, living accord to, which I think religion used to structure this for people."}, {"time": 10408, "text": "But in its absence, you need some sort of replacement."}, {"time": 10410, "text": "But even when things were, soldiers get this a lot, right?"}, {"time": 10413, "text": "They experienced this a lot."}, {"time": 10414, "text": "Even when things were tough, I was able to persist in living this way that I knew was right, even though it wasn't the easiest thing to do in the moment."}, {"time": 10419, "text": "Fewer things give humans more resiliency."}, {"time": 10422, "text": "It's like having done that, your relationships were strong, right?"}, {"time": 10425, "text": "Many people coming to your funeral is a standard."}, {"time": 10427, "text": "A lot of people are gonna come to your funeral."}, {"time": 10429, "text": "I mean, you matter to a lot of people."}, {"time": 10431, "text": "And then maybe having done, to the extent of whatever capabilities you happen to be granted, and they're different for different people, and some people can sprint real fast, and some people can do math problems, try to actually do something of impact."}, {"time": 10446, "text": "I'll just promise to give gift cards to anybody who shows up to the funeral."}, {"time": 10450, "text": "You're gonna hack it."}, {"time": 10451, "text": "I'm gonna hack even the funeral."}, {"time": 10452, "text": "There's gonna be a lottery wheel you spin when you come in and someone goes away with $10,000."}, {"time": 10457, "text": "See, the problem is, with all this living by principles, living a principled life, focusing on relationships, and kind of thinking of this life as this perfect thing kind of forgets the notion that none of it makes any sense, right?"}, {"time": 10476, "text": "It kind of implies that this is like a video game and you wanna get a high score, as opposed to none of this even makes sense."}, {"time": 10485, "text": "Like, why would he, like, what that?"}, {"time": 10487, "text": "Like, what does it even mean to die?"}, {"time": 10492, "text": "It's gonna be over."}, {"time": 10493, "text": "It's like everything I do, all these productivity hacks, all this life, all these efforts, all this creative efforts, kind of assume it's gonna go on forever."}, {"time": 10502, "text": "There's a kind of a sense of immortality, and I don't even know how to intellectually make sense that it ends."}, {"time": 10508, "text": "Of course, gotta ask you in that context, what do you think is the meaning of it all, especially for a computer scientist?"}, {"time": 10514, "text": "I mean, there's gotta be some mathematical."}, {"time": 10517, "text": "Yeah, 27, or what's the, what's the Douglas Adams?"}, {"time": 10521, "text": "Yeah, or 42, okay."}, {"time": 10523, "text": "27 is a better number."}, {"time": 10524, "text": "I should read more sci fi."}, {"time": 10526, "text": "Maybe you're onto something with a 27."}, {"time": 10528, "text": "I don't wanna give away too much, but just trust me, 27."}, {"time": 10531, "text": "It's visible, yeah."}, {"time": 10534, "text": "So, I mean, I don't know, obviously, right?"}, {"time": 10537, "text": "I mean, I'm a..."}, {"time": 10538, "text": "I was hoping you would."}, {"time": 10538, "text": "Yeah, I don't know, but going back to what you were saying about the sort of the existentialist, or sort of the more nihilist style approach, the one thing that there is are intimations, right?"}, {"time": 10550, "text": "So that there's these intimations that human halves of somehow this feels right, and this feels wrong, this feels good, this feels like I'm doing, I'm aligned with something, you know, when I'm acting with courage to save, whatever, right?"}, {"time": 10563, "text": "It's not, these intimations are a grounding against arbitrariness."}, {"time": 10567, "text": "Like, one of the ideas I'm really interested in is that when you look at religion, right?"}, {"time": 10573, "text": "So I'm interested in world religions."}, {"time": 10575, "text": "My grandfather was like a theologian that studied and wrote all these books, and I'm very interested in this type of stuff."}, {"time": 10581, "text": "And there's this great book that's, it's not specific to a particular religion, but it's Karen Armstrong wrote this great book called The Case for God."}, {"time": 10590, "text": "She's very interesting."}, {"time": 10591, "text": "She was a Catholic nun who sort of left that religion, but one of the smartest thinkers in terms of like accessible theological thinking that's not tied to any particular religion."}, {"time": 10602, "text": "Her whole argument is that the way to understand religion, first of all, you have to go way back pre enlightenment where all this was formed."}, {"time": 10608, "text": "We got messed up thinking about religion post enlightenment, right?"}, {"time": 10611, "text": "And these were operating systems for making sense of intimations."}, {"time": 10617, "text": "The one thing we had were these different intimations of this field, like awe and mystical experience."}, {"time": 10623, "text": "And this feels, there's something you feel when you act in a certain way and don't act in this other way."}, {"time": 10628, "text": "And it was like the scientists who were trying to study and understand the model of the atom by just looking at experiments and trying to understand what's going on."}, {"time": 10636, "text": "Like the great religions of the world were basically figuring out how do we make sense of these intimations and live in alignment with them and build a life of meaning around that."}, {"time": 10644, "text": "What were the tools they were using?"}, {"time": 10646, "text": "They were using ritual."}]}]