[{"title": "Dmitri Dolgov: Waymo and the Future of Self-Driving Cars | Lex Fridman Podcast #147", "id": "P6prRXkI5HM", "quotes": [{"time": 277, "text": "It was, uh, like, uh, I think there are 300, 320 by 200, uh, whatever it was."}, {"time": 283, "text": "I think that kind of the earlier, that's the resolution, right?"}, {"time": 286, "text": "And I actually think the reason why this company wanted to buy it is not like the fancy graphics or the implementation."}, {"time": 291, "text": "That was maybe the idea, uh, of my actual game, the idea of the game."}, {"time": 297, "text": "Well, one of the things I, it's so funny."}, {"time": 299, "text": "I'm used to play this game called golden X and the simplicity of the graphics and something about the simplicity of the music, like it's still haunts me."}, {"time": 310, "text": "I don't know if that's a childhood thing."}, {"time": 312, "text": "I don't know if that's the same thing for call of duty these days for young kids, but I still think that the simple one of the games are simple."}, {"time": 321, "text": "That simple purity makes for like allows your imagination to take over and thereby creating a more magical experience."}, {"time": 330, "text": "Like now with better and better graphics, it feels like your imagination doesn't get to, uh, create worlds, which is kind of interesting."}, {"time": 338, "text": "Um, it could be just an old man on a porch, like way waving at kids these days that have no respect."}, {"time": 344, "text": "But I still think that graphics almost get in the way of the experience."}, {"time": 350, "text": "Flip a bird."}, {"time": 351, "text": "Yeah, I don't know if the imagination is closed."}, {"time": 357, "text": "I don't yet, but that that's more about games that op like that's more like Tetris world where they optimally masterfully, like create a fun, short term dopamine experience versus I'm more referring to like role playing games where there's like a story you can live in it for months or years."}, {"time": 378, "text": "Um, like, uh, there's an elder scroll series, which is probably my favorite set of games that was a magical experience."}, {"time": 386, "text": "And that the graphics are terrible."}, {"time": 388, "text": "The characters were all randomly generated, but they're, I don't know."}, {"time": 391, "text": "That's it pulls you in."}, {"time": 393, "text": "There's a story."}, {"time": 394, "text": "It's like an interactive version of an elder scrolls Tolkien world."}, {"time": 400, "text": "And you get to live in it."}, {"time": 403, "text": "I miss it."}, {"time": 404, "text": "It's one of the things that suck about being an adult is there's no, you have to live in the real world as opposed to the elder scrolls world, you know, whatever brings you joy, right?"}, {"time": 414, "text": "Minecraft, right?"}, {"time": 415, "text": "Minecraft is a great example."}, {"time": 416, "text": "You create, like it's not the fancy graphics, but it's the creation of your own worlds."}, {"time": 421, "text": "Yeah, that one is crazy."}, {"time": 422, "text": "You know, one of the pitches for being a parent that people tell me is that you can like use the excuse of parenting to, to go back into the video game world."}, {"time": 432, "text": "And like, like that's like, you know, father, son, father, daughter time, but really you just get to play video games with your kids."}, {"time": 439, "text": "So anyway, at that time, did you have any ridiculously ambitious dreams of where as a creator, you might go as an engineer?"}, {"time": 449, "text": "Did you, what, what did you think of yourself as, as an engineer, as a tinker, or did you want to be like an astronaut or something like that?"}, {"time": 457, "text": "You know, I'm tempted to make something up about, you know, robots, uh, engineering or, you know, mysteries of the universe, but that's not the actual memory that pops into my mind when you, when you asked me about childhood dreams."}, {"time": 468, "text": "So I'll actually share the, the, the real thing, uh, when I was maybe four or five years old, I, you know, as we all do, I thought about, you know, what I wanted to do when I grow up and I had this dream of being a traffic control cop."}, {"time": 488, "text": "Uh, you know, they don't have those today's I think, but you know, back in the eighties and in Russia, uh, you probably are familiar with that Lex."}, {"time": 495, "text": "They had these, uh, you know, police officers that would stand in the middle of intersection all day and they would have their like stripe back, black and white batons that they would use to control the flow of traffic and, you know, for whatever reasons, I was strangely infatuated with this whole process and like that, that was my dream."}, {"time": 512, "text": "Uh, that's what I wanted to do when I grew up and, you know, my parents, uh, both physics profs, by the way, I think were, you know, a little concerned, uh, with that level of ambition coming from their child."}, {"time": 524, "text": "Uh, uh, you know, that age."}, {"time": 526, "text": "Well, that it's an interesting, I don't know if you can relate, but I very much love that idea."}, {"time": 532, "text": "I have a OCD nature that I think lends itself very close to the engineering mindset, which is you want to kind of optimize, you know, solve a problem by create, creating an automated solution, like a, like a set of rules, that set of rules you can follow and then thereby make it ultra efficient."}, {"time": 554, "text": "I don't know if that's, it was of that nature."}, {"time": 557, "text": "I certainly have that."}, {"time": 558, "text": "There's like fact, like SimCity and factory building games, all those kinds of things kind of speak to that engineering mindset, or did you just like the uniform?"}, {"time": 567, "text": "I think it was more of the latter."}, {"time": 568, "text": "I think it was the uniform and the, you know, the, the stripe baton that made cars go in the right directions."}, {"time": 576, "text": "But I guess, you know, I, it is, I did end up, uh, I guess, uh, you know, working on the transportation industry one way or another uniform."}, {"time": 584, "text": "No, but that's right."}, {"time": 586, "text": "Maybe, maybe, maybe it was my, you know, deep inner infatuation with the, you know, traffic control batons that led to this career."}, {"time": 595, "text": "What, uh, when did you, when was the leap from programming to robotics?"}, {"time": 600, "text": "That happened later."}, {"time": 601, "text": "That was after grad school, uh, after, and I actually, the most self driving cars was I think my first real hands on introduction to robotics."}, {"time": 610, "text": "But I never really had that much hands on experience in school and training."}, {"time": 614, "text": "I, you know, worked on applied math and physics."}, {"time": 617, "text": "Then in college, I did more half, uh, abstract computer science."}, {"time": 623, "text": "And it was after grad school that I really got involved in robotics, which was actually self driving cars."}, {"time": 629, "text": "And, you know, that was a big flip."}, {"time": 632, "text": "What, uh, what grad school?"}, {"time": 634, "text": "So I went to grad school in Michigan, and then I did a postdoc at Stanford, uh, which is, that was the postdoc where I got to play with self driving cars."}, {"time": 642, "text": "So we'll return there."}, {"time": 643, "text": "Let's go back to, uh, to Moscow."}, {"time": 646, "text": "So, uh, you know, for episode 100, I talked to my dad and also I grew up with my dad, I guess."}, {"time": 653, "text": "Uh, so I had to put up with them for many years and, uh, he, he went to the FISTIEG or MIPT, it's weird to say in English, cause I've heard all this in Russian, Moscow Institute of Physics and Technology."}, {"time": 669, "text": "And to me, that was like, I met some super interesting, as a child, I met some super interesting characters."}, {"time": 677, "text": "It felt to me like the greatest university in the world, the most elite university in the world, and just the people that I met that came out of there were like, not only brilliant, but also special humans."}, {"time": 692, "text": "It seems like that place really tested the soul, uh, both like in terms of technically and like spiritually."}, {"time": 700, "text": "So that could be just the romanticization of that place."}, {"time": 703, "text": "I'm not sure, but so maybe you can speak to it, but is it correct to say that you spent some time at FISTIEG?"}, {"time": 711, "text": "Uh, I got my bachelor's and master's in physics and math there."}, {"time": 743, "text": "I went back there."}, {"time": 744, "text": "Yeah, that's exactly the reaction most of my peers in college had."}, {"time": 748, "text": "But, you know, perhaps a little bit stronger that like, you know, point me out as this crazy kid, were your parents supportive of that?"}, {"time": 755, "text": "My games, your previous question, they, uh, they supported me and, you know, letting me kind of pursue my passions and the things that I was interested in."}, {"time": 763, "text": "That's a bold move."}, {"time": 764, "text": "What was it like there?"}, {"time": 765, "text": "It was interesting, you know, definitely fairly hardcore on the fundamentals of, you know, math and physics and, uh, you know, lots of good memories, uh, from, you know, from those times."}, {"time": 776, "text": "So Stanford."}, {"time": 777, "text": "How'd you get into autonomous vehicles?"}, {"time": 779, "text": "I had the great fortune, uh, and great honor to join Stanford's DARPA urban challenge team."}, {"time": 787, "text": "And, uh, 2006 there, this was a third in the sequence of the DARPA challenges."}, {"time": 792, "text": "There were two grand challenges prior to that."}, {"time": 794, "text": "And then in 2007, they held the DARPA urban challenge."}, {"time": 799, "text": "So, you know, I was doing my, my postdoc I had, I joined the team and, uh, worked on motion planning, uh, for, you know, that, that competition."}, {"time": 810, "text": "So for people who might not know, I know from, from certain autonomous vehicles is a funny world in a certain circle of people, everybody knows everything."}, {"time": 819, "text": "And then the certain circle, uh, nobody knows anything in terms of general public."}, {"time": 826, "text": "It's, it's a good question of what to talk about, but I do think that the urban challenge is worth revisiting."}, {"time": 830, "text": "It's a fun little challenge."}, {"time": 836, "text": "One that, first of all, like sparked so much, so many incredible minds to focus on one of the hardest problems of our time in artificial intelligence."}, {"time": 846, "text": "So that's, that's a success from a perspective of a single little challenge."}, {"time": 851, "text": "But can you talk about like, what did the challenge involve?"}, {"time": 854, "text": "So were there pedestrians, were there other cars, what was the goal?"}, {"time": 858, "text": "Uh, who was on the team?"}, {"time": 860, "text": "How long did it take any fun, fun sort of specs?"}, {"time": 866, "text": "So the way the challenge was constructed and just a little bit of backgrounding, as I mentioned, this was the third, uh, competition in that series."}, {"time": 874, "text": "The first year we're at the grand challenge called the grand challenge."}, {"time": 876, "text": "The goal there was to just drive in a completely static environment."}, {"time": 880, "text": "You know, you had to drive in a desert, uh, that was very successful."}, {"time": 885, "text": "So then DARPA followed with what they called the urban challenge, where the goal was to have, you know, build vehicles that could operate in more dynamic environments and, you know, share them with other vehicles."}, {"time": 896, "text": "There were no pedestrians there, but what DARPA did is they took over an abandoned air force base."}, {"time": 902, "text": "Uh, and it was kind of like a little fake city that they built out there."}, {"time": 906, "text": "And they had a bunch of, uh, robots, uh, you know, cars, uh, that were autonomous, uh, in there all at the same time."}, {"time": 913, "text": "Uh, mixed in with other vehicles driven by professional, uh, drivers and each car, uh, had a mission and so there's a crude map that they received, uh, beginning and they had a mission and go here and then there and over here."}, {"time": 928, "text": "Um, and they kind of all were sharing this environment at the same time."}, {"time": 932, "text": "They had to interact with each other."}, {"time": 934, "text": "They had to interact with the human drivers."}, {"time": 936, "text": "There's this very first, very rudimentary, um, version of, uh, self driving car that, you know, could operate, uh, and, uh, in a, in an environment, you know, shared with other dynamic actors that, as you said, you know, really, you know, many ways, you know, kickstarted this whole industry."}, {"time": 955, "text": "So who was on the team and how'd you do?"}, {"time": 959, "text": "Uh, I came in second."}, {"time": 962, "text": "Uh, perhaps that was my contribution to the team."}, {"time": 965, "text": "I think the Stanford team came in first in the DARPA challenge."}, {"time": 990, "text": "Uh, so is there interesting mistakes?"}, {"time": 993, "text": "Is there interesting challenges that stand out to you as some, like, taught you, um, a good technical lesson or a good philosophical lesson from that time?"}, {"time": 1003, "text": "Uh, you know, definitely, definitely a very memorable time, not really challenged, but like one of the most vivid memories that I have from the time."}, {"time": 1012, "text": "And I think that was actually one of the days that really got me hooked, uh, on this whole field was, uh, the first time I got to run my software and I got to software on the car and, uh, I was working on a part of our planning algorithm, uh, that had to navigate in parking lots."}, {"time": 1033, "text": "So it was something that, you know, called free space emotion planning."}, {"time": 1036, "text": "So the very first version of that, uh, was, you know, we tried on the car, it was on Stanford's campus, uh, in the middle of the night and you had this little course constructed with cones, uh, in the middle of a parking lot."}, {"time": 1048, "text": "So we're there in like 3 am, you know, by the time we got the code to, you know, uh, uh, you know, compile and turn over, uh, and, you know, it drove, I could actually did something quite reasonable and, you know, it was of course very buggy at the time and had all kinds of problems, but it was pretty darn magical."}, {"time": 1068, "text": "I remember going back and, you know, later at night and trying to fall asleep and just, you know, being unable to fall asleep for the rest of the night, uh, just my mind was blown."}, {"time": 1077, "text": "Just like, and that, that, that's what I've been doing ever since for more than a decade, uh, in terms of challenges and, uh, you know, interesting memories, like on the day of the competition, uh, it was pretty nerve wrecking."}, {"time": 1090, "text": "Uh, I remember standing there with Mike Montemarillo, who was, uh, the software lead and wrote most of the code."}, {"time": 1095, "text": "I think I did one little part of the planner, Mike, you know, incredibly that, you know, pretty much the rest of it, uh, with, with, you know, a bunch of other incredible people, but I remember standing on the day of the competition, uh, you know, watching the car, you know, with Mike and cars are completely empty, right?"}, {"time": 1112, "text": "They're all there lined up in the beginning of the race and then, you know, DARPA sends them, you know, on their mission one by one."}, {"time": 1118, "text": "So then leave and Mike, you just, they had these sirens, they all had their different silence silence, right?"}, {"time": 1123, "text": "Each siren had its own personality, if you will."}, {"time": 1126, "text": "So, you know, off they go and you don't see them."}, {"time": 1128, "text": "You just kind of, and then every once in a while they come a little bit closer to where the audience is and you can kind of hear, you know, the sound of your car and then, you know, it seems to be moving along."}, {"time": 1137, "text": "So that, you know, gives you hope."}, {"time": 1138, "text": "And then, you know, it goes away and you can't hear it for too long."}, {"time": 1141, "text": "You start getting anxious, right?"}, {"time": 1142, "text": "So it's a little bit like, you know, sending your kids to college and like, you know, kind of you invested in them."}, {"time": 1145, "text": "You hope you, you, you, you, you, you, you build it properly, but like, it's still, uh, anxiety inducing."}, {"time": 1178, "text": "Very scenic though."}, {"time": 1179, "text": "So most people go there for the scenery."}, {"time": 1181, "text": "Um, yeah, it's a beautiful campus."}, {"time": 1185, "text": "I'm like, unlike Stanford."}, {"time": 1186, "text": "So for people, yeah, that's true."}, {"time": 1188, "text": "Unlike Stanford, for people who don't know, CMU is one of the great robotics and sort of artificial intelligence universities in the world, CMU, Carnegie Mellon university, okay, sorry, go ahead."}, {"time": 1198, "text": "Good, good PSA."}, {"time": 1199, "text": "So in the part that I contributed to, which was navigating parking lots and the way that part of the mission work is, uh, you in a parking lot, you would get from DARPA an outline of the map."}, {"time": 1215, "text": "You basically get this, you know, giant polygon that defined the perimeter of the parking lot, uh, and there would be an entrance and, you know, so maybe multiple entrances or access to it, and then you would get a goal, uh, within that open space, uh, X, Y, you know, heading where the car had to park and had no information about the optical, so obstacles that the car might encounter there."}, {"time": 1236, "text": "So it had to navigate a kind of completely free space, uh, from the entrance to the parking lot into that parking space."}, {"time": 1243, "text": "And then, uh, once parked there, it had to, uh, exit the parking lot, you know, while of course, I'm counting and reasoning about all the obstacles that it encounters in real time."}, {"time": 1254, "text": "So, uh, Our interpretation, or at least my interpretation of the rules was that you had to reverse out of the parking spot."}, {"time": 1263, "text": "And that's what our cars did."}, {"time": 1264, "text": "Even if there's no obstacle in front, that's not what CMU's car did."}, {"time": 1268, "text": "And it just kind of drove right through."}, {"time": 1270, "text": "So there's still a debate."}, {"time": 1272, "text": "And of course, you know, as you stop and then reverse out and go out the different way that costs you some time."}, {"time": 1276, "text": "And so there's still a debate whether, you know, it was my poor implementation that cost us extra time or whether it was, you know, CMU, uh, violating an important rule of the competition."}, {"time": 1287, "text": "And, you know, I have my own, uh, opinion here in terms of other bugs."}, {"time": 1290, "text": "And like, uh, I, I have to apologize to Mike Montemarila, uh, for sharing this on air, but it is actually, uh, one of the more memorable ones."}, {"time": 1298, "text": "Uh, and it's something that's kind of become a bit of, uh, a metaphor and a label in the industry, uh, since then, I think, you know, at least in some circles, it's called the victory circle or victory lap."}, {"time": 1309, "text": "Um, and, uh, uh, our cars did that."}, {"time": 1313, "text": "So in one of the missions in the urban challenge, in one of the courses, uh, there was this big oval, right by the start and finish of the race."}, {"time": 1322, "text": "So the ARPA had a lot of the missions would finish kind of in that same location."}, {"time": 1325, "text": "Uh, and it was pretty cool because you could see the cars come by, you know, kind of finished that part leg of the trip, that leg of the mission, and then, you know, go on and finish the rest of it."}, {"time": 1335, "text": "Uh, and other vehicles would, you know, come hit their waypoint, uh, and, you know, exit the oval and off they would go."}, {"time": 1344, "text": "Our car on the hand, which hit the checkpoint, and then it would do an extra lap around the oval and only then, you know, uh, leave and go on its merry way."}, {"time": 1351, "text": "So over the course of the full day, it accumulated, uh, uh, some extra time and the problem was that we had a bug where it wouldn't, you know, start reasoning about the next waypoint and plan a route to get to that next point until it hit a previous one."}, {"time": 1362, "text": "And in that particular case, by the time you hit the, that, that one, it was too late for us to consider the next one and kind of make a lane change."}, {"time": 1369, "text": "So at every time we would do like an extra lap."}, {"time": 1370, "text": "So, you know, and that's the Stanford victory lap."}, {"time": 1375, "text": "The victory lap."}, {"time": 1377, "text": "Oh, that's there's, I feel like there's something philosophically profound in there somehow, but, uh, I mean, ultimately everybody is a winner in that kind of competition."}, {"time": 1386, "text": "And it led to sort of famously to the creation of, um, Google self driving car project and now Waymo."}, {"time": 1395, "text": "So can we, uh, give an overview of how is Waymo born?"}, {"time": 1400, "text": "How's the Google self driving car project born?"}, {"time": 1403, "text": "What's the, what is the mission?"}, {"time": 1406, "text": "What is it is the engineering kind of, uh, set of milestones that it seeks to accomplish, there's a lot of questions in there."}, {"time": 1415, "text": "Uh, yeah, uh, I don't know, kind of the DARPA urban challenge and the DARPA and previous DARPA grand challenges, uh, kind of led, I think to a very large degree to that next step and then, you know, Larry and Sergey, um, uh, Larry Page and Sergey Brin, uh, uh, Google founders course, uh, I saw that competition and believed in the technology."}, {"time": 1434, "text": "So, you know, the Google self driving car project was born, you know, at that time."}, {"time": 1439, "text": "And we started in 2009, it was a pretty small group of us, about a dozen people, uh, who came together, uh, to, to work on this project at Google."}, {"time": 1449, "text": "At that time we saw an incredible early result in the DARPA urban challenge."}, {"time": 1458, "text": "I think we're all incredibly excited, uh, about where we got to and we believed in the future of the technology, but we still had a very, you know, very, you know, rudimentary understanding of the problem space."}, {"time": 1471, "text": "So the first goal of this project in 2009 was to really better understand what we're up against."}, {"time": 1479, "text": "Uh, and, you know, with that goal in mind, when we started the project, we created a few milestones for ourselves, uh, that."}, {"time": 1488, "text": "Maximized learnings."}, {"time": 1489, "text": "Well, the two milestones were, you know, uh, one was to drive a hundred thousand miles in autonomous mode, which was at that time, you know, orders of magnitude that, uh, more than anybody has ever done."}, {"time": 1501, "text": "And the second milestone was to drive 10 routes, uh, each one was a hundred miles long, uh, and there were specifically chosen to become extra spicy and extra complicated and sample the full complexity of the, that, that, uh, domain."}, {"time": 1518, "text": "Um, uh, and you had to drive each one from beginning to end with no intervention, no human intervention."}, {"time": 1524, "text": "So you would get to the beginning of the course, uh, you would press the button that would engage in autonomy and you had to go for a hundred miles, you know, beginning to end, uh, with no interventions."}, {"time": 1535, "text": "Um, and it sampled again, the full complexity of driving conditions."}, {"time": 1540, "text": "Some, uh, were on freeways."}, {"time": 1542, "text": "We had one route that went all through all the freeways and all the bridges in the Bay area."}, {"time": 1546, "text": "You know, we had, uh, some that went around Lake Tahoe and kind of mountains, uh, roads."}, {"time": 1552, "text": "We had some that drove through dense urban, um, environments like in downtown Palo Alto and through San Francisco."}, {"time": 1559, "text": "So it was incredibly, uh, interesting, uh, to work on."}, {"time": 1564, "text": "And it, uh, it took us just under two years, uh, about a year and a half, a little bit more to finish both of these milestones."}, {"time": 1574, "text": "And in that process, uh, you know, it was an incredible amount of fun, probably the most fun I had in my professional career."}, {"time": 1582, "text": "And you're just learning so much."}, {"time": 1584, "text": "You are, you know, the goal here is to learn and prototype."}, {"time": 1586, "text": "You're not yet starting to build a production system, right?"}, {"time": 1589, "text": "So you just, you were, you know, this is when you're kind of working 24 seven and you're hacking things together."}, {"time": 1594, "text": "And you also don't know how hard this is."}, {"time": 1597, "text": "I mean, that's the point."}, {"time": 1598, "text": "Like, so, I mean, that's an ambitious, if I put myself in that mindset, even still, that's a really ambitious set of goals."}, {"time": 1606, "text": "Like just those two picking, picking 10 different, difficult, spicy challenges."}, {"time": 1616, "text": "And then having zero interventions."}, {"time": 1619, "text": "So like not saying gradually we're going to like, you know, over a period of 10 years, we're going to have a bunch of routes and gradually reduce the number of interventions, you know, that literally says like, by as soon as possible, we want to have zero and on hard roads."}, {"time": 1637, "text": "So like, to me, if I was facing that, it's unclear that whether that takes two years or whether that takes 20 years."}, {"time": 1646, "text": "I mean, it took us under two."}, {"time": 1647, "text": "I guess that that speaks to a really big difference between doing something once and having a prototype where you are going after, you know, learning about the problem versus how you go about engineering a product that, you know, where you look at, you know, you do properly do evaluation, you look at metrics, you drive down and you're confident that you can do that."}, {"time": 1700, "text": "That's another really important moment."}, {"time": 1701, "text": "Is there some memories of technical lessons or just one, like, what did you learn about the problem of driving from that experience?"}, {"time": 1742, "text": "Like what the hell is driving as an autonomous, or maybe I'm again romanticizing it, but is it, is there, is there some valuable lessons you picked up over there at those two years?"}, {"time": 1758, "text": "A ton."}, {"time": 1786, "text": "But we've tried, we've sampled enough of the problem space and we've made enough rapid success, even, you know, with technology of 2009, 2010, that it gave us confidence to then, you know, pursue this as a real product."}, {"time": 1804, "text": "So the next step, you mentioned the milestones that you had in the, in those two years, what are the next milestones that then led to the creation of Waymo and beyond?"}, {"time": 1814, "text": "Yeah, we had a, it was a really interesting journey and, you know, Waymo came a little bit later, then, you know, we completed those milestones in 2010."}, {"time": 1825, "text": "That was the pivot when we decided to focus on actually building a product using this technology."}, {"time": 1832, "text": "The initial couple of years after that, we were focused on a freeway, you know, what you would call a driver assist, maybe, you know, an L3 driver assist program."}, {"time": 1842, "text": "Then around 2013, we've learned enough about the space and thought more deeply about, you know, the product that we wanted to build, that we pivoted, we pivoted towards this vision of building a driver and deploying it fully driverless vehicles without a person."}, {"time": 1862, "text": "And that that's the path that we've been on since then."}, {"time": 1865, "text": "And very, it was exactly the right decision for us."}, {"time": 1868, "text": "So there was a moment where you're also considered like, what is the right trajectory here?"}, {"time": 1874, "text": "What is the right role of automation in the, in the task of driving?"}, {"time": 1878, "text": "There's still, it wasn't from the early days, obviously you want to go fully autonomous."}, {"time": 1884, "text": "From the early days, it was not."}, {"time": 1885, "text": "I think it was in 20, around 2013, maybe that we've, that became very clear and we made that pivot and also became very clear and that it's either the way you go building a driver assist system is, you know, fundamentally different from how you go building a fully driverless vehicle."}, {"time": 1903, "text": "So, you know, we've pivoted towards the ladder and that's what we've been working on ever since."}, {"time": 1910, "text": "And so that was around 2013, then there's sequence of really meaningful for us really important defining milestones since then."}, {"time": 1920, "text": "And in 2015, we had our first, actually the world's first fully driverless trade on public roads."}, {"time": 1935, "text": "It was in a custom built vehicle that we had."}, {"time": 1937, "text": "I must've seen those."}, {"time": 1938, "text": "We called them the Firefly, that, you know, funny looking marshmallow looking thing."}, {"time": 1942, "text": "And we put a passenger, his name was Steve Mann, you know, great friend of our project from the early days, the man happens to be blind."}, {"time": 1954, "text": "So we put them in that vehicle."}, {"time": 1956, "text": "The car had no steering wheel, no pedals."}, {"time": 1958, "text": "It was an uncontrolled environment."}, {"time": 1960, "text": "You know, no, you know, lead or chase cars, no police escorts."}, {"time": 1964, "text": "And, you know, we did that trip a few times in Austin, Texas."}, {"time": 1967, "text": "So that was a really big milestone."}, {"time": 1969, "text": "But that was in Austin."}, {"time": 1972, "text": "And, you know, we only, but at that time we're only, it took a tremendous amount of engineering."}, {"time": 1977, "text": "It took a tremendous amount of validation to get to that point."}, {"time": 1981, "text": "But, you know, we only did it a few times."}, {"time": 1983, "text": "We only did that."}, {"time": 1984, "text": "It was a fixed route."}, {"time": 1985, "text": "It was not kind of a controlled environment, but it was a fixed route."}, {"time": 1988, "text": "And we only did a few times."}, {"time": 1990, "text": "Then in 2016, end of 2016, beginning of 2017 is when we founded Waymo, the company."}, {"time": 2000, "text": "That's when we kind of, that was the next phase of the project where I wanted, we believed in kind of the commercial vision of this technology."}, {"time": 2010, "text": "And it made sense to create an independent entity, you know, within that alphabet umbrella to pursue this product at scale."}, {"time": 2019, "text": "Beyond that in 2017, later in 2017 was another really huge step for us."}, {"time": 2026, "text": "Really big milestone where we started, I think it was October of 2017 where when we started regular driverless operations on public roads, that first day of operations, we drove in one day."}, {"time": 2042, "text": "And that first day, a hundred miles and driverless fashion."}, {"time": 2045, "text": "And then we've now the most, the most important thing about that milestone was not that, you know, a hundred miles in one day, but that it was the start of kind of regular ongoing driverless operations."}, {"time": 2054, "text": "And when you say driverless, it means no driver."}, {"time": 2059, "text": "So on that first day, we actually hit a mix and in some, we didn't want to like, you know, be on YouTube and Twitter that same day."}, {"time": 2067, "text": "So in, in many of the rides we had somebody in the driver's seat, but they could not disengage like the car, not disengage, but actually on that first day, some of the miles were driven and just completely empty driver's seat."}, {"time": 2112, "text": "And now we'll talk about more and more where there's literally no driver."}, {"time": 2117, "text": "So that's another, the interesting case of where the driver's not supposed to disengage, that's like a nice middle ground, they're still there, but they're not supposed to disengage, but really there's the case when there's no, okay, there's something magical about there being nobody in the driver's seat."}, {"time": 2176, "text": "There's something about like the steering wheel, cause we perhaps romanticize the notion of the steering wheel, it's so essential to our conception, our 20th century conception of a car and it turning the steering wheel with nobody in driver's seat, that to me, I think maybe to others, it's really powerful."}, {"time": 2194, "text": "Like this thing is in control and then there's this leap of trust that you give."}, {"time": 2199, "text": "Like I'm going to put my life in the hands of this thing that's in control."}, {"time": 2202, "text": "So in that sense, when there's no, but no driver in the driver's seat, that's a magical moment for robots."}, {"time": 2209, "text": "So I'm, I've gotten a chance to last year to take a ride in a, in a way more vehicle and that, that was the magical moment."}, {"time": 2214, "text": "There's like nobody in the driver's seat."}, {"time": 2218, "text": "It's, it's like the little details."}, {"time": 2218, "text": "You would think it doesn't matter whether there's a driver or not, but like if there's no driver and the steering wheel is turning on its own, I don't know."}, {"time": 2227, "text": "That's magical."}, {"time": 2233, "text": "It's absolutely magical."}, {"time": 2233, "text": "I, I have taken many of these rides and like completely empty car, no human in the car pulls up, you know, you call it on your cell phone."}, {"time": 2242, "text": "It pulls up, you get in, it takes you on its way."}, {"time": 2242, "text": "There's nobody in the car, but you, right?"}, {"time": 2247, "text": "That's something called, you know, fully driverless, you know, our writer only mode of operation."}, {"time": 2251, "text": "It, it is magical."}, {"time": 2251, "text": "It is, you know, transformative."}, {"time": 2259, "text": "This is what we hear from our writers."}, {"time": 2259, "text": "It kind of really changes your experience."}, {"time": 2264, "text": "And not like that, that really is what unlocks the real potential of this technology."}, {"time": 2268, "text": "But, you know, coming back to our journey, you know, that was 2017 when we started, you know, truly driverless operations."}, {"time": 2278, "text": "Then in 2018, we've launched our public commercial service that we called Waymo One in Phoenix."}, {"time": 2285, "text": "In 2019, we started offering truly driverless writer only rides to our early rider population of users."}, {"time": 2293, "text": "And then, you know, 2020 has also been a pretty interesting year."}, {"time": 2302, "text": "One of the first ones, less about technology, but more about the maturing and the growth of Waymo as a company."}, {"time": 2311, "text": "We raised our first round of external financing this year, you know, we were part of Alphabet."}, {"time": 2317, "text": "So obviously we have access to, you know, significant resources but as kind of on the journey of Waymo maturing as a company, it made sense for us to, you know, partially go externally in this round."}, {"time": 2325, "text": "So, you know, we're raised about $3.2 billion from that round."}, {"time": 2330, "text": "We've also started putting our fifth generation of our driver, our hardware, that is on the new vehicle, but it's also a qualitatively different set of self driving hardware."}, {"time": 2350, "text": "That is now on the JLR pace."}, {"time": 2350, "text": "So that was a very important step for us."}, {"time": 2359, "text": "Hardware specs, fifth generation."}, {"time": 2359, "text": "I think it'd be fun to maybe, I apologize if I'm interrupting, but maybe talk about maybe the generations with a focus on what we're talking about on the fifth generation in terms of hardware specs, like what's on this car."}, {"time": 2376, "text": "So we separated out, you know, the actual car that we are driving from the self driving hardware we put on it."}, {"time": 2381, "text": "Right now we have, so this is, as I mentioned, the fifth generation, you know, we've gone through, we started, you know, building our own hardware, you know, many, many years ago."}, {"time": 2389, "text": "And that, you know, Firefly vehicle also had the hardware suite that was mostly designed, engineered, and built in house."}, {"time": 2401, "text": "Lighters are one of the more important components that we design and build from the ground up."}, {"time": 2407, "text": "So on the fifth generation of our drivers of our self driving hardware that we're switching to right now, we have, as with previous generations, in terms of sensing, we have lighters, cameras, and radars, and we have a pretty beefy computer that processes all that information and makes decisions in real time on board the car."}, {"time": 2433, "text": "So in all of the, and it's really a qualitative jump forward in terms of the capabilities and the various parameters and the specs of the hardware compared to what we had before and compared to what you can kind of get off the shelf in the market today."}, {"time": 2451, "text": "Meaning from fifth to fourth or from fifth to first?"}, {"time": 2454, "text": "Definitely from first to fifth, but also from the fourth."}, {"time": 2457, "text": "That was the world's dumbest question."}, {"time": 2458, "text": "Definitely from fourth to fifth, as well as the last step is a big step forward."}, {"time": 2467, "text": "So everything's in house."}, {"time": 2467, "text": "So like LIDAR is built in house and cameras are built in house?"}, {"time": 2475, "text": "You know, it's different."}, {"time": 2475, "text": "We work with partners and there's some components that we get from our manufacturing and supply chain partners."}, {"time": 2479, "text": "What exactly is in house is a bit different."}, {"time": 2486, "text": "We do a lot of custom design on all of our sensing modalities, lighters, radars, cameras, you know, exactly."}, {"time": 2497, "text": "There's lighters are almost exclusively in house and some of the technologies that we have, some of the fundamental technologies there are completely unique to Waymo."}, {"time": 2505, "text": "That is also largely true about radars and cameras."}, {"time": 2511, "text": "It's a little bit more of a mix in terms of what we do ourselves versus what we get from partners."}, {"time": 2517, "text": "Is there something super sexy about the computer that you can mention that's not top secret?"}, {"time": 2521, "text": "Like for people who enjoy computers for, I mean, there's a lot of machine learning involved, but there's a lot of just basic compute."}, {"time": 2532, "text": "You have to probably do a lot of signal processing on all the different sensors."}, {"time": 2537, "text": "You have to integrate everything has to be in real time."}, {"time": 2540, "text": "There's probably some kind of redundancy type of situation."}, {"time": 2543, "text": "Is there something interesting you can say about the computer for the people who love hardware?"}, {"time": 2547, "text": "It does have all of the characteristics, all the properties that you just mentioned."}, {"time": 2554, "text": "Redundancy, very beefy compute for general processing, as well as inference and ML models."}, {"time": 2561, "text": "It is some of the more sensitive stuff that I don't want to get into for IP reasons, but it can be shared a little bit in terms of the specs of the sensors that we have on the car."}, {"time": 2574, "text": "We actually shared some videos of what our lighters see in the world."}, {"time": 2580, "text": "We have 29 cameras."}, {"time": 2580, "text": "We have five lighters."}, {"time": 2585, "text": "We have six radars on these vehicles, and you can get a feel for the amount of data that they're producing."}, {"time": 2589, "text": "That all has to be processed in real time to do perception, to do complex reasoning."}, {"time": 2596, "text": "That kind of gives you some idea of how beefy those computers are, but I don't want to get into specifics of exactly how we build them."}, {"time": 2602, "text": "Okay, well, let me try some more questions that you can get into the specifics of, like GPU wise."}, {"time": 2605, "text": "Is that something you can get into?"}, {"time": 2608, "text": "I know that Google works with GPUs and so on."}, {"time": 2608, "text": "I mean, for machine learning folks, it's kind of interesting."}, {"time": 2613, "text": "Or is there no... How do I ask it?"}, {"time": 2618, "text": "I've been talking to people in the government about UFOs and they don't answer any questions."}, {"time": 2623, "text": "So this is how I feel right now asking about GPUs."}, {"time": 2626, "text": "But is there something interesting that you could reveal?"}, {"time": 2631, "text": "Or is it just... Or leave it up to our imagination, some of the compute."}, {"time": 2637, "text": "Is there any, I guess, is there any fun trickery?"}, {"time": 2642, "text": "Like I talked to Chris Latner for a second time and he was a key person about GPUs, and there's a lot of fun stuff going on in Google in terms of hardware that optimizes for machine learning."}, {"time": 2655, "text": "Is there something you can reveal in terms of how much, you mentioned customization, how much customization there is for hardware for machine learning purposes?"}, {"time": 2663, "text": "I'm going to be like that government person who bought UFOs."}, {"time": 2666, "text": "I guess I will say that it's really... Compute is really important."}, {"time": 2674, "text": "We have very data hungry and compute hungry ML models all over our stack."}, {"time": 2681, "text": "And this is where both being part of Alphabet, as well as designing our own sensors and the entire hardware suite together, where on one hand you get access to really rich raw sensor data that you can pipe from your sensors into your compute platform and build like build the whole pipe from sensor raw sensor data to the big compute as then have the massive compute to process all that data."}, {"time": 2714, "text": "And this is where we're finding that having a lot of control of that hardware part of the stack is really advantageous."}, {"time": 2721, "text": "One of the fascinating magical places to me again, might not be able to speak to the details, but it is the other compute, which is like, we're just talking about a single car, but the driving experience is a source of a lot of fascinating data."}, {"time": 2739, "text": "And you have a huge amount of data coming in on the car and the infrastructure of storing some of that data to then train or to analyze or so on."}, {"time": 2747, "text": "That's a fascinating piece of it that I understand a single car."}, {"time": 2752, "text": "I don't understand how you pull it all together in a nice way."}, {"time": 2760, "text": "Is that something that you could speak to in terms of the challenges of seeing the network of cars and then bringing the data back and analyzing things that like edge cases of driving, be able to learn on them to improve the system to see where things went wrong, where things went right and analyze all that kind of stuff."}, {"time": 2780, "text": "Is there something interesting there from an engineering perspective?"}, {"time": 2814, "text": "And this is where being part of Alphabet has once again been tremendously advantageous because we consume an incredible amount of compute for ML infrastructure."}, {"time": 2826, "text": "We build a lot of custom frameworks to get good at data mining, finding the interesting edge cases for training and for evaluation of the system for both training and evaluating some components and your sub parts of the system and various ML models, as well as the evaluating the entire system and simulation."}, {"time": 2851, "text": "That first piece that you mentioned that cars communicating to each other, essentially, I mean, through perhaps through a centralized point, but what that's fascinating too, how much does that help you?"}, {"time": 2860, "text": "Like if you imagine, you know, right now the number of way more vehicles is whatever X. I don't know if you can talk to what that number is, but it's not in the hundreds of millions yet."}, {"time": 2870, "text": "And imagine if the whole world is way more vehicles, like that changes potentially the power of connectivity."}, {"time": 2879, "text": "Like the more cars you have, I guess, actually, if you look at Phoenix, cause there's enough vehicles, there's enough, when there's like some level of density, you can start to probably do some really interesting stuff with the fact that cars can negotiate, can be, can communicate with each other and thereby make decisions."}, {"time": 2901, "text": "Is there something interesting there that you can talk to about like, how does that help with the driving problem from, as compared to just a single car solving the driving problem by itself?"}, {"time": 2915, "text": "Yeah, it's a spectrum."}, {"time": 2915, "text": "I first and say that, you know, it's, it helps and it helps in various ways, but it's not required right now with the way we build our system, like each cars can operate independently."}, {"time": 2926, "text": "They can operate with no connectivity."}, {"time": 2929, "text": "So I think it is important that, you know, you have a fully autonomous, fully capable driver that, you know, computerized driver that each car has."}, {"time": 2939, "text": "Then, you know, they do share information and they share information in real time."}, {"time": 2943, "text": "It really, really helps."}, {"time": 2946, "text": "So the way we do this today is, you know, whenever one car encounters something interesting in the world, whether it might be an accident or a new construction zone, that information immediately gets, you know, uploaded over the air and it's propagated to the rest of the fleet."}, {"time": 2963, "text": "So, and that's kind of how we think about maps as priors in terms of the knowledge of our drivers, of our fleet of drivers that is distributed across the fleet and it's updated in real time."}, {"time": 2978, "text": "So that's one use case."}, {"time": 3006, "text": "You know, it's not part of kind of your updating your static prior of the map of the world, but it's more of a dynamic information that could be relevant to the decisions that another car is making real time."}, {"time": 3014, "text": "So you can see them exchanging that information and you can build on that."}, {"time": 3016, "text": "But again, I see that as an advantage, but it's not a requirement."}, {"time": 3023, "text": "So what about the human in the loop?"}, {"time": 3023, "text": "So when I got a chance to drive with a ride in a Waymo, you know, there's customer service."}, {"time": 3034, "text": "So like there is somebody that's able to dynamically like tune in and help you out."}, {"time": 3039, "text": "What role does the human play in that picture?"}, {"time": 3048, "text": "That's a fascinating like, you know, the idea of teleoperation, be able to remotely control a vehicle."}, {"time": 3053, "text": "So here, what we're talking about is like, like frictionless, like a human being able to in a in a frictionless way, sort of help you out."}, {"time": 3063, "text": "I don't know if they're able to actually control the vehicle."}, {"time": 3070, "text": "Is that something you could talk to?"}, {"time": 3070, "text": "To be clear, we don't do teleporation."}, {"time": 3074, "text": "I kind of believe in teleporation for various reasons."}, {"time": 3076, "text": "That's not what we have in our cars."}, {"time": 3079, "text": "We do, as you mentioned, have, you know, version of, you know, customer support."}, {"time": 3082, "text": "You know, we call it life health."}, {"time": 3084, "text": "In fact, we find it that it's very important for our ride experience, especially if it's your first trip, you've never been in a fully driverless ride or only way more vehicle you get in, there's nobody there."}, {"time": 3095, "text": "And so you can imagine having all kinds of, you know, questions in your head, like how this thing works."}, {"time": 3100, "text": "So we've put a lot of thought into kind of guiding our, our writers or customers through that experience, especially for the first time they get some information on the phone."}, {"time": 3109, "text": "If the fully driverless vehicle is used to service their trip, when you get into the car, we have an in car, you know, screen and audio that kind of guides them and explains what to expect."}, {"time": 3121, "text": "They also have a button that they can push that will connect them to, you know, a real life human being that they can talk to, right, about this whole process."}, {"time": 3133, "text": "So that's one aspect of it."}, {"time": 3133, "text": "There is, you know, I should mention that there is another function that humans provide to our cars, but it's not teleoperation."}, {"time": 3141, "text": "You can think of it a little bit more like, you know, fleet assistance, kind of like, you know, traffic control that you have, where our cars, again, they're responsible on their own for making all of the decisions, all of the driving decisions that don't require connectivity."}, {"time": 3157, "text": "They, you know, anything that is safety or latency critical is done, you know, purely autonomously by onboard, our onboard system."}, {"time": 3169, "text": "But there are situations where, you know, if connectivity is available, when a car encounters a particularly challenging situation, you can imagine like a super hairy scene of an accident, the cars will do their best, they will recognize that it's an off nominal situation, they will do their best to come up with the right interpretation, the best course of action in that scenario."}, {"time": 3187, "text": "But if connectivity is available, they can ask for confirmation from, you know, human assistant to kind of confirm those actions and perhaps provide a little bit of kind of contextual information and guidance."}, {"time": 3202, "text": "So October 8th was when you're talking about the was Waymo launched the fully self, the public version of its fully driverless, that's the right term, I think, service in Phoenix."}, {"time": 3218, "text": "Is that October 8th?"}, {"time": 3218, "text": "It was the introduction of fully driverless, right, our only vehicles into our public Waymo One service."}, {"time": 3223, "text": "Okay, so that's that's amazing."}, {"time": 3227, "text": "So it's like anybody can get into Waymo in Phoenix."}, {"time": 3231, "text": "So we previously had early people in our early rider program, taking fully driverless rides in Phoenix."}, {"time": 3241, "text": "And just this a little while ago, we opened on October 8th, we opened that mode of operation to the public."}, {"time": 3246, "text": "So I can download the app and go on a ride."}, {"time": 3249, "text": "There's a lot more demand right now for that service."}, {"time": 3254, "text": "And then we have capacity."}, {"time": 3257, "text": "So we're kind of managing that."}, {"time": 3257, "text": "But that's exactly the way to describe it."}, {"time": 3260, "text": "So there's more demand than you can handle."}, {"time": 3262, "text": "Like what has been reception so far?"}, {"time": 3268, "text": "I mean, okay, so this is a product, right?"}, {"time": 3274, "text": "That's a whole nother discussion of like how compelling of a product it is."}, {"time": 3278, "text": "But it's also like one of the most kind of transformational technologies of the 21st century."}, {"time": 3283, "text": "So it's also like a tourist attraction."}, {"time": 3288, "text": "Like it's fun to, you know, to be a part of it."}, {"time": 3288, "text": "So it'd be interesting to see like, what do people say?"}, {"time": 3292, "text": "What do people, what have been the feedback so far?"}, {"time": 3296, "text": "You know, still early days, but so far, the feedback has been incredible, incredibly positive."}, {"time": 3304, "text": "They, you know, we asked them for feedback during the ride, we asked them for feedback after the ride as part of their trip."}, {"time": 3310, "text": "We asked them some questions, we asked them to rate the performance of our driver."}, {"time": 3312, "text": "Most by far, you know, most of our drivers give us five stars in our app, which is absolutely great to see."}, {"time": 3321, "text": "And you know, that's and we're they're also giving us feedback on you know, things we can improve."}, {"time": 3326, "text": "And you know, that's that's one of the main reasons we're doing this as Phoenix and you know, over the last couple of years, and every day today, we are just learning a tremendous amount of new stuff from our users."}, {"time": 3335, "text": "There's there's no substitute for actually doing the real thing, actually having a fully driverless product out there in the field with, you know, users that are actually paying us money to get from point A to point B."}, {"time": 3348, "text": "So this is a legitimate like, there's a paid service."}, {"time": 3351, "text": "And the idea is you use the app to go from point A to point B."}, {"time": 3356, "text": "And then what what are the A's?"}, {"time": 3359, "text": "What are the what's the freedom of the of the starting and ending places?"}, {"time": 3363, "text": "It's an area of geography where that service is enabled."}, {"time": 3367, "text": "It's a decent size of geography of territory."}, {"time": 3372, "text": "It's actually larger than the size of San Francisco."}, {"time": 3376, "text": "And you know, within that, you have full freedom of, you know, selecting where you want to go."}, {"time": 3380, "text": "You know, of course, there's some and you on your app, you get a map, you tell the car where you want to be picked up, where you want the car to pull over and pick you up."}, {"time": 3391, "text": "And then you tell it where you want to be dropped off."}, {"time": 3393, "text": "And of course, there are some exclusions, right?"}, {"time": 3394, "text": "You want to be you know, you were in terms of where the car is allowed to pull over, right?"}, {"time": 3397, "text": "So that you can do."}, {"time": 3400, "text": "But you know, besides that, it's amazing."}, {"time": 3400, "text": "It's not like a fixed just would be very I guess."}, {"time": 3403, "text": "Maybe that's what's the question behind your question."}, {"time": 3405, "text": "But it's not a, you know, preset set of yes, I guess."}, {"time": 3407, "text": "So within the geographic constraints with that within that area anywhere else, it can be you can be picked up and dropped off anywhere."}, {"time": 3416, "text": "And you know, people use them on like all kinds of trips."}, {"time": 3419, "text": "They we have and we have an incredible spectrum of riders."}, {"time": 3422, "text": "We I think the youngest actually have car seats them and we have, you know, people taking their kids and rides."}, {"time": 3427, "text": "I think the youngest riders we had on cars are, you know, one or two years old, you know, and the full spectrum of use cases people you can take them to, you know, schools to, you know, go grocery shopping, to restaurants, to bars, you know, run errands, you know, go shopping, etc, etc."}, {"time": 3441, "text": "You can go to your office, right?"}, {"time": 3444, "text": "Like the full spectrum of use cases, and people are going to use them in their daily lives to get around."}, {"time": 3451, "text": "And we see all kinds of really interesting use cases and that that that's providing us incredibly valuable experience that we then, you know, use to improve our product."}, {"time": 3463, "text": "So as somebody who's been on done a few long rants with Joe Rogan and others about the toxicity of the internet and the comments and the negativity in the comments, I'm fascinated by feedback."}, {"time": 3476, "text": "I believe that most people are good and kind and intelligent and can provide, like, even in disagreement, really fascinating ideas."}, {"time": 3487, "text": "So on a product side, it's fascinating to me, like, how do you get the richest possible user feedback, like, to improve?"}, {"time": 3494, "text": "What's, what are the channels that you use to measure?"}, {"time": 3499, "text": "Because, like, you're no longer, that's one of the magical things about autonomous vehicles is it's not like it's frictionless interaction with the human."}, {"time": 3512, "text": "So like, you don't get to, you know, it's just giving a ride."}, {"time": 3515, "text": "So like, how do you get feedback from people to in order to improve?"}, {"time": 3520, "text": "Yeah, great question, various mechanisms."}, {"time": 3520, "text": "So as part of the normal flow, we ask people for feedback, they as the car is driving around, we have on the phone and in the car, and we have a touchscreen in the car, you can actually click some buttons and provide real time feedback on how the car is doing, and how the car is handling a particular situation, you know, both positive and negative."}, {"time": 3540, "text": "So that's one channel, we have, as we discussed, customer support or life help, where, you know, if a customer wants to, has a question, or he has some sort of concern, they can talk to a person in real time."}, {"time": 3553, "text": "So that that is another mechanism that gives us feedback."}, {"time": 3556, "text": "At the end of a trip, you know, we also ask them how things went, they give us comments, and you know, star rating."}, {"time": 3565, "text": "And you know, if it's, we also, you know, ask them to explain what you know, one, well, and you know, what could be improved."}, {"time": 3573, "text": "And we have our writers providing very rich feedback, they're a lot, a large fraction is very passionate, very excited about this technology."}, {"time": 3584, "text": "So we get really good feedback."}, {"time": 3585, "text": "We also run UXR studies, right, you know, specific and that are kind of more, you know, go more in depth."}, {"time": 3593, "text": "And we will run both kind of lateral and longitudinal studies, where we have deeper engagement with our customers, you know, we have our user experience research team, tracking over time, that's things about longitudinal is cool."}, {"time": 3607, "text": "That's that's exactly right."}, {"time": 3607, "text": "And you know, that's another really valuable feedback, source of feedback."}, {"time": 3612, "text": "And we're just covering a tremendous amount, right?"}, {"time": 3616, "text": "People go grocery shopping, and they like want to load, you know, 20 bags of groceries in our cars and like that, that's one workflow that you maybe don't think about, you know, getting just right when you're building the driverless product."}, {"time": 3629, "text": "I have people like, you know, who bike as part of their trip."}, {"time": 3634, "text": "So they, you know, bike somewhere, then they get on our cars, they take apart their bike, they load into our vehicle, then go and that's, you know, how they, you know, where we want to pull over and how that, you know, get in and get out process works, provides very useful feedback in terms of what makes a good pickup and drop off location, we get really valuable feedback."}, {"time": 3655, "text": "And in fact, we had to do some really interesting work with high definition maps, and thinking about walking directions."}, {"time": 3665, "text": "And if you imagine you're in a store, right in some giant space, and then you know, you want to be picked up somewhere, like if you just drop a pin at a current location, which is maybe in the middle of a shopping mall, like what's the best location for the car to come pick you up?"}, {"time": 3676, "text": "And you can have simple heuristics where you're just going to take your you know, you clean in distance and find the nearest spot where the car can pull over that's closest to you."}, {"time": 3685, "text": "But oftentimes, that's not the most convenient one."}, {"time": 3688, "text": "You know, I have many anecdotes where that heuristic breaks in horrible ways."}, {"time": 3692, "text": "One example that I often mentioned is somebody wanted to be, you know, dropped off in Phoenix."}, {"time": 3698, "text": "And you know, we got car picked location that was close, the closest to there, you know, where the pin was dropped on the map in terms of, you know, latitude and longitude."}, {"time": 3711, "text": "But it happened to be on the other side of a parking lot that had this row of cacti."}, {"time": 3718, "text": "And the poor person had to like walk all around the parking lot to get to where they wanted to be in 110 degree heat."}, {"time": 3724, "text": "So that, you know, that was about so then, you know, we took all take all of these, all that feedback from our users and incorporate it into our system and improve it."}, {"time": 3730, "text": "Yeah, I feel like that's like requires AGI to solve the problem of like, when you're, which is a very common case, when you're in a big space of some kind, like apartment building, it doesn't matter, it's some large space."}, {"time": 3744, "text": "And then you call the, like a Waymo from there, right?"}, {"time": 3749, "text": "Like, whatever, it doesn't matter, ride share vehicle."}, {"time": 3752, "text": "And like, where's the pin supposed to drop?"}, {"time": 3757, "text": "I feel like that's, you don't think, I think that requires AGI."}, {"time": 3761, "text": "I'm gonna, in order to solve."}, {"time": 3761, "text": "Okay, the alternative, which I think the Google search engine is taught is like, there's something really valuable about the perhaps slightly dumb answer, but a really powerful one, which is like, what was done in the past by others?"}, {"time": 3778, "text": "Like, what was the choice made by others?"}, {"time": 3782, "text": "That seems to be like in terms of Google search, when you have like billions of searches, you could, you could see which, like when they recommend what you might possibly mean, they suggest based on not some machine learning thing, which they also do, but like, on what was successful for others in the past and finding a thing that they were happy with."}, {"time": 3803, "text": "Is that integrated at all?"}, {"time": 3803, "text": "Waymo, like what, what pickups worked for others?"}, {"time": 3807, "text": "I think you're exactly right."}, {"time": 3811, "text": "So there's a real, it's an interesting problem."}, {"time": 3814, "text": "Naive solutions have interesting failure modes."}, {"time": 3814, "text": "So there's definitely lots of things that can be done to improve."}, {"time": 3828, "text": "And both learning from, you know, what works, but doesn't work in actual heal from getting richer data and getting more information about the environment and richer maps."}, {"time": 3841, "text": "But you're absolutely right, that there's something like there's some properties of solutions that in terms of the effect that they have on users so much, much, much better than others, right?"}, {"time": 3850, "text": "And predictability and understandability is important."}, {"time": 3851, "text": "So you can have maybe something that is not quite as optimal, but is very natural and predictable to the user and kind of works the same way all the time."}, {"time": 3861, "text": "And that matters, that matters a lot for the user experience."}, {"time": 3865, "text": "And but you know, to get to the basics, the pretty fundamental property is that the car actually arrives where you told it to, right?"}, {"time": 3875, "text": "Like, you can always, you know, change it, see it on the map, and you can move it around if you don't like it."}, {"time": 3879, "text": "And but like, that property that the car actually shows up reliably is critical, which, you know, where compared to some of the human driven analogs, I think, you know, you can have more predictability."}, {"time": 3921, "text": "And of course, you get the position of the car and the route on the map."}, {"time": 3923, "text": "But and they actually follow that route, of course."}, {"time": 3926, "text": "But it can also share some really interesting information about what it's doing."}, {"time": 3929, "text": "So, you know, our cars, as they are coming to pick you up, if it's come, if a car is coming up to a stop sign, it will actually show you that like, it's there sitting, because it's at a stop sign or a traffic light will show you that it's got, you know, sitting at a red light."}, {"time": 3942, "text": "So, you know, they're like little things, right?"}, {"time": 3944, "text": "But I find those little touches really interesting, really magical."}, {"time": 3951, "text": "And it's just, you know, little things like that, that you can do to kind of delight your users."}, {"time": 3957, "text": "You know, this makes me think of, there's some products that I just love."}, {"time": 3962, "text": "Like, there's a there's a company called Rev, Rev.com, where I like for this podcast, for example, I can drag and drop a video."}, {"time": 3973, "text": "And then they do all the captioning."}, {"time": 3977, "text": "It's humans doing the captioning, but they connect, they automate everything of connecting you to the humans, and they do the captioning and transcription."}, {"time": 3987, "text": "It's all effortless."}, {"time": 3987, "text": "And it like, I remember when I first started using them, I was like, life's good."}, {"time": 3989, "text": "Like, because it was so painful to figure that out earlier."}, {"time": 3995, "text": "The same thing with something called iZotope RX, this company I use for cleaning up audio, like the sound cleanup they do."}, {"time": 4003, "text": "It's like drag and drop, and it just cleans everything up very nicely."}, {"time": 4009, "text": "Another experience like that I had with Amazon OneClick purchase, first time."}, {"time": 4012, "text": "I mean, other places do that now, but just the effortlessness of purchasing, making it frictionless."}, {"time": 4020, "text": "It kind of communicates to me, like, I'm a fan of design."}, {"time": 4024, "text": "I'm a fan of products that you can just create a really pleasant experience."}, {"time": 4028, "text": "The simplicity of it, the elegance just makes you fall in love with it."}, {"time": 4032, "text": "So on the, do you think about this kind of stuff?"}, {"time": 4036, "text": "I mean, it's exactly what we've been talking about."}, {"time": 4039, "text": "It's like the little details that somehow make you fall in love with the product."}, {"time": 4045, "text": "Is that, we went from like urban challenge days, where love was not part of the conversation, probably."}, {"time": 4050, "text": "And to this point where there's a, where there's human beings and you want them to fall in love with the experience."}, {"time": 4059, "text": "Is that something you're trying to optimize for?"}, {"time": 4062, "text": "Try to think about, like, how do you create an experience that people love?"}, {"time": 4068, "text": "I think that's the vision is removing any friction or complexity from getting our users, our writers to where they want to go."}, {"time": 4082, "text": "Making that as simple as possible."}, {"time": 4082, "text": "And then, you know, beyond that, just transportation, making things and goods get to their destination as seamlessly as possible."}, {"time": 4093, "text": "I talked about a drag and drop experience where I kind of express your intent and then it just magically happens."}, {"time": 4100, "text": "And for our writers, that's what we're trying to get to is you download an app and you click and car shows up."}, {"time": 4103, "text": "It's the same car."}, {"time": 4108, "text": "It's very predictable."}, {"time": 4108, "text": "It's a safe and high quality experience."}, {"time": 4113, "text": "And then it gets you in a very reliable, very convenient, frictionless way to where you want to be."}, {"time": 4123, "text": "And along the journey, I think we also want to do little things to delight our users."}, {"time": 4127, "text": "Like the ride sharing companies, because they don't control the experience, I think they can't make people fall in love necessarily with the experience."}, {"time": 4140, "text": "Or maybe they, they haven't put in the effort, but I think if I were to speak to the ride sharing experience I currently have, it's just very, it's just very convenient, but there's a lot of room for like falling in love with it."}, {"time": 4156, "text": "Like we can speak to sort of car companies, car companies do this."}, {"time": 4160, "text": "Well, you can fall in love with a car, right?"}, {"time": 4162, "text": "And be like a loyal car person, like whatever."}, {"time": 4162, "text": "Like I like badass hot rods, I guess, 69 Corvette."}, {"time": 4166, "text": "And at this point, you know, you can't really, cars are so, owning a car is so 20th century, man."}, {"time": 4175, "text": "But is there something about the Waymo experience where you hope that people will fall in love with it?"}, {"time": 4183, "text": "Is that part of it?"}, {"time": 4183, "text": "Or is it part of, is it just about making a convenient ride, not ride sharing, I don't know what the right term is, but just a convenient A to B autonomous transport or like, do you want them to fall in love with Waymo?"}, {"time": 4202, "text": "To maybe elaborate a little bit."}, {"time": 4202, "text": "I mean, almost like from a business perspective, I'm curious, like how, do you want to be in the background invisible or do you want to be like a source of joy that's in very much in the foreground?"}, {"time": 4215, "text": "I want to provide the best, most enjoyable transportation solution."}, {"time": 4224, "text": "And that means building it, building our product and building our service in a way that people do."}, {"time": 4234, "text": "Kind of use in a very seamless, frictionless way in their day to day lives."}, {"time": 4241, "text": "And I think that does mean, you know, in some way falling in love in that product, right, just kind of becomes part of your routine."}, {"time": 4248, "text": "It comes down my mind to safety, predictability of the experience, and privacy aspects of it, right?"}, {"time": 4262, "text": "Our cars, you get the same car, you get very predictable behavior."}, {"time": 4267, "text": "And you get a lot of different things."}, {"time": 4271, "text": "And that is important."}, {"time": 4271, "text": "And if you're going to use it in your daily life, privacy, and when you're in a car, you can do other things."}, {"time": 4278, "text": "You're spending a bunch, just another space where you're spending a significant part of your life."}, {"time": 4284, "text": "And so not having to share it with other people who you don't want to share it with, I think is a very nice property."}, {"time": 4287, "text": "Maybe you want to take a phone call or do something else in the vehicle."}, {"time": 4294, "text": "And, you know, safety on the quality of the driving, as well as the physical safety of not having to share that ride is important to a lot of people."}, {"time": 4305, "text": "What about the idea that when there's somebody like a human driving, and they do a rolling stop on a stop sign, like sometimes like, you know, you get an Uber or Lyft or whatever, like human driver, and, you know, they can be a little bit aggressive as drivers."}, {"time": 4327, "text": "It feels like there's not all aggression is bad."}, {"time": 4327, "text": "Now that may be a wrong, again, 20th century conception of driving."}, {"time": 4337, "text": "Maybe it's possible to create a driving experience."}, {"time": 4341, "text": "Like if you're in the back, busy doing something, maybe aggression is not a good thing."}, {"time": 4344, "text": "It's a very different kind of experience perhaps."}, {"time": 4347, "text": "But it feels like in order to navigate this world, you need to, how do I phrase this?"}, {"time": 4352, "text": "You need to kind of bend the rules a little bit, or at least test the rules."}, {"time": 4358, "text": "I don't know what language politicians use to discuss this, but whatever language they use, you like flirt with the rules."}, {"time": 4368, "text": "But like you sort of have a bit of an aggressive way of driving that asserts your presence in this world, thereby making other vehicles and people respect your presence and thereby allowing you to sort of navigate through intersections in a timely fashion."}, {"time": 4386, "text": "I don't know if any of that made sense, but like, how does that fit into the experience of driving autonomously?"}, {"time": 4398, "text": "It's a lot of thoughts."}, {"time": 4398, "text": "This is you're hitting on a very important point of a number of behavioral components and, you know, parameters that make your driving feel assertive and natural and comfortable and predictable."}, {"time": 4414, "text": "Our cars will follow rules, right?"}, {"time": 4417, "text": "They will do the safest thing possible in all situations."}, {"time": 4419, "text": "Let me be clear on that."}, {"time": 4419, "text": "But if you think of really, really good drivers, just think about professional lemon drivers, right?"}, {"time": 4427, "text": "They will follow the rules."}, {"time": 4429, "text": "They're very, very smooth, and yet they're very efficient."}, {"time": 4433, "text": "But they're assertive."}, {"time": 4433, "text": "They're comfortable for the people in the vehicle."}, {"time": 4438, "text": "They're predictable for the other people outside the vehicle that they share the environment with."}, {"time": 4443, "text": "And that's the kind of driver that we want to build."}, {"time": 4446, "text": "And you think if maybe there's a sport analogy there, right?"}, {"time": 4451, "text": "You can do in very many sports, the true professionals are very efficient in their movements, right?"}, {"time": 4460, "text": "They don't do like, you know, hectic flailing, right?"}, {"time": 4465, "text": "They're, you know, smooth and precise, right?"}, {"time": 4465, "text": "And they get the best results."}, {"time": 4469, "text": "So that's the kind of driver that we want to build."}, {"time": 4470, "text": "In terms of, you know, aggressiveness."}, {"time": 4470, "text": "Yeah, you can like, you know, roll through the stop signs."}, {"time": 4473, "text": "You can do crazy lane changes."}, {"time": 4475, "text": "It typically doesn't get you to your destination faster."}, {"time": 4478, "text": "Typically not the safest or most predictable, very most comfortable thing to do."}, {"time": 4480, "text": "But there is a way to do both."}, {"time": 4485, "text": "And that's what we're doing."}, {"time": 4489, "text": "We're trying to build the driver that is safe, comfortable, smooth, and predictable."}, {"time": 4493, "text": "Yeah, that's a really interesting distinction."}, {"time": 4498, "text": "I think in the early days of autonomous vehicles, the vehicles felt cautious as opposed to efficient."}, {"time": 4503, "text": "And I'm still probably, but when I rode in the Waymo, I mean, there was, it was, it was quite assertive."}, {"time": 4513, "text": "It moved pretty quickly."}, {"time": 4513, "text": "Like, yeah, then he's one of the surprising feelings was that it actually, it went fast."}, {"time": 4522, "text": "And it didn't feel like, awkwardly cautious than autonomous vehicle."}, {"time": 4528, "text": "Like, like, so I've also programmed autonomous vehicles and everything I've ever built was felt awkwardly, either overly aggressive."}, {"time": 4534, "text": "Okay, especially when it was my code, or like, awkwardly cautious is the way I would put it."}, {"time": 4544, "text": "And Waymo's vehicle felt like, assertive and I think efficient is like the right terminology here."}, {"time": 4557, "text": "It wasn't, and I also like the professional limo driver, because we often think like, you know, an Uber driver or a bus driver or a taxi."}, {"time": 4566, "text": "This is the funny thing is people think they track taxi drivers are professionals."}, {"time": 4569, "text": "They, I mean, it's, it's like, that that's like saying, I'm a professional walker, just because I've been walking all my life."}, {"time": 4580, "text": "I think there's an art to it, right?"}, {"time": 4580, "text": "And if you take it seriously as an art form, then there's a certain way that mastery looks like."}, {"time": 4590, "text": "It's interesting to think about what does mastery look like in driving?"}, {"time": 4593, "text": "And perhaps what we associate with like aggressiveness is unnecessary, like, it's not part of the experience of driving."}, {"time": 4603, "text": "It's like, unnecessary fluff, that efficiency, you can be, you can create a good driving experience within the rules."}, {"time": 4620, "text": "That's, I mean, you're the first person to tell me this."}, {"time": 4623, "text": "So it's, it's kind of interesting."}, {"time": 4623, "text": "I need to think about this, but that's exactly what it felt like with Waymo."}, {"time": 4627, "text": "I kind of had this intuition."}, {"time": 4627, "text": "Maybe it's the Russian thing."}, {"time": 4630, "text": "I don't know that you have to break the rules in life to get anywhere, but maybe, maybe it's possible that that's not the case in driving."}, {"time": 4639, "text": "I have to think about that, but it certainly felt that way on the streets of Phoenix when I was there in Waymo, that, that, that that was a very pleasant experience and it wasn't frustrating in that like, come on, move already kind of feeling."}, {"time": 4652, "text": "It wasn't, that wasn't there."}, {"time": 4655, "text": "I mean, that's what, that's what we're going after."}, {"time": 4657, "text": "I don't think you have to pick one."}, {"time": 4657, "text": "I think truly good driving."}, {"time": 4661, "text": "It gives you both efficiency, a certainness, but also comfort and predictability and safety."}, {"time": 4665, "text": "And, you know, it's, that's what fundamental improvements in the core capabilities truly unlock."}, {"time": 4674, "text": "And you can kind of think of it as, you know, a precision and recall trade off."}, {"time": 4679, "text": "You have certain capabilities of your model."}, {"time": 4681, "text": "And then it's very easy when, you know, you have some curve of precision and recall, you can move things around and can choose your operating point and your training of precision versus recall, false positives versus false negatives."}, {"time": 4690, "text": "But then, and you know, you can tune things on that curve and be kind of more cautious or more aggressive, but then aggressive is bad or, you know, cautious is bad, but true capabilities come from actually moving the whole curve up."}, {"time": 4702, "text": "And then you are kind of on a very different plane of those trade offs."}, {"time": 4708, "text": "And that, that's what we're trying to do here is to move the whole curve up."}, {"time": 4711, "text": "Before I forget, let's talk about trucks a little bit."}, {"time": 4714, "text": "So I also got a chance to check out some of the Waymo trucks."}, {"time": 4719, "text": "I'm not sure if we want to go too much into that space, but it's a fascinating one."}, {"time": 4724, "text": "So maybe we can mention at least briefly, you know, Waymo is also now doing autonomous trucking and how different like philosophically and technically is that whole space of problems."}, {"time": 4738, "text": "It's one of our two big products and you know, commercial applications of our driver, right?"}, {"time": 4746, "text": "Hailing and deliveries."}, {"time": 4749, "text": "You know, we have Waymo One and Waymo Via moving people and moving goods."}, {"time": 4752, "text": "You know, trucking is an example of moving goods."}, {"time": 4756, "text": "We've been working on trucking since 2017."}, {"time": 4761, "text": "It is a very interesting space."}, {"time": 4761, "text": "And your question of how different is it?"}, {"time": 4771, "text": "It has this really nice property that the first order challenges, like the science, the hard engineering, whether it's, you know, hardware or, you know, onboard software or off board software, all of the, you know, systems that you build for, you know, training your ML models for, you know, evaluating your time system."}, {"time": 4788, "text": "Like those fundamentals carry over."}, {"time": 4791, "text": "Like the true challenges of, you know, driving perception, semantic understanding, prediction, decision making, planning, evaluation, the simulator, ML infrastructure, those carry over."}, {"time": 4804, "text": "Like the data and the application and kind of the domains might be different, but the most difficult problems, all of that carries over between the domains."}, {"time": 4816, "text": "So that's very nice."}, {"time": 4819, "text": "So that's how we approach it."}, {"time": 4819, "text": "We're kind of build investing in the core, the technical core."}, {"time": 4822, "text": "And then there's specialization of that core technology to different product lines, to different commercial applications."}, {"time": 4830, "text": "So on just to tease it apart a little bit on trucks."}, {"time": 4834, "text": "So starting with the hardware, the configuration of the sensors is different."}, {"time": 4842, "text": "They're different physically, geometrically, you know, different vehicles."}, {"time": 4846, "text": "So for example, we have two of our main laser on the trucks on both sides so that we have, you know, not have the blind spots."}, {"time": 4854, "text": "Whereas on the JLR eye pace, we have, you know, one of it sitting at the very top, but the actual sensors are almost the same."}, {"time": 4862, "text": "Now we're largely the same."}, {"time": 4862, "text": "So all of the investment that over the years we've put into building our custom lighters, custom radars, pulling the whole system together, that carries over very nicely."}, {"time": 4873, "text": "Then, you know, on the perception side, the like the fundamental challenges of seeing, understanding the world, whether it's, you know, object detection, classification, you know, tracking, semantic understanding, all that carries over."}, {"time": 4885, "text": "You know, yes, there's some specialization when you're driving on freeways, you know, range becomes more important."}, {"time": 4891, "text": "The domain is a little bit different."}, {"time": 4893, "text": "But again, the fundamentals carry over very, very nicely."}, {"time": 4896, "text": "Same, and you guess you get into prediction or decision making, right, the fundamentals of what it takes to predict what other people are going to do to find the long tail to improve your system in that long tail of behavior prediction and response that carries over right and so on and so on."}, {"time": 4916, "text": "So I mean, that's pretty exciting."}, {"time": 4916, "text": "By the way, does Waymo via include using the smaller vehicles for transportation of goods?"}, {"time": 4925, "text": "That's an interesting distinction."}, {"time": 4925, "text": "So I would say there's three interesting modes of operation."}, {"time": 4933, "text": "So one is moving humans, one is moving goods, and one is like moving nothing, zero occupancy, meaning like you're going to the destination, your empty vehicle."}, {"time": 4941, "text": "I mean, it's the third is the less of it."}, {"time": 4947, "text": "If that's the entirety of it, it's the less, you know, exciting from the commercial perspective."}, {"time": 4951, "text": "Well, I mean, in terms of like, if you think about what's inside a vehicle as it's moving, because it does, you know, some significant fraction of the vehicle's movement has to be empty."}, {"time": 4965, "text": "I mean, it's kind of fascinating."}, {"time": 4965, "text": "Maybe just on that small point, is there different control and like policies that are applied for zero occupancy vehicle?"}, {"time": 4977, "text": "So vehicle with nothing in it, or is it just move as if there is a person inside?"}, {"time": 4984, "text": "What was with some subtle differences?"}, {"time": 4989, "text": "As a first order approximation, there are no differences."}, {"time": 4989, "text": "And if you think about, you know, safety and comfort and quality of driving, only part of it has to do with the people or the goods inside of the vehicle."}, {"time": 5006, "text": "But you don't want to be, you know, you want to drive smoothly, as we discussed, not for the purely for the benefit of whatever you have inside the car, right?"}, {"time": 5014, "text": "It's also for the benefit of the people outside kind of fitting naturally and predictably into that whole environment, right?"}, {"time": 5021, "text": "So, you know, yes, there are some second order things you can do, you can change your route, and you optimize maybe kind of your fleet, things at the fleet scale."}, {"time": 5030, "text": "And you would take into account whether some of your you know, some of your cars are actually, you know, serving a useful trip, whether with people or with goods, whereas, you know, other cars are, you know, driving completely empty to that next valuable trip that they're going to provide."}, {"time": 5045, "text": "But that those are mostly second order effects."}, {"time": 5049, "text": "So Phoenix is, is an incredible place."}, {"time": 5054, "text": "And what you've announced in Phoenix is, it's kind of amazing."}, {"time": 5058, "text": "But, you know, that's just like one city."}, {"time": 5063, "text": "How do you take over the world?"}, {"time": 5063, "text": "I mean, I'm asking for a friend."}, {"time": 5070, "text": "One step at a time."}, {"time": 5075, "text": "Is that a cartoon pinky in the brain?"}, {"time": 5075, "text": "But, you know, gradually is a true answer."}, {"time": 5080, "text": "So I think the heart of your question is, can you ask a better question than I asked?"}, {"time": 5088, "text": "You're asking a great question."}, {"time": 5088, "text": "Answer that one."}, {"time": 5088, "text": "I'm just gonna, you know, phrase it in the terms that I want to answer."}, {"time": 5096, "text": "You know, where are we today?"}, {"time": 5101, "text": "And, you know, what happens next?"}, {"time": 5101, "text": "And what does it take to go beyond Phoenix?"}, {"time": 5104, "text": "And what does it take to get this technology to more places and more people around the world, right?"}, {"time": 5113, "text": "So our next big area of focus is exactly that."}, {"time": 5123, "text": "Larger scale commercialization and just, you know, scaling up."}, {"time": 5126, "text": "If I think about, you know, the main, and, you know, Phoenix gives us that platform and gives us that foundation of upon which we can build."}, {"time": 5139, "text": "And it's, there are few really challenging aspects of this whole problem that you have to pull together in order to build the technology in order to deploy it into the field to go from a driverless car to a fleet of cars that are providing a service, and then all the way to commercialization."}, {"time": 5169, "text": "So, and then, you know, this is what we have in Phoenix."}, {"time": 5174, "text": "We've taken the technology from a proof point to an actual deployment and have taken our driver from, you know, one car to a fleet that can provide a service."}, {"time": 5185, "text": "Beyond that, if I think about what it will take to scale up and, you know, deploy in, you know, more places with more customers, I tend to think about three main dimensions, three main axes of scale."}, {"time": 5201, "text": "One is the core technology, you know, the hardware and software core capabilities of our driver."}, {"time": 5211, "text": "The second dimension is evaluation and deployment."}, {"time": 5216, "text": "And the third one is the, you know, product, commercial, and operational excellence."}, {"time": 5221, "text": "So you can talk a bit about where we are along, you know, each one of those three dimensions about where we are today and, you know, what has, what will happen next."}, {"time": 5231, "text": "On, you know, the core technology, you know, the hardware and software, you know, together comprise a driver, we, you know, obviously have that foundation that is providing fully driverless trips to our customers as we speak, in fact."}, {"time": 5250, "text": "And we've learned a tremendous amount from that."}, {"time": 5254, "text": "So now what we're doing is we are incorporating all those lessons into some pretty fundamental improvements in our core technology, both on the hardware side and on the software side to build a more general, more robust solution that then will enable us to massively scale beyond Phoenix."}, {"time": 5274, "text": "So on the hardware side, all of those lessons are now incorporated into this fifth generation hardware platform that is, you know, being deployed right now."}, {"time": 5289, "text": "And that's the platform, the fourth generation, the thing that we have right now driving in Phoenix, it's good enough to operate fully driverlessly, you know, night and day, you know, various speeds and various conditions, but the fifth generation is the platform upon which we want to go to massive scale."}, {"time": 5305, "text": "We, in turn, we've really made qualitative improvements in terms of the capability of the system, the simplicity of the architecture, the reliability of the redundancy."}, {"time": 5315, "text": "It is designed to be manufacturable at very large scale and, you know, provides the right unit economics."}, {"time": 5322, "text": "So that's the next big step for us on the hardware side."}, {"time": 5326, "text": "That's already there for scale, the version five."}, {"time": 5329, "text": "And is that coincidence or should we look into a conspiracy theory that it's the same version as the pixel phone?"}, {"time": 5335, "text": "Is that what's the hardware?"}, {"time": 5339, "text": "They neither confirm nor deny."}, {"time": 5339, "text": "So, sorry."}, {"time": 5344, "text": "So that's the, okay, that's that axis."}, {"time": 5348, "text": "So similarly, you know, hardware is a very discreet jump, but, you know, similar to how we're making that change from the fourth generation hardware to the fifth, we're making similar improvements on the software side to make it more, you know, robust and more general and allow us to kind of quickly scale beyond Phoenix."}, {"time": 5362, "text": "So that's the first dimension of core technology."}, {"time": 5367, "text": "How do you measure your system?"}, {"time": 5367, "text": "How do you evaluate it?"}, {"time": 5374, "text": "How do you build a release and deployment process where, you know, with confidence, you can, you know, regularly release new versions of your driver into a fleet?"}, {"time": 5385, "text": "How do you get good at it so that it is not, you know, a huge tax on your researchers and engineers that, you know, so you can, how do you build all these, you know, processes, the frameworks, the simulation, the evaluation, the data science, the validation, so that, you know, people can focus on improving the system and kind of the releases just go out the door and get deployed across the fleet."}, {"time": 5404, "text": "So we've gotten really good at that in Phoenix."}, {"time": 5407, "text": "That's been a tremendously difficult problem, but that's what we have in Phoenix right now that gives us that foundation."}, {"time": 5415, "text": "And now we're working on kind of incorporating all the lessons that we've learned to make it more efficient, to go to new places, you know, and scale up and just kind of, you know, stamp things out."}, {"time": 5422, "text": "So that's that second dimension of evaluation and deployment."}, {"time": 5425, "text": "And the third dimension is product, commercial, and operational excellence, right?"}, {"time": 5433, "text": "And again, Phoenix there is providing an incredibly valuable platform."}, {"time": 5438, "text": "You know, that's why we're doing things end to end in Phoenix."}, {"time": 5440, "text": "We're learning, as you know, we discussed a little earlier today, tremendous amount of really valuable lessons from our users getting really incredible feedback."}, {"time": 5450, "text": "And we'll continue to iterate on that and incorporate all those lessons into making our product, you know, even better and more convenient for our users."}, {"time": 5461, "text": "So you're converting this whole process in Phoenix into something that could be copy and pasted elsewhere."}, {"time": 5466, "text": "So like, perhaps you didn't think of it that way when you were doing the experimentation in Phoenix, but so how long did you basically, and you can correct me, but you've, I mean, it's still early days, but you've taken the full journey in Phoenix, right?"}, {"time": 5484, "text": "As you were saying of like what it takes to basically automate."}, {"time": 5489, "text": "I mean, it's not the entirety of Phoenix, right?"}, {"time": 5491, "text": "But I imagine it can encompass the entirety of Phoenix."}, {"time": 5496, "text": "That's some near term date, but that's not even perhaps important."}, {"time": 5501, "text": "Like as long as it's a large enough geographic area."}, {"time": 5503, "text": "So what, how copy pastable is that process currently and how like, you know, like when you copy and paste in Google docs, I think now in, or in word, you can like apply source formatting or apply destination formatting."}, {"time": 5529, "text": "So how, when you copy and paste the Phoenix into like, say Boston, how do you apply the destination formatting?"}, {"time": 5534, "text": "Like how much of the core of the entire process of bringing an actual public transportation, autonomous transportation service to a city is there in Phoenix that you understand enough to copy and paste into Boston or wherever?"}, {"time": 5555, "text": "So we're not quite there yet."}, {"time": 5559, "text": "We're not at a point where we're kind of massively copy and pasting all over the place."}, {"time": 5611, "text": "And that's what we're doing right now."}, {"time": 5618, "text": "We're incorporating all those things that we learned into that next system that then will allow us to kind of copy and paste all over the place and to massively scale to, you know, more users and more locations."}, {"time": 5627, "text": "I mean, you know, just talk a little bit about, you know, what does that mean along those different dimensions?"}, {"time": 5632, "text": "So on the hardware side, for example, again, it's that switch from the fourth to the fifth generation."}, {"time": 5637, "text": "And the fifth generation is designed to kind of have that property."}, {"time": 5640, "text": "Can you say what other cities you're thinking about?"}, {"time": 5644, "text": "Like, I'm thinking about, sorry, we're in San Francisco now."}, {"time": 5649, "text": "I thought I want to move to San Francisco, but I'm thinking about moving to Austin."}, {"time": 5652, "text": "I don't know why people are not being very nice about San Francisco currently, but maybe it's a small, maybe it's in vogue right now."}, {"time": 5663, "text": "But Austin seems, I visited there and it was, I was in a Walmart."}, {"time": 5668, "text": "It's funny, these moments like turn your life."}, {"time": 5672, "text": "There's this very nice woman with kind eyes, just like stopped and said, he looks so handsome in that tie, honey, to me."}, {"time": 5678, "text": "This has never happened to me in my life, but just the sweetness of this woman is something I've never experienced, certainly on the streets of Boston, but even in San Francisco where people wouldn't, that's just not how they speak or think."}, {"time": 5697, "text": "There's a warmth to Austin that love."}, {"time": 5697, "text": "And since Waymo does have a little bit of a history there, is that a possibility?"}, {"time": 5704, "text": "Is this your version of asking the question of like, you know, Dimitri, I know you can't share your commercial and deployment roadmap, but I'm thinking about moving to San Francisco, Austin, like, you know, blink twice if you think I should move to it."}, {"time": 5716, "text": "You got me."}, {"time": 5719, "text": "You know, we've been testing all over the place."}, {"time": 5719, "text": "I think we've been testing more than 25 cities."}, {"time": 5723, "text": "We drive in San Francisco."}, {"time": 5726, "text": "We drive in, you know, Michigan for snow."}, {"time": 5731, "text": "We are doing significant amount of testing in the Bay Area, including San Francisco, which is not like, because we're talking about the very different thing, which is like a full on large geographic area, public service."}, {"time": 5740, "text": "You can't share and you, okay."}, {"time": 5746, "text": "What about Moscow?"}, {"time": 5746, "text": "When is that happening?"}, {"time": 5754, "text": "Take on Yandex."}, {"time": 5754, "text": "I'm not paying attention to those folks."}, {"time": 5758, "text": "They're doing, you know, there's a lot of fun."}, {"time": 5758, "text": "I mean, maybe as a way of a question, you didn't speak to sort of like policy or like, is there tricky things with government and so on?"}, {"time": 5775, "text": "Like, is there other friction that you've encountered except sort of technological friction of solving this very difficult problem?"}, {"time": 5785, "text": "Is there other stuff that you have to overcome when deploying a public service in a city?"}, {"time": 5793, "text": "It's very important."}, {"time": 5793, "text": "So we put significant effort in creating those partnerships and you know, those relationships with governments at all levels, local governments, municipalities, state level, federal level."}, {"time": 5810, "text": "We've been engaged in very deep conversations from the earliest days of our projects."}, {"time": 5817, "text": "Whenever at all of these levels, whenever we go to test or operate in a new area, we always lead with a conversation with the local officials."}, {"time": 5830, "text": "But the result of that investment is that no, it's not challenges we have to overcome, but it is very important that we continue to have this conversation."}, {"time": 5839, "text": "I love politicians too."}, {"time": 5839, "text": "Okay, so Mr. Elon Musk said that LiDAR is a crutch."}, {"time": 5852, "text": "I wouldn't characterize it exactly that way."}, {"time": 5852, "text": "I know I think LiDAR is very important."}, {"time": 5856, "text": "It is a key sensor that we use just like other modalities, right?"}, {"time": 5862, "text": "As we discussed, our cars use cameras, LiDAR and radars."}, {"time": 5866, "text": "They are all very important."}, {"time": 5866, "text": "They are at the kind of the physical level."}, {"time": 5872, "text": "They are very different."}, {"time": 5872, "text": "They have very different, you know, physical characteristics."}, {"time": 5880, "text": "Cameras are passive."}, {"time": 5880, "text": "LiDARs and radars are active."}, {"time": 5883, "text": "Use different wavelengths."}, {"time": 5883, "text": "So that means they complement each other very nicely and together combined, they can be used to build a much safer and much more capable system."}, {"time": 5900, "text": "So, you know, to me it's more of a question, you know, why the heck would you handicap yourself and not use one or more of those sensing modalities when they, you know, undoubtedly just make your system more capable and safer."}, {"time": 5912, "text": "Now, it, you know, what might make sense for one product or one business might not make sense for another one."}, {"time": 5928, "text": "So if you're talking about driver assist technologies, you make certain design decisions and you make certain trade offs and make different ones if you are building a driver that you deploy in fully driverless vehicles."}, {"time": 5939, "text": "And, you know, in LiDAR specifically, when this question comes up, I, you know, typically the criticisms that I hear or, you know, the counterpoints is that cost and aesthetics."}, {"time": 5956, "text": "And I don't find either of those, honestly, very compelling."}, {"time": 5960, "text": "So on the cost side, there's nothing fundamentally prohibitive about, you know, the cost of LiDARs."}, {"time": 5964, "text": "You know, radars used to be very expensive before people started, you know, before people made certain advances in technology and, you know, started to manufacture them at massive scale and deploy them in vehicles, right?"}, {"time": 5975, "text": "You know, similar with LiDARs."}, {"time": 6003, "text": "And, you know, that improvement will continue."}, {"time": 6007, "text": "So I think, you know, cost is not a real issue."}, {"time": 6010, "text": "Second one is, you know, aesthetics."}, {"time": 6014, "text": "You know, I don't think that's, you know, a real issue either."}, {"time": 6018, "text": "Beauty is in the eye of the beholder."}, {"time": 6018, "text": "You can make LiDAR sexy again."}, {"time": 6022, "text": "I think it is sexy."}, {"time": 6022, "text": "Like, honestly, I think form all of function."}, {"time": 6025, "text": "You know, I was actually, somebody brought this up to me."}, {"time": 6030, "text": "I mean, all forms of LiDAR, even like the ones that are like big, you can make look, I mean, you can make look beautiful."}, {"time": 6040, "text": "There's no sense in which you can't integrate it into design."}, {"time": 6044, "text": "Like, there's all kinds of awesome designs."}, {"time": 6044, "text": "I don't think small and humble is beautiful."}, {"time": 6047, "text": "It could be like, you know, brutalism or like, it could be like harsh corners."}, {"time": 6055, "text": "I mean, like I said, like hot rods."}, {"time": 6055, "text": "Like, I don't like, I don't necessarily like, like, oh man, I'm going to start so much controversy with this."}, {"time": 6062, "text": "I don't like Porsches."}, {"time": 6067, "text": "The Porsche 911, like everyone says it's the most beautiful."}, {"time": 6070, "text": "It's like, it's like a baby car."}, {"time": 6075, "text": "But everyone, it's beauty is in the eye of the beholder."}, {"time": 6075, "text": "You're already looking at me like, what is this kid talking about?"}, {"time": 6078, "text": "I'm happy to talk about."}, {"time": 6078, "text": "You're digging your own hole."}, {"time": 6084, "text": "The form and function and my take on the beauty of the hardware that we put on our vehicles, you know, I will not comment on your Porsche monologue."}, {"time": 6094, "text": "So, but aesthetics, fine."}, {"time": 6094, "text": "But there's an underlying, like, philosophical question behind the kind of lighter question is like, how much of the problem can be solved with computer vision, with machine learning?"}, {"time": 6111, "text": "So I think without sort of disagreements and so on, it's nice to put it on the spectrum because Waymo is doing a lot of machine learning as well."}, {"time": 6123, "text": "It's interesting to think how much of driving, if we look at five years, 10 years, 50 years down the road, what can be learned in almost more and more and more end to end way."}, {"time": 6135, "text": "If we look at what Tesla is doing with, as a machine learning problem, they're doing a multitask learning thing where it's just, they break up driving into a bunch of learning tasks and they have one single neural network and they're just collecting huge amounts of data that's training that."}, {"time": 6150, "text": "I've recently hung out with George Hotz."}, {"time": 6153, "text": "I don't know if you know George."}, {"time": 6157, "text": "I love him so much."}, {"time": 6157, "text": "He's just an entertaining human being."}, {"time": 6161, "text": "We were off mic talking about Hunter S. Thompson."}, {"time": 6161, "text": "He's the Hunter S. Thompson of autonomous driving."}, {"time": 6165, "text": "So he, I didn't realize this with comma AI, but they're like really trying to end to end."}, {"time": 6173, "text": "They're the machine, like looking at the machine learning problem, they're really not doing multitask learning, but it's computing the drivable area as a machine learning task and hoping that like down the line, this level two system, this driver assistance will eventually lead to allowing you to have a fully autonomous vehicle."}, {"time": 6195, "text": "There's an underlying deep philosophical question there, technical question of how much of driving can be learned."}, {"time": 6202, "text": "So LiDAR is an effective tool today for actually deploying a successful service in Phoenix, right?"}, {"time": 6209, "text": "That's safe, that's reliable, et cetera, et cetera."}, {"time": 6213, "text": "But the question, and I'm not saying you can't do machine learning on LiDAR, but the question is that like how much of driving can be learned eventually."}, {"time": 6227, "text": "Can we do fully autonomous?"}, {"time": 6227, "text": "That's learned."}, {"time": 6229, "text": "You know, learning is all over the place and plays a key role in every part of our system."}, {"time": 6236, "text": "As you said, I would, you know, decouple the sensing modalities from the, you know, ML and the software parts of it."}, {"time": 6245, "text": "LiDAR, radar, cameras, like it's all machine learning."}, {"time": 6249, "text": "All of the object detection classification, of course, like that's what, you know, these modern deep nets and count nets are very good at."}, {"time": 6255, "text": "You feed them raw data, massive amounts of raw data, and that's actually what our custom build LiDARs and radars are really good at."}, {"time": 6263, "text": "And radars, they don't just give you point estimates of, you know, objects in space, they give you raw, like, physical observations."}, {"time": 6268, "text": "And then you take all of that raw information, you know, there's colors of the pixels, whether it's, you know, LiDARs returns and some auxiliary information."}, {"time": 6274, "text": "It's not just distance, right?"}, {"time": 6276, "text": "And, you know, angle and distance is much richer information that you get from those returns, plus really rich information from the radars."}, {"time": 6282, "text": "You fuse it all together and you feed it into those massive ML models that then, you know, lead to the best results in terms of, you know, object detection, classification, state estimation."}, {"time": 6295, "text": "So there's a side to interop, but there is a fusion."}, {"time": 6295, "text": "I mean, that's something that people didn't do for a very long time, which is like at the sensor fusion level, I guess, like early on fusing the information together, whether so that the the sensory information that the vehicle receives from the different modalities or even from different cameras is combined before it is fed into the machine learning models."}, {"time": 6319, "text": "Yeah, so I think this is one of the trends you're seeing more of that you mentioned end to end."}, {"time": 6321, "text": "There's different interpretation of end to end."}, {"time": 6321, "text": "There is kind of the purest interpretation of I'm going to like have one model that goes from raw sensor data to like, you know, steering torque and, you know, gas breaks."}, {"time": 6332, "text": "That, you know, that's too much."}, {"time": 6335, "text": "I don't think that's the right way to do it."}, {"time": 6337, "text": "There's more, you know, smaller versions of end to end where you're kind of doing more end to end learning or core training or depropagation of kind of signals back and forth across the different stages of your system."}, {"time": 6348, "text": "There's, you know, really good ways it gets into some fairly complex design choices where on one hand you want modularity and decomposability, decomposability of your system."}, {"time": 6357, "text": "But on the other hand, you don't want to create interfaces that are too narrow or too brittle to engineered where you're giving up on the generality of the solution or you're unable to properly propagate signal, you know, reach signal forward and losses and, you know, back so you can optimize the whole system jointly."}, {"time": 6399, "text": "Like the field over the last, you know, decade has been evolving in more kind of joint fusion, more end to end models that are, you know, solving some of these tasks, you know, jointly and there's tremendous power in that and, you know, that's the progression that kind of our technology, our stack has been on as well."}, {"time": 6414, "text": "Now to your, you know, that so I would decouple the kind of sensing and how that information is fused from the role of ML and the entire stack."}, {"time": 6421, "text": "And, you know, I guess it's, there's trade offs and, you know, modularity and how do you inject inductive bias into your system?"}, {"time": 6431, "text": "All right, this is, there's tremendous power in being able to do that."}, {"time": 6435, "text": "So, you know, we have, there's no part of our system that is not heavily, that does not heavily, you know, leverage data driven development or state of the art ML."}, {"time": 6449, "text": "But there's mapping, there's a simulator, there's perception, you know, object level, you know, perception, whether it's semantic understanding, prediction, decision making, you know, so forth and so on."}, {"time": 6462, "text": "It's, you know, of course, object detection and classification, like you're finding pedestrians and cars and cyclists and, you know, cones and signs and vegetation and being very good at estimating kind of detection, classification, and state estimation."}, {"time": 6471, "text": "There's just stable stakes, like that's step zero of this whole stack."}, {"time": 6474, "text": "You can be incredibly good at that, whether you use cameras or light as a radar, but that's just, you know, that's stable stakes, that's just step zero."}, {"time": 6483, "text": "Beyond that, you get into the really interesting challenges of semantic understanding at the perception level, you get into scene level reasoning, you get into very deep problems that have to do with prediction and joint prediction and interaction, so the interaction between all the actors in the environment, pedestrians, cyclists, other cars, and you get into decision making, right?"}, {"time": 6499, "text": "So, how do you build a lot of systems?"}, {"time": 6502, "text": "So, we leverage ML very heavily in all of these components."}, {"time": 6506, "text": "I do believe that the best results you achieve by kind of using a hybrid approach and having different types of ML, having different models with different degrees of inductive bias that you can have, and combining kind of model, you know, free approaches with some model based approaches and some rule based, physics based systems."}, {"time": 6529, "text": "So, you know, one example I can give you is traffic lights."}, {"time": 6534, "text": "There's a problem of the detection of traffic light state, and obviously that's a great problem for, you know, computer vision confidence, or, you know, that's their bread and butter, right?"}, {"time": 6545, "text": "That's how you build that."}, {"time": 6545, "text": "But then the interpretation of, you know, of a traffic light, that you're gonna need to learn that, right?"}, {"time": 6551, "text": "You don't need to build some, you know, complex ML model that, you know, infers with some, you know, precision and recall that red means stop."}, {"time": 6562, "text": "Like, it's a very clear engineered signal with very clear semantics, right?"}, {"time": 6565, "text": "So you want to induce that bias, like how you induce that bias, and that whether, you know, it's a constraint or a cost, you know, function in your stack, but like it is important to be able to inject that, like, clear semantic signal into your stack."}, {"time": 6580, "text": "And, you know, that's what we do."}, {"time": 6584, "text": "And, but then the question of, like, and that's when you apply it to yourself, when you are making decisions whether you want to stop for a red light, you know, or not."}, {"time": 6594, "text": "But if you think about how other people treat traffic lights, we're back to the ML version of that."}, {"time": 6597, "text": "You know they're supposed to stop for a red light, but that doesn't mean they will."}, {"time": 6602, "text": "So then you're back in the, like, very heavy ML domain where you're picking up on, like, very subtle cues about, you know, they have to do with the behavior of objects, pedestrians, cyclists, cars, and the whole, you know, entire configuration of the scene that allow you to make accurate predictions on whether they will, in fact, stop or run a red light."}, {"time": 6622, "text": "So it sounds like already for Waymo, like, machine learning is a huge part of the stack."}, {"time": 6629, "text": "So it's a huge part of, like, not just, so obviously the first, the level zero, or whatever you said, which is, like, just the object detection of things that, you know, with no other machine learning can do, but also starting to do prediction behavior and so on to model the, what other, what the other parties in the scene, entities in the scene are going to do."}, {"time": 6651, "text": "So machine learning is more and more playing a role in that as well."}, {"time": 6655, "text": "I think we've been going back to the, you know, earliest days, like, you know, DARPA, the DARPA Grand Challenge, our team was leveraging, you know, machine learning."}, {"time": 6665, "text": "It was, like, pre, you know, ImageNet, and it was a very different type of ML, but, and I think actually it was before my time, but the Stanford team during the Grand Challenge had a very interesting machine learned system that would, you know, use LiDAR and camera."}, {"time": 6678, "text": "We've been driving in the desert, and it, we had built the model where it would kind of extend the range of free space reasoning."}, {"time": 6686, "text": "We get a clear signal from LiDAR, and then it had a model that said, hey, like, this stuff on camera kind of sort of looks like this stuff in LiDAR, and I know this stuff that I'm seeing in LiDAR, I'm very confident it's free space, so let me extend that free space zone into the camera range that would allow the vehicle to drive faster."}, {"time": 6703, "text": "And then we've been building on top of that and kind of staying and pushing the state of the art in ML, in all kinds of different ML over the years."}, {"time": 6708, "text": "And in fact, from the early days, I think, you know, 2010 is probably the year where Google, maybe 2011 probably, got pretty heavily involved in machine learning, kind of deep nuts, and at that time it was probably the only company that was very heavily investing in kind of state of the art ML and self driving cars."}, {"time": 6731, "text": "And they go hand in hand."}, {"time": 6736, "text": "And we've been on that journey ever since."}, {"time": 6736, "text": "We're doing, pushing a lot of these areas in terms of research at Waymo, and we collaborate very heavily with the researchers in Alphabet, and all kinds of ML, supervised ML, unsupervised ML, published some interesting research papers in the space, especially recently."}, {"time": 6757, "text": "It's just a super active learning as well."}, {"time": 6761, "text": "Yeah, so super, super active."}, {"time": 6761, "text": "Of course, there's, you know, kind of the more mature stuff, like, you know, ConvNets for, you know, object detection."}, {"time": 6768, "text": "But there's some really interesting, really active work that's happening in kind of more, you know, in bigger models and, you know, models that have more structure to them, you know, not just, you know, large bitmaps and reason about temporal sequences."}, {"time": 6786, "text": "And some of the interesting breakthroughs that you've, you know, we've seen in language models, right?"}, {"time": 6790, "text": "You know, transformers, you know, GPT3 inference."}, {"time": 6794, "text": "There's some really interesting applications of some of the core breakthroughs to those problems of, you know, behavior prediction, as well as, you know, decision making and planning, right?"}, {"time": 6804, "text": "You can think about it, kind of the the behavior, how, you know, the path, the trajectories, the how people drive."}, {"time": 6811, "text": "They have kind of a share, a lot of the fundamental structure, you know, this problem."}, {"time": 6814, "text": "There's, you know, sequential, you know, nature."}, {"time": 6818, "text": "There's a lot of structure in this representation."}, {"time": 6821, "text": "There is a strong locality, kind of like in sentences, you know, words that follow each other."}, {"time": 6825, "text": "They're strongly connected, but there's also kind of larger context that doesn't have that locality, and you also see that in driving, right?"}, {"time": 6831, "text": "What, you know, is happening in the scene as a whole has very strong implications on, you know, the kind of the next step in that sequence where whether you're, you know, predicting what other people are going to do, whether you're making your own decisions, or whether in the simulator you're building generative models of, you know, humans walking, cyclists riding, and other cars driving."}, {"time": 6850, "text": "That's all really fascinating, like how it's fascinating to think that transformer models and all this, all the breakthroughs in language and NLP that might be applicable to like driving at the higher level, at the behavioral level, that's kind of fascinating."}, {"time": 6864, "text": "Let me ask about pesky little creatures called pedestrians and cyclists."}, {"time": 6867, "text": "They seem, so humans are a problem."}, {"time": 6867, "text": "If we can get rid of them, I would."}, {"time": 6872, "text": "But unfortunately, they're all sort of a source of joy and love and beauty, so let's keep them around."}, {"time": 6879, "text": "They're also our customers."}, {"time": 6879, "text": "For your perspective, yes, yes, for sure."}, {"time": 6883, "text": "They're a source of money, very good."}, {"time": 6886, "text": "But I don't even know where I was going."}, {"time": 6886, "text": "Oh yes, pedestrians and cyclists, you know, they're a fascinating injection into the system of uncertainty of like a game theoretic dance of what to do."}, {"time": 6900, "text": "And also they have perceptions of their own, and they can tweet about your product, so you don't want to run them over from that perspective."}, {"time": 6917, "text": "I mean, I don't know, I'm joking a lot, but I think in seriousness, like, you know, pedestrians are a complicated computer vision problem, a complicated behavioral problem."}, {"time": 6927, "text": "Is there something interesting you could say about what you've learned from a machine learning perspective, from also an autonomous vehicle, and a product perspective about just interacting with the humans in this world?"}, {"time": 6942, "text": "Yeah, just to state on record, we care deeply about the safety of pedestrians, you know, even the ones that don't have Twitter accounts."}, {"time": 6952, "text": "But yes, I'm glad, I'm glad somebody does."}, {"time": 6957, "text": "But you know, in all seriousness, safety of vulnerable road users, pedestrians or cyclists, is one of our highest priorities."}, {"time": 6967, "text": "We do a tremendous amount of testing and validation, and put a very significant emphasis on, you know, the capabilities of our systems that have to do with safety around those unprotected vulnerable road users."}, {"time": 6983, "text": "You know, cars, just, you know, discussed earlier in Phoenix, we have completely empty cars, completely driverless cars, you know, driving in this very large area, and you know, some people use them to, you know, go to school, so they'll drive through school zones, right?"}, {"time": 6995, "text": "So, kids are kind of the very special class of those vulnerable user road users, right?"}, {"time": 6999, "text": "You want to be, you know, super, super safe, and super, super cautious around those."}, {"time": 7002, "text": "So, we take it very, very, very seriously."}, {"time": 7005, "text": "And you know, what does it take to be good at it?"}, {"time": 7010, "text": "You know, an incredible amount of performance across your whole stack."}, {"time": 7015, "text": "You know, starts with hardware, and again, you want to use all sensing modalities available to you."}, {"time": 7025, "text": "Imagine driving on a residential road at night, and kind of making a turn, and you don't have, you know, headlights covering some part of the space, and like, you know, a kid might run out."}, {"time": 7036, "text": "And you know, lighters are amazing at that."}, {"time": 7036, "text": "They see just as well in complete darkness as they do during the day, right?"}, {"time": 7040, "text": "So, just again, it gives you that extra, you know, margin in terms of, you know, capability, and performance, and safety, and quality."}, {"time": 7052, "text": "And in fact, we oftentimes, in these kinds of situations, we have our system detect something, in some cases even earlier than our trained operators in the car might do, right?"}, {"time": 7062, "text": "Especially, you know, in conditions like, you know, very dark nights."}, {"time": 7066, "text": "So, starts with sensing, then, you know, perception has to be incredibly good."}, {"time": 7070, "text": "And you have to be very, very good at kind of detecting pedestrians in all kinds of situations, and all kinds of environments, including, you know, people in weird poses, people kind of running around, and you know, being partially occluded."}, {"time": 7089, "text": "So, you know, that's step number one, right?"}, {"time": 7093, "text": "Then, you have to have in very high accuracy, and very low latency, in terms of your reactions to, you know, what, you know, these actors might do, right?"}, {"time": 7101, "text": "And we've put a tremendous amount of engineering, and tremendous amount of validation, in to make sure our system performs properly."}, {"time": 7110, "text": "And, you know, oftentimes, it does require a very strong reaction to do the safe thing."}, {"time": 7115, "text": "And, you know, we actually see a lot of cases like that."}, {"time": 7118, "text": "That's the long tail of really rare, you know, really, you know, crazy events that contribute to the safety around pedestrians."}, {"time": 7128, "text": "Like, one example that comes to mind, that we actually happened in Phoenix, where we were driving along, and I think it was a 45 mile per hour road, so you have pretty high speed traffic, and there was a sidewalk next to it, and there was a cyclist on the sidewalk."}, {"time": 7143, "text": "And as we were in the right lane, right next to the side, so it was a multi lane road, so as we got close to the cyclist on the sidewalk, it was a woman, you know, she tripped and fell."}, {"time": 7157, "text": "Just, you know, fell right into the path of our vehicle, right?"}, {"time": 7160, "text": "And our, you know, car, you know, this was actually with a test driver, our test drivers, did exactly the right thing."}, {"time": 7169, "text": "They kind of reacted, and came to stop."}, {"time": 7169, "text": "It requires both very strong steering, and, you know, strong application of the brake."}, {"time": 7173, "text": "And then we simulated what our system would have done in that situation, and it did, you know, exactly the same thing."}, {"time": 7179, "text": "And that speaks to, you know, all of those components of really good state estimation and tracking."}, {"time": 7186, "text": "And, like, imagine, you know, a person on a bike, and they're falling over, and they're doing that right in front of you, right?"}, {"time": 7192, "text": "So you have to be really, like, things are changing."}, {"time": 7192, "text": "The appearance of that whole thing is changing, right?"}, {"time": 7194, "text": "And a person goes one way, they're falling on the road, they're, you know, being flat on the ground in front of you."}, {"time": 7200, "text": "You know, the bike goes flying the other direction."}, {"time": 7203, "text": "Like, the two objects that used to be one, they're now, you know, are splitting apart, and the car has to, like, detect all of that."}, {"time": 7209, "text": "Like, milliseconds matter, and it doesn't, you know, it's not good enough to just brake."}, {"time": 7212, "text": "You have to, like, steer and brake, and there's traffic around you."}, {"time": 7215, "text": "So, like, it all has to come together, and it was really great to see in this case, and other cases like that, that we're actually seeing in the wild, that our system is, you know, performing exactly the way that we would have liked, and is able to, you know, avoid collisions like this."}, {"time": 7230, "text": "That's such an exciting space for robotics."}, {"time": 7232, "text": "Like, in that split second to make decisions of life and death."}, {"time": 7237, "text": "The stakes are high, in a sense, but it's also beautiful that for somebody who loves artificial intelligence, the possibility that an AI system might be able to save a human life."}, {"time": 7249, "text": "That's kind of exciting as a problem, like, to wake up."}, {"time": 7253, "text": "It's terrifying, probably, for an engineer to wake up, and to think about, but it's also exciting because it's, like, it's in your hands."}, {"time": 7261, "text": "Let me try to ask a question that's often brought up about autonomous vehicles, and it might be fun to see if you have anything interesting to say, which is about the trolley problem."}, {"time": 7274, "text": "So, a trolley problem is an interesting philosophical construct that highlights, and there's many others like it, of the difficult ethical decisions that we humans have before us in this complicated world."}, {"time": 7289, "text": "So, specifically is the choice between if you are forced to choose to kill a group X of people versus a group Y of people, like one person."}, {"time": 7302, "text": "If you did nothing, you would kill one person, but if you would kill five people, and if you decide to swerve out of the way, you would only kill one person."}, {"time": 7311, "text": "Do you do nothing, or you choose to do something?"}, {"time": 7315, "text": "You can construct all kinds of, sort of, ethical experiments of this kind that, I think, at least on a positive note, inspire you to think about, like, introspect what are the physics of our morality, and there's usually not good answers there."}, {"time": 7336, "text": "I think people love it because it's just an exciting thing to think about."}, {"time": 7340, "text": "I think people who build autonomous vehicles usually roll their eyes, because this is not, this one as constructed, this, like, literally never comes up in reality."}, {"time": 7354, "text": "You never have to choose between killing one or, like, one of two groups of people, but I wonder if you can speak to, is there some something interesting to you as an engineer of autonomous vehicles that's within the trolley problem, or maybe more generally, are there difficult ethical decisions that you find that an algorithm must make?"}, {"time": 7378, "text": "On the specific version of the trolley problem, which one would you do, if you're driving?"}, {"time": 7383, "text": "The question itself is a profound question, because we humans ourselves cannot answer, and that's the very point."}, {"time": 7391, "text": "I would kill both."}, {"time": 7398, "text": "Yeah, humans, I think you're exactly right in that, you know, humans are not particularly good."}, {"time": 7401, "text": "I think they're kind of phrased as, like, what would a computer do, but, like, humans, you know, are not very good, and actually oftentimes I think that, you know, freezing and kind of not doing anything, because, like, you've taken a few extra milliseconds to just process, and then you end up, like, doing the worst of the possible outcomes, right?"}, {"time": 7415, "text": "So, I do think that, as you've pointed out, it can be a bit of a distraction, and it can be a bit of a kind of red herring."}, {"time": 7422, "text": "I think it's an interesting, you know, discussion in the realm of philosophy, right?"}, {"time": 7427, "text": "But in terms of what, you know, how that affects the actual engineering and deployment of self driving vehicles, it's not how you go about building a system, right?"}, {"time": 7437, "text": "We've talked about how you engineer a system, how you, you know, go about evaluating the different components and, you know, the safety of the entire thing."}, {"time": 7449, "text": "How do you kind of inject the, you know, various model based, safety based arguments, and, like, yes, you reason at parts of the system, you know, you reason about the probability of a collision, the severity of that collision, right?"}, {"time": 7464, "text": "And that is incorporated, and there's, you know, you have to properly reason about the uncertainty that flows through the system, right?"}, {"time": 7467, "text": "So, you know, those, you know, factors definitely play a role in how the cars then behave, but they tend to be more of, like, the emergent behavior."}, {"time": 7476, "text": "And what you see, like, you're absolutely right that these, you know, clear theoretical problems that they, you know, you don't encounter that in the system, and really kind of being back to our previous discussion of, like, what, you know, what, you know, which one do you choose?"}, {"time": 7489, "text": "Well, you know, oftentimes, like, you made a mistake earlier."}, {"time": 7493, "text": "Like, you shouldn't be in that situation in the first place, right?"}, {"time": 7497, "text": "And in reality, the system comes up."}, {"time": 7500, "text": "If you build a very good, safe, and capable driver, you have enough, you know, clues in the environment that you drive defensively, so you don't put yourself in that situation, right?"}, {"time": 7508, "text": "And again, you know, it has, you know, this, if you go back to that analogy of, you know, precision and recoil, like, okay, you can make a, you know, very hard trade off, but like, neither answer is really good."}, {"time": 7519, "text": "But what instead you focus on is kind of moving the whole curve up, and then you focus on building the right capability on the right defensive driving, so that, you know, you don't put yourself in the situation like this."}, {"time": 7528, "text": "I don't know if you have a good answer for this, but people love it when I ask this question about books."}, {"time": 7535, "text": "Are there books in your life that you've enjoyed, philosophical, fiction, technical, that had a big impact on you as an engineer or as a human being?"}, {"time": 7547, "text": "You know, everything from science fiction to a favorite textbook."}, {"time": 7550, "text": "Is there three books that stand out that you can think of?"}, {"time": 7553, "text": "So I would, you know, that impacted me, I would say, and this one is, you probably know it well, but not generally well known, I think, in the U.S., or kind of internationally, The Master and Margarita."}, {"time": 7571, "text": "It's one of, actually, my favorite books."}, {"time": 7576, "text": "It is, you know, by Russian, it's a novel by Russian author Mikhail Bulgakov, and it's just, it's a great book."}, {"time": 7586, "text": "It's one of those books that you can, like, reread your entire life, and it's very accessible."}, {"time": 7588, "text": "You can read it as a kid, and, like, it's, you know, the plot is interesting."}, {"time": 7617, "text": "Like, it makes you think one of those books that, you know, is good and makes you think, but also has, like, this really, you know, silly, quirky, dark sense of, you know, humor."}, {"time": 7627, "text": "It captures the Russian soul more than many, perhaps, many other books."}, {"time": 7630, "text": "On that, like, slight note, just out of curiosity, one of the saddest things is I've read that book in English."}, {"time": 7637, "text": "Did you, by chance, read it in English or in Russian?"}, {"time": 7642, "text": "In Russian, only in Russian, and I actually, that is a question I had, kind of posed to myself every once in a while, like, I wonder how well it translates, if it translates at all, and there's the language aspect of it, and then there's the cultural aspect, so I, actually, I'm not sure if, you know, either of those would work well in English."}, {"time": 7659, "text": "Now, I forget their names, but, so, when the COVID lifts a little bit, I'm traveling to Paris for several reasons."}, {"time": 7663, "text": "One is just, I've never been to Paris, I want to go to Paris, but there's the most famous translators of Dostoevsky, Tolstoy, of most of Russian literature live there."}, {"time": 7723, "text": "So, from what I understand, Dostoevsky translates easier, others don't as much."}, {"time": 7770, "text": "There's a few Russian people that I think are truly special human beings, and I feel, like, I sometimes encounter this with some incredible scientists, and maybe you encounter this as well at some point in your life, that it feels like because of the language barrier, their ideas are lost to history."}, {"time": 7840, "text": "I mean, I know it's a silly concept, but it's a fundamental one, because how do you translate, and that's the thing that Google Translate is also facing as a more machine learning problem, but I wonder as a more bigger problem for AI, how do we capture the magic that's there in the language?"}, {"time": 7863, "text": "I think that's a really interesting, really challenging problem."}, {"time": 7868, "text": "If you do read it, Master and Margarita in English, sorry, in Russian, I'd be curious to get your opinion, and I think part of it is language, but part of it's just, you know, centuries of culture, that, you know, the cultures are different, so it's hard to connect that."}, {"time": 7888, "text": "Okay, so that was my first one, right?"}, {"time": 7888, "text": "You had two more."}, {"time": 7888, "text": "The second one I would probably pick is the science fiction by the Strogatsky brothers."}, {"time": 7895, "text": "You know, it's up there with, you know, Isaac Asimov and, you know, Ray Bradbury and, you know, company."}, {"time": 7898, "text": "The Strogatsky brothers kind of appealed more to me."}, {"time": 7903, "text": "I think it made more of an impression on me growing up."}, {"time": 7907, "text": "I apologize if I'm showing my complete ignorance."}, {"time": 7913, "text": "I'm so weak on sci fi."}, {"time": 7913, "text": "What did they write?"}, {"time": 7917, "text": "Oh, Roadside Picnic, Heart to Be a God, Beetle in an Ant Hill, Monday Starts on Saturday."}, {"time": 7927, "text": "Like, it's not just science fiction."}, {"time": 7934, "text": "It also has very interesting, you know, interpersonal and societal questions, and some of the language is just completely hilarious."}, {"time": 7947, "text": "That's the one."}, {"time": 7947, "text": "Monday Starts on Saturday."}, {"time": 7947, "text": "So, I need to read."}, {"time": 7951, "text": "Okay, oh boy."}, {"time": 7951, "text": "You put that in the category of science fiction?"}, {"time": 7956, "text": "That one is, I mean, this was more of a silly, you know, humorous work."}, {"time": 7959, "text": "I mean, there is kind of..."}, {"time": 7963, "text": "It's profound too, right?"}, {"time": 7963, "text": "Science fiction, right?"}, {"time": 7963, "text": "It's about, you know, this research institute, and it has deep parallels to serious research, but the setting, of course, is that they're working on, you know, magic, right?"}, {"time": 7973, "text": "And there's a lot of stuff."}, {"time": 7976, "text": "And that's their style, right?"}, {"time": 7980, "text": "And, you know, other books are very different, right?"}, {"time": 7980, "text": "You know, Heart to Be a God, right?"}, {"time": 7983, "text": "It's about kind of this higher society being injected into this primitive world, and how they operate there, and some of the very deep ethical questions there, right?"}, {"time": 7993, "text": "And, like, they've got this full spectrum."}, {"time": 7993, "text": "Some is, you know, more about kind of more adventure style."}, {"time": 7996, "text": "But, like, I enjoy all of their books."}, {"time": 7999, "text": "There's just, you know, probably a couple."}, {"time": 8001, "text": "Actually, one I think that they consider their most important work."}, {"time": 8004, "text": "I think it's The Snail on a Hill."}, {"time": 8004, "text": "I'm not exactly sure how it translates."}, {"time": 8009, "text": "I tried reading a couple times."}, {"time": 8009, "text": "I still don't get it."}, {"time": 8012, "text": "But everything else I fully enjoyed."}, {"time": 8012, "text": "And, like, for one of my birthdays as a kid, I got, like, their entire collection, like, occupied a giant shelf in my room, and then, like, over the holidays, I just, like, you know, my parents couldn't drag me out of the room, and I read the whole thing cover to cover."}, {"time": 8024, "text": "And I really enjoyed it."}, {"time": 8029, "text": "And that's one more."}, {"time": 8029, "text": "For the third one, you know, maybe a little bit darker, but, you know, comes to mind is Orwell's 1984."}, {"time": 8036, "text": "And, you know, you asked what made an impression on me and the books that people should read."}, {"time": 8041, "text": "That one, I think, falls in the category of both."}, {"time": 8043, "text": "You know, definitely it's one of those books that you read, and you just kind of, you know, put it down and you stare in space for a while."}, {"time": 8051, "text": "You know, that kind of work."}, {"time": 8051, "text": "I think there's, you know, lessons there."}, {"time": 8056, "text": "People should not ignore."}, {"time": 8059, "text": "And, you know, nowadays, with, like, everything that's happening in the world, I, like, can't help it, but, you know, have my mind jump to some, you know, parallels with what Orwell described."}, {"time": 8069, "text": "And, like, there's this whole, you know, concept of double think and ignoring logic and, you know, holding completely contradictory opinions in your mind and not have that not bother you and, you know, sticking to the party line at all costs."}, {"time": 8084, "text": "Like, you know, there's something there."}, {"time": 8088, "text": "If anything, 2020 has taught me, and I'm a huge fan of Animal Farm, which is a kind of friendly, as a friend of 1984 by Orwell."}, {"time": 8097, "text": "It's kind of another thought experiment of how our society may go in directions that we wouldn't like it to go."}, {"time": 8107, "text": "But if anything that's been kind of heartbreaking to an optimist about 2020 is that that society is kind of fragile."}, {"time": 8118, "text": "Like, we have this, this is a special little experiment we have going on."}, {"time": 8125, "text": "And not, it's not unbreakable."}, {"time": 8125, "text": "Like, we should be careful to, like, preserve whatever the special thing we have going on."}, {"time": 8132, "text": "I mean, I think 1984 and these books, The Brave New World, they're helpful in thinking, like, stuff can go wrong in nonobvious ways."}, {"time": 8143, "text": "And it's, like, it's up to us to preserve it."}, {"time": 8148, "text": "And it's, like, it's a responsibility."}, {"time": 8148, "text": "It's been weighing heavy on me because, like, for some reason, like, more than my mom follows me on Twitter and I feel like I have, like, now somehow a responsibility to do this world."}, {"time": 8163, "text": "And it dawned on me that, like, me and millions of others are, like, the little ants that maintain this little colony, right?"}, {"time": 8172, "text": "So we have a responsibility not to be, I don't know what the right analogy is, but I'll put a flamethrower to the place."}, {"time": 8180, "text": "We want to not do that."}, {"time": 8183, "text": "And there's interesting complicated ways of doing that as 1984 shows."}, {"time": 8187, "text": "It could be through bureaucracy."}, {"time": 8187, "text": "It could be through incompetence."}, {"time": 8189, "text": "It could be through misinformation."}, {"time": 8193, "text": "It could be through division and toxicity."}, {"time": 8196, "text": "I'm a huge believer in, like, that love will be the, somehow, the solution."}, {"time": 8199, "text": "So, love and robots."}, {"time": 8199, "text": "Love and robots, yeah."}, {"time": 8206, "text": "Unfortunately, I think it's less of a flamethrower type of thing."}]}]