[{"title": "Kevin Scott: Microsoft CTO | Lex Fridman Podcast #30", "id": "QDN6xvhAw94", "quotes": [{"time": 482, "text": "Maybe you can speak to, this connects to AI, so we have a candidate, Andrew Yang, who kind of talks about artificial intelligence and the concern that people have about, you know, automation's impact on society and arguably, Microsoft is at the cutting edge of innovation in all these kinds of ways and so it's pushing AI forward."}, {"time": 507, "text": "How do you think about combining all our conversations together here with radical markets and socialism and innovation in AI that Microsoft is doing and then Andrew Yang's worry that that will result in job loss for the lower and so on."}, {"time": 527, "text": "I think it's sort of one of the most important questions in technology like maybe even in society right now about how is AI going to develop over the course of the next several decades and what's it going to be used for and what benefits will it produce and what negative impacts will it produce and who gets to steer this whole thing."}, {"time": 591, "text": "As a platform."}, {"time": 592, "text": "Yeah, it has to be a platform that other people can use to build businesses, to fulfill their creative objectives, to be entrepreneurs, to solve problems that they have in their work and in their lives."}, {"time": 607, "text": "It can't be a thing where there are a handful of companies sitting in a very small handful of cities geographically who are making all the decisions about what goes into the AI and then on top of all this infrastructure, then build all of the commercially valuable uses for it."}, {"time": 630, "text": "So I think that's bad from a sort of economics and sort of equitable distribution of value perspective, sort of back to this whole notion of did the markets work?"}, {"time": 644, "text": "But I think it's also bad from an innovation perspective because I have infinite amounts of faith in human beings that if you give folks powerful tools, they will go do interesting things and it's more than just a few tens of thousands of people with the interesting tools, it should be millions of people with the tools."}, {"time": 698, "text": "But access to that technology democratized over time."}, {"time": 702, "text": "Like now, like an engine, it's not like a differentiated thing, like there isn't one engine company that builds all the engines and all of the things that use engines are made by this company and like they get all the economics from all of that."}, {"time": 717, "text": "Like fully demarcated, like they're probably, we're sitting here in this room and like even though they're probably things like the MEMS gyroscope that are in both of our phones, like there's like little engines sort of everywhere."}, {"time": 733, "text": "They're just a component in how we build the modern world."}, {"time": 736, "text": "Like AI needs to get there."}, {"time": 737, "text": "Yeah, so that's a really powerful way to think."}, {"time": 740, "text": "If we think of AI as a platform versus a tool that Microsoft owns, as a platform that enables creation on top of it, that's the way to democratize it."}, {"time": 751, "text": "That's really interesting actually."}, {"time": 754, "text": "And Microsoft throughout its history has been positioned well to do that."}, {"time": 758, "text": "And the tie back to this radical markets thing, like so my team has been working with Glenn on this, and Jaren Lanier actually."}, {"time": 770, "text": "So Jaren is the sort of father of virtual reality."}, {"time": 776, "text": "Like he's one of the most interesting human beings on the planet, like a sweet, sweet guy."}, {"time": 782, "text": "And so Jaren and Glenn and folks in my team have been working on this notion of data as labor or like they call it data dignity as well."}, {"time": 793, "text": "And so the idea is that if you, again going back to this sort of industrial analogy, if you think about data as the raw material that is consumed by the machine of AI in order to do useful things, then like we're not doing a really great job right now in having transparent marketplaces for valuing those data contributions."}, {"time": 819, "text": "So and we all make them explicitly like you go to LinkedIn, you sort of set up your profile on LinkedIn, like that's an explicit contribution."}, {"time": 827, "text": "Like you know exactly the information that you're putting into the system."}, {"time": 830, "text": "And like you put it there because you have some nominal notion of what value you're going to get in return."}, {"time": 836, "text": "But it's like only nominal, like you don't know exactly what value you're getting in return."}, {"time": 840, "text": "Like service is free, like it's low amount of perceived debt."}, {"time": 844, "text": "And then you've got all this indirect contribution that you're making just by virtue of interacting with all of the technology that's in your daily life."}, {"time": 853, "text": "And so like what Glenn and Jaren and this data dignity team are trying to do is like, can we figure out a set of mechanisms that let us value those data contributions so that you could create an economy and like a set of controls and incentives that would allow people to like maybe even in the limit, like earn part of their living through the data that they're creating."}, {"time": 881, "text": "And like you can sort of see it in explicit ways."}, {"time": 882, "text": "There are these companies like Scale AI, and like there are a whole bunch of them in China right now that are basically data labeling companies."}, {"time": 892, "text": "So like you're doing supervised machine learning, you need lots and lots of label training data."}, {"time": 897, "text": "And like those people who work for those companies are getting compensated for their data contributions into the system."}, {"time": 907, "text": "That's easier to put a number on their contribution because they're explicitly labeling data."}, {"time": 912, "text": "But you're saying that we're all contributing data in different kinds of ways."}, {"time": 915, "text": "And it's fascinating to start to explicitly try to put a number on it."}, {"time": 922, "text": "It really is."}, {"time": 924, "text": "Because we don't have as much transparency as I think we need in like how the data is getting used."}, {"time": 937, "text": "And it's super complicated."}, {"time": 938, "text": "Like we, I think as technologists sort of appreciate like some of the subtlety there."}, {"time": 944, "text": "It's like the data gets created and then it gets, it's not valuable."}, {"time": 950, "text": "Like the data exhaust that you give off, or the explicit data that I am putting into the system isn't super valuable atomically."}, {"time": 965, "text": "Like it's only valuable when you sort of aggregate it together into sort of large numbers."}, {"time": 970, "text": "This is true even for these like folks who are getting compensated for like labeling things."}, {"time": 974, "text": "Like for supervised machine learning now, like you need lots of labels to train a model that performs well."}, {"time": 981, "text": "And so I think that's one of the challenges."}, {"time": 984, "text": "It's like how do you sort of figure out like because this data is getting combined in so many ways like through these combinations like how the value is flowing."}, {"time": 995, "text": "Yeah, that's fascinating."}, {"time": 997, "text": "And it's fascinating that you're thinking about this."}, {"time": 1001, "text": "And I wasn't even going into this conversation expecting the breadth of research really that Microsoft broadly is thinking about, you're thinking about at Microsoft."}, {"time": 1012, "text": "So if we go back to 89 when Microsoft released Office, or 1990 when they released Windows 3.0."}, {"time": 1022, "text": "In your view, I know you weren't there through its history, but how has the company changed in the 30 years since as you look at it now?"}, {"time": 1032, "text": "The good thing is it's started off as a platform company."}, {"time": 1036, "text": "Like it's still a platform company, like the parts of the business that are thriving and most successful are those that are building platforms."}, {"time": 1046, "text": "Like the mission of the company now is, the mission's changed."}, {"time": 1050, "text": "It's like changed in a very interesting way."}, {"time": 1052, "text": "So back in 89, 90 like they were still on the original mission, which was like put a PC on every desk and in every home."}, {"time": 1063, "text": "And it was basically about democratizing access to this new personal computing technology, which when Bill started the company, integrated circuit microprocessors were a brand new thing."}, {"time": 1077, "text": "And people were building homebrew computers from kits, like the way people build ham radios right now."}, {"time": 1088, "text": "I think this is the interesting thing for folks who build platforms in general."}, {"time": 1092, "text": "Bill saw the opportunity there and what personal computers could do."}, {"time": 1098, "text": "And it was like, it was sort of a reach."}, {"time": 1100, "text": "Like you just sort of imagine like where things were when they started the company versus where things are now."}, {"time": 1106, "text": "Like in success, when you've democratized a platform, it just sort of vanishes into the platform."}, {"time": 1111, "text": "You don't pay attention to it anymore."}, {"time": 1112, "text": "Like operating systems aren't a thing anymore."}, {"time": 1115, "text": "Like they're super important, like completely critical."}, {"time": 1118, "text": "And like when you see one fail, like you just sort of understand."}, {"time": 1123, "text": "But like it's not a thing where you're not like waiting for the next operating system thing in the same way that you were in 1995, right?"}, {"time": 1132, "text": "Like in 1995, like we had Rolling Stones on the stage with the Windows 95 rollout."}, {"time": 1137, "text": "Like it was like the biggest thing in the world."}, {"time": 1139, "text": "Everybody lined up for it the way that people used to line up for iPhone."}, {"time": 1143, "text": "But like, you know, eventually, and like this isn't necessarily a bad thing."}, {"time": 1147, "text": "Like it just sort of, you know, the success is that it's sort of, it becomes ubiquitous."}, {"time": 1152, "text": "It's like everywhere, like human beings, when their technology becomes ubiquitous, they just sort of start taking it for granted."}, {"time": 1158, "text": "So the mission now that Satya rearticulated five plus years ago now, when he took over as CEO of the company."}, {"time": 1168, "text": "Our mission is to empower every individual and every organization in the world to be more successful."}, {"time": 1178, "text": "And so, you know, again, like that's a platform mission."}, {"time": 1183, "text": "And like the way that we do it now is, is different."}, {"time": 1186, "text": "It's like we have a hyperscale cloud that people are building their applications on top of."}, {"time": 1191, "text": "Like we have a bunch of AI infrastructure that people are building their AI applications on top of."}, {"time": 1196, "text": "We have, you know, we have a productivity suite of software, like Microsoft Dynamics, which, you know, some people might not think is the sexiest thing in the world, but it's like helping people figure out how to automate all of their business processes and workflows and to help those businesses using it to grow and be more."}, {"time": 1219, "text": "So it's a much broader vision in a way now than it was back then."}, {"time": 1225, "text": "Like it was sort of very particular thing."}, {"time": 1227, "text": "And like now, like we live in this world where technology is so powerful and it's like such a basic fact of life that it both exists and is going to get better and better over time or at least more and more powerful over time."}, {"time": 1245, "text": "So like, you know, what you have to do as a platform player is just much bigger."}, {"time": 1249, "text": "There's so many directions in which you can transform."}, {"time": 1252, "text": "You didn't mention mixed reality, too."}, {"time": 1255, "text": "You know, that's probably early days or it depends how you think of it."}, {"time": 1260, "text": "But if we think on a scale of centuries, it's the early days of mixed reality."}, {"time": 1264, "text": "Oh, for sure."}, {"time": 1264, "text": "And so with HoloLens, Microsoft is doing some really interesting work there."}, {"time": 1270, "text": "Do you touch that part of the effort?"}, {"time": 1273, "text": "What's the thinking?"}, {"time": 1274, "text": "Do you think of mixed reality as a platform, too?"}, {"time": 1278, "text": "When we look at what the platforms of the future could be, it's like fairly obvious that like AI is one."}, {"time": 1283, "text": "Like you don't have to, I mean, like that's, you know, you sort of say it to like someone and you know, like they get it."}, {"time": 1291, "text": "But like we also think of the like mixed reality and quantum as like these two interesting, you know, potentially."}, {"time": 1300, "text": "Quantum computing?"}, {"time": 1302, "text": "So let's get crazy then."}, {"time": 1304, "text": "So you're talking about some futuristic things here."}, {"time": 1308, "text": "Well, the mixed reality, Microsoft is really, it's not even futuristic, it's here."}, {"time": 1313, "text": "It's incredible stuff."}, {"time": 1314, "text": "And look, and it's having an impact right now."}, {"time": 1316, "text": "Like one of the more interesting things that's happened with mixed reality over the past couple of years that I didn't clearly see is that it's become the computing device for folks who, for doing their work, who haven't used any computing device at all to do their work before."}, {"time": 1336, "text": "So technicians and service folks and people who are doing like machine maintenance on factory floors."}, {"time": 1345, "text": "So like they, you know, because they're mobile and like they're out in the world and they're working with their hands and, you know, sort of servicing these like very complicated things, they're, they don't use their mobile phone and like they don't carry a laptop with them and, you know, they're not tethered to a desk."}, {"time": 1363, "text": "And so mixed reality, like where it's getting traction right now, where HoloLens is selling a lot of units is for these sorts of applications for these workers."}, {"time": 1374, "text": "And it's become like, I mean, like the people love it."}, {"time": 1378, "text": "They're like, oh my God, like this is like for them, like the same sort of productivity boosts that, you know, like an office worker had when they got their first personal computer."}, {"time": 1388, "text": "Yeah, but you did mention it's certainly obvious AI as a platform, but can we dig into it a little bit?"}, {"time": 1395, "text": "How does AI begin to infuse some of the products in Microsoft?"}, {"time": 1399, "text": "So currently providing training of, for example, neural networks in the cloud or providing pre trained models or just even providing computing resources and whatever different inference that you wanna do using neural networks."}, {"time": 1419, "text": "How do you think of AI infusing as a platform that Microsoft can provide?"}, {"time": 1425, "text": "Yeah, I mean, I think it's super interesting."}, {"time": 1428, "text": "It's like everywhere."}, {"time": 1429, "text": "And like we run these review meetings now where it's me and Satya and like members of Satya's leadership team and like a cross functional group of folks across the entire company who are working on like either AI infrastructure or like have some substantial part of their product work using AI in some significant way."}, {"time": 1462, "text": "Now, the important thing to understand is like when you think about like how the AI is gonna manifest in like an experience for something that's gonna make it better, like I think you don't want the AIness to be the first order thing."}, {"time": 1478, "text": "It's like whatever the product is and like the thing that is trying to help you do, like the AI just sort of makes it better."}, {"time": 1485, "text": "And this is a gross exaggeration, but like people get super excited about like where the AI is showing up in products and I'm like, do you get that excited about like where you're using a hash table like in your code?"}, {"time": 1499, "text": "Like it's just another."}, {"time": 1501, "text": "It's just a tool."}, {"time": 1501, "text": "It's a very interesting programming tool, but it's sort of like it's an engineering tool."}, {"time": 1507, "text": "And so like it shows up everywhere."}, {"time": 1509, "text": "So like we've got dozens and dozens of features now in Office that are powered by like fairly sophisticated machine learning, our search engine wouldn't work at all if you took the machine learning out of it."}, {"time": 1524, "text": "The like increasingly things like content moderation on our Xbox and xCloud platform."}, {"time": 1536, "text": "When you mean moderation, you mean like the recommender is like showing what you wanna look at next."}, {"time": 1541, "text": "No, no, no, it's like anti bullying stuff."}, {"time": 1543, "text": "So the usual social network stuff that you have to deal with."}, {"time": 1547, "text": "But it's like really it's targeted, it's targeted towards a gaming audience."}, {"time": 1552, "text": "So it's like a very particular type of thing where the line between playful banter and like legitimate bullying is like a subtle one."}, {"time": 1562, "text": "And like you have to like, it's sort of tough."}, {"time": 1565, "text": "Like I have."}, {"time": 1567, "text": "I'd love to if we could dig into it because you're also, you led the engineering efforts of LinkedIn."}, {"time": 1572, "text": "And if we look at LinkedIn as a social network, and if we look at the Xbox gaming as the social components, the very different kinds of I imagine communication going on on the two platforms, right?"}, {"time": 1586, "text": "And the line in terms of bullying and so on is different on the platforms."}, {"time": 1591, "text": "So how do you, I mean, it's such a fascinating philosophical discussion of where that line is."}, {"time": 1597, "text": "I don't think anyone knows the right answer."}, {"time": 1599, "text": "Twitter folks are under fire now, Jack at Twitter for trying to find that line."}, {"time": 1605, "text": "Nobody knows what that line is."}, {"time": 1606, "text": "But how do you try to find the line for trying to prevent abusive behavior and at the same time, let people be playful and joke around and that kind of thing?"}, {"time": 1622, "text": "I think in a certain way, like if you have what I would call vertical social networks, it gets to be a little bit easier."}, {"time": 1632, "text": "So like if you have a clear notion of like what your social network should be used for, or like what you are designing a community around, then you don't have as many dimensions to your sort of content safety problem as you do in a general purpose platform."}, {"time": 1653, "text": "I mean, so like on LinkedIn, like the whole social network is about connecting people with opportunity, whether it's helping them find a job or to sort of find mentors or to sort of help them like find their next sales lead or to just sort of allow them to broadcast their sort of professional identity to their network of peers and collaborators and sort of professional community."}, {"time": 1688, "text": "Like that is, I mean, like in some ways, like that's very, very broad, but in other ways it's sort of, it's narrow."}, {"time": 1695, "text": "And so like you can build AI's like machine learning systems that are capable with those boundaries of making better automated decisions about like what is sort of inappropriate and offensive comment or dangerous comment or illegal content when you have some constraints."}, {"time": 1717, "text": "You know, same thing with like the gaming social network."}, {"time": 1723, "text": "So for instance, like it's about playing games, not having fun."}, {"time": 1727, "text": "And like the thing that you don't want to have happen on the platform is why bullying is such an important thing."}, {"time": 1732, "text": "Like bullying is not fun."}, {"time": 1733, "text": "So you want to do everything in your power to encourage that not to happen."}, {"time": 1739, "text": "And yeah, but I think it's sort of a tough problem in general and it's one where I think, you know, eventually we're going to have to have some sort of clarification from our policymakers about what it is that we should be doing, like where the lines are, because it's tough."}, {"time": 1760, "text": "Like you don't, like in democracy, right?"}, {"time": 1763, "text": "Like you don't want, you want some sort of democratic involvement."}, {"time": 1768, "text": "Like people should have a say in like where the lines are drawn."}, {"time": 1774, "text": "Like you don't want a bunch of people making like unilateral decisions."}, {"time": 1779, "text": "And like we are in a state right now for some of these platforms where you actually do have to make unilateral decisions where the policymaking isn't going to happen fast enough in order to like prevent very bad things from happening."}, {"time": 1792, "text": "But like we need the policymaking side of that to catch up, I think, as quickly as possible because you want that whole process to be a democratic thing, not a, you know, not some sort of weird thing where you've got a non representative group of people making decisions that have, you know, like national and global impact."}, {"time": 1812, "text": "And it's fascinating because the digital space is different than the physical space in which nations and governments were established."}, {"time": 1819, "text": "And so what policy looks like globally, what bullying looks like globally, what's healthy communication looks like globally is an open question and we're all figuring it out together, which is fascinating."}, {"time": 1833, "text": "Yeah, I mean with, you know, sort of fake news, for instance."}, {"time": 1838, "text": "Deep fakes and fake news generated by humans?"}, {"time": 1842, "text": "Yeah, so we can talk about deep fakes, like I think that is another like, you know, sort of very interesting level of complexity."}, {"time": 1848, "text": "But like if you think about just the written word, right?"}, {"time": 1851, "text": "Like we have, you know, we invented papyrus, what, 3,000 years ago where we, you know, you could sort of put word on paper."}, {"time": 1861, "text": "And then 500 years ago, like we get the printing press, like where the word gets a little bit more ubiquitous."}, {"time": 1871, "text": "And then like you really, really didn't get ubiquitous printed word until the end of the 19th century when the offset press was invented."}, {"time": 1880, "text": "And then, you know, just sort of explodes and like, you know, the cross product of that and the Industrial Revolution's need for educated citizens resulted in like this rapid expansion of literacy and the rapid expansion of the word."}, {"time": 1896, "text": "But like we had 3,000 years up to that point to figure out like how to, you know, like what's journalism, what's editorial integrity, like what's, you know, what's scientific peer review."}, {"time": 1910, "text": "And so like you built all of this mechanism to like try to filter through all of the noise that the technology made possible to like, you know, sort of getting to something that society could cope with."}, {"time": 1923, "text": "And like, if you think about just the piece, the PC didn't exist 50 years ago."}, {"time": 1929, "text": "And so in like this span of, you know, like half a century, like we've gone from no digital, you know, no ubiquitous digital technology to like having a device that sits in your pocket where you can sort of say whatever is on your mind to like what did Mary have in her, Mary Meeker just released her new like slide deck last week."}, {"time": 1952, "text": "You know, we've got 50% penetration of the internet to the global population."}, {"time": 1958, "text": "Like there are like three and a half billion people who are connected now."}, {"time": 1961, "text": "So it's like, it's crazy, crazy, like inconceivable, like how fast all of this happened."}, {"time": 1966, "text": "So, you know, it's not surprising that we haven't figured out what to do yet, but like we gotta really like lean into this set of problems because like we basically have three millennia worth of work to do about how to deal with all of this and like probably what, you know, amounts to the next decade worth of time."}, {"time": 1987, "text": "So since we're on the topic of tough, you know, tough challenging problems, let's look at more on the tooling side in AI that Microsoft is looking at is face recognition software."}, {"time": 1998, "text": "So there's a lot of powerful positive use cases for face recognition, but there's some negative ones and we're seeing those in different governments in the world."}, {"time": 2008, "text": "So how do you, how does Microsoft think about the use of face recognition software as a platform in governments and companies?"}, {"time": 2019, "text": "How do we strike an ethical balance here?"}, {"time": 2022, "text": "Yeah, I think we've articulated a clear point of view."}, {"time": 2027, "text": "So Brad Smith wrote a blog post last fall, I believe that sort of like outlined like very specifically what, you know, what our point of view is there."}, {"time": 2039, "text": "And, you know, I think we believe that there are certain uses to which face recognition should not be put."}, {"time": 2044, "text": "And we believe again, that there's a need for regulation there."}, {"time": 2049, "text": "Like the government should like really come in and say that, you know, this is where the lines are."}, {"time": 2055, "text": "And like, we very much wanted to like figuring out where the lines are, should be a democratic process."}, {"time": 2060, "text": "But in the short term, like we've drawn some lines where, you know, we push back against uses of face recognition technology, you know, like the city of San Francisco, for instance, I think has completely outlawed any government agency from using face recognition tech."}, {"time": 2079, "text": "And like that may prove to be a little bit overly broad."}, {"time": 2084, "text": "But for like certain law enforcement things, like you really, I would personally rather be overly sort of cautious in terms of restricting use of it until like we have, you know, sort of defined a reasonable, you know, democratically determined regulatory framework for like where we could and should use it."}, {"time": 2108, "text": "And, you know, the other thing there is like, we've got a bunch of research that we're doing and a bunch of progress that we've made on bias there."}, {"time": 2118, "text": "And like, there are all sorts of like weird biases that these models can have, like all the way from like the most noteworthy one where, you know, you may have underrepresented minorities who are like underrepresented in the training data and then you start learning like strange things."}, {"time": 2139, "text": "But like there are even, you know, other weird things."}, {"time": 2142, "text": "Like we've, I think we've seen in the public research, like models can learn strange things, like all doctors are men, for instance, just, yeah."}, {"time": 2154, "text": "I mean, and so like, it really is a thing where it's very important for everybody who is working on these things before they push publish, they launch the experiment, they, you know, push the code to, you know, online, or they even publish the paper that they are at least starting to think about what some of the potential negative consequences are, some of this stuff."}, {"time": 2186, "text": "I mean, this is where, you know, like the deep fake stuff I find very worrisome just because there are going to be some very good beneficial uses of like GAN generated imagery."}, {"time": 2206, "text": "And funny enough, like one of the places where it's actually useful is we're using the technology right now to generate synthetic visual data for training some of the face recognition models to get rid of the bias."}, {"time": 2223, "text": "So like, that's one like super good use of the tech, but like, you know, it's getting good enough now where, you know, it's going to sort of challenge a normal human being's ability to, like now you're just sort of say, like it's very expensive for someone to fabricate a photorealistic fake video."}, {"time": 2244, "text": "And like GANs are going to make it fantastically cheap to fabricate a photorealistic fake video."}, {"time": 2250, "text": "And so like what you assume you can sort of trust is true versus like be skeptical about is about to change."}, {"time": 2258, "text": "And like, we're not ready for it, I don't think."}, {"time": 2260, "text": "The nature of truth, right."}, {"time": 2261, "text": "That's, it's also exciting because I think both you and I probably would agree that the way to solve, to take on that challenge is with technology, right?"}, {"time": 2272, "text": "There's probably going to be ideas of ways to verify which kind of video is legitimate, which kind is not."}, {"time": 2280, "text": "So to me, that's an exciting possibility, most likely for just the comedic genius that the internet usually creates with these kinds of videos and hopefully will not result in any serious harm."}, {"time": 2293, "text": "Yeah, and it could be, you know, like I think we will have technology to, that may be able to detect whether or not something's fake or real."}, {"time": 2304, "text": "Although the fakes are pretty convincing, even like when you subject them to machine scrutiny."}, {"time": 2314, "text": "But, you know, we also have these increasingly interesting social networks, you know, that are under fire right now for some of the bad things that they do."}, {"time": 2326, "text": "Like one of the things you could choose to do with a social network is like you could, you could use crypto and the networks to like have content signed where you could have a like full chain of custody that accompanied every piece of content."}, {"time": 2343, "text": "So like when you're viewing something and like you want to ask yourself, like how much can I trust this?"}, {"time": 2351, "text": "Like you can click something and like have a verified chain of custody that shows like, oh, this is coming from this source."}, {"time": 2359, "text": "And it's like signed by like someone whose identity I trust."}, {"time": 2364, "text": "Yeah, I think having that, you know, having that chain of custody, like being able to like say, oh, here's this video."}, {"time": 2369, "text": "Like it may or may not have been produced using some of this deepfake technology, but if you've got a verified chain of custody where you can sort of trace it all the way back to an identity and you can decide whether or not like I trust this identity."}, {"time": 2381, "text": "Like, oh no, this is really from the White House or like this is really from the, you know, the office of this particular presidential candidate or it's really from, you know, Jeff Wiener, CEO of LinkedIn or Satya Nadella, CEO of Microsoft."}, {"time": 2395, "text": "Like that might be like one way that you can solve some of the problems."}, {"time": 2399, "text": "So like that's not the super high tech."}, {"time": 2401, "text": "Like we've had all of this technology forever."}, {"time": 2404, "text": "And, but I think you're right."}, {"time": 2406, "text": "Like it has to be some sort of technological thing because the underlying tech that is used to create this is not going to do anything but get better over time and the genie is sort of out of the bottle."}, {"time": 2421, "text": "There's no stuffing it back in."}, {"time": 2422, "text": "And there's a social component, which I think is really healthy for a democracy where people will be skeptical about the thing they watch in general."}, {"time": 2432, "text": "So, you know, which is good."}, {"time": 2434, "text": "Skepticism in general is good for content."}, {"time": 2437, "text": "So deepfakes in that sense are creating a global skepticism about can they trust what they read."}, {"time": 2444, "text": "It encourages further research."}, {"time": 2446, "text": "I come from the Soviet Union where basically nobody trusted the media because you knew it was propaganda."}, {"time": 2455, "text": "And that kind of skepticism encouraged further research about ideas as opposed to just trusting any one source."}, {"time": 2462, "text": "Well, look, I think it's one of the reasons why the scientific method and our apparatus of modern science is so good."}, {"time": 2471, "text": "Like, because you don't have to trust anything."}, {"time": 2475, "text": "Like, the whole notion of modern science beyond the fact that this is a hypothesis and this is an experiment to test the hypothesis and this is a peer review process for scrutinizing published results."}, {"time": 2490, "text": "But stuff's also supposed to be reproducible."}, {"time": 2493, "text": "So you know it's been vetted by this process, but you also are expected to publish enough detail where if you are sufficiently skeptical of the thing, you can go try to reproduce it yourself."}, {"time": 2504, "text": "And like, I don't know what it is."}, {"time": 2507, "text": "Like, I think a lot of engineers are like this where like, you know, sort of this, like your brain is sort of wired for skepticism."}, {"time": 2515, "text": "Like, you don't just first order trust everything that you see and encounter."}, {"time": 2520, "text": "And like, you're sort of curious to understand, you know, the next thing."}, {"time": 2524, "text": "But like, I think it's an entirely healthy thing."}, {"time": 2529, "text": "And like, we need a little bit more of that right now."}, {"time": 2532, "text": "So I'm not a large business owner."}, {"time": 2536, "text": "So I'm just a huge fan of many of Microsoft products."}, {"time": 2543, "text": "I mean, I still, actually in terms of, I generate a lot of graphics and images and I still use PowerPoint to do that."}, {"time": 2548, "text": "It beats Illustrator for me."}, {"time": 2550, "text": "Even professional sort of, it's fascinating."}, {"time": 2554, "text": "So I wonder, what is the future of, let's say Windows and Office look like?"}, {"time": 2562, "text": "Is, do you see it?"}, {"time": 2563, "text": "I mean, I remember looking forward to XP."}, {"time": 2565, "text": "Was it exciting when XP was released?"}, {"time": 2568, "text": "Just like you said, I don't remember when 95 was released."}, {"time": 2571, "text": "But XP for me was a big celebration."}, {"time": 2573, "text": "And when 10 came out, I was like, oh, okay."}, {"time": 2576, "text": "Well, it's nice."}, {"time": 2577, "text": "It's a nice improvement."}, {"time": 2579, "text": "So what do you see the future of these products?"}, {"time": 2583, "text": "I think there's a bunch of excite."}, {"time": 2584, "text": "I mean, on the Office front, there's gonna be this like increasing productivity wins that are coming out of some of these AI powered features that are coming."}, {"time": 2598, "text": "Like the products will sort of get smarter and smarter in like a very subtle way."}, {"time": 2601, "text": "Like there's not gonna be this big bang moment where like Clippy is gonna reemerge and it's gonna be."}, {"time": 2608, "text": "Wait a minute."}, {"time": 2608, "text": "Okay, we'll have to wait, wait, wait."}, {"time": 2610, "text": "Is Clippy coming back?"}, {"time": 2612, "text": "But quite seriously, so injection of AI."}, {"time": 2617, "text": "There's not much, or at least I'm not familiar, sort of assistive type of stuff going on inside the Office products."}, {"time": 2623, "text": "Like a Clippy style assistant, personal assistant."}, {"time": 2627, "text": "Do you think that there's a possibility of that in the future?"}, {"time": 2632, "text": "So I think there are a bunch of like very small ways in which like machine learning powered assistive things are in the product right now."}, {"time": 2640, "text": "So there are a bunch of interesting things."}, {"time": 2644, "text": "Like the auto response stuff's getting better and better."}, {"time": 2649, "text": "And it's like getting to the point where it can auto respond with like, okay, this person's clearly trying to schedule a meeting."}, {"time": 2659, "text": "So it looks at your calendar and it automatically like tries to find like a time and a space that's mutually interesting."}, {"time": 2667, "text": "Like we have this notion of Microsoft search at a Microsoft search where it's like not just web search, but it's like search across like all of your information that's sitting inside of like your Office 365 tenant and like potentially in other products."}, {"time": 2686, "text": "And like we have this thing called the Microsoft Graph that is basically an API federator that sort of like gets you hooked up across the entire breadth of like all of the, like what were information silos before they got woven together with the graph."}, {"time": 2705, "text": "Like that is like getting increasing, with increasing effectiveness, sort of plumbed into some of these auto response things where you're gonna be able to see the system like automatically retrieve information for you."}, {"time": 2718, "text": "Like if, you know, like I frequently send out, you know, emails to folks where like I can't find a paper or a document or whatnot."}, {"time": 2725, "text": "There's no reason why the system won't be able to do that for you."}, {"time": 2727, "text": "And like, I think the, it's building towards like having things that look more like, like a fully integrated, you know, assistant, but like you'll have a bunch of steps that you will see before you, like it will not be this like big bang thing where like Clippy comes back and you've got this like, you know, manifestation of, you know, like a fully, fully powered assistant."}, {"time": 2753, "text": "So I think that's, that's definitely coming in, like all of the, you know, collaboration, coauthoring stuff's getting better."}, {"time": 2760, "text": "You know, it's like really interesting."}, {"time": 2762, "text": "Like if you look at how we use the Office product portfolio at Microsoft, like more and more of it is happening inside of like Teams as a canvas."}, {"time": 2774, "text": "And like, it's this thing where, you know, you've got collaboration is like at the center of the product and like we built some like really cool stuff that's some of, which is about to be open source that are sort of framework level things for doing, for doing coauthoring."}, {"time": 2795, "text": "So in, is there a cloud component to that?"}, {"time": 2797, "text": "So on the web, or is it, and forgive me if I don't already know this, but with Office 365, we still, the collaboration we do if we're doing Word, we still send the file around."}, {"time": 2810, "text": "So this is."}, {"time": 2811, "text": "We're already a little bit better than that."}, {"time": 2814, "text": "A little bit better than that and like, you know, so like the fact that you're unaware of it means we've got a better job to do, like helping you discover, discover this stuff."}, {"time": 2822, "text": "But yeah, I mean, it's already like got a huge, huge cloud component."}, {"time": 2827, "text": "And like part of, you know, part of this framework stuff, I think we're calling it, like I, like we've been working on it for a couple of years."}, {"time": 2834, "text": "So like, I know the internal code name for it, but I think when we launched it to build, it's called the Fluid Framework."}, {"time": 2874, "text": "So like you can be in whatever canvas is most convenient for you to get your work done."}, {"time": 2880, "text": "So I, out of my own sort of curiosity as an engineer, I know what it's like to sort of lead a team of 10, 15 engineers."}, {"time": 2888, "text": "Microsoft has, I don't know what the numbers are, maybe 50, maybe 60,000 engineers, maybe 40."}, {"time": 2894, "text": "I don't know exactly what the number is, it's a lot."}, {"time": 2897, "text": "It's tens of thousands."}, {"time": 2898, "text": "Right, so it's more than 10 or 15."}, {"time": 2900, "text": "What, I mean, you've led different sizes, mostly large size of engineers."}, {"time": 2910, "text": "What does it take to lead such a large group into a continue innovation, continue being highly productive and yet develop all kinds of new ideas and yet maintain, like what does it take to lead such a large group of brilliant people?"}, {"time": 2928, "text": "I think the thing that you learn as you manage larger and larger scale is that there are three things that are like very, very important for big engineering teams."}, {"time": 2942, "text": "Like one is like having some sort of forethought about what it is that you're gonna be building over large periods of time."}, {"time": 2951, "text": "Like not exactly, like you don't need to know that like, you know, I'm putting all my chips on this one product and like this is gonna be the thing, but like it's useful to know like what sort of capabilities you think you're going to need to have to build the products of the future."}, {"time": 2964, "text": "And then like invest in that infrastructure, like whether, and like I'm not just talking about storage systems or cloud APIs, it's also like what does your development process look like?"}, {"time": 2975, "text": "What tools do you want?"}, {"time": 2976, "text": "Like what culture do you want to build around?"}, {"time": 2980, "text": "Like how you're, you know, sort of collaborating together to like make complicated technical things."}, {"time": 2985, "text": "And so like having an opinion and investing in that is like, it just gets more and more important."}, {"time": 2990, "text": "And like the sooner you can get a concrete set of opinions, like the better you're going to be."}, {"time": 2997, "text": "Like you can wing it for a while at small scales, like, you know, when you start a company, like you don't have to be like super specific about it, but like the biggest miseries that I've ever seen as an engineering leader are in places where you didn't have a clear enough opinion about those things soon enough."}]}]