[{"title": "Donald Knuth: Programming, Algorithms, Hard Problems & the Game of Life | Lex Fridman Podcast #219", "id": "EE1R8FYUJm0", "quotes": [{"time": 302, "text": "But anyway, so I'm sitting there at the console of the machine."}, {"time": 306, "text": "I mean, I'm doing this at night when nobody else is around."}, {"time": 311, "text": "And so you have one set of switches where you dial the number I'm inputting, but there's another switch that says, okay, now execute one instruction and show me what you did."}, {"time": 317, "text": "Or there was another four switches that say, stop if you get to that instruction."}, {"time": 326, "text": "So I can say, now go until you get there again and watch."}, {"time": 333, "text": "So I could watch, it would take that number and it would divide it by two."}, {"time": 339, "text": "And if there's no remainder, then okay, two is a factor."}, {"time": 339, "text": "So then I work on it."}, {"time": 339, "text": "But if not divisible by two, divide by three."}, {"time": 348, "text": "Keep trying until you know you're at the end."}, {"time": 355, "text": "And you would find a bug if you were just surprised that something weird happened?"}, {"time": 362, "text": "Well, certainly."}, {"time": 362, "text": "I mean, first of all, I might have tried to divide by one instead of two."}, {"time": 365, "text": "You go off by one error, as people make all the time."}, {"time": 371, "text": "But maybe I go to the wrong instruction."}, {"time": 371, "text": "Maybe I left something in a register that I shouldn't have done."}, {"time": 378, "text": "But the first bugs were pretty..."}, {"time": 378, "text": "Probably on the first night, I was able to get the factors of 30 as equal to two, three, and five."}, {"time": 389, "text": "So you're sitting there late at night."}, {"time": 396, "text": "So it feels like you spent many years late at night working on a computer."}, {"time": 403, "text": "So what's that like?"}, {"time": 403, "text": "So most of the world is sleeping."}, {"time": 403, "text": "And you have to be there at night because that's when you get access to the computer."}, {"time": 411, "text": "Between my freshman and sophomore year, I didn't need sleep."}, {"time": 411, "text": "I used to do all nighters."}, {"time": 416, "text": "When I was in high school, I used to do the whole student newspaper every Monday night."}, {"time": 424, "text": "I would just stay up all night and it would be done on Tuesday morning."}, {"time": 432, "text": "I didn't get ulcers and stuff like that until later."}, {"time": 438, "text": "I don't know if you know Rodney Brooks."}, {"time": 439, "text": "Rod Brooks, of course."}, {"time": 440, "text": "He told me a story that he really looked up to you."}, {"time": 440, "text": "He was actually afraid of you."}, {"time": 449, "text": "Well, vice versa, I must say."}, {"time": 452, "text": "But he tells a story when you were working on tech that they screwed up something with a machine."}, {"time": 457, "text": "I think this might have been MIT."}, {"time": 457, "text": "And you were waiting for them to fix the machine so you can get back to work late at night."}, {"time": 467, "text": "That happened all the time."}, {"time": 469, "text": "He was really intimidated."}, {"time": 469, "text": "He's like, Dr. Knuth is not happy with this."}, {"time": 474, "text": "But no, the machine at Stanford AI Lab was down an awful lot because they had many talented programmers changing the operating system every day."}, {"time": 489, "text": "So the operating system was getting better every day, but it was also crashing."}, {"time": 494, "text": "So I wrote almost the entire manual for tech during downtime of that machine."}, {"time": 503, "text": "But that's another story."}, {"time": 504, "text": "Well, he was saying it's a hardware problem."}, {"time": 504, "text": "They tried to fix it and they reinserted something and smoke was everywhere."}, {"time": 512, "text": "Well, that didn't happen as often as the operating system."}, {"time": 518, "text": "It's a funny story because he was saying there's this tall Don Knuth that I look up to and there was pressure to fix the computer."}, {"time": 531, "text": "The kind of things we remember that stick in our memory."}, {"time": 534, "text": "Well, I could tell you a bunch of Rod Brooks stories too, but let's go back to the 650."}, {"time": 540, "text": "So I'm debugging my first program and I had more bugs in it than a number of lines of code."}, {"time": 552, "text": "I mean, the number of lines of code kept growing."}, {"time": 552, "text": "And let me explain."}, {"time": 557, "text": "So I had to punch the answers on cards."}, {"time": 557, "text": "So suppose I'm factoring the number 30, then I got to put two somewhere on the card."}, {"time": 566, "text": "I got to put a three somewhere on the card."}, {"time": 571, "text": "I got to put a five somewhere on the card."}, {"time": 571, "text": "And here's my first program."}, {"time": 571, "text": "I probably screwed up and it fell off the edge of the card or something like that."}, {"time": 577, "text": "But I didn't realize that there are some tentative numbers that have more than eight factors."}, {"time": 584, "text": "And the card has only 80 columns."}, {"time": 584, "text": "And so I need 10 columns for every factor."}, {"time": 593, "text": "So my first program didn't take account for the fact that I would have to punch more than one card."}, {"time": 598, "text": "My first program just lined stuff up in memory and then punched the card."}, {"time": 603, "text": "So by the time I finished, I had to deal with lots of things."}, {"time": 603, "text": "Also, if you put a large prime number in there, my program might have sat there for 10 minutes."}, {"time": 620, "text": "The 650 was pretty slow."}, {"time": 620, "text": "And so it would sit there spinning its wheels and you wouldn't know if it was in a loop or whatever."}, {"time": 624, "text": "You said 10 digit?"}, {"time": 626, "text": "10 digits."}, {"time": 626, "text": "So I think the largest is sort of 999999997 or something like that."}, {"time": 636, "text": "That would take me a while for that first one."}, {"time": 636, "text": "Anyway, that was my first program."}, {"time": 640, "text": "Well, what was your goal with that program?"}, {"time": 640, "text": "Was there something you were hoping to find a large prime maybe or the opposite?"}, {"time": 646, "text": "No, my goal was to see the lights flashing and understand how this magical machine would be able to do something that took so long by hand."}, {"time": 654, "text": "So what was your second program?"}, {"time": 659, "text": "My second program was a converted number from binary to decimal or something like that."}, {"time": 659, "text": "It was much simpler."}, {"time": 668, "text": "It didn't have that many bugs in it."}, {"time": 668, "text": "My third program was tic tac toe."}, {"time": 674, "text": "And it had some machines."}, {"time": 674, "text": "So the tic tac toe program is interesting on many levels, but one of them is that it had some you can call machine learning in it."}, {"time": 686, "text": "I don't know how long it's going to be before the name of our field has changed from computer science to machine learning."}, {"time": 694, "text": "But anyway, it was my first experience with machine learning."}, {"time": 702, "text": "So here we had... Yeah."}, {"time": 702, "text": "How does the program... Well, first of all, what is the problem you were solving?"}, {"time": 706, "text": "What is tic tac toe?"}, {"time": 706, "text": "And then how was it designed?"}, {"time": 714, "text": "So you've got a three by three grid and each can be in three states."}, {"time": 723, "text": "It can be empty or it can have an X or an O. Yeah."}, {"time": 723, "text": "So three to the ninth is a... Well, how big is it?"}, {"time": 728, "text": "I should know."}, {"time": 728, "text": "But it's 81 times three."}, {"time": 728, "text": "So anyway, eight is like two to the third."}, {"time": 746, "text": "And so that would be like two to the sixth."}, {"time": 746, "text": "But that would be 64."}, {"time": 755, "text": "Then you have to..."}, {"time": 755, "text": "Anyway, I love how you're doing the calculation."}, {"time": 755, "text": "So it's a lot of..."}, {"time": 755, "text": "Anyway, the three comes from the fact that it's either empty, an X or an O."}, {"time": 761, "text": "And the 650 was a machine that had only two thousand ten digit words."}, {"time": 769, "text": "You go from zero zero zero zero to one nine nine nine and that's it."}, {"time": 780, "text": "And each word you have a ten digit number."}, {"time": 780, "text": "So that's not many bits."}, {"time": 789, "text": "I mean, I got to have..."}, {"time": 789, "text": "In order to have a memory of every position I've seen, I need three to the ninth bits."}, {"time": 794, "text": "But it was a decimal machine too."}, {"time": 794, "text": "It didn't have bits."}, {"time": 801, "text": "But it did have strange instruction where if you had a ten digit number, but all the digits were either eight or nine, you'd be eight, nine, nine, eight or something like that."}, {"time": 809, "text": "You could make a test whether it was eight or nine."}, {"time": 818, "text": "That was one of the strange things IBM engineers put into the machine."}, {"time": 823, "text": "I have no idea why."}, {"time": 823, "text": "Well, hardly ever used."}, {"time": 823, "text": "But anyway, I needed one digit for every position I'd seen."}, {"time": 831, "text": "Zero meant it was a bad position."}, {"time": 831, "text": "Nine meant it was good position."}, {"time": 837, "text": "And I think I started out at five or six."}, {"time": 837, "text": "But if you win a game, then you increase the value of that position for you, but you decrease it for your opponent."}, {"time": 846, "text": "But I had that much total memory for every possible position was one digit."}, {"time": 858, "text": "And I had a total of 20,000 digits, which had to also include my program and all the logic and everything, including how to ask the user what the moves are and things like this."}, {"time": 874, "text": "So I think I had to work it out."}, {"time": 874, "text": "Every position in tic tac toe is equivalent to roughly eight others because you can rotate the board, which gives you a factor of four, and you can also flip it over."}, {"time": 889, "text": "And that's another factor too."}, {"time": 889, "text": "So I might have needed only three to the ninth over eight positions plus a little bit."}, {"time": 895, "text": "But anyway, that was a part of the program to squeeze it into this tiny..."}, {"time": 905, "text": "So you tried to find an efficient representation that took account for that kind of rotation."}, {"time": 911, "text": "I had to, otherwise I couldn't do the learning."}, {"time": 918, "text": "But I had three parts to my tic tac toe program."}, {"time": 918, "text": "And I called it brain one, brain two, and brain three."}, {"time": 924, "text": "So brain one just played at random."}, {"time": 924, "text": "It's your turn."}, {"time": 924, "text": "You got to put an X somewhere."}, {"time": 939, "text": "It has to go in an empty space, but that's it."}, {"time": 939, "text": "Choose one and play it."}, {"time": 939, "text": "Brain two had a canned routine."}, {"time": 948, "text": "And I think it also... Maybe it assumed you were the first player, or maybe it allowed you to be first."}, {"time": 959, "text": "I think you're allowed to be either first or second, but had a canned built in strategy known to be optimum for tic tac toe."}, {"time": 963, "text": "Before I forget, by the way, I learned many years later that Charles Babbage had thought about programming tic tac toe for his dream machine that he was never able to finish."}, {"time": 983, "text": "So that was the program he thought about."}, {"time": 986, "text": "More than 100 years ago."}, {"time": 986, "text": "He did that."}, {"time": 986, "text": "And I had, however, been influenced by a demonstration at the Museum of Science and Industry in Chicago."}, {"time": 997, "text": "It's like Boston Science Museum."}, {"time": 1002, "text": "I think Bell Labs had prepared a special exhibit about telephones and relay technology, and they had a tic tac toe playing machine as part of that exhibit."}, {"time": 1010, "text": "So that had been one of my... Something I'd seen before I was a freshman in college and inspired me to see if I could write a program for it."}, {"time": 1025, "text": "So anyway, I had brain one, random, knowing nothing."}, {"time": 1025, "text": "Brain two, knowing everything."}, {"time": 1033, "text": "Then brain three was the learning one."}, {"time": 1033, "text": "And I could play brain one against brain one, brain one against brain two, and so on."}, {"time": 1042, "text": "And so you could also play against the user, against the live users."}, {"time": 1048, "text": "So I started going, the learning thing, and I said, okay, take two random people just playing tic tac toe knowing nothing."}, {"time": 1057, "text": "And after about..."}, {"time": 1057, "text": "I forget the number now, but it converged after about 600 games to a safe draw."}, {"time": 1069, "text": "The way my program learned was actually, it learned how not to make mistakes."}, {"time": 1077, "text": "It didn't try to do anything for winning, it just tried to say not losing."}, {"time": 1084, "text": "So that was probably because of the way I designed the learning thing."}, {"time": 1090, "text": "I could have had a different reinforcement function that would reward brilliant play."}, {"time": 1098, "text": "And if I took a novice against a skilled player, it was able to learn how to play a good game."}, {"time": 1109, "text": "And that was really my..."}, {"time": 1109, "text": "But after I finished that, I felt I understood programming."}, {"time": 1118, "text": "Did a curiosity and interest in learning systems persist for you?"}, {"time": 1128, "text": "So why did you want brain three to learn?"}, {"time": 1128, "text": "I think naturally, we're talking about Rod Brooks."}, {"time": 1138, "text": "He was teaching all kinds of very small devices to learn stuff."}, {"time": 1138, "text": "If a leaf drops off of a tree, he was saying something, well, it learns if there's wind or not."}, {"time": 1157, "text": "But I mean, he pushed that a little bit too far."}, {"time": 1157, "text": "But he said he could probably train some little mini bugs to scour out dishes if he had enough financial support."}, {"time": 1168, "text": "Can I ask you about that?"}, {"time": 1168, "text": "He also mentioned that during those years, there was discussion inspired by Turing about computation, of what is computation."}, {"time": 1185, "text": "I never thought about any stuff like that."}, {"time": 1185, "text": "That was way too philosophical."}, {"time": 1185, "text": "I was a freshman after all."}, {"time": 1200, "text": "I was pretty much a machine."}, {"time": 1207, "text": "So it's almost like, yeah, I got you."}, {"time": 1207, "text": "It's a tinkering mindset, not a philosophical mindset."}, {"time": 1212, "text": "It was just exciting to me to be able to control something, but not to say, am I solving a big problem or something like that?"}, {"time": 1221, "text": "Or is this a step for humankind?"}, {"time": 1221, "text": "No, no way."}, {"time": 1228, "text": "When did you first start thinking about computation in the big sense?"}, {"time": 1228, "text": "Like the universal Turing machine?"}, {"time": 1234, "text": "I had to take classes on computability when I was a senior."}, {"time": 1234, "text": "So we read this book by Martin Davis."}, {"time": 1247, "text": "Yeah, this is cool stuff."}, {"time": 1247, "text": "But I learned about it because I needed to pass the exams."}, {"time": 1253, "text": "But I didn't invent any of that boring stuff."}, {"time": 1253, "text": "But I had great fun playing with the machine."}, {"time": 1260, "text": "I wrote programs because it was fun to write programs and get this."}, {"time": 1271, "text": "I mean, it was like watching miracles happen."}, {"time": 1275, "text": "You mentioned in an interview that when reading a program, you can tell when the author of the program changed."}, {"time": 1282, "text": "How the heck can you do that?"}, {"time": 1282, "text": "Like, what makes a distinct style for a programmer, do you think?"}, {"time": 1291, "text": "You know, there's different Hemingway has a style of writing versus James Joyce or something."}, {"time": 1299, "text": "Yeah, those are pretty easy to imitate."}, {"time": 1299, "text": "But it's the same with music and whatever."}, {"time": 1305, "text": "During the pandemic, I spent a lot more time playing the piano."}, {"time": 1305, "text": "And I found something that I'd had when I was taking lessons before I was a teenager."}, {"time": 1315, "text": "And it was Yankee Doodle who played in the style of... You had Beethoven and you had Debussy and Chopin, and the last one was Gershwin."}, {"time": 1336, "text": "And I played over and over again."}, {"time": 1336, "text": "I thought it was so brilliant."}, {"time": 1336, "text": "But it was so easy."}, {"time": 1346, "text": "But also to appreciate how this author, Mario, somebody or other, had been able to reverse engineer the styles of those composers."}, {"time": 1355, "text": "But now, specifically to your question, I mean, there would be..."}, {"time": 1363, "text": "It was pretty obvious in this program I was reading."}, {"time": 1363, "text": "It was a compiler and it had been written by a team at Carnegie Mellon."}, {"time": 1373, "text": "And I have no idea which program was responsible for it."}, {"time": 1373, "text": "But you would get to a part where the guy would just not know how to move things between registers very efficiently."}, {"time": 1389, "text": "And so everything that could be done in one instruction would take three or something like that."}, {"time": 1396, "text": "That would be a pretty obvious change in style."}, {"time": 1396, "text": "But there were also flashes of brilliance where you could do in one instruction."}, {"time": 1403, "text": "Normally, I used two because you knew enough about the way the machine worked that you could accomplish two goals in one step."}, {"time": 1409, "text": "So it was mostly the brilliance of the concept more than the semicolons or the use of short sentences versus long sentences or something like that."}, {"time": 1425, "text": "So you would see the idea in the code and you could see the different style of thinking expressed in the code."}, {"time": 1430, "text": "It was stylistic."}, {"time": 1430, "text": "I mean, I could identify authors by their by the amount of technical aptitude they had, but not by the style in the sense of rhythm or something like that."}, {"time": 1447, "text": "So if you think about Mozart, Beethoven, Bach, if somebody looked at Don Knuth code, would they be able to tell that this is a distinct style of thinking going on here?"}, {"time": 1463, "text": "And what would be the defining characteristic of the style?"}, {"time": 1468, "text": "Well, my code now is literate programming."}, {"time": 1468, "text": "So it's a combination of English and C mostly."}, {"time": 1468, "text": "But if you just looked at the C part of it, you would also probably notice that I use a lot of global variables that other people don't."}, {"time": 1486, "text": "And I expand things in line more than instead of calling."}, {"time": 1496, "text": "Anyway, I have different subset of C that I use."}, {"time": 1500, "text": "But that's a little bit stylistic."}, {"time": 1503, "text": "But with literate programming, you alternate between English and C or whatever."}, {"time": 1510, "text": "And by the way, people listening to this should look up literate programming."}, {"time": 1510, "text": "It's very interesting concept that you proposed and developed over the years."}, {"time": 1521, "text": "That's the most significant thing, I think, to come out of the tech project is that I realized that my programs were to be read by people and not just by computers and that typography could massively enhance that."}, {"time": 1545, "text": "And so, I mean, they're just wonderful."}, {"time": 1545, "text": "If they're going to look it up, they should also look up this book called Physically Based Rendering by Matt Farr and, gosh, anyway, it got an Academy Award."}, {"time": 1562, "text": "But all the graphic effects you see in movies are accomplished by algorithms."}, {"time": 1573, "text": "And the whole book is a literate program."}, {"time": 1573, "text": "It tells you not only how you do all the shading and bring images in that you need for animation and textures and so on, but you can run the code."}, {"time": 1587, "text": "And so, I find it an extension of how to teach programming is by telling a story as part of the program."}, {"time": 1607, "text": "So it works as a program, but it's also readable by humans."}, {"time": 1612, "text": "And especially by me a week later or a year later."}, {"time": 1618, "text": "That's a good test."}, {"time": 1618, "text": "If you yourself understand the code easily a week or a month or a year later."}, {"time": 1626, "text": "So it's the greatest thing since sliced bread."}, {"time": 1632, "text": "Programming or literate programming?"}, {"time": 1634, "text": "Literate programming."}, {"time": 1635, "text": "You heard it here first."}, {"time": 1635, "text": "You dodged this question in an interview I listened to."}, {"time": 1644, "text": "So let me ask you again here."}, {"time": 1644, "text": "What makes for a beautiful program?"}, {"time": 1651, "text": "What are the characteristics you see?"}, {"time": 1651, "text": "Like you just said, literate programming."}, {"time": 1656, "text": "What are the characteristics you see in a program that make you sit back and say, that's pretty good?"}, {"time": 1660, "text": "Well, the reason I didn't answer is because there are dozens and dozens of answers to that because you can define beauty, the same personal defined beauty, different way from hour to hour."}, {"time": 1674, "text": "I mean, it depends on what you're looking for."}, {"time": 1679, "text": "At one level, it's beautiful just if it works at all."}, {"time": 1679, "text": "At another level, it's beautiful if it can be understood easily."}, {"time": 1690, "text": "It's beautiful if it's literate programming."}, {"time": 1690, "text": "It makes you laugh."}, {"time": 1701, "text": "So I'm with you."}, {"time": 1701, "text": "I think beauty, if it's readable."}, {"time": 1707, "text": "Readable, yeah."}, {"time": 1708, "text": "Is if you understand what's going on and also understand the elegance of thought behind it."}, {"time": 1716, "text": "And then also, as you said, wit and humor."}, {"time": 1716, "text": "I was always, I remember having this conversation, I had this conversation on Stack Overflow, whether humor is good in comments."}, {"time": 1731, "text": "Whether humor is good in comments."}, {"time": 1733, "text": "Like when you add comments in code, I always thought a little bit of humor is good."}, {"time": 1740, "text": "It shows personality."}, {"time": 1740, "text": "It shows character, shows wit and fun and all those kinds of things of the personality of the programmer."}, {"time": 1748, "text": "So a couple of days ago, I received a wonderful present from my former editor at Aspen Wesley."}, {"time": 1757, "text": "He's downsizing his house and he found that somebody at the company had found all of their internal files about the art of computer programming from the 1960s and they gave it to him before throwing it in the garbage."}, {"time": 1772, "text": "And then so he said, oh yeah, he planned to keep it for posterity, but now he realized that posterity is a bit too much for him to handle, so he sent it to me."}, {"time": 1784, "text": "And so I just received this big stack of letters, some of which I had written to them, but many of which they had written to early guinea pigs who were telling them whether they should publish or not."}, {"time": 1806, "text": "You know, and one of the things was in the comments to volume one, the major reader was Bob Floyd, who is my great co worker in the 60s, died early, unfortunately."}, {"time": 1827, "text": "And he commented about the humor in it."}, {"time": 1827, "text": "So he ran it by me, you know, says, you know, keep this joke in or not, you know."}, {"time": 1838, "text": "They also sent it out to focus group."}, {"time": 1846, "text": "What do you think about humor in a book about computer programming?"}, {"time": 1850, "text": "What's the conclusion?"}, {"time": 1851, "text": "And I stated my philosophy."}, {"time": 1851, "text": "It said, you know, the ideal thing is that it's something where the reader knows that there's probably a joke here if you only understood it."}, {"time": 1860, "text": "And this is a motivation to understand, to think about it a little bit."}, {"time": 1864, "text": "But anyway, it's a very delicate humor."}, {"time": 1873, "text": "I mean, it's really each each century invents a different kind of humor, too."}, {"time": 1873, "text": "Different cultures have different different kinds of humor."}, {"time": 1881, "text": "Like we talked about Russia a little bit offline."}, {"time": 1887, "text": "You know, there's dark humor and, you know, when a country goes through something difficult, that life and stuff like this."}, {"time": 1894, "text": "And, you know, and Jack Benny, I mean, you know, Steve Allen wrote this book about humor, and it was the most boring book, but he was one of my idols."}, {"time": 1906, "text": "But it's called The Funny Men or something like that."}, {"time": 1914, "text": "So anyway, I think it's important to know that this is part of life, and it should be fun and not... And so, you know, I wrote this organ composition, which is based on the Bible, but I didn't refrain from putting little jokes in it also in the music."}, {"time": 1934, "text": "It's hidden in the music."}, {"time": 1935, "text": "It's there, yeah."}, {"time": 1938, "text": "A little humor is okay?"}, {"time": 1939, "text": "I mean, not egregious humor."}, {"time": 1939, "text": "So in this correspondence, you know, there were things I said, yeah, I really shouldn't have done that."}, {"time": 1947, "text": "But other ones I insisted on."}, {"time": 1947, "text": "And I've got jokes in there that nobody has figured out yet."}, {"time": 1955, "text": "In fact, in volume two, I've got a cryptogram, a message, enciphered."}, {"time": 1964, "text": "And in order to decipher it, you're going to have to break an RSA key, which is larger than people know how to break."}, {"time": 1972, "text": "And so, you know, if computers keep getting faster and faster, then, you know, it might be a hundred years, but somebody will figure out what this what this message is and they will laugh."}, {"time": 1984, "text": "I mean, I've got a joke in there."}, {"time": 1989, "text": "So that one you really have to work for."}, {"time": 1989, "text": "I don't know if you've heard about this."}, {"time": 1995, "text": "Let me explain it."}, {"time": 1995, "text": "Maybe you'll find it interesting."}, {"time": 1995, "text": "So OpenAI is a company that does AI work, and they have this language model."}, {"time": 2002, "text": "It's a neural network that can generate language pretty well."}, {"time": 2008, "text": "But they also have, on top of that, developed something called OpenAI Codex."}, {"time": 2018, "text": "And together with GitHub, they developed a system called OpenAI Copilot."}, {"time": 2023, "text": "Let me explain what it does."}, {"time": 2023, "text": "There's echoes of literate programming in it."}, {"time": 2023, "text": "So what you do is you start writing code and it completes the code for you."}, {"time": 2030, "text": "So, for example, you start, let's go to your factoring program."}, {"time": 2037, "text": "You start, you write in JavaScript and Python and any language that it trained on."}, {"time": 2044, "text": "You start, you write the first line and some comments, like what this code does, and it generates the function for you."}, {"time": 2051, "text": "And it does an incredibly good job."}, {"time": 2057, "text": "Like, it's not provably right, but it often does a really good job of completing the code for you."}, {"time": 2063, "text": "But how do you know whether it did a good job or not?"}, {"time": 2067, "text": "You could see a lot of examples where it did a good job."}, {"time": 2071, "text": "And so it's not a thing that generates code for you."}, {"time": 2075, "text": "It starts, it gives you, so it puts the human in the seat of fixing issues versus writing from scratch."}, {"time": 2082, "text": "Do you find that kind of idea at all interesting?"}, {"time": 2088, "text": "Every year, we're going to be losing more and more control over what machines are doing."}, {"time": 2093, "text": "And people are saying, well, when I was a professor at Caltech in the 60s, we had this guy who talked a good game."}, {"time": 2103, "text": "He could give inspiring lectures and you'd think, well, thrilling things he was talking about."}, {"time": 2113, "text": "An hour later, you'd say, well, what did he say?"}, {"time": 2116, "text": "But he really felt that it didn't matter whether computers got the right answer or not, it just mattered whether it made you happy or not."}, {"time": 2123, "text": "In other words, if your boss paid for it, then you had a job, you could take care of your wife."}, {"time": 2135, "text": "Happiness is more important than truth."}, {"time": 2138, "text": "He didn't believe in truth, but he was a philosopher."}, {"time": 2140, "text": "Yes, I like it."}, {"time": 2140, "text": "And somehow you see... We're going that way."}, {"time": 2147, "text": "So many more things are taken over by saying, well, this seems to work."}, {"time": 2155, "text": "When there is a competing interest involved, neither side understands why the decision is being made."}, {"time": 2160, "text": "We realize now that it's bad, but consider what happens 5 or 10 years down the line when things get even more further detached."}, {"time": 2169, "text": "Each thing is based on something from the previous year."}, {"time": 2180, "text": "So you start to lose..."}, {"time": 2180, "text": "The more you automate, the more you start to lose track of some deep human things."}, {"time": 2188, "text": "So that's the dark side."}, {"time": 2188, "text": "The positive side is the more you automate, the more you let humans do what humans do best."}, {"time": 2196, "text": "So maybe programming... Maybe humans should focus on a small part of programming that requires that genius, the magic of the human mind, and the mess you let the machine generate."}, {"time": 2215, "text": "That's the positive, but of course, it does come with the darkness of automation."}, {"time": 2221, "text": "Correctness?"}, {"time": 2222, "text": "I'm never going to try to write a book about that."}, {"time": 2226, "text": "I'm never going to recommend to any of my students to work for them."}, {"time": 2230, "text": "So you're on the side of correctness, not beauty, not happiness."}, {"time": 2234, "text": "I'm on the side of understanding."}, {"time": 2237, "text": "Understanding."}, {"time": 2238, "text": "And I think these things are really marvelous if what they do is all of a sudden we have a better medical diagnosis or it'll help guide some scientific experiment or something like curing diseases or whatever."}, {"time": 2254, "text": "But when it affects people's lives in a serious way..."}, {"time": 2254, "text": "If you're writing code, oh yeah, this is great."}, {"time": 2266, "text": "This will make a slaughter bot."}, {"time": 2270, "text": "Right now it seems like fun and games."}, {"time": 2279, "text": "It's useful to write a little JavaScript program that helps you with the website."}, {"time": 2284, "text": "But like you said, one year passes, two years passes, five years, and you forget."}, {"time": 2290, "text": "You start building on top of it, and then all of a sudden you have autonomous weapon systems."}, {"time": 2294, "text": "Well, we're all dead."}, {"time": 2294, "text": "It doesn't matter in that sense."}, {"time": 2301, "text": "Well, in the end, this whole thing ends anyway."}, {"time": 2308, "text": "There is a heat death of the universe predicted, but I'm trying to postpone that for a little bit."}, {"time": 2318, "text": "Well, it'd be nice that at the end, as we approach the heat death of the universe, there's still some kind of consciousness there to appreciate it."}, {"time": 2322, "text": "Hopefully human consciousness."}, {"time": 2331, "text": "I'll settle for 10 to the 10th year, some finite number."}, {"time": 2331, "text": "But things like this might be the reason we don't pick up any signals from extraterrestrials."}, {"time": 2339, "text": "They don't want anything to do with us."}, {"time": 2346, "text": "Oh, because they, because they, they, they invented it too."}, {"time": 2354, "text": "So you, you do have a little bit of worry on the existential threats of AI and automation."}, {"time": 2363, "text": "So like, like removing the human from the picture, et cetera."}, {"time": 2366, "text": "Um, people have more, more potential to do harm now than by far than they did a hundred years ago."}, {"time": 2376, "text": "But are you optimistic about the humans are good at creating destructive things, but also humans are good at solving problems."}, {"time": 2382, "text": "I mean, there's half empty and half full, you know, so I can go."}, {"time": 2386, "text": "So let me, let me put it this way because, because it's the only way I can be optimistic, but, but, but, but think of, um, of, uh, things that have changed because of civilization, you know, they don't occur just in nature."}, {"time": 2411, "text": "So just, uh, just imagine the room we're in, for example."}, {"time": 2411, "text": "Some, you know, we've got pencils, we've got books, we've got tables, we've got microphones, your clothing, food, all these things were added."}, {"time": 2425, "text": "Somebody invented them one by one and millions of things, uh, that we inherit."}, {"time": 2434, "text": "Um, and, uh, it's inconceivable that, that so many millions of billions of things, uh, wouldn't have problems and we get it all right."}, {"time": 2440, "text": "Um, and each one would have no negative effects and so on."}, {"time": 2448, "text": "So it, it's very amazing that as much works as does work."}, {"time": 2458, "text": "It's, it's, it's incredibly amazing."}, {"time": 2458, "text": "And actually that's the source of my optimism as well, including for artificial intelligence."}, {"time": 2466, "text": "So we, we drive over bridges."}, {"time": 2466, "text": "We, uh, we use all kinds of technology."}, {"time": 2475, "text": "We don't know how it works."}, {"time": 2475, "text": "And there's millions of brilliant people involved in building a small part of that and it doesn't go wrong and it works."}, {"time": 2480, "text": "And I mean that it, it works and it doesn't go, go wrong often enough for us to suffer."}, {"time": 2487, "text": "And we can identify things that aren't working and try to improve on them."}, {"time": 2494, "text": "In a suboptimal, often suboptimal way."}, {"time": 2502, "text": "But it's, but the, but the, the kind of things that I know how to improve require human beings to be rational."}, {"time": 2510, "text": "And I, I'm losing my confidence that human beings are rational."}, {"time": 2510, "text": "Now here you go again with the worst case, uh, worst case analysis."}, {"time": 2517, "text": "Um, they may not be rational, but they're, um, they're, they're clever and, uh, beautiful in their own kind of way."}, {"time": 2524, "text": "I tend to think that most people, um, have the desire and the capacity to be good to each other and love will ultimately win out."}, {"time": 2540, "text": "Like if they're given the opportunity, that's where they lean."}, {"time": 2540, "text": "In the Art of Computer Programming, you wrote, the real problem is that programmers have spent far too much time worrying about efficiency in the wrong places."}, {"time": 2552, "text": "And at the wrong times, premature optimization is the root of all evil in parentheses, or at least most of it in programming."}, {"time": 2558, "text": "Can you, uh, explain this idea?"}, {"time": 2566, "text": "Uh, what's the wrong time?"}, {"time": 2566, "text": "What is the wrong place for optimization?"}, {"time": 2566, "text": "So so first of all, the word optimization, I started out writing software, uh, and optimization was, I was a compiler writer."}, {"time": 2584, "text": "So optimization meant, uh, making the, uh, making a better translation so that it would run faster on a, on a machine."}, {"time": 2592, "text": "So an optimized program is just like, you know, you, you, you run a program and you set the optimization level, uh, for, uh, to the compiler."}, {"time": 2604, "text": "So that's one word for optimization."}, {"time": 2604, "text": "Um, and at that time I, I happened to be looking in an unabridged dictionary, uh, for some reason or other, and I came to the word optimizer."}, {"time": 2617, "text": "So what's the meaning of the word optimize?"}, {"time": 2617, "text": "And it says to view with optimism."}, {"time": 2624, "text": "And you look in Webster's dictionary of English language in 19, early 1960s, that's what optimize meant."}, {"time": 2630, "text": "Um, now, so people started doing cost optimization, other kinds of things, uh, uh, you know, whole sub fields of, of, uh, algorithms and economics and whatever are based on what they call optimization now."}, {"time": 2646, "text": "But, uh, but to me optimization when I was saying that was saying, uh, changing a program to make it more, uh, tuned to the machine."}, {"time": 2661, "text": "And I found out that, uh, when a person writes a program, uh, he or she tends to think that the parts that were hardest to write are going to be hardest for the computer to execute."}, {"time": 2677, "text": "So maybe I have 10 pages of code, but I had to work a week writing this page."}, {"time": 2677, "text": "I mentally think that when the computer gets to that page, it's going to slow down."}, {"time": 2687, "text": "It's going to say, oh, I don't understand what I'm doing."}, {"time": 2693, "text": "I better, I better be more careful."}, {"time": 2693, "text": "Anyway, this is of course silly, but it's, it's, it's something that we, that we, that we don't know when we write a piece of code."}, {"time": 2704, "text": "We don't know what, what, whether the computer is actually going to be executing that code very much."}, {"time": 2709, "text": "So, so people had, had a very poor understanding of, of what the computer was actually doing."}, {"time": 2717, "text": "Uh, I made one test where, where we studied a Fortran compiler and it was spending more than 80% of its time reading the comments card."}, {"time": 2725, "text": "Um, but as a programmer, we were really concerned about how fast it could take a complicated expression that had lots of levels of parentheses and, and, and, and convert that into something."}, {"time": 2736, "text": "But that was just, you know, less than 1% of the, so if we optimize that, uh, we didn't know what we were doing, but, but, but if we knew that it was spending 80% of his time on the comments card, you know, in 10 minutes, we could, we could make the, the, the compiler run more than twice as fast."}, {"time": 2761, "text": "And you could only do that once you've completed the program and then you empirically study where."}, {"time": 2765, "text": "I had some kind of profiling that I knew what was important."}, {"time": 2770, "text": "So you don't think this applies generally?"}, {"time": 2770, "text": "I mean, there's something that rings true to this across all of them."}, {"time": 2775, "text": "I'm glad that it applied generally, but it was, it was only my good luck."}, {"time": 2778, "text": "I said it, but you know, but I did, but I said it in a limited context and I, and, and I'm glad if it makes people think about stuff because I, but it applies in another sense too, that is sometimes I will do optimization in a way that does help the actual running time, but makes the program impossible to change next week."}, {"time": 2809, "text": "Because I've changed my data structure or something that, that made it less adaptable."}, {"time": 2816, "text": "So one of the great principles of computer science is, is, is laziness or whatever you call it, late binding."}, {"time": 2824, "text": "You know, don't hold off decisions when you can."}, {"time": 2824, "text": "And, and, and, you know, and we understand now quantitatively how valuable that is."}, {"time": 2838, "text": "What do you mean we understand?"}, {"time": 2838, "text": "So you mean from a... People, people have written thesis about how you can, how late binding will, will improve the, I mean, you know, just in time manufacturing or whatever, you can make, you can defer a decision instead of doing your advanced planning and say, I'm going to allocate 30% to this and 50%."}, {"time": 2861, "text": "So in all kinds of domains, there's an optimality to laziness in many cases."}, {"time": 2865, "text": "Decision is not made in advance."}, {"time": 2865, "text": "So instead you, you, you design in order to be flexible to change with the, with the way the wind is blowing."}, {"time": 2873, "text": "But so the reason that line resonated with a lot of people is because there's something about the programmer's mind that wants, that enjoys optimization."}, {"time": 2886, "text": "So it's a constant struggle to balance laziness and late binding with the desire to optimize."}, {"time": 2895, "text": "The elegance of a well optimized code is something that's compelling to programming."}, {"time": 2903, "text": "It's another concept of beauty."}, {"time": 2911, "text": "Let me ask you a weird question."}, {"time": 2911, "text": "So Roger Penrose has talked about computation computers and he proposed that the way the human mind discovers mathematical ideas is something more than a computer."}, {"time": 2929, "text": "That, that a universal Turing machine cannot do everything that a human mind can do."}, {"time": 2937, "text": "Now this includes discovering mathematical ideas and it also includes, he's written a book about it, Consciousness."}, {"time": 2945, "text": "So I don't know if you know Roger, but my, my daughter's kids played with his kids in Oxford."}, {"time": 2952, "text": "So do you think there is such a limit to the computer?"}, {"time": 2952, "text": "Do you think consciousness is more than a computation?"}, {"time": 2959, "text": "Do you think the human mind, the way it thinks is more than a computation?"}, {"time": 2966, "text": "I mean, I can say yes or no, but, but, but I don't, I have no reason."}, {"time": 2975, "text": "So you don't find it useful to have an intuition in one way or the other?"}, {"time": 2975, "text": "Like when you think about algorithms, isn't it useful to think about the limits?"}, {"time": 2980, "text": "Unanswerable question in my opinion is, is no better than anybody else."}, {"time": 2986, "text": "You think it's unanswerable."}, {"time": 2986, "text": "So you don't think eventually science."}, {"time": 2991, "text": "How many angels can dance on the head of a, I mean, I don't know."}, {"time": 2991, "text": "But angels."}, {"time": 2998, "text": "Anyway, there, there are lots of things that are beyond, that we can speculate about, but I don't want somebody to say, oh yeah, Knuth said this and so he's, he's, he's smart."}, {"time": 3003, "text": "And so, so he, so that must be, I mean, I say it's something that we'll never know."}, {"time": 3014, "text": "That's a strong statement."}, {"time": 3014, "text": "I don't, I personally think it's something we will know eventually."}, {"time": 3022, "text": "Like there's no reason to me why the, the workings of the human mind are not within the reach of science."}, {"time": 3028, "text": "That's absolutely possible."}, {"time": 3028, "text": "And I'm not denying it."}, {"time": 3034, "text": "But right now you don't have a good intuition."}, {"time": 3034, "text": "I mean, that's also possible, you know, that an AI, you know, created the universe, you know, intelligent design has all been done by an AI."}, {"time": 3045, "text": "This is, I mean, all of these things are, but, but, but you're asking me to, to pronounce on it."}, {"time": 3052, "text": "And I don't have any expertise."}, {"time": 3052, "text": "I'm a teacher that passes on knowledge, but I don't, but I don't know the fact that I, that I vote yes or no on."}, {"time": 3065, "text": "Well, you do have expertise as a human, not as a, not as a teacher or a scholar of computer science."}, {"time": 3074, "text": "I mean, that's ultimately the realm of where the discussion of human thought."}, {"time": 3078, "text": "Well, I know where."}, {"time": 3079, "text": "And consciousness is."}, {"time": 3081, "text": "I know where, where Penrose is coming from."}, {"time": 3081, "text": "He, I'm sure he has no, I mean, he might even thought he proved it, but."}, {"time": 3088, "text": "He doesn't prove it."}, {"time": 3088, "text": "He is following intuition."}, {"time": 3092, "text": "But, but I mean, you have to ask John McCarthy."}, {"time": 3092, "text": "John McCarthy, I think, were totally unimpressed by these statements."}, {"time": 3103, "text": "So you don't think, so even like the Turing paper on, on the Turing test that, you know, starts by asking, can machines think?"}, {"time": 3114, "text": "You don't think these kind of, Turing doesn't like that question."}, {"time": 3119, "text": "I don't consider it important, let's just put it that way."}, {"time": 3124, "text": "Because it's, it's in the category of things that it would be nice to know, but I think it's beyond knowledge."}, {"time": 3130, "text": "And so I don't, I'm more interested in knowing about the Riemann hypothesis or something."}, {"time": 3140, "text": "So when you say, it's an interesting statement, beyond knowledge."}, {"time": 3144, "text": "I think what you mean is it's not sufficiently well, it's not even known well enough to be able to formalize it in order to ask a clear question."}, {"time": 3156, "text": "And so that's why it's beyond knowledge, but that doesn't mean it's not eventually going to be formalized."}, {"time": 3161, "text": "Maybe consciousness will be understood some, someday."}, {"time": 3166, "text": "The last time I checked, it was still 200 years away."}, {"time": 3171, "text": "I mean, I haven't been specializing in this by any means, but I went to lectures about it 20 years ago when I was, there was a symposium at the American Academy in Cambridge."}, {"time": 3177, "text": "And it started out by saying, essentially, everything that's been written about consciousness is hogwash."}, {"time": 3192, "text": "I tend to disagree with that a little bit."}, {"time": 3198, "text": "So consciousness for the longest time still is in the realm of philosophy."}, {"time": 3204, "text": "So it's just conversations without any basis and understanding."}, {"time": 3208, "text": "Still, I think once you start creating artificial intelligence systems that interact with humans and they have personality, they have identity, you start flirting with the question of consciousness, not from a philosophical perspective, but from an engineering perspective."}, {"time": 3230, "text": "And then it starts becoming much more like, I feel like."}, {"time": 3233, "text": "Don't misunderstand me."}, {"time": 3233, "text": "I certainly don't disagree with that at all."}, {"time": 3240, "text": "And even at these lectures that we had 20 years ago, there were neurologists pointing out that human beings had actually decided to do something before they were conscious of making that decision."}, {"time": 3254, "text": "I mean, they could tell that signals were being sent to their arms before they knew that things like this are true."}, {"time": 3264, "text": "And Les Valiant has an architecture for the brain."}, {"time": 3264, "text": "And more recently, Christos Papadimitriou in the Academy of Science Proceedings a year ago with two other people, but I know Christos very well."}, {"time": 3284, "text": "And he's got this model of this architecture by which you could create things that correlate well with experiments that are done on consciousness."}, {"time": 3302, "text": "And he actually has a machine language in which you can write code and test hypotheses."}, {"time": 3317, "text": "And so we might have a big breakthrough."}, {"time": 3317, "text": "My personal feeling is that consciousness is the best model I've heard of to explain the miracle of consciousness is that somehow inside of our brains, we're having a continual survival for the fittest competition."}, {"time": 3339, "text": "And I'm speaking to you, and I'm speaking to you, all the possible things I might be wanting to say are all in there and there's like a voting going on."}, {"time": 3356, "text": "And one of them is winning and that's affecting the next sentence and so on."}, {"time": 3364, "text": "And there was this book, Machine Intelligence or something?"}, {"time": 3371, "text": "On Intelligence?"}, {"time": 3372, "text": "On Intelligence, yeah."}, {"time": 3372, "text": "Bill Atkinson was a total devotee of that book."}, {"time": 3381, "text": "Well, I like whether it's consciousness or something else, I like the storytelling part that it feels like for us humans, it feels like there's a concrete story."}, {"time": 3387, "text": "It's almost like literary programming."}, {"time": 3394, "text": "I don't know what the programming is going on on the inside, but I'm getting a nice story here about what happened."}, {"time": 3398, "text": "And it feels like I'm in control and I'm getting a nice clear story."}, {"time": 3404, "text": "But it's also possible there's a computation going on that's really messy."}, {"time": 3409, "text": "There's a bunch of different competing ideas."}, {"time": 3409, "text": "And in the end, it just kind of generates a story for you, a consistent story for you to believe."}, {"time": 3414, "text": "And that makes it all nice."}, {"time": 3421, "text": "And so I prefer to talk about things that I have some expertise in than things which I'm only on the sideline."}, {"time": 3434, "text": "So there's a tricky thing."}, {"time": 3434, "text": "I don't know if you have any expertise in this."}, {"time": 3438, "text": "You might be a little bit on the sideline."}, {"time": 3438, "text": "It'd be interesting to ask though."}, {"time": 3441, "text": "What are your thoughts on Cellular Automata and the Game of Life?"}, {"time": 3445, "text": "Have you ever played with those kind of little games?"}, {"time": 3448, "text": "I think the Game of Life is wonderful and shows all kinds of stuff about how things can evolve without the creator understanding anything more than the power of learning in a way."}, {"time": 3463, "text": "But to me, the most important thing about the Game of Life is how it focused for me what it meant to have free will or not."}, {"time": 3481, "text": "Because the Game of Life is obviously totally deterministic."}, {"time": 3481, "text": "And I find it hard to believe that anybody who's ever had children cannot believe in free will."}, {"time": 3491, "text": "On the other hand, this makes it crystal clear."}, {"time": 3497, "text": "John Conway said he wondered whether it was immoral to shut the computer off after he got into a particularly interesting play of the Game of Life."}, {"time": 3516, "text": "So to me, the reason I love the Game of Life is exactly as you said, a clear illustration that from simple initial conditions with simple rules, you know exactly how the system is operating, it's deterministic."}, {"time": 3529, "text": "And yet, if you allow yourself to lose that knowledge a little bit enough to see the bigger organisms that emerge, and then all of a sudden they seem conscious."}, {"time": 3546, "text": "They seem, not conscious, but living."}, {"time": 3550, "text": "If the universe is finite, we're all living in the Game of Life, just slowed down."}, {"time": 3550, "text": "I mean, it sped up a lot."}, {"time": 3561, "text": "But do you think technically some of the ideas that you used for analysis of algorithms can be used to analyze the Game of Life?"}, {"time": 3568, "text": "Can we make sense of it?"}, {"time": 3568, "text": "Or is it too weird?"}, {"time": 3572, "text": "I mean, I've got a dozen exercises in volume four, fascicle six, that actually work rather well for that purpose."}, {"time": 3583, "text": "Bill Gospers came up with the algorithm that allows Golly to run thousands and thousands of times faster."}, {"time": 3597, "text": "You know the website called Golly?"}, {"time": 3597, "text": "G O L L Y?"}, {"time": 3604, "text": "It simulates the cellular automata, like Game of Life?"}, {"time": 3607, "text": "Yeah, you got to check it out."}, {"time": 3610, "text": "Can I ask you about John Conway?"}, {"time": 3612, "text": "In fact, I'm just reading now the issue of mathematical intelligence that came in last week."}, {"time": 3619, "text": "It's a whole issue devoted to remembrance of him."}, {"time": 3628, "text": "Did you know him?"}, {"time": 3630, "text": "I slept overnight in his house several times."}, {"time": 3636, "text": "He recently passed away."}, {"time": 3638, "text": "Yeah, he died a year ago, May, I think it was, of COVID."}, {"time": 3646, "text": "What are some memories of him, of his work, that stand out for you?"}, {"time": 3646, "text": "On a technical level, did any of his work inspire you?"}, {"time": 3658, "text": "On a personal level, did he himself inspire you in some way?"}, {"time": 3666, "text": "Absolutely, all of those things."}, {"time": 3666, "text": "But let's see, when did I first meet him?"}, {"time": 3666, "text": "I guess I first met him at Oxford in 1967 when I was..."}, {"time": 3671, "text": "Okay, that's a long time ago."}, {"time": 3677, "text": "Yeah, you were minus 20 years old or something, I don't know, 1967."}, {"time": 3677, "text": "But there was a conference where I think I was speaking about something known as the Knuth Bendix algorithm now, but he gave a famous talk about knots."}, {"time": 3697, "text": "And I didn't know at the time, but anyway, that talk had now..."}, {"time": 3707, "text": "The source of thousands and thousands of papers since then."}, {"time": 3707, "text": "And he was reported on something that he had done in high school almost 10 years earlier before this conference, but he never published it."}, {"time": 3724, "text": "And he climaxed his talk by building some knots."}, {"time": 3724, "text": "You have these little plastic things that you can stick together."}, {"time": 3733, "text": "It's something like Lego, but easier."}, {"time": 3733, "text": "And so he made a whole bunch of knots in front of the audience and so on and then disassembled it."}, {"time": 3743, "text": "So it was a dramatic lecture before he had learned how to give even more dramatic lectures later."}, {"time": 3753, "text": "Were you at that lecture?"}, {"time": 3757, "text": "And I was there, yeah, because I was at the same conference."}, {"time": 3757, "text": "For some reason, I happened to be in Calgary the same day that he was visiting Calgary."}, {"time": 3766, "text": "And it was the spring of 72, I'm pretty sure."}, {"time": 3776, "text": "And we had lunch together and he wrote down during the lunch on a napkin all of the facts about what he called numbers."}, {"time": 3788, "text": "And he covered the napkin with the theorems about his idea of numbers."}, {"time": 3797, "text": "And I thought it was incredibly beautiful."}, {"time": 3797, "text": "And later in 1972, my sabbatical year began and I went to Norway."}, {"time": 3811, "text": "And in December of that year, in the middle of the night, the thought came to me, you know, Conway's theory about numbers would be a great thing to teach students how to invent research and what the joys are of research."}, {"time": 3826, "text": "And I had also read a book in dialogue by Alfred Renyi, kind of a Socratic thing where the two characters were talking to each other about mathematics."}, {"time": 3846, "text": "And so at the end, in the morning, I woke up my wife and said, Jill, I think I want to write a book about Conway's theory."}, {"time": 3856, "text": "And, you know, I'm supposed to be writing the Art of Computer Program and doing all this other stuff, but I really want to write this other book."}, {"time": 3872, "text": "And so we made this plan."}, {"time": 3872, "text": "But I said, I thought I could write it in a week."}, {"time": 3880, "text": "And we made the plan then."}, {"time": 3880, "text": "So in January, I rented a room in a hotel in downtown Oslo."}, {"time": 3887, "text": "We were in sabbatical in Norway."}, {"time": 3887, "text": "And I rented the hotel in downtown Oslo and did nothing else except write up Conway's theory."}, {"time": 3896, "text": "And I changed the name to Surreal Numbers."}, {"time": 3896, "text": "And so this book is now published as Surreal Numbers."}, {"time": 3902, "text": "And, you know, we figured out, we'd always wonder what would be like to have a fair enough hotel room."}, {"time": 3911, "text": "So we figured out that she would visit me twice during the week."}, {"time": 3916, "text": "Things like this, you know, we would try to sneak in."}, {"time": 3916, "text": "This hotel was run by a mission organization."}, {"time": 3924, "text": "These ladies were probably very strict, but anyway."}, {"time": 3924, "text": "So, and it's a wild week in every way."}, {"time": 3934, "text": "But the thing is, I had lost that."}, {"time": 3934, "text": "I had lost that napkin in which he wrote the theory, but I looked for it, but I couldn't find it."}, {"time": 3938, "text": "So I tried to recreate from memory what he had told me at that lunch in Calgary."}, {"time": 3946, "text": "And as I wrote the book, I was going through exactly what I, what the characters in the book were supposed to be doing."}, {"time": 3955, "text": "So I start with the two axioms that start out the whole thing and everything is defined, flows from that, but you have to discover why."}, {"time": 3966, "text": "And every mistake that I make as I'm trying to discover it, my characters make too."}, {"time": 3966, "text": "And so it's a long, long story."}, {"time": 3975, "text": "But I worked through this week and it was one of the most intense weeks of my life and I described it in other places."}, {"time": 3985, "text": "But anyway, after six days, I finished it and on the seventh day I rested and I sent to my secretary to type it."}, {"time": 3996, "text": "It was flowing as I was writing it faster than I could think almost."}, {"time": 4004, "text": "But after I finished and tried to write a letter to my secretary telling her how to type it, I couldn't write anymore."}, {"time": 4014, "text": "You gave it everything."}, {"time": 4019, "text": "The muse had left me completely."}, {"time": 4019, "text": "Can you explain how that week could have happened?"}, {"time": 4025, "text": "That seems like such a magical week of productivity."}, {"time": 4025, "text": "But anyway, there was some..."}, {"time": 4028, "text": "It was almost as if I was channeling."}, {"time": 4028, "text": "So the book was typed, they sent it to Conway and he said, well, Don, you got the one axiom wrong."}, {"time": 4044, "text": "Is there a difference between less than or equal and not greater than?"}, {"time": 4044, "text": "The opposite of being greater than and less than or equal."}, {"time": 4052, "text": "But anyway, technically it can make a difference when you're developing a logical theory."}, {"time": 4058, "text": "And the way I had chosen was harder to do than John's original."}, {"time": 4067, "text": "And we visited him at his house in Cambridge in April."}, {"time": 4067, "text": "We took a boat actually from Norway over to across the channel and so on and stayed with him for some days."}, {"time": 4073, "text": "And we talked about all kinds of things he had."}, {"time": 4081, "text": "He had puzzles that I'd never heard of before."}, {"time": 4081, "text": "He had a great way to solve the game of solitaire."}, {"time": 4092, "text": "Many of the common interests that he'd never written them up."}, {"time": 4099, "text": "But anyway, then in the summertime, I took another week off and went to a Conway place in the mountains of Norway and rewrote the book using the correct axiom."}, {"time": 4114, "text": "So that was the most intensive connection with Conway."}, {"time": 4114, "text": "After that..."}, {"time": 4120, "text": "It started with a napkin."}, {"time": 4121, "text": "But we would run into each other."}, {"time": 4121, "text": "The next really... And I was giving lectures in Montreal."}, {"time": 4130, "text": "I was giving a series of seven lectures about the topic called Stable Marriages."}, {"time": 4142, "text": "And he arrived in Montreal between my sixth and seventh lecture."}, {"time": 4151, "text": "And we met at a party."}, {"time": 4151, "text": "And I started telling him about the topic I was doing."}, {"time": 4151, "text": "And he sat and thought about it."}, {"time": 4160, "text": "He came up with a beautiful theory to show that the..."}, {"time": 4160, "text": "I mean, in technical terms, it's that the set of all stable marriages forms a lattice."}, {"time": 4166, "text": "And there was a simple way to find the greatest lower bound of two stable pairings and least upper bound of two stable marriage."}, {"time": 4181, "text": "And so I could use it in my lecture the next day."}, {"time": 4181, "text": "And he came up with this theorem during the party."}, {"time": 4186, "text": "And it's a distributive lattice."}, {"time": 4186, "text": "It added greatly to the theory of stable matching."}, {"time": 4199, "text": "So you mentioned your wife, Jill."}, {"time": 4199, "text": "You mentioned stable marriage."}, {"time": 4199, "text": "Can you tell the story of how you two met?"}, {"time": 4207, "text": "So we celebrated 60 years of wedded bliss last month."}, {"time": 4207, "text": "And we met because I was dating her roommate."}, {"time": 4217, "text": "This was my sophomore year, her freshman year."}, {"time": 4217, "text": "I was dating her roommate."}, {"time": 4217, "text": "And I wanted her advice on strategy or something like this."}, {"time": 4224, "text": "And anyway, I found I enjoyed her advice better than her."}, {"time": 4233, "text": "I enjoyed her roommate."}, {"time": 4233, "text": "You guys were majoring the same thing?"}, {"time": 4239, "text": "Because I read something about working on a computer in grad school on a difficult computer science topic."}, {"time": 4246, "text": "So she's an artist and I'm a geek."}, {"time": 4255, "text": "What was she doing with a computer science book?"}, {"time": 4255, "text": "Was it the manual that she was reading?"}, {"time": 4261, "text": "What was she reading?"}, {"time": 4261, "text": "I wrote the manual that she had to take a class in computer science."}, {"time": 4265, "text": "So you're the tutor?"}, {"time": 4270, "text": "There were terrible times trying to learn certain concepts, but I learned art from her."}, {"time": 4283, "text": "And so we worked together occasionally in design projects."}, {"time": 4283, "text": "But every year we write a Christmas card and we each have to compromise our own notions of beauty."}, {"time": 4300, "text": "When did you fall in love with her?"}, {"time": 4300, "text": "That day that I asked her about her roommate."}, {"time": 4308, "text": "I don't mind telling these things, depending on how far you go."}, {"time": 4319, "text": "I promise not to go too far."}, {"time": 4325, "text": "I never really enjoyed kissing until I found how she did it."}, {"time": 4333, "text": "And 60 years."}, {"time": 4340, "text": "Is there a secret you can say in terms of stable marriages, of how you stayed together so long?"}, {"time": 4347, "text": "The topic stable marriage, by the way, is a technical term."}, {"time": 4353, "text": "It's a joke, Don."}, {"time": 4356, "text": "But two different people will have to learn how to compromise and work together and you're going to have ups and downs and crises and so on."}, {"time": 4368, "text": "And so as long as you don't set your expectation on having 24 hours of bliss, then there's a lot of hope for stability."}, {"time": 4384, "text": "But if you decide that there's going to be no frustration, then..."}, {"time": 4393, "text": "So you're going to have to compromise on your notions of beauty when you write Christmas cards."}, {"time": 4401, "text": "You mentioned that Richard Feynman was someone you looked up to."}, {"time": 4406, "text": "Probably you've met him in Caltech."}, {"time": 4408, "text": "Well, we knew each other, yeah, at Caltech, for sure, yeah."}, {"time": 4415, "text": "You are one of the seminal personalities of computer science."}, {"time": 4415, "text": "He's one for physics."}, {"time": 4423, "text": "Is there specific things you picked up from him by way of inspiration?"}, {"time": 4429, "text": "So we used to go to each other's lectures."}, {"time": 4431, "text": "But if I saw him sitting in the front row, it would throw me for a loop, actually."}, {"time": 4431, "text": "I would miss a few sentences."}, {"time": 4439, "text": "What unique story do I have?"}, {"time": 4439, "text": "I often refer to his time in Brazil where he essentially said they were teaching all the physics students the wrong way."}, {"time": 4451, "text": "They were just learning how to pass exams and not learning any physics."}, {"time": 4458, "text": "And he said, if you want me to prove it, here, I'll turn any page of this textbook and I'll tell you what's wrong with this page."}, {"time": 4467, "text": "And he did so."}, {"time": 4472, "text": "And the textbook had been written by his host, and he was a great teacher."}, {"time": 4472, "text": "And he had previously asked his host if he was supposed to tell the truth."}, {"time": 4479, "text": "But anyway, it epitomizes the way education goes wrong in all kinds of fields and has to periodically be brought back from a process of giving credentials to a process of giving knowledge."}, {"time": 4510, "text": "That's probably a story that continues to this day in a bunch of places where it's too easy for educational institutions to fall into credentialism versus inspirationalism."}, {"time": 4526, "text": "I don't know if those are words, but sort of understanding versus just giving a little plaque."}, {"time": 4539, "text": "It's very much like what we were talking about."}, {"time": 4539, "text": "If you want to be able to believe the answer, a computer is doing that."}, {"time": 4545, "text": "One of the things Bob Floyd showed me in the 60s, there was a..."}, {"time": 4551, "text": "He loved this cartoon."}, {"time": 4551, "text": "There were two guys standing in front of..."}, {"time": 4551, "text": "In those days, a computer was a big thing."}, {"time": 4559, "text": "And the first guy says to the other guy, he said, this machine can do in one second what it would take a million people to do in a hundred years."}, {"time": 4572, "text": "And the other guy says, oh, so how do you know it's right?"}, {"time": 4581, "text": "Is there some interesting distinction between physics and math to you?"}, {"time": 4586, "text": "Have you looked at physics much?"}, {"time": 4586, "text": "Speaking of Richard Feynman, the difference between the physics community, the physics way of thinking, the physics intuition versus the theoretical computer science, the mathematical sciences, do you see that as a gap?"}, {"time": 4600, "text": "Are they strongly overlapping?"}, {"time": 4604, "text": "It's quite different, in my opinion."}, {"time": 4604, "text": "I started as a physics major and I switched into math."}, {"time": 4612, "text": "And probably the reason was that I could get A plus on the physics exam, but I never had any idea why I would have been able to come up with the problems that were on those exams."}, {"time": 4625, "text": "But in math, I knew why the teacher set those problems and I thought of other problems that I could set, too."}, {"time": 4633, "text": "And I believe it's quite a different mentality."}, {"time": 4640, "text": "It has to do with your philosophy of geekdom?"}, {"time": 4643, "text": "No, it's..."}, {"time": 4643, "text": "I mean, some of my computer scientist friends are really good at physics and others are really good at physics and others are not."}, {"time": 4650, "text": "And I'm really good at algebra, but not at geometry."}, {"time": 4659, "text": "Talk about different parts of mathematics."}, {"time": 4659, "text": "So there are different kinds of physics, but physicists think of things in terms of waves."}, {"time": 4664, "text": "And I can think of things in terms of waves, but it's like a dog walking on hind legs if I'm thinking about it."}, {"time": 4674, "text": "So you basically like to see the world in discrete ways and then physics is more continuous."}, {"time": 4682, "text": "I'm not sure if Turing would have been a great physicist."}, {"time": 4682, "text": "I think he was a pretty good chemist, but I don't know."}, {"time": 4690, "text": "But anyway, I see things..."}, {"time": 4690, "text": "I believe that computer science is largely driven by people who have brains who are good at resonating with certain kinds of concepts."}, {"time": 4714, "text": "And like quantum computers, it takes a different kind of brain."}, {"time": 4717, "text": "Well, quantum computers is almost like at the intersection in terms of brain between computer science and physics because it involves both at least at this time."}, {"time": 4730, "text": "But there is like the physicists I've known, they have incredibly powerful intuition."}, {"time": 4739, "text": "And I mean, statistical mechanics."}, {"time": 4739, "text": "So I study statistical mechanics and I mean, random processes are related to algorithms in a lot of ways."}, {"time": 4748, "text": "But there's lots of different flavors of physics as there are different flavors of mathematics as well."}, {"time": 4755, "text": "But the thing is that I don't see... Well, actually, when they talk to physicists, they use a completely different language than when they're writing expository papers."}, {"time": 4770, "text": "And so I didn't understand quantum mechanics at all from reading about it in Scientific American."}, {"time": 4776, "text": "But when I read how they describe it to each other, talking about eigenvalues and various mathematical terms that made sense, then it made sense to me."}, {"time": 4790, "text": "But Hawking said that every formula you put in a book, you lose half of your readers."}, {"time": 4798, "text": "And so he didn't put any formulas in the book."}, {"time": 4798, "text": "So I couldn't understand his book at all."}, {"time": 4802, "text": "You could say you understood it, but I really didn't."}, {"time": 4810, "text": "Well, Feynman also spoke in this way."}, {"time": 4810, "text": "So Feynman, I think, prided himself on really strong intuition."}, {"time": 4817, "text": "But at the same time, he was hiding all the really good, the deep computation he was doing."}, {"time": 4823, "text": "So there was one thing that I was never able to..."}, {"time": 4823, "text": "I wish I'd had more time to work out with him."}, {"time": 4832, "text": "But I guess I could describe it for you."}, {"time": 4832, "text": "There's something that got my name attached to it called Knuth arrow notation."}, {"time": 4839, "text": "But it's a notation for very large numbers."}, {"time": 4839, "text": "And so I find out that somebody invented it in the 1830s."}, {"time": 4848, "text": "It's fairly easy to understand anyway."}, {"time": 4848, "text": "So you start with x plus x plus x plus x n times, and you can call that xn."}, {"time": 4856, "text": "So xn is multiplication."}, {"time": 4856, "text": "Then you take x times x times x times x n times."}, {"time": 4868, "text": "That gives you exponentiation, x to the nth power."}, {"time": 4868, "text": "So that's one arrow."}, {"time": 4877, "text": "So xn with no arrows is multiplication."}, {"time": 4877, "text": "Arrow n is x to the nth power."}, {"time": 4885, "text": "So just to clarify for the..."}, {"time": 4885, "text": "So x times x times x n times is obviously xn."}, {"time": 4896, "text": "x plus x plus x n times."}, {"time": 4899, "text": "And then multiplication is x to the n. And then here the arrow is when you're doing the same kind of repetitive operation for the exponential."}, {"time": 4911, "text": "So I put in one arrow, and I get x to the nth power."}, {"time": 4911, "text": "Now I put in two arrows."}, {"time": 4911, "text": "And that takes x to the x to the x to the x n times power."}, {"time": 4917, "text": "So in other words, if it's two double arrow three, that would be two to the two to the two."}, {"time": 4928, "text": "So that would be two to the fourth power."}, {"time": 4928, "text": "That'd be 16."}, {"time": 4935, "text": "So that's the double arrow."}, {"time": 4935, "text": "And now you can do a triple arrow, of course, and so on."}, {"time": 4948, "text": "And I had this paper called, well, essentially big numbers."}, {"time": 4948, "text": "You try to impress your friend, but by saying a number they've never thought of before."}, {"time": 4958, "text": "And I gave a special name for it and designed a font for it that has script k and so on."}, {"time": 4967, "text": "But it really is 10, I think, like 10 quadruple arrow three or something like that."}, {"time": 4973, "text": "And I claim that that number is so mind boggling that you can't comprehend how large it is."}, {"time": 4980, "text": "But anyway, I talked to Feynman about this, and he said, oh, let's just use double arrow."}, {"time": 4987, "text": "But instead of taking integers, let's consider complex numbers."}, {"time": 4995, "text": "I mean, okay, x arrow arrow two, that means x to the x."}, {"time": 4995, "text": "But what about x double arrow 2.5?"}, {"time": 5007, "text": "Well, that's not too hard to figure out."}, {"time": 5007, "text": "That's interpolate between those."}, {"time": 5014, "text": "But what about x double arrow i or 1 plus i or some complex number?"}, {"time": 5022, "text": "And so he claimed that there was no analytic function that would do the job."}, {"time": 5034, "text": "But I didn't know how he could claim that that wasn't true."}, {"time": 5034, "text": "And his next question was, did then have a complex number of arrows?"}, {"time": 5051, "text": "So that's Feynman."}, {"time": 5053, "text": "That's Feynman."}, {"time": 5056, "text": "Can you describe what the Knuth Morris Pratt algorithm does?"}, {"time": 5056, "text": "And how did you come to develop it?"}, {"time": 5064, "text": "One of the many things that you're known for and has your name attached to it."}, {"time": 5068, "text": "So it should be actually Morris Pratt Knuth."}, {"time": 5068, "text": "But we decided to use alphabetical order when we published the paper."}, {"time": 5076, "text": "The problem is something that everybody knows now if they're using a search engine."}, {"time": 5082, "text": "You have a large collection of text, and you want to know if the word Knuth appears anywhere in the text, let's say, or some other word that's less interesting than Knuth."}, {"time": 5101, "text": "That's the most interesting word."}, {"time": 5105, "text": "Like Morris or something."}, {"time": 5105, "text": "Like Morris, right."}, {"time": 5107, "text": "So anyway, we have a large piece of text, and it's all one long, one dimensional thing."}, {"time": 5107, "text": "First letter, second letter, et cetera, et cetera, et cetera."}, {"time": 5116, "text": "And so you'd like to be able to do this quickly."}, {"time": 5124, "text": "And the obvious way is let's say we're looking for Morris."}, {"time": 5124, "text": "So we would go through and wait till we get to letter M. Then we look at the next word, and sure enough, it's an O, and then an R. But then, too bad, the next letter is E. So we missed out on Morris."}, {"time": 5139, "text": "And so we go back and start looking for another."}, {"time": 5152, "text": "So that's the obvious way to do it."}, {"time": 5152, "text": "And Jim Morris noticed there was a more clever way to do it."}, {"time": 5161, "text": "The obvious way would have started... Let's say we found that letter M had character position 1000."}, {"time": 5170, "text": "So it would have started next at character position 1001."}, {"time": 5176, "text": "But he said, no, look, we already read the O and the R, and we know that they aren't Ms."}, {"time": 5186, "text": "So we can start... We don't have to read those over again."}, {"time": 5186, "text": "And this gets pretty tricky when the word isn't Morris, but it's more like abracadabra, where you have patterns that are occurring."}, {"time": 5203, "text": "Like repeating patterns at the beginning, at the middle, at the end."}, {"time": 5209, "text": "So he worked it out, and he put it into the system software at Berkeley, I think it was, where he was writing some... Berkeley Unix, I think, was some routine that was supposed to find occurrences of patterns in text."}, {"time": 5223, "text": "But he didn't explain it."}, {"time": 5223, "text": "And so he found out that several months later, somebody had looked at it, didn't look right, and so they ripped it out."}, {"time": 5234, "text": "So he had this algorithm, but it didn't make it through because it wasn't understood."}, {"time": 5240, "text": "Nobody knew about this particularly."}, {"time": 5248, "text": "Von Pratt also had independently discovered it a year or two later."}, {"time": 5248, "text": "I forget why."}, {"time": 5259, "text": "I think Von was studying some technical problem about palindromes or something like that."}, {"time": 5259, "text": "He wasn't really..."}, {"time": 5268, "text": "Von wasn't working on text searching, but he was working on an abstract problem that was related."}, {"time": 5276, "text": "Well, at that time, Steve Cook was professor at Berkeley, and it was the greatest mistake that Berkeley CS department made was not to give him tenure."}, {"time": 5293, "text": "So Steve went to Toronto."}, {"time": 5293, "text": "But I knew Steve while he was at Berkeley, and he had come up with a very peculiar theorem about a technical concept called a stack automaton."}, {"time": 5309, "text": "And a stack automaton is a machine that can't do everything a Turing machine can do, but it can only look at something at the top of a stack, or it can put more things on the stack, or it can take things off of the stack."}, {"time": 5324, "text": "It can't remember a long string of symbols, but it can remember them in reverse order."}, {"time": 5331, "text": "So if you tell a stack automaton A, B, C, D, E, it can tell you afterwards E, D, C, B, A."}, {"time": 5340, "text": "It doesn't have any other memory except this one thing that it can see."}, {"time": 5383, "text": "The stack automaton goes slow, but somehow the fact that it can do it at all means that there has to be a fast way."}, {"time": 5393, "text": "So I thought this was a pretty cool theorem."}, {"time": 5399, "text": "And so I tried it out on a problem where I knew a stack automaton could do it, but I couldn't figure out a fast way to do it on a regular computer."}, {"time": 5408, "text": "I thought it was a pretty good programmer, but by golly, I couldn't think of any way to recognize this language efficiently."}, {"time": 5422, "text": "So I went through Steve Cook's construction."}, {"time": 5422, "text": "I filled my blackboard with everything that stack automaton did."}, {"time": 5429, "text": "I wrote down, and then I tried to see patterns in that."}, {"time": 5437, "text": "And how did he convert that into a computer program on a regular machine?"}, {"time": 5437, "text": "And finally, I psyched it out."}, {"time": 5444, "text": "What was the thing I was missing so that I could say, oh yeah, this is what I should do in my program."}, {"time": 5452, "text": "And now I have an efficient program."}, {"time": 5452, "text": "And so I would never have thought about that if I hadn't had his theorem, which was a purely abstract thing."}, {"time": 5469, "text": "So you used this theorem to try to intuit how to use the stack automaton for the string matching problem."}, {"time": 5476, "text": "So the problem I had started with was not the string matching problem, but then I realized that the string matching problem was another thing which could be done by a stack automaton."}, {"time": 5488, "text": "And so when I looked at what that told me, then I had a nice algorithm for this string matching problem."}, {"time": 5496, "text": "And it told me exactly what I should remember as I'm going through the string."}, {"time": 5504, "text": "And I worked it out, and I wrote this little paper called Automata Theory Can Be Useful."}, {"time": 5512, "text": "And the reason was that it was first, I mean, I had been reading all kinds of papers about automata theory, but it never improved my programming for everyday problems."}, {"time": 5516, "text": "It was something that you published in journals, and it was interesting stuff."}, {"time": 5524, "text": "But here was a case where I couldn't figure out how to write the program."}, {"time": 5531, "text": "I had a theorem from automata theory."}, {"time": 5536, "text": "Then I knew how to write the program."}, {"time": 5536, "text": "So this was, for me, a change in life."}, {"time": 5536, "text": "I started to say, maybe I should learn more about automata theory."}, {"time": 5545, "text": "And I showed this note to Vaughn Pratt, and he said, that's similar to something I was working on."}, {"time": 5552, "text": "And Jim Morris was at Berkeley, too, at the time."}, {"time": 5561, "text": "Anyway, he's had an illustrious career, but I haven't kept track of Jim."}, {"time": 5561, "text": "But Vaughn is my colleague at Stanford and my student later."}, {"time": 5569, "text": "But this was before Vaughn was still a graduate student and hadn't come to Stanford yet."}, {"time": 5578, "text": "So we found out that we'd all been working on the same thing."}, {"time": 5582, "text": "So it was our algorithm."}, {"time": 5582, "text": "We each discovered it independently, but each of us had discovered a different part of the elephant, a different aspect of it."}, {"time": 5587, "text": "And so we could put our things together with my job to write the paper."}, {"time": 5595, "text": "How did the elephant spring to life?"}, {"time": 5603, "text": "Spring to life was because I had drafted this paper, automata theory."}, {"time": 5610, "text": "It can be useful, which was seen by Vaughn and then by Jim."}, {"time": 5610, "text": "And then we combined, because maybe they had also been thinking of writing something up about it."}, {"time": 5620, "text": "About specifically the string match problem in a period."}, {"time": 5628, "text": "Last time we talked, you told me what the most beautiful algorithm is, actually, for strongly connected graphs."}, {"time": 5634, "text": "What is the hardest problem, puzzle, idea in computer science for you personally that you had to work through?"}, {"time": 5643, "text": "Just something that was just the hardest thing that I've ever been involved with."}, {"time": 5649, "text": "I don't know how to answer questions like that, but in this case, it's pretty clear because it's called the birth of the giant component."}, {"time": 5669, "text": "So now let me explain that because this actually gets into physics too."}, {"time": 5675, "text": "And it gets into something called Bose Einstein statistics."}, {"time": 5675, "text": "But anyway, it's got some interesting stories and it's connected with Berkeley again."}, {"time": 5684, "text": "So start with the idea of a random graph."}, {"time": 5692, "text": "Now, here we just say we have N points that are totally unconnected and there's no geometry involved."}, {"time": 5702, "text": "There's no saying some points are further apart than others."}, {"time": 5702, "text": "All points are exactly alike."}, {"time": 5709, "text": "And let's say we have 100 points and we number them from 0 to 99."}, {"time": 5719, "text": "Now let's take pi, the digits of pi, so two at a time."}, {"time": 5719, "text": "So we had 31, 41, 59, 26."}, {"time": 5719, "text": "We can look, go through pi."}, {"time": 5731, "text": "And so we take the first two, 31, 41, and let's put a connection between 0.31 and 0.41."}, {"time": 5741, "text": "That's an edge in the graph."}, {"time": 5741, "text": "Then we take 59, 26 and make another edge."}, {"time": 5752, "text": "And the graph gets bigger, gets more and more connected as we add these things one at a time."}, {"time": 5760, "text": "So we started out with N points and we add M edges."}, {"time": 5760, "text": "Each edge is completely, we forgot about edges we had before."}, {"time": 5770, "text": "We might get an edge twice."}, {"time": 5770, "text": "We might get an edge from a point to itself even."}, {"time": 5776, "text": "Maybe pi is going to have a run of four digits in there."}, {"time": 5776, "text": "But anyway, we're evolving a graph at random."}, {"time": 5786, "text": "And a magical thing happens when the number of edges is like 0.49 N, so maybe N is a million and I have 490,000 edges."}, {"time": 5800, "text": "Then almost all the time, it consists of isolated trees, not even any loops."}, {"time": 5818, "text": "It's a very small number of edges so far."}, {"time": 5821, "text": "A little less than half N. N, right."}, {"time": 5824, "text": "A little less than half N. But if I had 0.51 edges, so a little more than half N. So a million points, 510,000 edges."}, {"time": 5832, "text": "Now it probably has one component that's much bigger than the others."}, {"time": 5844, "text": "And we call that the giant component."}, {"time": 5850, "text": "First of all, is there a name for this kind of random, super cool pi random graph?"}, {"time": 5861, "text": "Well, I call it the pi graph."}, {"time": 5861, "text": "No, no, the pi graph is actually, my pi graph is based on binary representation of pi, not the decimal representation of pi."}, {"time": 5871, "text": "But anyway, let's suppose I was rolling dice instead."}, {"time": 5879, "text": "So it doesn't have to be pi?"}, {"time": 5887, "text": "The point is, every step, choose totally at random one of those endpoints, choose totally at random another one of those endpoints, make that an edge."}, {"time": 5893, "text": "That's the process."}, {"time": 5901, "text": "So there's nothing magical about pi?"}, {"time": 5903, "text": "No, no, I was sort of saying pi is sort of random that nobody knows the pattern in."}, {"time": 5909, "text": "Exactly, got it."}, {"time": 5911, "text": "But I could have just as well drawn straws or something."}, {"time": 5911, "text": "This was a concept invented by Erdos and Renyi, and they call it the evolution of random graphs."}, {"time": 5919, "text": "And if you start out with a large number N, and you repeat this process, all of a sudden a big bang happens at one half N. There'll be two points together, then maybe we'll have three."}, {"time": 5932, "text": "And then maybe branch out a little bit."}, {"time": 5941, "text": "But they'll all be separate until we get to one half N. And we pass one half N, and all of a sudden there's substance to it."}, {"time": 5948, "text": "There's a big clump of stuff that's all joined together."}, {"time": 5956, "text": "So it's almost like a phase transition of some kind."}, {"time": 5959, "text": "It's a phase transition, but it's a double phase transition."}, {"time": 5959, "text": "It turns out that there's actually two things going on at once at this phase transition, which is very remarkable about it."}, {"time": 5974, "text": "So a lot of the most important algorithms are based on random processes."}, {"time": 5980, "text": "And so I want to understand random processes now."}, {"time": 5980, "text": "So there are data structures that sort of grow this way."}, {"time": 5986, "text": "Okay, so Dick Karp, one of the leading experts on randomized algorithms, had his students looking at this at Berkeley."}, {"time": 5996, "text": "And we heard a rumor that the students had found something interesting happening."}, {"time": 6002, "text": "The students are generating this, or simulating this random evolution of graphs."}, {"time": 6008, "text": "And they're taking snapshots every so often to take a look at what the graph is."}, {"time": 6017, "text": "And the rumor was that every time they looked, there was only one component that had loops in it, almost always."}, {"time": 6023, "text": "They do a million experiments, and only three or four times did they ever happen to see a loop at this point."}, {"time": 6035, "text": "I mean, no, more than one component with a loop."}, {"time": 6035, "text": "So they watch it until the graph gets completely full."}, {"time": 6043, "text": "So it starts out totally empty and gets more and more edges all the time."}, {"time": 6052, "text": "And so, okay, certainly a loop comes along once."}, {"time": 6052, "text": "But now all the loops stay somehow joined to that one."}, {"time": 6059, "text": "There never were two guys with loops in these experiments."}, {"time": 6059, "text": "So anyway, almost always, certainly not always, but with very high probability this seemed to be true."}, {"time": 6079, "text": "So we heard about this rumor at Stanford, and we said, if that's true, then a lot more must also be true."}, {"time": 6086, "text": "So there's a whole theory out there waiting to be discovered that we haven't ever thought about."}, {"time": 6091, "text": "So let's take a look at it."}, {"time": 6091, "text": "And so we looked closer and we found out, no, actually, it's not true."}, {"time": 6097, "text": "But in fact, it's almost true."}, {"time": 6097, "text": "Namely, there's a very short interval of time when it's true."}, {"time": 6106, "text": "And if you don't happen to look at it during that short interval of time, then you miss it."}, {"time": 6111, "text": "So in other words, there'll be a period where there are two or three components that have loops, but they join together pretty soon."}, {"time": 6125, "text": "So if you don't have a real fast shutter speed, you're going to miss that instant."}, {"time": 6135, "text": "So separate loops don't exist for long."}, {"time": 6138, "text": "I started looking at this to make it quantitative."}, {"time": 6138, "text": "And the basic problem was to slow down the Big Bang so that I could watch it happening."}, {"time": 6145, "text": "I think I can explain it actually in fairly elementary terms, even without writing a formula, like Hawking would do."}, {"time": 6158, "text": "And so let's watch the evolution."}, {"time": 6158, "text": "And at first, these edges are coming along and they're just making things without loops, which we call trees."}, {"time": 6167, "text": "So then all of a sudden, a loop first appears."}, {"time": 6174, "text": "So at that point, I have one component that has a loop."}, {"time": 6174, "text": "Now, I say that the complexity of a component is the number of edges minus the number of vertices."}, {"time": 6181, "text": "So if I have a loop, I have like a loop of length five, it has five edges and five vertices."}, {"time": 6190, "text": "Or I could put a tail on that and that would be another edge, another vertex."}, {"time": 6201, "text": "It's like a zero, one, two complexity kind of thing."}, {"time": 6204, "text": "So if the complexity is zero, we have one loop, I call it a cycle or I call it a cyclic component."}, {"time": 6212, "text": "So a cyclic component looks like a wheel to which you attach fibers or trees."}, {"time": 6225, "text": "They go branching, but there are no more loops."}, {"time": 6225, "text": "There's only one loop and everything else feeds into that loop."}, {"time": 6229, "text": "And that has complexity zero."}, {"time": 6229, "text": "But a tree itself has complexity minus one because it might have 10 vertices and nine edges to tie them together."}, {"time": 6237, "text": "So nine minus 10 is minus one."}, {"time": 6246, "text": "So complexity minus one is a tree."}, {"time": 6246, "text": "It's got to be connected."}, {"time": 6246, "text": "That's what I mean by a component."}, {"time": 6254, "text": "So if I have 10 things connected, I have to have nine edges."}, {"time": 6261, "text": "Can you clarify why when complexity can go above zero, I'm a little confused why."}, {"time": 6268, "text": "So the complexity plus one is the number of loops."}, {"time": 6268, "text": "So if complexity is zero, I have one loop."}, {"time": 6274, "text": "If complexity is one, that means I have one more edge than I have vertices."}, {"time": 6274, "text": "So I might have like 11 edges and 10 vertices."}, {"time": 6283, "text": "So we call that a bicycle because it's got two loops in it."}, {"time": 6293, "text": "It's got to have two loops in it."}, {"time": 6293, "text": "Well, but why can't it be trees just going off of the loop?"}, {"time": 6302, "text": "I would need more edges then."}, {"time": 6302, "text": "So every time I get another loop, I get another excess of edges over vertices."}, {"time": 6308, "text": "So in other words, we start out and after I have one loop, I have one component that has a cycle in it."}, {"time": 6323, "text": "Now the next step, according to the rumor, would be that at the next step, I would have a bicycle in the evolution of almost all graphs."}, {"time": 6331, "text": "It would go from cycle to bicycle."}, {"time": 6331, "text": "But in fact, there's a certain probability it goes from cycle to two different cycles."}, {"time": 6348, "text": "And I worked out the probability was something like five out of 24."}, {"time": 6352, "text": "That's pretty high."}, {"time": 6353, "text": "It was substantial."}, {"time": 6353, "text": "But still, soon they're going to merge together almost."}, {"time": 6363, "text": "But then it splits again after you have either two or one, one."}, {"time": 6363, "text": "The next step is you either have three or you have two, one or you have one, one, one."}, {"time": 6371, "text": "And so I worked out the probability for those transitions."}, {"time": 6377, "text": "And I worked it out up to the first five transitions."}, {"time": 6377, "text": "And I had these strange numbers, five 24s."}, {"time": 6388, "text": "And I stayed up all night and about 3 a.m."}, {"time": 6388, "text": "I had the numbers computed and I looked at them."}, {"time": 6395, "text": "The denominator was something like 23023."}, {"time": 6395, "text": "The probability was something over 23023."}, {"time": 6409, "text": "I don't know how you worked that out."}, {"time": 6413, "text": "But I had a formula that I could calculate the probability."}, {"time": 6413, "text": "And I could find the limiting probability as n goes to infinity."}, {"time": 6418, "text": "And it turned out to be this number."}, {"time": 6418, "text": "But the denominator was 230."}, {"time": 6424, "text": "And I looked at the denominator and I said, wait a minute."}, {"time": 6424, "text": "This number factors because 1001 is equal to 7 times 11 times 13."}, {"time": 6431, "text": "I had learned that in my first computer program."}, {"time": 6437, "text": "So 23023 is 7 times 11 times 13 times 23."}, {"time": 6437, "text": "That's not a random number."}, {"time": 6437, "text": "There has to be a reason why those small primes appear in the denominator."}, {"time": 6451, "text": "So all of a sudden that suggested another way of looking at the problem where small prime factors would occur."}, {"time": 6461, "text": "So that said, oh, yeah, let me take the logarithm of this formula."}, {"time": 6470, "text": "And sure enough, it's going to simplify."}, {"time": 6470, "text": "And it happened."}, {"time": 6470, "text": "So I and I wouldn't have noticed it except for this factorization."}, {"time": 6479, "text": "OK, so I go to bed and I say, oh, OK, this is this looks like I'm slowing down the Big Bang."}, {"time": 6485, "text": "I can figure out what's going on here."}, {"time": 6489, "text": "And the next day it turned out Bill Gates comes to Stanford to visit."}, {"time": 6489, "text": "They're trying to sell him on donating money for a new computer science building."}, {"time": 6497, "text": "And they gave me an appointment to talk to Bill and I wrote down on the blackboard this evolutionary diagram going from one to two, five twenty fourths in all this business."}, {"time": 6513, "text": "And I wrote it down."}, {"time": 6513, "text": "And anyway, at the end of the day, he was discussing people with the development office and he said, boy, I was really impressed with what Professor Knuth said about this giant component."}, {"time": 6526, "text": "And and so, you know, I love this story because it shows that theoretical computer science is really worthwhile."}, {"time": 6536, "text": "Does Bill have you ever talked to Bill Gates about it since then?"}, {"time": 6543, "text": "Yeah, that's a cool that's a cool little moment in history."}, {"time": 6549, "text": "But anyway, he happened to visit on exactly the day after I had I had found this pattern and that allowed me to crack the problem so that I could develop the theory some more and understand what's happening in the big."}, {"time": 6565, "text": "But because I could I could now write down explicit formulas for stuff."}, {"time": 6573, "text": "And so it would work not only the first few steps, but also they'll study the whole process."}, {"time": 6579, "text": "And and I worked further and further and I with two authors, co authors, and we finally figured out that the probability that the rumor was true."}, {"time": 6585, "text": "In other words, look at the evolution of a random graph going from zero to complete and say, what's the probability that at every point in time, there was only one component with a cycle?"}, {"time": 6602, "text": "We started with this rumor saying there's only one site, there's only one component with a cycle."}, {"time": 6609, "text": "And so the rumor was it's 100%."}, {"time": 6616, "text": "Rumor was that was 100%."}, {"time": 6616, "text": "It turned out the actual numbers is like 87%."}, {"time": 6616, "text": "I should remember the number but I don't but I don't have it with me."}, {"time": 6626, "text": "But but anyway, but but the but the number it turned out to be like 12 over pi squared or eight over pi."}, {"time": 6633, "text": "Anyway, it was a nice it related to pi."}, {"time": 6642, "text": "And we could never have done that with it."}, {"time": 6642, "text": "But so that's the hardest problem I ever solved in my life was to prove that this probability is it was proven."}, {"time": 6648, "text": "The probability was proven."}, {"time": 6654, "text": "Yeah, I was able to prove this that this and this should shed light on a whole bunch of other things about random graphs."}, {"time": 6661, "text": "That was sort of the major thing we were after."}, {"time": 6667, "text": "What was the connection to physics that you mentioned?"}, {"time": 6671, "text": "Well, Bose Einstein statistics is a study of how molecules bond together without geometry."}, {"time": 6678, "text": "You created the tech typesetting system and released it as open source."}, {"time": 6693, "text": "Just on that little aspect, why did you release it as open source?"}, {"time": 6693, "text": "What is your vision for open source?"}, {"time": 6702, "text": "Okay, well that the word open source didn't exist at that time."}, {"time": 6702, "text": "But we but I didn't want proprietary rights over it."}, {"time": 6707, "text": "Because I saw how proprietary rights were holding things back."}, {"time": 6716, "text": "In the late 50s, people at IBM developed the language called Fortran."}, {"time": 6716, "text": "They could have kept it proprietary."}, {"time": 6723, "text": "They could have said only IBM can use this language."}, {"time": 6723, "text": "Everybody else has to."}, {"time": 6729, "text": "They said anybody who can translate Fortran into the language of their machines is allowed to make Fortran compilers."}, {"time": 6738, "text": "On the other hand, in the typography industry, I had seen a lot of languages that were developed for composing pages."}, {"time": 6754, "text": "And each manufacturer had his own language for composing pages."}, {"time": 6754, "text": "And that was holding everything back because people were tied to a particular manufacturer."}, {"time": 6761, "text": "And then a new equipment is invented a year later."}, {"time": 6768, "text": "But printing machines, they have to expect to amortize the cost over 20, 30 years."}, {"time": 6775, "text": "So you didn't want that for tech?"}, {"time": 6777, "text": "That for tech."}, {"time": 6777, "text": "I didn't need the income."}, {"time": 6777, "text": "I already had a good job."}, {"time": 6777, "text": "And my books were, people were buying enough books that it would bring me plenty of supplemental income for everything my kids needed for education and whatever."}, {"time": 6803, "text": "So there was no reason for me to try to maximize income any further."}, {"time": 6808, "text": "Income is sort of a threshold function."}, {"time": 6808, "text": "If you don't have enough, you're starving."}, {"time": 6816, "text": "But if you get over the threshold, then you start thinking about philanthropy or else you're trying to take it with you."}, {"time": 6821, "text": "But anyway, my income was over the threshold."}, {"time": 6831, "text": "So I didn't need to keep it."}, {"time": 6831, "text": "And so I specifically could see the advantage of making it open for everybody."}, {"time": 6842, "text": "Do you think most software should be open?"}, {"time": 6846, "text": "So I think that people should charge for non trivial software, but not for trivial software."}, {"time": 6853, "text": "Yeah, you give an example of, I think, Adobe Photoshop versus GIMP on Linux as Photoshop has value."}, {"time": 6862, "text": "So it's definitely worth paying for all this stuff."}, {"time": 6862, "text": "I mean, well, they keep adding stuff that my wife and I don't care about, but they have built in a fantastic undo feature, for example, in Photoshop where you can go through a sequence of a thousand complicated steps on graphics and then it can take you back anywhere in that sequence with really beautiful algorithms."}, {"time": 6903, "text": "I didn't think about what algorithm."}, {"time": 6903, "text": "It must be some kind of efficient representation."}, {"time": 6908, "text": "I mean, there's a lot of really subtle Nobel Prize class creation of intellectual property in there."}, {"time": 6916, "text": "And with patents, you get a limited time to, I mean, eventually the idea of patents is that you publish so that it's not a trade secret."}, {"time": 6937, "text": "That said, you've said that I currently use Ubuntu Linux on a standalone laptop."}, {"time": 6937, "text": "It has no internet connection."}, {"time": 6945, "text": "I occasionally carry flash memory drives between the machine and the Macs that I use for network surfing and graphics, but I trust my family jewels only to Linux."}, {"time": 6957, "text": "Why do you love Linux?"}, {"time": 6960, "text": "The version of Linux that I use is stable."}, {"time": 6960, "text": "Actually, I'm going to have to upgrade one of these days, but... To a newer version of Ubuntu?"}, {"time": 6970, "text": "Yeah, I'll stick with Ubuntu, but right now I'm running something that doesn't support a lot of the new software."}, {"time": 6978, "text": "The last stable, I don't remember the number, like 14."}, {"time": 6978, "text": "Anyway, it's quite... And I'm going to get a new computer."}, {"time": 6986, "text": "I'm getting new solid state memory instead of a hard disk."}, {"time": 6996, "text": "Yeah, the basics."}, {"time": 6996, "text": "Well, let me ask you, sticking on the topic of tech, when thinking about beautiful typography, what is your favorite letter, number, or symbol?"}, {"time": 7016, "text": "Ridiculous question, but is there some... Let me show you here."}, {"time": 7019, "text": "Look at the last page."}, {"time": 7031, "text": "The very end of the index."}, {"time": 7037, "text": "There's a book by Dr. Seuss called On Beyond Zebra, and he gave a name to that."}, {"time": 7042, "text": "Did you say Dr. Seuss gave a name to that?"}, {"time": 7044, "text": "Dr. Seuss, this is S, E, U, S, S, E. He wrote children's books in the 50s, 40s and 50s."}, {"time": 7054, "text": "Wait, you're talking about Cat in the Hat, Dr. Seuss?"}, {"time": 7056, "text": "Cat in the Hat, yeah."}, {"time": 7059, "text": "I like how you had the spell there."}, {"time": 7061, "text": "On Beyond Zebra, did it get to Soviet Union?"}, {"time": 7066, "text": "No, Dr. Seuss did not come to the Soviet Union, but since you... Oh, actually, I think it did actually a little bit when we were... That was a book, maybe Cat in the Hat or Green Eggs and Ham, I think was used to learn English."}, {"time": 7091, "text": "So I think it made it in that way."}, {"time": 7092, "text": "Well, my..."}, {"time": 7092, "text": "Okay, I didn't like those as much as Bartholomew Cubbins, but I used to know Bartholomew Cubbins by heart when I was young."}, {"time": 7104, "text": "So what the heck is this symbol we're looking at?"}, {"time": 7108, "text": "He has a name for it at the end of his book On Beyond Zebra."}, {"time": 7112, "text": "Who made it?"}, {"time": 7114, "text": "It looks like a bunch of vines."}, {"time": 7119, "text": "Well, is that symbol exist in fact?"}, {"time": 7121, "text": "By the way, he made a movie in the early 50s."}, {"time": 7121, "text": "I don't remember the name of the movie now."}, {"time": 7129, "text": "You can probably find it easily enough, but it features dozens and dozens of pianos all playing together at the same time."}, {"time": 7134, "text": "But all the scenery is sort of based on the kind of artwork that was in his books and the fantasy, you know, based of Seussland or something."}, {"time": 7154, "text": "And I saw the movie only once or twice, but it's quite..."}, {"time": 7154, "text": "I'd like to see it again."}, {"time": 7162, "text": "That's really fascinating that you gave him..."}, {"time": 7162, "text": "They gave him a shout out here."}, {"time": 7166, "text": "Is there some elegant basic symbol that you're attracted to?"}, {"time": 7166, "text": "Something that gives you pleasure?"}, {"time": 7174, "text": "Something you use a lot?"}, {"time": 7174, "text": "Pi?"}, {"time": 7179, "text": "Pi, of course."}, {"time": 7179, "text": "I try to use pi as often as I can when I need a random example because it doesn't have any known characters."}, {"time": 7187, "text": "So for instance, I don't have it here to show you, but do you know the game called Masyu?"}, {"time": 7199, "text": "M A S Y U?"}, {"time": 7208, "text": "It's a great recreation."}, {"time": 7208, "text": "I mean, Sudoku is easier to understand, but Masyu is more addictive."}, {"time": 7215, "text": "You have black and white stones, like on a go board, and you have to draw a path that goes straight through a white stone and makes a right angle turn at the black stone."}, {"time": 7230, "text": "And it turns out to be a really nice puzzle because it doesn't involve numbers."}, {"time": 7239, "text": "It's visual, but it's really pleasant to play with."}, {"time": 7239, "text": "So I wanted to use it as an example in art of computer programming, and I have exercises on how to design cool Masyu puzzles."}, {"time": 7248, "text": "You can find on Wikipedia certainly as an example, M A S Y U."}, {"time": 7257, "text": "And so I decided I would take pi, the actual image of it, and it had pixels, and I would put a stone wherever it belongs in the Greek letter pi."}, {"time": 7280, "text": "But the problem was, find a way to make some of the stones white, some of the stones black, so that there's a unique solution to the Masyu puzzle."}, {"time": 7286, "text": "That was a good test case for my algorithm on how to design Masyu puzzles because I insisted in advance that the stones had to be placed in exactly the positions that make the letter pi, make a Greek letter pi."}, {"time": 7300, "text": "And it turned out there was a unique way to do that."}, {"time": 7309, "text": "And so pi is a source of examples where I can prove that I'm starting with something that isn't canned."}, {"time": 7321, "text": "And most recently, I was writing about something called graceful graphs."}, {"time": 7328, "text": "Graceful graphs is the following."}, {"time": 7328, "text": "You have a graph that has M edges to it, and you attach numbers to every vertex in the following way."}, {"time": 7340, "text": "So every time you have an edge between vertices, you take the difference between those numbers, and that difference has got to be..."}, {"time": 7354, "text": "I'll tell you what edge it is."}, {"time": 7354, "text": "So one edge, two numbers will be one apart."}, {"time": 7354, "text": "There'll be another edge where the numbers are two apart."}, {"time": 7361, "text": "And so it's a great computer problem."}, {"time": 7361, "text": "Can you find a graceful way to label a graph?"}, {"time": 7368, "text": "So I started with a graph that I use for an organic graph, not a mathematically symmetric graph or anything."}, {"time": 7375, "text": "And I take 49 states of the United States, the edges go from one state to the next state."}, {"time": 7384, "text": "So for example, California be next to Oregon, Nevada, Arizona."}, {"time": 7392, "text": "And I include District of Columbia, so I have 49."}, {"time": 7392, "text": "I can't get Alaska and Hawaii in there because they don't touch."}, {"time": 7404, "text": "You have to be able to drive from one to the other."}, {"time": 7410, "text": "So is there a graceful labeling of the United States?"}, {"time": 7410, "text": "Each state gets a number, and then if California is number 30 and Oregon is number 11, that edge is going to be number 19, the difference between those, okay?"}, {"time": 7425, "text": "So is there a way to do this for all the states?"}, {"time": 7425, "text": "And so I was thinking of having a contest for people to get it as graceful as they could."}, {"time": 7432, "text": "But my friend, Tom Rokicki, actually solved the problem by proving that, I mean, I was able to get it down within seven or something like that."}, {"time": 7450, "text": "He was able to get a perfect solution."}, {"time": 7454, "text": "The actual solution or to prove that a solution exists?"}, {"time": 7457, "text": "Well, more precisely, I had figured out a way to put labels on so that all the edges were labeled somewhere between 1 and 117, but there were some gaps in there because I should really have gone from 1 to 105 or whatever the number is."}, {"time": 7472, "text": "So I gave myself a lot of slack."}, {"time": 7472, "text": "He did it without any slack whatsoever, a perfect graceful labeling."}, {"time": 7481, "text": "And so I called out the contest because the problem's already solved and too easy in a sense because Tom was able to do it in an afternoon."}, {"time": 7495, "text": "Sorry, he gave the algorithm or for this particular... For the United States."}, {"time": 7500, "text": "For the United States."}, {"time": 7501, "text": "This problem is incredibly hard."}, {"time": 7501, "text": "I mean... For the general algorithm."}, {"time": 7505, "text": "But it was very lucky that it worked for the United States, I think."}, {"time": 7513, "text": "The theory is still very incomplete."}, {"time": 7513, "text": "But anyway, then Tom came back a couple of days later and he had been able to not only find a graceful labeling, but the label of Washington was 31, and the label of Idaho was 41, following the digits of pi."}, {"time": 7526, "text": "Going across the top edge of the United States, he has the digits of pi perfectly."}, {"time": 7541, "text": "Did he do it on purpose?"}, {"time": 7543, "text": "He was able to still get a graceful labeling with that extra thing."}, {"time": 7551, "text": "And it's a miracle, okay?"}, {"time": 7551, "text": "But I like to use pi in my book, you see."}, {"time": 7562, "text": "All roads lead to pi."}, {"time": 7562, "text": "Somehow often hidden in the middle of the most difficult problems."}, {"time": 7572, "text": "Can I ask you about productivity?"}, {"time": 7576, "text": "Productivity."}, {"time": 7577, "text": "Yeah, you said that, quote, my scheduling principle is to do the thing I hate most on my to do list."}, {"time": 7585, "text": "By week's end, I'm very happy."}, {"time": 7585, "text": "Can you explain this process to a productive life?"}, {"time": 7593, "text": "Well, but all the time I'm working on what I don't want to do, but still, I'm glad to have all those unpleasant tasks finished."}, {"time": 7602, "text": "Is that something you would advise to others?"}, {"time": 7606, "text": "Well, yeah, I don't know how to say it."}, {"time": 7606, "text": "During the pandemic, I feel my productivity actually went down by half because I have to communicate by writing, which is slow."}, {"time": 7614, "text": "I don't like to send out a bad sentence."}, {"time": 7627, "text": "So I go through and reread what I've written and edit and fix it."}, {"time": 7627, "text": "So everything takes a lot longer when I'm communicating by text messages instead of just together with somebody in a room."}, {"time": 7645, "text": "And it's also slower because the libraries are closed and stuff."}, {"time": 7651, "text": "But there's another thing about scheduling that I learned from my mother that I should probably tell you, and that is it's different from what people in the robotics field do, which is called planning."}, {"time": 7662, "text": "So she had this principle that was, see something that needs to be done and do it."}, {"time": 7674, "text": "Instead of saying, I'm going to do this first and do this first, just pick this up."}, {"time": 7683, "text": "But at any one moment, there's a set of tasks that you can do."}, {"time": 7683, "text": "And you're saying a good heuristic is to do the one you want to do least."}, {"time": 7695, "text": "The one I haven't got any good reason, that I'll never be able to do it any better than I am now."}, {"time": 7700, "text": "There are some things that I know, if I do something else first, then I'll be able to do that one better."}, {"time": 7713, "text": "But there are some that are going to be harder because I've forgotten some of the groundwork that went into it or something like that."}, {"time": 7720, "text": "So I just finished a pretty tough part of the book."}, {"time": 7726, "text": "And so now I'm doing the parts that are more fun."}, {"time": 7726, "text": "But the other thing is, as I'm writing the book, of course, I want the reader to think that I'm happy all the time I'm writing the book."}, {"time": 7742, "text": "It's upbeat."}, {"time": 7742, "text": "I can have humor."}, {"time": 7742, "text": "I can say this is cool."}, {"time": 7742, "text": "And this, I have to disguise the fact that it was painful in any way to come up with these."}, {"time": 7758, "text": "The road to that excitement is painful."}, {"time": 7758, "text": "It's laden with pain."}, {"time": 7758, "text": "You've given some advice to people before, but can you... You give me too much credit."}, {"time": 7770, "text": "But anyway, this is my turn to say things that I believe."}, {"time": 7770, "text": "But I want to preface it by saying I also believe that other people do these things much better than I do."}, {"time": 7788, "text": "So I can only tell you my side of it."}, {"time": 7792, "text": "So can I ask you to give advice to young people today, to high school students, to college students, whether they're geeks or the other kind, about how to live a life that they can be proud of, how to have a successful career, how to have a successful life?"}, {"time": 7813, "text": "It's always the same as I've said before, I guess, not to do something because it's trendy, but something that you personally feel that you were called to do rather than somebody else expects you to do."}, {"time": 7832, "text": "How do you know you're called to do something?"}, {"time": 7837, "text": "If you try it and it works or it doesn't work."}, {"time": 7837, "text": "I mean, you learn about yourself."}, {"time": 7837, "text": "Life is a binary search."}, {"time": 7845, "text": "You try something and you find out, oh yeah, I have a background that helped me with this."}, {"time": 7849, "text": "Or maybe I could do this if I worked a little bit harder."}, {"time": 7849, "text": "But you try something else and you say, well, I have really no intuition for this and it looks like it doesn't have my name on it."}, {"time": 7864, "text": "Was there advice along the way that you got about what you should and shouldn't work on?"}, {"time": 7872, "text": "Or do you just try to listen to yourself?"}, {"time": 7872, "text": "Yeah, I probably overreact another way."}, {"time": 7878, "text": "When I see everybody else going some way, I probably say, hmm, not too much competition."}, {"time": 7887, "text": "But mostly I played with things that were interesting to me and then later on I found, oh, actually the most important thing I learned was how to be interested in almost anything."}, {"time": 7903, "text": "I mean, not to be bored."}, {"time": 7903, "text": "It makes me very sad when I see kids talking to each other and they say, that was boring."}, {"time": 7911, "text": "And to me, a person should feel upset if he had to admit that he wasn't able to find something interesting."}, {"time": 7926, "text": "It's a skill they think, I haven't learned how to enjoy life."}, {"time": 7933, "text": "I have to have somebody entertain me instead of..."}, {"time": 7940, "text": "It is a skill."}, {"time": 7940, "text": "David Foster Wallace, I really like the thing he says about this, which is the key to life is to be unborable."}, {"time": 7947, "text": "And I do really like you saying that it's a skill because I think that's a really good advice, which is if you find something boring, that's not..."}, {"time": 7960, "text": "I don't believe it's because it's boring."}, {"time": 7960, "text": "It's because you haven't developed a skill."}, {"time": 7969, "text": "I haven't learned how to... How to find the beauty in that, how to find the fun in it."}, {"time": 7971, "text": "That's a really good point."}, {"time": 7978, "text": "Sometimes it's more difficult than others to do this."}, {"time": 7978, "text": "I mean, during the COVID, lots of days when I never saw another human being, but I still find other ways to..."}, {"time": 7994, "text": "It still was a pretty fun time."}, {"time": 7998, "text": "I came a few minutes early today and I walked around Foster City."}, {"time": 7998, "text": "I didn't know what was going on in Foster City."}, {"time": 8008, "text": "I saw some beautiful flowers at the nursery at Home Depot a few blocks away."}, {"time": 8014, "text": "It's full of amazing things like this."}, {"time": 8014, "text": "Sometimes I'll sit there and just stare at a tree."}, {"time": 8022, "text": "Nature is beautiful."}, {"time": 8022, "text": "Let me ask you the big ridiculous question."}, {"time": 8028, "text": "I don't think I asked you last time."}, {"time": 8028, "text": "So I have to ask this time in case you have a good answer."}, {"time": 8032, "text": "Our existence here on earth, the whole thing."}, {"time": 8046, "text": "No, no, you can't."}, {"time": 8046, "text": "I will not allow you to try to escape answering this question."}, {"time": 8051, "text": "You have to answer definitively because surely, surely, Don Knuth, there must be an answer."}, {"time": 8059, "text": "What is the answer?"}, {"time": 8059, "text": "Is it 42?"}, {"time": 8062, "text": "Well, I don't think it's a numerical."}, {"time": 8062, "text": "That's the SDS."}, {"time": 8066, "text": "That was in Zen and... All right."}, {"time": 8066, "text": "So anyway, it's only for me, but I personally think of my belief that God exists, although I have no idea what that means."}, {"time": 8077, "text": "But I believe that there is something beyond human capabilities."}, {"time": 8088, "text": "It might be some AI, but whatever it is."}, {"time": 8088, "text": "But whatever."}, {"time": 8106, "text": "But I do believe that there is something that goes beyond the realm of human understanding, but that I can try to learn more about how to resonate with whatever that being would like me to do."}, {"time": 8129, "text": "So you think you can have occasional glimpses of that being?"}, {"time": 8134, "text": "I strive for that."}, {"time": 8134, "text": "Not that I ever think I'm going to get close to it, but it's not for me."}, {"time": 8142, "text": "It's saying, what should I do that that being wants me to do?"}, {"time": 8149, "text": "I'm trying to ask, does that being want me to be talking to Lex Friedman right now?"}, {"time": 8169, "text": "What I'm trying to say is, of all the strategies I could choose or something, I try to do it not strategically, but I try to imagine that I'm following somebody's wishes."}, {"time": 8193, "text": "Even though you're not smart enough to know what they are."}]}]