[{"title": "Skye Fitzgerald: Hunger, War, and Human Suffering | Lex Fridman Podcast #278", "id": "dHTgffkpeYo", "quotes": [{"time": 374, "text": "She didn't have a chance to discover love."}, {"time": 376, "text": "She didn't have a chance to have a career."}, {"time": 379, "text": "She was robbed of all of those things because of the insidious nature of hunger that she was born into."}, {"time": 386, "text": "She didn't have to die, she was not starving."}, {"time": 392, "text": "Her mother was being starved because of the blockade over the country."}, {"time": 397, "text": "Now, who instituted that blockade?"}, {"time": 399, "text": "MBS in Saudi Arabia with the reinforcement and sort of tacit approval of the United States, our own government here."}, {"time": 408, "text": "And so there are people who are responsible for the starvation of children and I think we need to hold them accountable."}, {"time": 415, "text": "Now, that's incredibly difficult to do, but just because it's difficult doesn't mean it ought not to be done."}, {"time": 423, "text": "And we'll talk about many cases like these throughout history and going on today."}, {"time": 428, "text": "Let's talk about Hunger Ward."}, {"time": 430, "text": "Let's dive in."}, {"time": 432, "text": "You've been nominated for an Oscar twice."}, {"time": 434, "text": "This is one of the times for a documentary."}, {"time": 441, "text": "Can you please tell me what Hunger Ward, The Last Hope Between War and Starvation is about?"}, {"time": 447, "text": "Hunger Ward is a short documentary that really is an attempt to illustrate the effects of the conflict on Yemen, specifically on civilians."}, {"time": 460, "text": "And we document it in both the north and the south of the country because it's a bifurcated country."}, {"time": 466, "text": "The south is held by the globally recognized government in the south, which up until last week was run by, at least on the surface, by President Hadi holed up in Riyadh."}, {"time": 480, "text": "He was essentially removed from office last week by, most people would agree, the Emiratis and the Saudis to put in place a presidential council."}, {"time": 492, "text": "So we wanted to show that starvation was happening in very similar fashions, both in the south and the north."}, {"time": 499, "text": "And we wanted to do this film because so few people in the west know anything about the conflict in Yemen, nor the US's complicity in it."}, {"time": 512, "text": "And so my intent with the project was try to bring it to a larger western audience as an attempt to intervene and change the political status quo, which allows the use of starvation in Yemen to continue."}, {"time": 524, "text": "So US complicity, who are the bad guys?"}, {"time": 529, "text": "Now, the world, unfortunately, cannot be painted in black and white of good guys and bad guys."}, {"time": 536, "text": "But for the purpose of conversation, who is causing suffering in the world in this situation?"}, {"time": 546, "text": "Who started the war?"}, {"time": 549, "text": "And then, of course, the roots of war go back in history."}, {"time": 554, "text": "But let's start at the top."}, {"time": 557, "text": "Well, there are bad actors and there are less bad actors."}, {"time": 560, "text": "I mean, I think that's always the case in war, probably."}, {"time": 562, "text": "And everybody loses in war."}, {"time": 564, "text": "Yeah, I concur with that statement."}, {"time": 568, "text": "In the case of the status quo in Yemen right now, it's a completely asymmetrical war."}, {"time": 575, "text": "And so the Saudi coalition, which is made up of primarily Saudi Arabia, the Emiratis, United States, France, Britain, supplying weapons, but it's really driven and catalyzed by Saudi Arabia."}, {"time": 592, "text": "And it's asymmetrical to a great extent just because of the incredible firepower by air that the Saudis use continuously to pummel Northern Yemen."}, {"time": 604, "text": "When I was there, the sheer volume of airstrikes is hard to describe."}, {"time": 610, "text": "And we show the result of only one in the film, really."}, {"time": 614, "text": "But it's an asymmetrical war."}, {"time": 616, "text": "The de facto authorities of the North, Ansar Allah, also known as the Houthi rebel group, they don't have an air force, right?"}, {"time": 625, "text": "They have a drone force, but they don't have an air force."}, {"time": 627, "text": "And so from a military standpoint, it's completely asymmetrical."}, {"time": 631, "text": "The Saudis really don't commit troops to the ground."}, {"time": 634, "text": "They use only proxies to fight on the ground."}, {"time": 637, "text": "What is the narrative they use to justify war?"}, {"time": 642, "text": "So there's a story on every side in war."}, {"time": 646, "text": "Some of it is grounded in truth."}, {"time": 649, "text": "Some of it is not at all grounded in truth, also known as propaganda."}, {"time": 654, "text": "What's the narrative used by the Saudis for this war?"}, {"time": 658, "text": "The Saudi line is essentially that the Houthis are an illegitimate government, and that it's really a proxy war between Iran, who supports the Houthis nominally, and the rest of the world."}, {"time": 672, "text": "That's the Saudi narrative."}, {"time": 674, "text": "The reality is something altogether different."}, {"time": 676, "text": "While the Houthis do receive support from Iran, this is a war started by and sustained by MBS in Saudi Arabia."}, {"time": 685, "text": "Who's MBS?"}, {"time": 685, "text": "Mohammed bin Salman."}, {"time": 687, "text": "And who is he?"}, {"time": 688, "text": "He is the son of the ruler of Saudi Arabia."}, {"time": 692, "text": "What's his power?"}, {"time": 693, "text": "I'm asking basic dumb questions."}, {"time": 695, "text": "He's the de facto ruler."}, {"time": 697, "text": "Of the military and the..."}, {"time": 699, "text": "Yes, he seized control of the country several years ago, even though he, on the surface, is not the ruler of Saudi Arabia, he is."}, {"time": 706, "text": "He's the crown prince."}, {"time": 707, "text": "I'm sorry to interrupt often, but who is he as a man?"}, {"time": 712, "text": "What's your sense of the... Yeah, so I've never met him, and I likely will never meet him, hopefully."}, {"time": 719, "text": "But he is, I know a lot about him through his actions, sort of in the MENA region, Middle East and North Africa region."}, {"time": 727, "text": "And he is one of three, in my view, as an American sitting here in the US, three people in the world that I think has caused such an incredible volume of misery and suffering and murder on this planet that I think if he weren't around, the world would be a lot better place."}, {"time": 755, "text": "And I'm not a violent person by nature, but there are three human beings that I think the world would be better off without."}, {"time": 762, "text": "Do you mind, before I ask other questions, mentioning the three?"}, {"time": 766, "text": "Oh, yeah, Assad is one in Syria, and that comes out of an earlier project that I did in Syria and Turkey, and what I saw Assad as a ruler do to his own people."}, {"time": 781, "text": "And Putin would be the third."}, {"time": 783, "text": "Those three human beings are murderers on a scale beyond imagining."}, {"time": 791, "text": "On MBS, are you able to think as a documentary filmmaker, as a human being, as a scholar, as a thinker, with an open mind about a man like that who does evil onto the world, and what that must feel like to be inside the mind of that man?"}, {"time": 808, "text": "So basically, consider his worldview."}, {"time": 811, "text": "With most evil people, with all people, probably, but with people who do evil onto the world, they think they're doing good."}, {"time": 820, "text": "They're the hero of their own story."}, {"time": 821, "text": "Right, and so to be able to place yourself, I feel like, for me, to understand a person, I have to literally, like the way actors kind of have to do, you know, live inside the body of the person they're trying to study."}, {"time": 837, "text": "Inhabit the character."}, {"time": 838, "text": "Inhabit the person."}, {"time": 839, "text": "So are you able to do that, or because you are also studying the people who suffer as a result, as a consequence of their actions, you just, you put them in a box, and you say, I hate the person in that box."}, {"time": 855, "text": "I'm going to move on."}, {"time": 857, "text": "This goes back to your black and white statement at the beginning, right?"}, {"time": 860, "text": "It's like, the world as a whole, of course, you know, is every gradation of gray, right?"}, {"time": 866, "text": "My background is theater, Lex, and so I was trained long before I picked up a camera to inhabit other characters, right?"}, {"time": 874, "text": "I have two degrees in theater, and so that level of sort of like walking in other people's shoes and trying to understand and empathize with their worldview is fundamental to how I live my life and how I do my work."}, {"time": 887, "text": "So in the case of those three that I named, Assad, MBS, and Putin, yeah, I can go there and think through how they came to be, who they are, right, from afar, right?"}, {"time": 899, "text": "And after I go through that process, I still don't think there's any way that one can justify what they've done."}, {"time": 910, "text": "We're going to talk about each of those people, for sure."}, {"time": 914, "text": "Well, I'm not an expert on any of them."}, {"time": 916, "text": "Well, you're a human being, which makes you a partial expert on human nature because nobody's an expert."}, {"time": 924, "text": "You're just as good as anyone else."}, {"time": 926, "text": "Anybody who actually carries a camera and listens and observe others isn't especially an expert of human nature."}, {"time": 935, "text": "Who's willing to take that leap and truly understand somebody of any level, not leaders."}, {"time": 941, "text": "I feel like to understand a leader, you have to first understand humans, and to understand humans, you have to see humans at their worst and their best, which is something that you've definitely done."}, {"time": 952, "text": "So let's stick on Hunger Ward."}, {"time": 954, "text": "This lens that you've chosen to look at this is through a single, maybe you can speak to that."}, {"time": 960, "text": "You've mentioned the starvation as a result of war."}, {"time": 966, "text": "What is the documentary?"}, {"time": 968, "text": "Like, what is the lens you've chosen to give the world a peek at the results, at the suffering that's a result of this war?"}, {"time": 978, "text": "People a lot of times will ask me if they've seen Hunger Ward, you know."}, {"time": 984, "text": "They ask where the hope is, right?"}, {"time": 986, "text": "You read the byline earlier, The Lost Hope."}, {"time": 992, "text": "And what I try to focus on in many of my films, including Hunger Ward, is in the very difficult context of war, as the case is in Hunger Ward in Yemen, I look for hope, and I look for inspiration, and I do that through people who are doing incredible things under the most difficult circumstances."}, {"time": 1016, "text": "So when I set out to do a film about starvation in Yemen, right?"}, {"time": 1024, "text": "I mean, just listen to that statement."}, {"time": 1026, "text": "Where's the hope there, right?"}, {"time": 1028, "text": "And yet what I found, what I discovered, were human beings that we could tell the story through who are incredible, inspirational human beings doing amazing things every day."}, {"time": 1040, "text": "One of those is Makiya Maji, a nurse practitioner in the north of the country at a small rural clinic."}, {"time": 1047, "text": "And another is Dr. Aida Al Sadiq, who's a pediatrician in the south of the country."}, {"time": 1053, "text": "And so we chose to tell the story sort of through their experiences as caregivers, devoting their lives to try to save this entire cohort, this entire generation of children that has been born into starvation."}, {"time": 1068, "text": "And that's an incredible, difficult task, but equally inspirational to watch these human beings devote every minute of every day to save a child."}, {"time": 1080, "text": "I mean, in my view, nothing is more important than that action."}, {"time": 1084, "text": "Maybe on that point, real quick."}, {"time": 1087, "text": "So there is suffering at scale, starvation at scale."}, {"time": 1091, "text": "There's, I mean, the numbers, maybe you can mention in Yemen, what are the numbers in terms of people in starvation, but from a perspective of a nurse practitioner or a doctor, you always have, you're treating one person in front of you."}, {"time": 1108, "text": "So how do you make sense of that calculus, of like there's a huge number of people suffering, and then there's just the person in front of you?"}, {"time": 1117, "text": "Is that all we can do as humans, is just to help one person at a time?"}, {"time": 1125, "text": "Is that the right way to think and to approach these problems or can you actually make sense of the numbers?"}, {"time": 1132, "text": "Speaking just as a human being, I think the scale of suffering is so great in Yemen that I think I'd be overwhelmed if I focused on that scale."}, {"time": 1146, "text": "You've probably heard that a child dies every 75 seconds in Yemen from hunger."}, {"time": 1154, "text": "So we've been sitting here, how long?"}, {"time": 1156, "text": "35 minutes or so."}, {"time": 1159, "text": "That's a good handful of children that have already passed away."}, {"time": 1163, "text": "So to overcome sort of, I think, that danger of psychic numbing, which can happen when you think about suffering on such a large scale, as a filmmaker, as a human being, I have to focus in on the individuals, on those human beings in front of me."}, {"time": 1178, "text": "And I think that's exactly what Dr. Al Sadiq and Makiya do to keep going each day."}, {"time": 1183, "text": "And one of the amazing things about these two healthcare providers that we showcased in the film is that they treat anyone who shows up, right?"}, {"time": 1193, "text": "They don't have to have money."}, {"time": 1195, "text": "They don't have to have any resources."}, {"time": 1197, "text": "They just have to get to the clinic or the hospital."}, {"time": 1200, "text": "And it's incredibly moving to see sort of the flexibility of their thinking in terms of how they make that work."}, {"time": 1208, "text": "Makiya, for example, I saw her in the north of the country."}, {"time": 1212, "text": "It's an incredibly rural clinic that she works at."}, {"time": 1214, "text": "So it's like a magnet for all the cases in the north of the country."}, {"time": 1218, "text": "People come from hundreds of kilometers away sometimes for specialty treatment of pediatric malnutrition."}, {"time": 1225, "text": "And one time I saw a child come in and it was a male relative that brought this young girl in."}, {"time": 1233, "text": "And just because of sort of the gender dynamics in Yemen, there had to be a parent or a relative there to stay with the child while they're at the clinic."}, {"time": 1243, "text": "And it was a male relative."}, {"time": 1245, "text": "And so what many doctors in that instance would do would just turn them away."}, {"time": 1251, "text": "And instead what Makiya did is she walked into one of the rooms, talked to one of the other mothers and convinced them to become the temporary guardian, essentially, of this child until a female relative could arrive."}, {"time": 1264, "text": "So, you know, she's flexible."}, {"time": 1266, "text": "She finds solutions rather than allowing the problems to deter solutions."}, {"time": 1271, "text": "One child at a time."}, {"time": 1272, "text": "Yeah, yeah, one child at a time."}, {"time": 1273, "text": "You mentioned that you saw a child die in front of you."}, {"time": 1282, "text": "So when you're filming this as a filmmaker, what's that like psychologically, philosophically, creatively as a filmmaker, as a storyteller?"}, {"time": 1299, "text": "What do you do there as a human and as a filmmaker?"}, {"time": 1303, "text": "Or what's that whole experience like?"}, {"time": 1305, "text": "Because you get to, like you said, you take it to the whole journey of a starving mother giving birth to a starving child."}, {"time": 1314, "text": "It's not something I want to film."}, {"time": 1317, "text": "It's not something that I certainly wanted to happen or seek out, but it happened."}, {"time": 1325, "text": "And the sad truth is that it happens every week at that hospital."}, {"time": 1329, "text": "And so when it happened in this instance, I felt an incredible responsibility to do justice to that reality, to acknowledge that a child had just died of starvation related causes."}, {"time": 1346, "text": "And to find some way, if the parents wanted us to, to integrate that into this story we bring back to a Western audience."}, {"time": 1359, "text": "And I've filmed many difficult things over the years."}, {"time": 1369, "text": "And usually I really love filming."}, {"time": 1374, "text": "And I didn't love filming Hunger Ward."}, {"time": 1376, "text": "It was not a process that I enjoyed on any way, show, perform, sadly, because of the content."}, {"time": 1384, "text": "Because who wants to watch a child die in front of them?"}, {"time": 1386, "text": "I don't, but I did."}, {"time": 1388, "text": "And I had to."}, {"time": 1390, "text": "And when that happened, I felt an incredible responsibility again, to go deep, right?"}, {"time": 1397, "text": "To go deep with that family, to tell the story of this hospital with every sort of ounce of focus and talent that I could bring to the story."}, {"time": 1408, "text": "Because people should know that children are dying of starvation right now as we sit here."}, {"time": 1416, "text": "And that that doesn't have to happen."}, {"time": 1417, "text": "And it is happening because of political dynamics that we can intervene on."}, {"time": 1422, "text": "Is there times you wanted to walk away, quit the telling of the story, come back to the United States where you can just appreciate the wonderful comfort you can have just sitting there and having food and freedom to do whatever you want, those kinds of things."}, {"time": 1453, "text": "Doesn't have to be in the United States."}, {"time": 1455, "text": "In a lot of places in the world."}, {"time": 1457, "text": "Well, that dynamic of sort of like survivor's guilt on some level definitely exists."}, {"time": 1463, "text": "One of the hardest things from Hunger Report actually was eating, right?"}, {"time": 1468, "text": "Because we were in these malnutrition clinics, they're called TFCs, Therapeutic Feeding Centers, where over a long period of time, children lost the ability to eat normal food, right?"}, {"time": 1485, "text": "And couldn't digest it and just were literally starving."}, {"time": 1489, "text": "And the practitioners were trying to bring them back to a state of thriving."}, {"time": 1495, "text": "But to leave those clinics, right?"}, {"time": 1498, "text": "And to go to our camp or to go to our hotel and then to have access to food, right?"}, {"time": 1503, "text": "Because we could buy food on the streets and in the hotels."}, {"time": 1508, "text": "I mean, it was a very intentional act throughout the course of the shoot to look at a piece of bread, right?"}, {"time": 1514, "text": "Or to look at a bowl of rice and think about that child in the TFC and think about how the privilege of having that bowl of rice that I could eat and digest."}, {"time": 1526, "text": "So it certainly every day helped me appreciate, right?"}, {"time": 1531, "text": "The privilege I had."}, {"time": 1533, "text": "Every bite you take."}, {"time": 1534, "text": "With every bite, absolutely."}, {"time": 1536, "text": "And so I wouldn't call it guilt."}, {"time": 1538, "text": "It wasn't exactly guilt, but it was definitely mindfulness, right?"}, {"time": 1542, "text": "Meditate on the suffering of people who can't."}, {"time": 1547, "text": "That's right, exactly."}, {"time": 1548, "text": "So that knowledge sort of, it was catalytic in some ways."}, {"time": 1552, "text": "It sort of moved us forward really wanting to shape the most powerful story we could because we were surrounded by so much suffering."}, {"time": 1560, "text": "So much suffering every day."}, {"time": 1563, "text": "How did filming that movie change you as a man?"}, {"time": 1567, "text": "As a human being?"}, {"time": 1569, "text": "You've filmed a few difficult documentaries."}, {"time": 1574, "text": "That one is a heavy one."}, {"time": 1576, "text": "When you think of the person you were before you filmed it, and now when you wake up every morning and look yourself in the mirror, how is that person different?"}, {"time": 1585, "text": "Every documentary I do changes me in a different way."}, {"time": 1589, "text": "Like I am not static in that sense, right?"}, {"time": 1592, "text": "And preformed, it's like I change with every project because so many of them are difficult and challenging, right?"}, {"time": 1600, "text": "And so in order to do them, I have to allow myself to change and be changed by them."}, {"time": 1606, "text": "In the case of Hunger Ward, you may remember the girl Omeima, who's the 10 year old girl who we showcase in Auden in the south of the country."}, {"time": 1618, "text": "And we were there when she was admitted to the hospital."}, {"time": 1624, "text": "And when she was admitted, this 10 year old girl weighed 24 pounds and she could barely stand up."}, {"time": 1634, "text": "And we started with the permission of the family to start to document her treatment and to see what would happen with this young girl who is so severely malnourished."}, {"time": 1647, "text": "And we watched her be treated by the nurses and the doctors in Sadaka Hospital."}, {"time": 1655, "text": "And slowly over the course of a couple of weeks, we saw her change."}, {"time": 1660, "text": "We saw her start to sort of gain strength and start to recover."}, {"time": 1665, "text": "And she also watched the caregivers very carefully."}, {"time": 1670, "text": "And I watched her watch them."}, {"time": 1674, "text": "And I'll never forget there was a moment where about two and a half weeks, I think, into her treatment, we walked into a room and I saw her offering a cap full of water to another younger child who was also starving."}, {"time": 1695, "text": "The shot's actually in the film."}, {"time": 1697, "text": "And so to see Omeima, this child who's starving, giving sustenance to a younger, more vulnerable child who is also starving, moved me deeply."}, {"time": 1711, "text": "So I saw her learn from the caregivers around her."}, {"time": 1718, "text": "And as a human being, as a filmmaker, I was incredibly inspired by Omeima."}, {"time": 1724, "text": "That capacity for compassion is there."}, {"time": 1726, "text": "Even within a 10 year old girl who's starving."}, {"time": 1729, "text": "And so you asked what changed me."}, {"time": 1732, "text": "That's one moment, right?"}, {"time": 1734, "text": "Rather than being crushed by such heavy content, it was actually the opposite, where I came away inspired by a 10 year old girl."}, {"time": 1742, "text": "And I didn't anticipate that."}, {"time": 1745, "text": "I didn't think that's what this content would do, but it's what it did."}, {"time": 1748, "text": "It reinforced for me sort of this incredible capacity we all have as human beings, right?"}, {"time": 1756, "text": "To do good, right?"}, {"time": 1757, "text": "To even within the most difficult circumstances, to choose who we become and what we do."}, {"time": 1764, "text": "And a 10 year old girl taught me that or reinforced that for me."}, {"time": 1769, "text": "Were you able to feel the culture of the people, so the language barrier, were you able to break through the language barrier, the culture barrier, to understand the people?"}, {"time": 1785, "text": "Because even suffering has a language of sorts, depending on where you are."}, {"time": 1790, "text": "The way people joke about things, the way they cry, the way."}, {"time": 1795, "text": "This is an interesting thing I actually wanna ask you."}, {"time": 1797, "text": "Sorry, I'm asking a million questions."}, {"time": 1800, "text": "I find that the people, I've been talking to people in Ukraine and Russia, but in general, I've gotten a chance to talk to people who've been through trauma in their life."}, {"time": 1813, "text": "And there's a humor they have about trauma in hard times."}, {"time": 1820, "text": "It depends on the culture, of course."}, {"time": 1822, "text": "Certainly, Russian speaking folk, I mean, the more suffering you've experienced, for some reason, the more they joke about it."}, {"time": 1831, "text": "It's almost like they're able to see something deep about humanity now that they have suffered and they're able to laugh at the absurdity, the injustice of it all."}, {"time": 1842, "text": "And you could also say it's a way for them to deal with it."}, {"time": 1845, "text": "But that humor has a kind of profound understanding within it about what it means to be human."}, {"time": 1857, "text": "That I just, and then you, to really understand it, you have to know the language."}, {"time": 1862, "text": "So I guess I'm asking, were you able to really feel the humans on the other side of the language?"}, {"time": 1869, "text": "I'd like to think so."}, {"time": 1870, "text": "I mean, as you noted, there are universities and there are universals in life that transcend language."}, {"time": 1879, "text": "I mean, suffering is suffering."}, {"time": 1881, "text": "Love is love."}, {"time": 1883, "text": "Compassion doesn't take place only through language."}, {"time": 1888, "text": "It's through actions."}, {"time": 1889, "text": "And so was there a language barrier?"}, {"time": 1893, "text": "Did we try to bridge that through other means and sort of universal emotions and experiences?"}, {"time": 1902, "text": "That's one of the things I always think about when I'm filming is how do we distill down to universals through imagery, through the vocabulary of cinema?"}, {"time": 1914, "text": "Because I believe so deeply that that vocabulary should be visual."}, {"time": 1918, "text": "So the words, what's the most powerful way to express the universal?"}, {"time": 1923, "text": "Is it visual or is it language words?"}, {"time": 1927, "text": "I think it's visual."}, {"time": 1929, "text": "And we're talking about the human face or human face, human body, everything."}, {"time": 1934, "text": "Through actions as well."}, {"time": 1935, "text": "Actions, the dynamic."}, {"time": 1936, "text": "I'm thinking about a woman named Salha in the film who isn't named, but you see her multiple times throughout the film."}, {"time": 1946, "text": "And she's basically the matron of the ward in the South."}, {"time": 1949, "text": "And she's the gatekeeper for the ward."}, {"time": 1951, "text": "So no one enters that ward without her permission."}, {"time": 1953, "text": "She's literally the gatekeeper at the door."}, {"time": 1956, "text": "So no one comes in unless Salha allows them to come in."}, {"time": 1960, "text": "But then she also is sort of like the first point of contact for compassion in the ward."}, {"time": 1967, "text": "So when mothers and families are admitted, she forms relationships between the moms and the grandmothers, for example, who are admitted and who are living there on the ward."}, {"time": 1980, "text": "And she does it through hugging, right?"}, {"time": 1983, "text": "She does it through bringing them food, right?"}, {"time": 1987, "text": "And she forms these really rather quickly deep relationships of compassion with the families."}, {"time": 1995, "text": "And so it's amazing to watch and no language is needed, right, to bear witness to this."}, {"time": 2002, "text": "And she also suffers because of that, right?"}, {"time": 2006, "text": "And so near the end of the film, if you recall, when another child dies and the mother is wailing, we actually cut away to Salha, who's in the hallway, who walks into another room and begins sobbing."}, {"time": 2023, "text": "She's not a family member, but she has a deep relationship with that family that she forged as soon as they stepped into the ward."}, {"time": 2031, "text": "So that's universal, right?"}, {"time": 2033, "text": "To see a woman weep because a child has died, even if they're not related to that, that's a universal sort of emotional experience we can all relate to."}, {"time": 2044, "text": "So that's what I mean by visual vocabulary."}, {"time": 2047, "text": "And it's especially powerful because she has seen much of this kind of suffering and she's still, maybe she has built up some callous to be able to work day to day, but there's still an ocean underneath the ice."}, {"time": 2065, "text": "She's kept her heart open despite all the pain that she sees and feels every day."}, {"time": 2070, "text": "Somehow she's a human being who's able to do that, which is a very difficult thing to do, right?"}, {"time": 2075, "text": "She still allows herself to be vulnerable."}, {"time": 2079, "text": "And maybe that's why she can do what she does."}, {"time": 2083, "text": "What lessons do you draw from other families in history?"}, {"time": 2085, "text": "So for me personally, one that's touched my family and one of the great families in history is in Ukraine, Holodomor in the 30s."}, {"time": 2096, "text": "32, 33, right?"}, {"time": 2097, "text": "32, 33 with Stalin."}, {"time": 2099, "text": "Maybe you could speak to the universals of the suffering here."}, {"time": 2105, "text": "What lessons do you draw from those other famines if you looked at them or in general about famine that are manufactured by the decisions of, let's say, authoritarian leaders?"}, {"time": 2119, "text": "Well, famine doesn't have to exist or the bulk of famines on this planet, I believe don't have to exist."}, {"time": 2133, "text": "And most of them, or at least a good number of them are manufactured by the leaders that choose to use famine as a weapon, right?"}, {"time": 2144, "text": "And Ukraine is one of the obvious examples right now, with siege tactics that are happening in different parts of the country."}, {"time": 2153, "text": "And we built international humanitarian law for a reason, many years ago, and it continues to be written to this day."}, {"time": 2166, "text": "And it's there to prevent what's happening in Ukraine right now."}, {"time": 2171, "text": "It's there to prevent what's been happening in Yemen for seven years."}, {"time": 2176, "text": "And yet there hasn't been any teeth behind it."}, {"time": 2179, "text": "And that's what disturbs me is that we can see how these famines are being used as weapons in war."}, {"time": 2190, "text": "And yet we aren't sort of using the levers of power that exist in order to, I think, to call out in important and powerful ways those who are causing them and to make sure that we hold them accountable on the global stage."}, {"time": 2207, "text": "Now, to some extent, that seems to be happening in Ukraine in a way that hasn't happened for a long time."}, {"time": 2213, "text": "And that gives me hope, right?"}, {"time": 2216, "text": "And yet I don't believe we've done enough."}, {"time": 2219, "text": "And I think the national community needs to do far more than we are both in Yemen, in Ethiopia, and in Ukraine right now."}, {"time": 2227, "text": "There are certain kinds of things that captivate the global attention, and it seems like starvation is not always one of them."}, {"time": 2236, "text": "For some reason, murder and destruction gets people's attention more."}, {"time": 2243, "text": "The death, of course, is easy to enumerate, but it's the suffering that's the problem."}, {"time": 2249, "text": "Yeah, yeah, you know, when we went to film Hunger Ward, that was one of the creative questions that I was really concerned about because starvation, you know, it's not a quick action, right?"}, {"time": 2261, "text": "It's a long, slow, insidious process, right?"}, {"time": 2265, "text": "Just like hunger, right?"}, {"time": 2267, "text": "And yet when you're hungry, right, it takes you over."}, {"time": 2273, "text": "It becomes the most important thing, right?"}, {"time": 2276, "text": "It's just absolutely fundamental to life."}, {"time": 2279, "text": "It's like drawing breath."}, {"time": 2280, "text": "And so I really, before I filmed Hunger Ward, I struggled to sort of answer how we could creatively approach that because, you know, someone's sitting in a clinic, right?"}, {"time": 2293, "text": "Starving or being treated for starvation, you know, that's a pretty static scene, right?"}, {"time": 2300, "text": "And what we found was that because of the volume of cases and because of the nature of sort of how quickly how quickly people were coming and going is that it was more dynamic than we anticipated."}, {"time": 2315, "text": "And there's something also about starvation."}, {"time": 2318, "text": "You get tired."}, {"time": 2320, "text": "It's almost like it's a quiet suffering."}, {"time": 2326, "text": "And by the way, there's something about when I think about dark times, I mean, you'll hear me chuckle, for example."}, {"time": 2334, "text": "That's almost like, it's almost like you have to kind of laugh at, you can't help but laugh at like the injustice and the cruelty in the world."}, {"time": 2348, "text": "Somehow that helps your mind deal with it."}, {"time": 2350, "text": "I mean, I see this all the time."}, {"time": 2353, "text": "Like when you're struggling, you can't feed your family."}, {"time": 2356, "text": "You lost your home."}, {"time": 2358, "text": "The last thing you have is jokes about."}, {"time": 2361, "text": "It's humor."}, {"time": 2362, "text": "Yeah, it's humor."}, {"time": 2363, "text": "It's like, ah, the fucking man fucked me over again."}, {"time": 2368, "text": "And there's jokes all around that."}, {"time": 2370, "text": "And then you laugh and you drink vodka and you play music."}, {"time": 2378, "text": "It's gallows humor, right?"}, {"time": 2379, "text": "It's a way of, I think, simultaneously acknowledging and allowing yourself to move forward, right?"}, {"time": 2386, "text": "Beyond the pain and the suffering."}, {"time": 2389, "text": "So you mentioned Ukraine and you mentioned Putin."}, {"time": 2392, "text": "What are your thoughts about the humanitarian crisis and generally the suffering that's resulting from the war in Ukraine?"}, {"time": 2402, "text": "Well, first off, I think the conflict is just gonna exacerbate, you know, sort of the global challenge we have with displacement."}, {"time": 2412, "text": "The last entire trilogy I did was about displacement to great extent due to war."}, {"time": 2419, "text": "And, you know, this is a huge displacement of human beings regardless of the cause."}, {"time": 2424, "text": "And that is gonna sort of have a ripple effect across the globe for many, many years to come regardless of even if the conflict ended today."}, {"time": 2435, "text": "That's gonna set up a whole nother strain on sort of the global sort of resources that come into play to deal with refugees."}, {"time": 2447, "text": "You know, there were 79 million displaced people on this globe prior to the Ukrainian conflict, right?"}, {"time": 2454, "text": "You probably know the numbers better than I do in terms of what the current estimates are for displacement from Ukraine."}, {"time": 2460, "text": "It's four to six million."}, {"time": 2461, "text": "So what are we up to now?"}, {"time": 2463, "text": "73, 74 million individuals on this planet now who are displaced?"}, {"time": 2469, "text": "That's a significant bump."}, {"time": 2472, "text": "I wish that the levers of power were used differently in situations like Ukraine and Syria, for example."}, {"time": 2480, "text": "So what are the levers of power?"}, {"time": 2483, "text": "Well, military might."}, {"time": 2484, "text": "Let's take that for one, right?"}, {"time": 2486, "text": "So I have always felt after working in Syria and Turkey that we completely missed our opportunity as a player on the global stage with military capability to prevent the killing of hundreds of thousands of civilians in Syria."}, {"time": 2510, "text": "We had the ability and we didn't leverage that ability."}, {"time": 2514, "text": "You know, the fact that I talked with so many Syrians during the course of doing that project who told me their stories of living in their house, right?"}, {"time": 2527, "text": "And having a Syrian helicopter fly over their house and drop a 55 gallon drum full of explosives and shrapnel in their neighborhood over and over and over again."}, {"time": 2544, "text": "Not focused on any military targets, only meant to kill and sow fear, right?"}, {"time": 2551, "text": "And early in the conflict, we could have stopped that."}, {"time": 2555, "text": "Before Russia got involved, we could have intervened and created a no fly zone."}, {"time": 2560, "text": "That we, the United States or coalition that we were a part of, yeah."}, {"time": 2565, "text": "And we didn't do it and we could have."}, {"time": 2567, "text": "And I think that's an example where we have the military capability to actually do good in a situation like that."}, {"time": 2573, "text": "And we don't usually use it for those purposes."}, {"time": 2575, "text": "And I think that's what a military ought to be used for beyond just defending our borders is to save others with the privilege that that power affords."}, {"time": 2584, "text": "What do you think about the power of the military versus the power of sanctions versus the power of conversation?"}, {"time": 2592, "text": "They're all different tools, right?"}, {"time": 2593, "text": "To be used at different moments."}, {"time": 2595, "text": "But if words fail, if sanctions fail, right?"}, {"time": 2601, "text": "I think there are moments in history where power is justified, right?"}, {"time": 2606, "text": "And I think Syria was one of them."}, {"time": 2608, "text": "I think when barrel bombs were dropping on civilian neighborhoods for months and months and months with no intent to do anything other than kill Syrian civilians, that's an instance I think where might is justified to shoot those helicopters out of the sky."}, {"time": 2625, "text": "Here's the difficult thing."}, {"time": 2626, "text": "We've talked about Yemen."}, {"time": 2628, "text": "Where's the line between good and evil for US intervention in different countries and conflicts in the world?"}, {"time": 2639, "text": "It's easy to look back 10, 20, 30 years to know what was and wasn't a quote unquote just war."}, {"time": 2645, "text": "In the moment, how do we know?"}, {"time": 2648, "text": "I think it's incredibly difficult to answer that, right?"}, {"time": 2651, "text": "And I think that's why leaders make the wrong choices so often, right?"}, {"time": 2655, "text": "Is they second guess themselves."}, {"time": 2658, "text": "I think you take all the data at your fingertips, all the intelligence that you have, right?"}, {"time": 2663, "text": "And you look at it all very carefully and you make a decision, right?"}, {"time": 2667, "text": "There are some instances though where it's very clear what's happening, right?"}, {"time": 2673, "text": "And leaders still don't act, right?"}, {"time": 2676, "text": "In Yemen right now, for example, it's very clear what's happening, right?"}, {"time": 2680, "text": "Children are being starved because of a blockade."}, {"time": 2684, "text": "All the US would have to do is ensure that blockade, now there's a two month ceasefire in place now, but remains lifted beyond the ceasefire and children will stop starving."}, {"time": 2696, "text": "That's pretty simple."}, {"time": 2697, "text": "You can trace, it's a direct connection."}, {"time": 2700, "text": "And we haven't had the sort of the moral wherewithal to make that decision because we're too interested in maintaining positive ties with Saudi Arabia where oil flows from and so much influence because Saudi Arabia has so much influence throughout the MENA region."}, {"time": 2719, "text": "We want to keep that relationship tight despite sort of the moral wounds that come from that."}, {"time": 2726, "text": "About half the world is under authoritarian regimes and everybody operates under narratives."}, {"time": 2733, "text": "And there's a narrative in the United States that freedom is good, democracy is good."}, {"time": 2740, "text": "I have fallen victim to this narrative."}, {"time": 2743, "text": "I believe in it."}, {"time": 2746, "text": "I'm saying this jokingly, but not really because who knows the truth of anything in this world?"}, {"time": 2753, "text": "I eat meat, factory farm meat, and I seem to not be intellectually and philosophically tortured by this, and I should be."}, {"time": 2762, "text": "There's a lot of suffering there."}, {"time": 2764, "text": "What do we do to lessen the suffering of the people under authoritarian regimes?"}, {"time": 2772, "text": "Again, the same question."}, {"time": 2774, "text": "Military conflict, diplomacy, sanctions, all those kinds of things."}, {"time": 2784, "text": "Does that lessen suffering or increase the suffering for what you see in Yemen?"}, {"time": 2791, "text": "Is it something that has to be healed across generations or can be healed on a scale of months and years?"}, {"time": 2799, "text": "I'm just a guy with a camera, Alex, you know?"}, {"time": 2802, "text": "But as a guy with a camera, I've seen a lot of things in a lot of places and I've seen the effects these decisions made by authoritarian leaders have on their own citizens."}, {"time": 2819, "text": "And that's what drives my thinking on this."}, {"time": 2824, "text": "And that's what drives and motivates me each day to raise the red flag through my films and say, listen, Biden, you campaigned for president in part on a platform that said that we would regain our prominence on the moral stage of the world and that we would prioritize sort of a moral paradigm over relationships with authoritarian regimes, Saudi Arabia being one."}, {"time": 2861, "text": "And yet when the CIA report came out that clearly articulated in detail that MBS was responsible for Khashoggi's murder and for cutting his body into pieces and probably burning it in the backyard of the embassy, what did Biden do?"}, {"time": 2879, "text": "He didn't really make a pariah out of MBS like he said he was going to, right?"}, {"time": 2885, "text": "What if he'd done something else and actually done what he said he was gonna do, which was make MBS?"}, {"time": 2890, "text": "What if he had removed the ability for MBS to fly to the United States, for example?"}, {"time": 2896, "text": "Now that's a sanction, right?"}, {"time": 2898, "text": "That's a sanction that's individual and concrete and would be hugely embarrassing for MBS."}, {"time": 2905, "text": "That would have been Biden saying, this is unacceptable behavior, right?"}, {"time": 2911, "text": "This is something which because you executed such a horrendous act on someone living in the United States, we are not going to give you a stage here at least, right?"}, {"time": 2927, "text": "Within the borders of our country."}, {"time": 2929, "text": "Those are the things that leaders can do that I don't think they do often enough."}, {"time": 2933, "text": "And certainly our leader right now isn't doing it in the way I wish he were."}, {"time": 2937, "text": "He certainly has taken a different stand on Ukraine and been very vocal."}, {"time": 2943, "text": "But there's so many instances we could talk about where I feel like the political game and ship, right?"}, {"time": 2949, "text": "Often falls into maintaining relationships like with MBS and Saudi Arabia rather than doing the right thing."}, {"time": 2956, "text": "Rather than as a nation, a leader of a nation saying, this is unacceptable."}, {"time": 2962, "text": "We have a higher standard than this."}, {"time": 2964, "text": "Cause I think when leaders do that, it becomes aspirational, right?"}, {"time": 2970, "text": "It becomes aspirational for other leaders in the progressive world at least."}, {"time": 2976, "text": "And also it rings the alarm bells for other authoritarian leaders and says, you know what, there are lines, right?"}, {"time": 2984, "text": "There are things that can't be done or there will be significant consequences."}, {"time": 2988, "text": "Like you will not be able to fly into our airspace anymore."}, {"time": 2991, "text": "And sanctions I think need to be concrete and individual to some, in addition to the larger scope."}, {"time": 2998, "text": "But when they're concrete and individual, I think often they're felt in a different way."}, {"time": 3004, "text": "You mean felt obviously by the individuals."}, {"time": 3006, "text": "And so the ripple effects of that might have the power to steer the direction of nations."}, {"time": 3018, "text": "Because of the nature of authoritarian regimes, right?"}, {"time": 3021, "text": "Individuals have so much power."}, {"time": 3023, "text": "So if Putin is put on trial in the Hague at some point, or at least there's the threat of that, right?"}, {"time": 3032, "text": "Now that's likely never to happen of course because someone has to be in custody to go on trial, right?"}, {"time": 3037, "text": "And he's never gonna allow that to happen."}, {"time": 3039, "text": "But just knowing that that danger exists is going to change his travel plans in the future, right?"}, {"time": 3049, "text": "MBS not being able to fly to the US, he's gonna feel that and be embarrassed by that."}, {"time": 3055, "text": "So I think they have a special meaning and consequence in authoritarian regimes because of that."}, {"time": 3063, "text": "So you said you're just a guy with a camera."}, {"time": 3067, "text": "I would say you're a brilliant guy with a camera."}, {"time": 3073, "text": "I'm also a kind of guy with a camera."}, {"time": 3075, "text": "You're a guy with a couple cameras."}, {"time": 3076, "text": "A couple cameras."}, {"time": 3077, "text": "I have more."}, {"time": 3078, "text": "A couple mics too."}, {"time": 3080, "text": "You got a couple mics, a couple cameras, robot over here."}, {"time": 3083, "text": "When you can't beat them with quality, you bring the quantity."}, {"time": 3088, "text": "So to me, that's also an interest partially because I also speak Russian and a bit Ukrainian."}, {"time": 3097, "text": "I wanna study that part of the world."}, {"time": 3099, "text": "I wanna talk to a lot of people."}, {"time": 3101, "text": "I wanna talk to the leaders."}, {"time": 3102, "text": "I wanna talk to regular people."}, {"time": 3104, "text": "To be honest, and I would love to get your comments on this, the regular quote unquote people are way more fascinating to me."}, {"time": 3113, "text": "As a filmmaker, how do you figure out how to tell this story?"}, {"time": 3118, "text": "I'm sure a guy with a camera, you're looking at war in Ukraine, but also what's going on in Yemen and Syria and other places in the world."}, {"time": 3127, "text": "I mentioned North Korea."}, {"time": 3128, "text": "That's a super interesting one."}, {"time": 3130, "text": "Hard to bring cameras along."}, {"time": 3131, "text": "China, in Canada, the truckers."}, {"time": 3136, "text": "There's all kinds of fascinating things happening in the world."}, {"time": 3139, "text": "So you as a scholar of human suffering and human flourishing, how do you choose how to tell the story?"}, {"time": 3149, "text": "How do I choose a story?"}, {"time": 3150, "text": "How do I choose how to tell a story?"}, {"time": 3151, "text": "Both a story and how, I assume those are coupled."}, {"time": 3155, "text": "So how do you choose which story to tell?"}, {"time": 3158, "text": "And how do you choose how to tell that story?"}, {"time": 3161, "text": "Well, in terms of how to choose which story, it's a bit of a mystery potion for me, frankly."}, {"time": 3172, "text": "I go often on instinct, but there's also a highly intentional piece of it for me as well."}, {"time": 3180, "text": "And the intentional piece is, I guess I'd call it the do I care threshold, or the so what threshold."}, {"time": 3188, "text": "You personally, just something in your heart just kind of gets excited or hurts or just feels something."}, {"time": 3195, "text": "So one of the things that disturbs me about American culture, Lex, is that we seem to be a people that's fascinated by reality television, for example."}, {"time": 3204, "text": "Like look at how many of us here in America watch reality television, right?"}, {"time": 3210, "text": "That deeply disturbs me."}, {"time": 3211, "text": "Not that I've never watched an episode, I've shot a whole season of it once to make a living, right?"}, {"time": 3216, "text": "So it's like I know it, right?"}, {"time": 3218, "text": "But I feel like the things we should be paying attention to are the things, personally, are the things I choose to film, right?"}, {"time": 3227, "text": "As a human being, as a dad, as a filmmaker, I think we should be paying attention to the fact that children are being starved in Yemen."}, {"time": 3238, "text": "I think we should be paying attention to the fact that Ukrainians are being displaced by the millions."}, {"time": 3244, "text": "So there's this so what threshold that I use."}, {"time": 3247, "text": "And I feel like it has to be a topic that if we don't cover and we don't put out in the world in the largest possible way, in the hope of intervening, in the hope of marshaling maximum resources and attention to solving the problem, that's what I'm dedicated to as a filmmaker."}, {"time": 3265, "text": "Because I didn't pick up a camera initially to film puppy dogs, right?"}, {"time": 3271, "text": "To make people smile."}, {"time": 3273, "text": "I believe the camera is a tool for change."}, {"time": 3276, "text": "I believe the camera is a powerful tool that we can use to raise awareness and marshal resources and help people understand the impact that these geopolitical decisions have on real people's lives."}, {"time": 3291, "text": "And that's the intent I create each film with."}, {"time": 3297, "text": "Now, how I choose each story, that's the magic potion piece of it, right?"}, {"time": 3301, "text": "And often one flows rather organically into another, frankly."}, {"time": 3306, "text": "So you just kind of, like you said, you go with instinct a little bit."}, {"time": 3309, "text": "To some extent, but oftentimes I choose the next project based on relationships I've developed in the last film."}, {"time": 3318, "text": "And so one often flows into another through relationships I develop."}, {"time": 3321, "text": "And then a colleague will share a detail about something that's happening in a certain place."}, {"time": 3327, "text": "And I'll go, hmm, really, I didn't know that, right?"}, {"time": 3330, "text": "And usually it's before it's hit the world stage in a big way."}, {"time": 3334, "text": "And so I start to do due diligence."}, {"time": 3336, "text": "And often that, it reveals it to be a much bigger and more pressing topic that I wanna learn more about."}, {"time": 3343, "text": "Before I talk to you about Syria and Lifeboat, you mentioned a camera is the best weapon."}, {"time": 3352, "text": "Maybe just, well, I can't take out a tank, right?"}, {"time": 3357, "text": "But it's a good weapon."}, {"time": 3358, "text": "Second, top three."}, {"time": 3361, "text": "I love the humor throughout this."}, {"time": 3364, "text": "We were talking about such dark topics."}, {"time": 3367, "text": "It resets the mind in a way that allows me to think."}, {"time": 3373, "text": "As a filmmaker, I almost wanna talk about the technical details."}, {"time": 3384, "text": "How do you choose to shoot stuff?"}, {"time": 3389, "text": "Again, so maybe you can explain to me."}, {"time": 3391, "text": "I work with incredible folks that care about lenses and equipment and so on."}, {"time": 3400, "text": "And I tend to be somebody that just wants to kinda go as like a gorilla shooting, like not plan too much, just go with gritty."}, {"time": 3418, "text": "I'm trying to come up with words that sound positive."}, {"time": 3421, "text": "Do a positive spin on what I try to do."}, {"time": 3424, "text": "But like gritty, don't over plan, use, like we had a big discussion if you see this light."}, {"time": 3432, "text": "It's on a stand that's a very ghetto stand."}, {"time": 3436, "text": "You need a sandbag on that, man."}, {"time": 3438, "text": "So no sandbag and like the stand is actually bending under the weight of that thing."}, {"time": 3445, "text": "It could fall on us."}, {"time": 3446, "text": "It could fall."}, {"time": 3447, "text": "It probably won't reach us, but it could fall."}, {"time": 3448, "text": "But the danger, live under that danger."}, {"time": 3450, "text": "Embrace that danger."}, {"time": 3454, "text": "Because that thing is easier to transport than a heavier one."}, {"time": 3458, "text": "Sandbag, that's extra weight."}, {"time": 3460, "text": "So if you keep, like people tell me there's the right way to do stuff."}, {"time": 3464, "text": "Like here's these giant cases with all the kinds of padding for transporting stuff."}, {"time": 3469, "text": "I transport most of the equipment in a garbage bag."}, {"time": 3473, "text": "So that's just a preference because that's somehow that chaos allows me to ignore all the stupidity of loving the equipment and focusing on the story."}, {"time": 3484, "text": "So that said, I've never shot anything like worthwhile."}, {"time": 3491, "text": "Like there is power to the visual."}, {"time": 3496, "text": "Like definitely."}, {"time": 3497, "text": "And so finding a certain angle, a certain light whether it's natural light or additional artificial lighting just capturing a tear, capturing when the person forgets themselves for a moment and looks out into the distance missing somebody, thinking about somebody."}, {"time": 3518, "text": "All of those like moments you can capture a lens, a camera can do magic with that."}, {"time": 3524, "text": "I don't even know the question I'm asking you but how do both technical and philosophical, how do you capture the visual power that you're after?"}, {"time": 3535, "text": "So, so many of my films I think are built on the premise of access, right?"}, {"time": 3542, "text": "Built on this notion that the biggest hurdle to the story is getting there, being there in the room or being there on the boat while a crisis is unfolding."}, {"time": 3559, "text": "And that access typically is really nuanced and difficult to gain."}, {"time": 3566, "text": "And then trust flows from that, right?"}, {"time": 3568, "text": "Cause usually it takes a long time to gain that access because that access is so hard fought."}, {"time": 3577, "text": "It necessarily informs how we film, right?"}, {"time": 3583, "text": "To be in a room at Sadaka Hospital in Southern Yemen I can't have five people in that room, right?"}, {"time": 3590, "text": "I can't have a boom mic over a scene."}, {"time": 3594, "text": "I want in creatively the opposite of that as well."}, {"time": 3598, "text": "So it's not just a logistical question, it's also a creative question to capture intimate moments where families are dealing with suffering children and dying children and caretaking is active and ongoing all the time."}, {"time": 3613, "text": "You don't want to interrupt that moment."}, {"time": 3615, "text": "And so that informs how I do things."}, {"time": 3617, "text": "So we go fleet and nimble and small."}, {"time": 3621, "text": "Those are all really good words."}, {"time": 3622, "text": "But so it's logistical on the one hand, but it's also a creative choice, right?"}, {"time": 3628, "text": "So when we filmed Hunger Ward, two people were filming the entire film, right?"}, {"time": 3632, "text": "Me and my director of photography."}, {"time": 3634, "text": "That was the two people in the room?"}, {"time": 3636, "text": "Two people in the room."}, {"time": 3638, "text": "The whole film, right?"}, {"time": 3639, "text": "We had a field producer as well in this part of the country, but in terms of camera, it's just two people and we're doing everything."}, {"time": 3645, "text": "And we have lenses that are long enough that we don't have to move to camera."}, {"time": 3652, "text": "We don't have to move to capture the film."}, {"time": 3653, "text": "So we can tuck into a corner sometimes, right?"}, {"time": 3656, "text": "And so just what's long mean?"}, {"time": 3658, "text": "That means they're standing farther away and they can look."}, {"time": 3660, "text": "Zoom lens, it's not a prime lens."}, {"time": 3662, "text": "So it's not a fixed focal length, right?"}, {"time": 3664, "text": "Because a fixed focal length, you have to move a lot more in order to capture action."}, {"time": 3667, "text": "With a zoom lens, maybe a 105 at the long end, I can tuck into a corner and just film from 15 feet away instead of having to get right up on someone, right?"}, {"time": 3678, "text": "So you're less likely to interrupt the scene and you can kind of become the fly on the wall sometimes."}, {"time": 3685, "text": "So I'm very intentional about that piece of it so that we can capture those vulnerable moments and not interrupt them."}, {"time": 3696, "text": "That's really fascinating too, because the access, I don't often think about this, but that's probably true for me as well."}, {"time": 3704, "text": "Part of the storytelling is to be in the room."}, {"time": 3712, "text": "And that's the hard part."}, {"time": 3713, "text": "For me, most of my films, that's the hardest part."}, {"time": 3716, "text": "Actually, as hard as Hunger Ward and Lifeboat were to film and 50 Feet From Syria, the getting there piece of it for the last two was much harder."}, {"time": 3726, "text": "Yeah, and it's also, it's a creative act."}, {"time": 3729, "text": "It's, I don't know if it is for you, but it's the kind of people you talk to."}, {"time": 3735, "text": "It's like how you live your life."}, {"time": 3738, "text": "Like the kind of people I talk to right now, they steer the direction of my life and steer the direction of things I'll film."}, {"time": 3745, "text": "So it's not just like you're trying to get access."}, {"time": 3748, "text": "It's like, it's everything."}, {"time": 3750, "text": "It builds, it builds and builds and builds and builds."}, {"time": 3754, "text": "It builds on itself, yeah, yeah."}, {"time": 3756, "text": "I mean, part of the thing, even saying, talking about some of these leaders and conversations with them, it's almost like steering your life into the direction of the difficult, of like taking the leap."}, {"time": 3771, "text": "And if you're a good human being and a lot of people know who you are as a human, like not as a name, but as really who you are, that like putting that attention out there, it's somehow the world opens doors where the access becomes, the access that once seemed impossible becomes possible."}, {"time": 3798, "text": "And then all of that is a creative journey to be in the room."}, {"time": 3802, "text": "I think that probably is, I mean, it's true even for fiction films probably, is like everything that led to that, like to be in the room, the journey to be in the room and to shoot the scene is maybe more important than the scene itself."}, {"time": 3819, "text": "And like really focus on the creative act of that."}, {"time": 3822, "text": "Yeah, that's really fascinating."}, {"time": 3823, "text": "And especially, I mean, with a documentary, you get one take."}, {"time": 3827, "text": "Yeah, you can't say, hey, reset, right?"}, {"time": 3831, "text": "Ah, that is so interesting."}, {"time": 3833, "text": "As you were in some of the most difficult parts of the world in the room with some of the most difficult stories to be told."}, {"time": 3842, "text": "And yet, I think that's why I keep doing these stories."}, {"time": 3845, "text": "Because once you have that lived experience for me, it's moving."}, {"time": 3856, "text": "It moves me to bear witness to these inspiring people under difficult circumstances."}, {"time": 3866, "text": "And I can't come back to the US afterwards and walk down the grocery aisle where there's 50 different choices for canned peas, right?"}, {"time": 3880, "text": "And not sort of feel that lived tension, right?"}, {"time": 3885, "text": "That lived tension of the privilege that I have here in the US."}, {"time": 3889, "text": "And then I have a choice about what to do with that privilege, right?"}, {"time": 3894, "text": "And the last thing I wanna do is start doing stories about dandelions, right?"}, {"time": 3901, "text": "There's far more important things to do on this very limited time that I have on the planet."}, {"time": 3905, "text": "And I think that's catalytic for me."}, {"time": 3912, "text": "Like I feel that mortality each day."}, {"time": 3917, "text": "And my goal is to tell as many of these stories before I'm gone."}, {"time": 3926, "text": "Could you speak to the getting access?"}, {"time": 3931, "text": "Is this just, you know, is there interesting stories of how a weird or funny or profound ways that led you to get access to a room?"}, {"time": 3945, "text": "Each one is a different adventure."}, {"time": 3946, "text": "And it's definitely an adventure."}, {"time": 3947, "text": "It's an adventure."}, {"time": 3948, "text": "Everyone's an adventure, yeah."}, {"time": 3949, "text": "Probably one of the easiest ones I ever had in the recent past was for 50 Feet from Syria where I literally broke my hand in a bicycle race."}, {"time": 3961, "text": "And after many months of trying to get an appointment with an orthopedic hand surgeon, a specialist, I finally did and he was Syrian American."}, {"time": 3971, "text": "And the Syrian conflict had just begun and we just started talking about it."}, {"time": 3976, "text": "And after he looked at my hand in the first five minutes, he's like, yeah, you need surgery, great."}, {"time": 3983, "text": "But then somehow we started talking about Syria and like five minutes in, he just stood up and like put the privacy curtain around us, supposed to be a 15 minute appointment or so."}, {"time": 3993, "text": "And we talked for an hour, right?"}, {"time": 3995, "text": "So, you know, those moments of sort of mysterious confluence happen, right?"}, {"time": 4000, "text": "And I think you have to be open to them when they do happen because I'm a storyteller, I'm always looking as well, right?"}, {"time": 4006, "text": "So, because he then contacted me later and said, Skye, I am going back to the Syrian border to volunteer as a surgeon, do you want to come with me?"}, {"time": 4016, "text": "That was an easy one."}, {"time": 4017, "text": "That's probably the easiest one I could give you."}, {"time": 4018, "text": "But it came out of this interesting moment, very personal moment, right?"}, {"time": 4022, "text": "Lifeboat and Hunger Ward are completely different."}, {"time": 4027, "text": "And I had to really work hard to gain access to those stories."}, {"time": 4032, "text": "So you intentionally thought like what, I want to get access to the story."}, {"time": 4038, "text": "And then what are the different ideas?"}, {"time": 4040, "text": "And they often might involve a doctor or a dentist or just being maybe intentionally and aggressively open to experiences that lead you into the room."}, {"time": 4055, "text": "So it's funny you mentioned the doctor because I have similar experiences now."}, {"time": 4062, "text": "I've just gotten access to all kinds of fascinating people in the same way."}, {"time": 4070, "text": "They're all around us."}, {"time": 4072, "text": "You just have to look."}, {"time": 4073, "text": "It's like there's fascinating people everywhere who are doing incredible things, but we have to be open and keep our eyes open and realize that there are amazing human beings everywhere."}, {"time": 4084, "text": "Yeah, there's networks that connect people just through life."}, {"time": 4089, "text": "You meet people, you share a beer or a drink or just you fall in love or you share trauma together."}, {"time": 4098, "text": "You go through a hard time together."}, {"time": 4099, "text": "And those little sticky things connects us humans."}, {"time": 4102, "text": "And if you just keep yourself open and embrace the curiosity."}, {"time": 4107, "text": "And then also the persistence, I suppose."}, {"time": 4110, "text": "Like how long have you chased access?"}, {"time": 4116, "text": "Does it take days, weeks, months, years?"}, {"time": 4119, "text": "Lex, I'm not the most talented filmmaker in the world."}, {"time": 4123, "text": "I'm not the smartest guy in the world."}, {"time": 4126, "text": "I think if there's qualities that have served me well in my career, it's persistence and tenacity, right?"}, {"time": 4133, "text": "I've always been sort of a slow burn human being."}, {"time": 4136, "text": "Like I would never hit a home run, but I hit a first, right?"}, {"time": 4143, "text": "A single to first, and then I'd hit another single to first."}, {"time": 4146, "text": "So I ran a marathon when I was 18."}, {"time": 4149, "text": "And I think that is illustrative of sort of how my career has been."}, {"time": 4154, "text": "I just keep going."}, {"time": 4156, "text": "And I believe in this notion of incremental evolution that with each project, I try to learn from it and take away lessons learned and improve my craft, right?"}, {"time": 4168, "text": "And improve how I leverage that craft and improve how I tell the story from a narrative standpoint each time."}, {"time": 4177, "text": "So that on the next project, it's a little bit better."}, {"time": 4181, "text": "And that's the arc of my career is learning, learning, evolving, evolving, so that I can make a little better film the next time."}, {"time": 4190, "text": "How do you gain people's trust?"}, {"time": 4193, "text": "Like for example, there's a line between journalists and documentary filmmakers."}, {"time": 4198, "text": "Nobody really trusts journalists."}, {"time": 4203, "text": "But a documentary filmmaker, of course I'm joking, half joking."}, {"time": 4209, "text": "I don't know which percentage joking, but some truth."}, {"time": 4212, "text": "But documentary filmmaker is a kind of storyteller, an artist, and somehow that's more trustworthy because you're on the same side in some way."}, {"time": 4223, "text": "Maybe on the same side, yeah."}, {"time": 4225, "text": "Is there something to be said how you gain the trust of people to gain access?"}, {"time": 4229, "text": "Are you just trying to be a good human being?"}, {"time": 4234, "text": "Is there something to be said there?"}, {"time": 4235, "text": "Well, so I do draw a distinction between journalism and filmmaking because I think you're right, they're different."}, {"time": 4242, "text": "And there are some filmmakers who do hue to sort of the journalistic tenets of who, what, where, when, why, fair and balanced on both sides, right?"}, {"time": 4251, "text": "Make sure everyone has a voice."}, {"time": 4253, "text": "If you say fair and balanced, you're rarely either fair or balanced."}, {"time": 4258, "text": "I've seen that with journalists."}, {"time": 4259, "text": "Journalists often, unfortunately, in my perspective, sorry to interrupt you rudely and go on a rant, but they seem to have."}, {"time": 4265, "text": "Go on a rant, do it."}, {"time": 4267, "text": "They seem to have an agenda."}, {"time": 4269, "text": "As opposed to seeking to truly tell a story or to truly understand, especially when they're talking to people who have some degree of evil in them."}, {"time": 4284, "text": "Well, we all have an agenda, right?"}, {"time": 4285, "text": "I think in anything we do, whether it's like to seek truth or some larger principle, I always have an agenda."}, {"time": 4295, "text": "I chose to work with civilians and caretakers in Yemen on Hunger Ward rather than to go interview MBS, right?"}, {"time": 4305, "text": "That's what I'm interested in is bringing that to the world, right?"}, {"time": 4310, "text": "But in terms of building relationships and trust, it's really, I think about transparency as much as anything else and going in in a collaborative sense."}, {"time": 4323, "text": "So I don't think of the people that I film with as subjects, for example."}, {"time": 4332, "text": "I think of them as collaborators."}, {"time": 4334, "text": "So it's a different mindset that I go into projects with."}, {"time": 4338, "text": "And it's based on relationships, right?"}, {"time": 4339, "text": "You have to build relationships with other human beings, however you can, and that takes time and it takes listening and it's active."}, {"time": 4348, "text": "So I've talked about the notion of consent before, which is so important in nonfiction film."}, {"time": 4356, "text": "And I hew to this idea that you don't just slide a piece of paper in front of someone, have release form and have them sign it, right?"}, {"time": 4368, "text": "That's not the nature of true consent in my mind."}, {"time": 4371, "text": "It's you have to work on a foundation of active consent every single day that you're working with someone."}, {"time": 4379, "text": "And that's based on relationship, right?"}, {"time": 4381, "text": "And it's based on dialogue."}, {"time": 4382, "text": "So it's trust that I'm always aiming for."}, {"time": 4385, "text": "It's the building of relationships, which I'm always aiming for, which is why yesterday I got a bunch of photos from Dr. Al Sadiq in the South of Yemen."}, {"time": 4395, "text": "And she sends me photos all the time of the children that she's currently treating because we have an active relationship that's continues on and probably will for many years to come."}, {"time": 4406, "text": "So it's going to continue."}, {"time": 4408, "text": "And that's the only way that I can do these kinds of films."}, {"time": 4412, "text": "Let me ask you about silly little details of filming."}, {"time": 4416, "text": "Before we go to the big picture stories, cameras, lenses, how much do those matter?"}, {"time": 4426, "text": "You mentioned director of photography."}, {"time": 4427, "text": "What's your, how much do you love the feel, the smell of equipment that does the visual filming?"}, {"time": 4436, "text": "You know, there's some people, they're just like, ah, they love lenses."}, {"time": 4443, "text": "How much do you love that or versus how much do you focus on the story or the access and all those kinds of things?"}, {"time": 4449, "text": "I'm not a tech geek, but because during the bulk of my career, I've worked as a director of photography myself for other people in order to pay the bills over the years, you know, I know the technical side of it because I've had to know it and I've had to train myself and learn it."}, {"time": 4469, "text": "So I see them as necessary tools."}, {"time": 4473, "text": "And again, because I believe, you know, film and cinema is and should be visually driven and not verbally driven."}, {"time": 4485, "text": "I want the best tools possible within my means, right?"}, {"time": 4489, "text": "And within the logistical ability of the project because we have to go so small, right?"}, {"time": 4496, "text": "I can't afford nor can I bring a huge $100,000 lens."}, {"time": 4500, "text": "So if I gave you a trillion dollars."}, {"time": 4502, "text": "A trillion dollars?"}, {"time": 4505, "text": "Unlimited."}, {"time": 4507, "text": "There's still huge constraints that have nothing to do with money."}, {"time": 4510, "text": "Like you just said."}, {"time": 4511, "text": "So what cameras would you use?"}, {"time": 4513, "text": "You know what I'd do with a trillion dollars?"}, {"time": 4516, "text": "I could do a lot with a trillion dollars."}, {"time": 4516, "text": "You're not allowed."}, {"time": 4517, "text": "You're only allowed to fund the film and no corrupt stuff where you like use the film to actually help children."}, {"time": 4524, "text": "No, you're not allowed to do any of that."}, {"time": 4526, "text": "What I would do with a trillion is I wouldn't invest in it."}, {"time": 4528, "text": "Well, I guess I would invest in current."}, {"time": 4529, "text": "I would increase capacity to do more films."}, {"time": 4533, "text": "What I would do."}, {"time": 4534, "text": "So I would buy basically the perfect little, you know, mini equipment set, right?"}, {"time": 4540, "text": "But then I would train three teams maybe to do the same thing that I've been doing so we could multiply and scale up."}, {"time": 4548, "text": "More and more stories."}, {"time": 4549, "text": "Yeah, that's what I would do with the money."}, {"time": 4551, "text": "But the actual setup."}, {"time": 4552, "text": "Would remain small and nimble."}, {"time": 4556, "text": "And what about lighting?"}, {"time": 4559, "text": "Do you usually use natural light?"}, {"time": 4561, "text": "Do you ever do?"}, {"time": 4564, "text": "I mean, sorry for the technical questions here, but highlighting the drama of the human face."}, {"time": 4573, "text": "That's the visual."}, {"time": 4574, "text": "That's art."}, {"time": 4575, "text": "That's like, to reveal reality at its deepest is art."}, {"time": 4583, "text": "And do you use lighting?"}, {"time": 4584, "text": "Lighting's such a big part of that."}, {"time": 4587, "text": "Do you ever do artificial lighting?"}, {"time": 4588, "text": "Do you try to do natural always?"}, {"time": 4590, "text": "You know the best lighting instrument in the world?"}, {"time": 4593, "text": "Is the sun."}, {"time": 4594, "text": "At the right moment of the day."}, {"time": 4597, "text": "And so I predominantly use natural light at certain moments and just shape natural light during the course of these small human rights stocks."}, {"time": 4611, "text": "That's not to say we don't bring instruments sometimes, but when we do, they're very small and again, compact."}, {"time": 4620, "text": "So for example, I have this small little tube kit that's just three instruments, right?"}, {"time": 4627, "text": "That you can charge with USB."}, {"time": 4628, "text": "Because electricity is often a major issue where we go."}, {"time": 4631, "text": "So there's just three little tube lights with magnetic backs that if we find in a situation where, you know, we can't get enough exposure for a hallway or something, and we have the time to throw it up, we'll throw it up if people are walking, if collaborators are walking down that hallway a lot, for example, at night, just so we can see them, right?"}, {"time": 4649, "text": "So it's instances like that."}, {"time": 4651, "text": "Or if we do do an interview, which we don't do very often, but if we do, just so we have a key light on the face, right?"}, {"time": 4660, "text": "And always bring a reflector or two, you know, just to shape natural light as well in ways."}, {"time": 4666, "text": "But it's about shaping rather than producing light for us."}, {"time": 4673, "text": "Got it, as we sit surrounded by black curtains in complete natural light."}, {"time": 4677, "text": "So just so you know, this room is like a violation of the basic principles of using the sun."}, {"time": 4688, "text": "So behind the large curtains are giant windows."}, {"time": 4693, "text": "So this whole."}, {"time": 4694, "text": "Should I rip them open?"}, {"time": 4695, "text": "Should I rip open the curtains real quick?"}, {"time": 4699, "text": "How much of the work is done in the edit?"}, {"time": 4701, "text": "That's another question I'm curious about."}, {"time": 4704, "text": "And how much do you sort of anticipate that?"}, {"time": 4708, "text": "Like when you're actually shooting, are you thinking of the final story as it appears on screen or are you just collecting, as a human, collecting little bits of story here and there and in the edit is where most of the storytelling happens?"}, {"time": 4726, "text": "I've developed this sort of mental paradigm for myself over the years that speaks to that."}, {"time": 4733, "text": "And I call it the three creations, right?"}, {"time": 4736, "text": "And so when I'm doing a film, the first creation for me is my preconception or visualization of what the film is going to be before I shoot it, right?"}, {"time": 4749, "text": "So I have this entire vision of what a film's gonna be."}, {"time": 4755, "text": "And sometimes it can be pretty specific."}, {"time": 4756, "text": "Like I'll think through the scenes if I know the locations and everything, and I'll have this idea of what I'm gonna create, right?"}, {"time": 4764, "text": "And then I'm there filming, right?"}, {"time": 4766, "text": "And always without fail, reality is something altogether different than what I thought it would be."}, {"time": 4773, "text": "But it's still good to have the original idea."}, {"time": 4775, "text": "Yeah, yeah, but if I tried to hold to that original vision, right, and to create a film out of that idea, they'd be crap, all the films would be crap."}, {"time": 4783, "text": "So I have to adapt, I have to evolve my approach and then embrace what is actually occurring with the people actually doing it and then reenvision."}, {"time": 4793, "text": "So that reenvision is very active during the entire filming process."}, {"time": 4797, "text": "And so that's the second creation, that's the rethinking and revisualizing based on what we're actually experiencing and seeing what this film is going to be."}, {"time": 4808, "text": "And then I finished filming, right?"}, {"time": 4811, "text": "And we bring the hard drives back and we plug in the hard drives in the edit bay."}, {"time": 4816, "text": "And oftentimes, because it's two of us filming most of the time, I haven't seen all the footage."}, {"time": 4823, "text": "Because in the field, it's all about just filming, right?"}, {"time": 4826, "text": "And then just transferring the footage and getting on safely, you know, clone to multiple drives."}, {"time": 4831, "text": "I don't have a chance to review everything."}, {"time": 4833, "text": "I can't do rushes like you do on a large feature."}, {"time": 4836, "text": "So because I'm filming half of it, I know what I've filmed, right?"}, {"time": 4840, "text": "But I haven't seen everything the director of photography has filmed, right?"}, {"time": 4845, "text": "So the next stage for me is reviewing every single frame of what's been filmed."}, {"time": 4851, "text": "And that's where discovery happens the third time, right?"}, {"time": 4856, "text": "Or the second time rather is, wow, now I thought we'd filmed this, but actually there's this over here."}, {"time": 4865, "text": "And then I have to open up this second vision and turn it and transform it into a third vision for the film based on what's actually on the hard drive."}, {"time": 4872, "text": "So is this like a daily process?"}, {"time": 4875, "text": "So what I do, my process is that if it's a really difficult project, I'll take a break before I go through this just for healing, you know, and some space away and fresh eyes."}, {"time": 4887, "text": "And usually that's about a month."}, {"time": 4889, "text": "And then once I reengage, I reengage whole hog, I reengage fully and I review every single frame."}, {"time": 4897, "text": "And as I do that, I create a spreadsheet."}, {"time": 4900, "text": "And for Hunger War, that spreadsheet was, I don't know, 1500 lines long or something where it's basically log notes."}, {"time": 4908, "text": "And I watch every scene and I take notes and I know really what we have."}, {"time": 4914, "text": "And once I've gone through that process that takes about a month and I really know what we came back with, I create an outline for the film from that."}, {"time": 4922, "text": "And that's the third visioning, right?"}, {"time": 4925, "text": "That's usually completely different than my original vision for the film to some extent, right?"}, {"time": 4930, "text": "But I have to stay open to that entire process or I'd be trying to create something that I can't really create."}, {"time": 4939, "text": "So I think those are the three creations for me."}, {"time": 4942, "text": "That's so cool to know what we have, just to lay it all out and to load it in into your mind."}, {"time": 4951, "text": "Cause like, this is the capture of reality we have."}, {"time": 4955, "text": "It's a very kind of scientific process too."}, {"time": 4957, "text": "Cause you know, in science, you collect a bunch of data about a phenomena and now you have to like analyze that data, but now your phenomena is long gone."}, {"time": 4966, "text": "Now you just have the data."}, {"time": 4967, "text": "Just the data and you have to write a paper about it, like analyze the data, it's similar things."}, {"time": 4974, "text": "You have to like load it all in."}, {"time": 4975, "text": "Where's the story?"}, {"time": 4976, "text": "How do you, that last probably profound piece of doing the editing, like in your mind, like how to lay those things out?"}, {"time": 4990, "text": "Well, it's almost like the scientific process, right?"}, {"time": 4992, "text": "I have a hypothesis, a creative hypothesis, right?"}, {"time": 4995, "text": "Not a scientific one."}, {"time": 4997, "text": "But then I'm testing the hypothesis during the course of filming, right?"}, {"time": 5000, "text": "And I have to stay true to what the data tells me in the end creatively."}, {"time": 5005, "text": "So it's very similar to the scientific processes."}, {"time": 5007, "text": "I don't know what we should, we should probably coin that."}, {"time": 5010, "text": "Yeah, that's pretty good."}, {"time": 5011, "text": "Creative scientific process or something like that."}, {"time": 5014, "text": "But then you actually do the edit and then you watch, that's also iterative in a sense, because maybe when you have a film, that's 20, 30, 40 minutes, or if it's feature length, like do you ever have it where it sucks?"}, {"time": 5034, "text": "Like it's not at all."}, {"time": 5035, "text": "Is there a stage where it sucks?"}, {"time": 5036, "text": "Like a stage where, right, right."}, {"time": 5038, "text": "Like it's where it's like, no, this is not, this is not what I was, like when it's all put together in this way, this doesn't, this is not working right."}, {"time": 5047, "text": "This is not right."}, {"time": 5048, "text": "Or do you, is it always like an incremental step towards better and better?"}, {"time": 5053, "text": "It's incremental."}, {"time": 5053, "text": "Yeah, it's incremental."}, {"time": 5054, "text": "Yeah, and there's always some moment in the editing process where there's a breakthrough, where suddenly I understand how it fits together more fully."}, {"time": 5064, "text": "And you have to be, like you said, resilient."}, {"time": 5066, "text": "You have to be patient that that moment will come."}, {"time": 5069, "text": "Are you ultra self critical or are you generally optimistic and patient?"}, {"time": 5075, "text": "I don't think those are mutually exclusive."}, {"time": 5078, "text": "Right, so you just oscillate or are they like dance partners or something?"}, {"time": 5082, "text": "They're dance partners, yeah."}, {"time": 5084, "text": "Definitely dancing all the way through the process."}, {"time": 5087, "text": "By way of advice, you know, to young filmmakers, how to film something that is recognized by the world in some way."}, {"time": 5100, "text": "I would say, you know, first off, learn your craft, right?"}, {"time": 5105, "text": "Because I think craft is incredibly foundational, right?"}, {"time": 5111, "text": "To creating a powerful story."}, {"time": 5114, "text": "And sorry to interrupt, but when you say craft, do you mean just the raw technical, the director of photography, like the filming aspect?"}, {"time": 5121, "text": "Is it the storytelling, is it the access, the whole thing?"}, {"time": 5124, "text": "I think craft is more than just knowing how to push record on a camera or what lens to use, right?"}, {"time": 5128, "text": "That's part of it, right?"}, {"time": 5130, "text": "But I think at least in nonfiction, you know, I'm a product to some extent of having to know how to do it all, right?"}, {"time": 5142, "text": "Having to teach myself how to do it all."}, {"time": 5144, "text": "Because I didn't go to film school, you know?"}, {"time": 5148, "text": "But I became so enamored of telling stories through a camera."}, {"time": 5154, "text": "What was the leap, by the way, from theater to storyteller?"}, {"time": 5157, "text": "Oh, I just needed an extra class in grad school."}, {"time": 5160, "text": "I was in a MFA directing class and I needed an extra class and I just sort of like talked my way into a television directing class and fell in love with it."}, {"time": 5171, "text": "And the actor became the director."}, {"time": 5175, "text": "Well, yeah, I mean, I wasn't an actor, but I had to act and I had to know the craft of acting because I was in the theater, you know, to work with actors."}, {"time": 5182, "text": "Did you love it, though?"}, {"time": 5184, "text": "Did you love acting?"}, {"time": 5184, "text": "The theater?"}, {"time": 5187, "text": "Yeah, theater?"}, {"time": 5188, "text": "The first, yeah, as an undergraduate, yeah."}, {"time": 5190, "text": "But then I learned pretty quickly that I was pretty bad at it, or at least not very good, and that my skills lay elsewhere in more sort of behind the scenes and shaping a story."}, {"time": 5202, "text": "When you started taking a class, but also telling stories as a director, did you quickly realize that you're pretty good at this or was it a grind?"}, {"time": 5216, "text": "That's a good question, Max."}, {"time": 5218, "text": "I think, I definitely knew right away that it was more my wheelhouse, right?"}, {"time": 5225, "text": "And I think part of that was because I grew up in sort of a world of imagination."}, {"time": 5234, "text": "And I think that active imagination as a child really lent itself well to the skillset that a director needs, right?"}, {"time": 5243, "text": "To shape story, to shape narrative, to shape performances."}, {"time": 5246, "text": "So I think it was a much more natural fit for me."}, {"time": 5249, "text": "Was I excellent at the beginning?"}, {"time": 5251, "text": "Heck no, no, I think few people are, but I learned."}, {"time": 5256, "text": "Where was the biggest struggle for you?"}, {"time": 5257, "text": "Is it, so your imagination clearly was something that you worked on for a lifetime."}, {"time": 5263, "text": "So I'm sure that was pretty strong."}, {"time": 5266, "text": "Books, came from books."}, {"time": 5267, "text": "Books."}, {"time": 5269, "text": "But the actual conversion of the imagination, you said shape the story."}, {"time": 5273, "text": "Where was the skill most lacking in the shaping of the story initially?"}, {"time": 5279, "text": "Technical side."}, {"time": 5279, "text": "Just technical side."}, {"time": 5280, "text": "Yeah, like, you know, cause I taught myself everything."}, {"time": 5283, "text": "What kind of microphone should I use, right?"}, {"time": 5285, "text": "What kind of camera?"}, {"time": 5286, "text": "What does this lens do?"}, {"time": 5287, "text": "What's that lens do?"}, {"time": 5288, "text": "I didn't know any of that."}, {"time": 5290, "text": "And so I essentially was, I have been self taught, technically."}, {"time": 5294, "text": "How do you get good technically, would you say, when you're self taught?"}, {"time": 5296, "text": "Just doing it over and over again."}, {"time": 5298, "text": "And what kind of stories were you telling?"}, {"time": 5300, "text": "I began shooting local commercials for."}, {"time": 5304, "text": "For money?"}, {"time": 5305, "text": "For money, yeah, yeah."}, {"time": 5306, "text": "So you're doing professional projects?"}, {"time": 5308, "text": "And so I kind of learned on the job as I did it."}, {"time": 5311, "text": "How many hobby projects did you do, just for the hell of it?"}, {"time": 5314, "text": "Or were you trying to focus on the professional?"}, {"time": 5315, "text": "Well, I was trying to make money, right?"}, {"time": 5317, "text": "Right out of grad school, just to pay the rent."}, {"time": 5319, "text": "And that's a forcing function to, I mean, I personally love having my back to the wall or financially you're screwed if you don't succeed."}, {"time": 5330, "text": "I mean, I lived out of the trunk of my car for a couple of years after grad school, just freelancing, just like, but that couple of years really helped me learn fast because I had to learn fast."}, {"time": 5342, "text": "So I did a couple of voyages around the world for this group called Semester at Sea, that is a floating university that where they go out three and a half months at a time with about 500 college level students and about 35 professors."}, {"time": 5356, "text": "And so you're shooting every day for three and a half months in like nine different countries."}, {"time": 5360, "text": "And so that really was like instrumental to me becoming a pretty good camera person pretty quickly."}, {"time": 5367, "text": "And you were doing most of the work yourself?"}, {"time": 5369, "text": "One man, one man band, yeah."}, {"time": 5371, "text": "The second voyage, I at least had an editor with me."}, {"time": 5375, "text": "Yeah, but I was shooting everything."}, {"time": 5376, "text": "Yeah, what's the perfect team?"}, {"time": 5378, "text": "Is it two people for nonfiction asking for a friend?"}, {"time": 5383, "text": "Some kind of interested in some storytelling, not of the level and the sophistication that you're doing, but more."}, {"time": 5391, "text": "I think you have to allow the story to dictate what the size of the film should be."}, {"time": 5394, "text": "For these small human rights docs I do, I think two or three, it means you work your butt off, because you're doing everything, right?"}, {"time": 5401, "text": "But it allows you to tell intimate stories and have that access."}, {"time": 5404, "text": "I'm doing a film this summer that's a scripted piece where we'll probably have 25 crew people."}, {"time": 5411, "text": "So it's a completely different endeavor altogether."}, {"time": 5414, "text": "But doing it yourself, what do you think about that?"}, {"time": 5418, "text": "Even though you have that trillion dollars."}, {"time": 5421, "text": "Oh, I have that trillion dollars again?"}, {"time": 5423, "text": "Sweet, you can write that check before I leave, right?"}, {"time": 5425, "text": "Yeah, I will."}, {"time": 5426, "text": "I've never seen a check for that big."}, {"time": 5430, "text": "It's gonna be interesting."}, {"time": 5431, "text": "How many zeros is that?"}, {"time": 5431, "text": "I write them so often, I've lost track."}, {"time": 5436, "text": "Or the United States government sure as heck writes them often."}, {"time": 5439, "text": "Okay, anyway, I mean, is there an argument can you steel man the case for a single person?"}, {"time": 5444, "text": "Not for me, not for me, and here's why."}, {"time": 5453, "text": "What I've found is that by being a team of two filming with a field producer, by two people filming, it allows us to double our footage first off, right?"}, {"time": 5470, "text": "So we have twice as much footage in the time we're filming to come back with as opposed to one person filming."}, {"time": 5475, "text": "So you're each manning a camera?"}, {"time": 5479, "text": "And how much, sorry to keep interrupting, how much interaction and interplay there is?"}, {"time": 5485, "text": "Sometimes the director of photography is in another room filming a different scene, if it makes sense."}, {"time": 5490, "text": "Sometimes we're cross shooting in the same room, right?"}, {"time": 5492, "text": "Just depends on the needs of the moment."}, {"time": 5495, "text": "So we come back with double the footage is one thing."}, {"time": 5498, "text": "But as a director, so that's, you know, given how access is sometimes shaped by the events so that we can only, something, you know, in Lifeboat, for example, you know, a rescue operation may only happen three days, right?"}, {"time": 5512, "text": "So you want as much footage of that as you can."}, {"time": 5515, "text": "But the other piece of it that's really critical for me, I found is that by having another human being I'm filming with, who I'm co shooting with, it frees me up as a director to not always have to be shooting either."}, {"time": 5527, "text": "I can do all the other work to build relationships, right?"}, {"time": 5531, "text": "To have side conversations with people, to sort out the right way to tell a story, right?"}, {"time": 5538, "text": "Or to transfer footage, knowing that the director of photography is still filming during all that."}, {"time": 5543, "text": "So it frees me up to think of as a director rather than just an image acquirer."}, {"time": 5549, "text": "Yeah, cause there's also, I don't know how distracting it is."}, {"time": 5552, "text": "You've obviously done it for years, but setting stuff up, it preoccupies your mind."}, {"time": 5560, "text": "Like pressing the record button, and like framing stuff and all that, that still takes up some part of your mind where you can't think freely."}, {"time": 5568, "text": "That's my choice, right?"}, {"time": 5569, "text": "That's how I work best."}, {"time": 5571, "text": "That said, the caveat there would be that's not the only way to do it, obviously, right?"}, {"time": 5575, "text": "Like one of my favorite documentaries of all time is a documentary called A Woman Captured, shot in Hungary, by a single filmmaker with a single camera with a single lens, right?"}, {"time": 5589, "text": "And it's brilliant, and powerful, and moving, and interventional."}, {"time": 5596, "text": "It's incredible filmmaking, and it was a single human being who created that film with a collaborator or subject."}, {"time": 5603, "text": "So it can be done, it's just not how I work best."}, {"time": 5606, "text": "Yeah, how much personally would the other person, how important is the relationship with them outside of the filming?"}, {"time": 5617, "text": "With the director of photography?"}, {"time": 5618, "text": "The director of photography, say."}, {"time": 5619, "text": "Like, how much drinking, and if you don't drink, whatever the equivalent of that is, do you have to do together?"}, {"time": 5627, "text": "How much soul searching?"}, {"time": 5628, "text": "Or is it more like two surgeons getting together?"}, {"time": 5632, "text": "Is it surgeons, or is it a jazz band?"}, {"time": 5635, "text": "Well, it could be either, right?"}, {"time": 5637, "text": "Hopefully not at the same time, though, because I don't think surgeons and jazz bands go well together, probably."}, {"time": 5642, "text": "They're both good with fingers, I suppose."}, {"time": 5645, "text": "Exactly, but I'd rather maybe not play jazz while they operate on me."}, {"time": 5649, "text": "But I think, for me, I think there are moments of both, but usually not at the same time, right?"}, {"time": 5657, "text": "There are surgical moments where the moment is so pressing, you really have to be that task driven, right?"}, {"time": 5665, "text": "To capture as thoroughly as possible whatever's unfolding, right?"}, {"time": 5669, "text": "But I think there's other times where you do improvise like jazz, right?"}, {"time": 5672, "text": "And where you have a lot of choices ahead of you, and you're doing maybe a dance with the other camera person, right?"}, {"time": 5681, "text": "In order to capture a scene as creatively and fully as possible during a fixed duration."}, {"time": 5687, "text": "How much, you said shaping, because it is nonfiction."}, {"time": 5691, "text": "But I feel like there's so many ways to tell the same nonfiction, that is bordering on fiction."}, {"time": 5698, "text": "Well, it's storytelling."}, {"time": 5703, "text": "And how much shaping do you see yourself as doing?"}, {"time": 5708, "text": "Like how important is your role?"}, {"time": 5710, "text": "How you tell the story?"}, {"time": 5714, "text": "I suppose the question I'm asking is, how many ways can you really screw this up?"}, {"time": 5720, "text": "Every day you can screw it up."}, {"time": 5722, "text": "I mean, that's really the, I think what you're asking about is really the ethos of documentary filmmaking, right?"}, {"time": 5729, "text": "I allow a lot of things to guide my choices."}, {"time": 5734, "text": "One of them being, am I being fair, right?"}, {"time": 5738, "text": "Not balanced, but am I being fair to what I'm witnessing?"}, {"time": 5743, "text": "Does the camera capturing in a fair way the truth of the reality?"}, {"time": 5748, "text": "Some fundamental truth of it."}, {"time": 5749, "text": "And it also speaks to consent, right?"}, {"time": 5751, "text": "Am I being fair in a sense of consent?"}, {"time": 5753, "text": "Do I have active consent in this moment, right?"}, {"time": 5756, "text": "Regardless of whether I have a signed piece of paper."}, {"time": 5758, "text": "I always find some way to document it, whether it's just direct address to camera or a translated release."}, {"time": 5765, "text": "So there's, actually that's an interesting little, so they say something to the camera that they consent or they sign the thing."}, {"time": 5772, "text": "Yeah, so for example, the large broadcast companies have this formalized process where they present a piece of paper, right?"}, {"time": 5781, "text": "And the subject reads it and they sign it and then you have permission and that's irrevocable, right?"}, {"time": 5788, "text": "So it'll hold up in court."}, {"time": 5790, "text": "That's not how I operate, right?"}, {"time": 5792, "text": "And so it's just, for example, that doesn't work if someone's illiterate and can't read that piece of paper, right?"}, {"time": 5802, "text": "What if they don't know how to sign their name, right?"}, {"time": 5804, "text": "So instead you have to have a conversation, ask questions, have them ask questions, come to a complete understanding before you even know whether they understand what you're asking, right?"}, {"time": 5814, "text": "And then in that case, if someone's illiterate, then you have that conversation, you just sit down and it takes a long time sometimes, but you have to do it."}, {"time": 5821, "text": "And then if they still wanna participate and they give you their consent, they can't sign a piece of paper, right?"}, {"time": 5828, "text": "So then you just do in their native language, right?"}, {"time": 5831, "text": "Direct consent to camera in their language."}, {"time": 5834, "text": "Interesting, but also you're speaking to the consent that's just a human placing trust in you."}, {"time": 5840, "text": "You make a connection like this."}, {"time": 5841, "text": "That's the most important consent, yeah."}, {"time": 5843, "text": "I hate papers, I hate papers and lawyers because they, exactly for that reason, yeah, okay, great, but you should be focusing on the human connection that leads to the trust, like real consent and consent day to day, minute to minute, because that can change."}, {"time": 5863, "text": "Absolutely, and it does change."}, {"time": 5866, "text": "You mentioned A Woman Captured."}, {"time": 5871, "text": "I'm sure you can't answer that, but I will force you."}, {"time": 5874, "text": "What are the top three documentaries of all time, short or feature length?"}, {"time": 5881, "text": "This is not your opinion, this is objective truth."}, {"time": 5885, "text": "Maybe top one, what's the greatest?"}, {"time": 5889, "text": "We got, let's see, March of the Penguins."}, {"time": 5894, "text": "That's probably number one for me."}, {"time": 5896, "text": "No, I'm just kidding, I don't know."}, {"time": 5897, "text": "I do seem to, the metaphor of penguins huddling together in hard, cold, like in the harsh conditions of nature, that's something that's kind of beautiful."}, {"time": 5914, "text": "I don't love all nature documentaries, but something about March of the Penguins."}, {"time": 5920, "text": "I think Morgan Freeman."}, {"time": 5922, "text": "Yeah, he narrated it."}, {"time": 5923, "text": "Narrates it, so maybe everything, just any documentary with Morgan Freeman, I'm a sucker for that."}, {"time": 5930, "text": "Warner, Herzog, The Life and the Taiga, The Simple People."}, {"time": 5934, "text": "I love Grizzly Man, I love Grizzly Man."}, {"time": 5936, "text": "I think that's one of his best works."}, {"time": 5939, "text": "Yes, I think that's Joe Rogan's favorite documentary."}, {"time": 5944, "text": "It's both comedy and, I mean it's."}, {"time": 5946, "text": "Tragic comedy."}, {"time": 5947, "text": "Tragic comedy, yeah."}, {"time": 5949, "text": "Is there something that stands out to you, I mean I'm joking about best, something that was impactful to you?"}, {"time": 5955, "text": "Just to put it out there, I don't think there's any way to say that they're objectively the best three documentaries of all time, but for me, and you may find this interesting given your background, is that I think my top three are all from the Eastern Bloc, actually."}, {"time": 5975, "text": "So Aquarella by Viktor Kosokovsky is one of my favorite, and it's a couple years old now, which is sort of a meditation on the place water has on our planet and on our lives."}, {"time": 5990, "text": "I think A Woman Captured that I mentioned, which was shot in Hungary."}, {"time": 5994, "text": "Is it a feature length one?"}, {"time": 5996, "text": "Both are feature lengths, yeah."}, {"time": 5998, "text": "It is just brilliant, and it I think has yet to find distribution here in the U.S."}, {"time": 6005, "text": "But it's the perfect example of what they call verite, or direct nonfiction filmmaking."}, {"time": 6013, "text": "A European woman, this is the synopsis, a European woman has been kept by a family as a domestic slave for 10 years, drawing courage from the filmmaker's presence."}, {"time": 6023, "text": "She decides to escape the unbearable oppression and become a free person."}, {"time": 6028, "text": "Wow, so the filmmaker is part of the story."}, {"time": 6032, "text": "Part of the story, it didn't start that way, but during the course of the story, the filmmaker comes to understand that this is actually modern day slavery."}, {"time": 6041, "text": "And rather than just allow it to be, actually enables and assists this woman to free herself from slavery and become a free woman."}, {"time": 6051, "text": "I wonder, sorry, on a small tangent before we get to number three, like Icarus is interesting too."}, {"time": 6057, "text": "How often do you become part of the story, or the story is different because of your presence?"}, {"time": 6066, "text": "Like you changed the tide of history."}, {"time": 6070, "text": "Yeah, well, back to just like one person at a time that we keep talking, we keep coming back to that theme on some level."}, {"time": 6076, "text": "So this could tie in interesting to one of my favorite films actually."}, {"time": 6081, "text": "So the last two films that I would mention for my top four list would be, the third Eastern Bloc one would be a film called Immortal in 2019, which was shot in Russia by a Russian woman that sort of examines the place of the state in shaping individuals to be vehicles for the state."}, {"time": 6106, "text": "I mean, that's my own synopsis, but that's one of my takeaways from the brilliant 60 minute doc or so."}, {"time": 6112, "text": "Again, Russian filmmaking is really quite good and powerful."}, {"time": 6117, "text": "The fourth one would be a Frederick Wiseman film, Titicate Follies, which was filmed in the US decades ago, inside basically the bowels of an insane asylum or a mental health institution."}, {"time": 6131, "text": "And I bring up Wiseman because he is really the godfather, so to speak, of direct cinema or cinema verite."}, {"time": 6141, "text": "And when early in my career, I really believed in what he expressed as the place of the verite filmmaker, which is simply fly on the wall, which is only observational in nature, right?"}, {"time": 6161, "text": "And I believe that that's how I should be as a nonfiction filmmaker, that I was there only to bear witness, to observe, and not to intervene in any way, shape, or form."}, {"time": 6172, "text": "And that was the sort of foundation for how I operated for many, many years."}, {"time": 6180, "text": "And then some things happened."}, {"time": 6181, "text": "So one of those things that happened was I filmed Lifeboat."}, {"time": 6187, "text": "And during the course of filming Lifeboat, which covered rescue operations in the Mediterranean off the coast of Libya, in the first three days of that rescue mission, we came upon over 3,000 people, asylum seekers, floating in flimsy rafts in the water."}, {"time": 6210, "text": "And we were on the Zodiacs and we were filming."}, {"time": 6215, "text": "And within the first couple hours, we would come up to these rafts and these boats that were in really dire shape, and people would be pushed off, and people would jump off, and people would fall into the water, and some of them couldn't swim."}, {"time": 6237, "text": "And so we found ourselves in this moment where we had a choice."}, {"time": 6242, "text": "We could film someone drown in front of us, or we could put our cameras down and pull them out of the water."}, {"time": 6248, "text": "And so that's what we did."}, {"time": 6250, "text": "We put our cameras in the bottom of the water, bottom of the Zodiac, and just started pulling people out of the water."}, {"time": 6257, "text": "And if I was Wiseman, according to his paradigm, then we should have just filmed."}, {"time": 6265, "text": "And I didn't anticipate that moment beforehand."}, {"time": 6270, "text": "I had no sort of foreknowledge that I was gonna find myself faced with that dilemma of the moment as a documentarian."}, {"time": 6278, "text": "But there was no question in my mind that I had to put my camera down and pull that fellow human being out of the water."}, {"time": 6283, "text": "And I don't regret it at all."}, {"time": 6285, "text": "So I've come to a different place."}, {"time": 6286, "text": "I've evolved to what I believe for the kind of film that I do is more appropriate."}, {"time": 6292, "text": "I can go to sleep at night knowing that, regardless of how the film would have been different if I hadn't made that choice, I made the right choice as a human being."}, {"time": 6302, "text": "So I think of it as being a human being first and a filmmaker second in moments like that."}, {"time": 6308, "text": "That's beautifully put, but I also think you could be a human being in small ways too, like silly ways, and put a little bit of yourself in documentaries."}, {"time": 6320, "text": "I tend to see that as really beautiful."}, {"time": 6324, "text": "Like the meta piece of it?"}, {"time": 6326, "text": "Yeah, just put yourself into the movie a little bit."}, {"time": 6331, "text": "Because break that third, fourth, whatever the wall is, is realize that there's a human behind the camera too."}, {"time": 6338, "text": "For some reason, me as a fan, as a viewer, that's enjoyable too."}, {"time": 6342, "text": "I think there's a real authenticity there behind the story, especially with these hard stories that you're doing that there's a human being struggling to."}, {"time": 6353, "text": "Like observing the suffering and having to bear the burden that this kind of suffering exists in the world and you're behind that camera living that struggle."}, {"time": 6369, "text": "And there's small ways to show yourself in that way."}, {"time": 6372, "text": "As you know, I don't do that in a big way."}, {"time": 6376, "text": "But I actually, there are subtle moments where I allow that presence to live just for a second."}, {"time": 6383, "text": "Like I hate belly button docs, that's what I call them."}, {"time": 6387, "text": "What's a belly button doc?"}, {"time": 6388, "text": "A belly button doc is navel gazing, right?"}, {"time": 6390, "text": "Where it's sort of a narcissistic filmmaking where someone just studies their own place in the world."}, {"time": 6398, "text": "Right, I think."}, {"time": 6400, "text": "I think my, I'm more concerned with how I can intervene, right?"}, {"time": 6408, "text": "Yeah, well, you're trying to really deeply empathize."}, {"time": 6413, "text": "So like, if you do empathize, who am I?"}, {"time": 6415, "text": "I don't wanna center myself in these stories."}, {"time": 6417, "text": "It's not about me, right?"}, {"time": 6419, "text": "I am so unimportant."}, {"time": 6422, "text": "What is important is what's happening, what's unfolding in the world that we need to act upon."}, {"time": 6426, "text": "And I think it's selfish and narcissistic to push myself into these stories unnecessarily."}, {"time": 6433, "text": "Now that said, I think there is some small value in what you're saying just to remind viewers that there's obviously a filmmaker at play."}, {"time": 6441, "text": "So sometimes the way that I do that is just like through a question on camera."}, {"time": 6445, "text": "I'd allow the audio to live of a question or during a conversation I'm having with someone so they can just hear how it's posed, for example, right?"}, {"time": 6454, "text": "And to me, that's enough."}, {"time": 6458, "text": "I do like moments when people recognize that you exist."}, {"time": 6463, "text": "They look at the filmmaker past the camera and yes, you ask the question in an interview or something like that and they respond to that."}, {"time": 6473, "text": "Like they respond to this like new perturbation into their reality that was created by this other human."}, {"time": 6480, "text": "I especially like when those questions or those perturbations are like a little bit absurd and like add something very novel to their situation and that novelty reveals something about them."}, {"time": 6495, "text": "So as opposed to capturing the day to day reality of their life, you do that plus the perturbations of like something novel."}, {"time": 6504, "text": "But of course, there's all kinds of ways to do this."}, {"time": 6506, "text": "Let me, what was number five, by the way?"}, {"time": 6509, "text": "I only gave you four."}, {"time": 6511, "text": "I'm just gonna stay at four."}, {"time": 6513, "text": "There's a short doc I like, I mentioned, they're called The Toxic Pigs of Fukushima."}, {"time": 6522, "text": "It's a great title though, right?"}, {"time": 6523, "text": "It's a great title."}, {"time": 6523, "text": "Yeah, great title."}, {"time": 6525, "text": "No one's seen it, but it's great."}, {"time": 6527, "text": "It says what it sounds like."}, {"time": 6529, "text": "Yeah, yeah, it's exactly what it sounds like, but really brilliantly executed."}, {"time": 6535, "text": "Well, let me ask you about Lifeboat because it's extremely, I don't."}, {"time": 6544, "text": "It's a really moving idea."}, {"time": 6547, "text": "Just the fact that this exists in the world, that there's, as a metaphor, as a reality, that there is a set of people trying to flee desperately."}, {"time": 6558, "text": "It's the desperation of it."}, {"time": 6561, "text": "And now with these refugees, the desperation of that, of trying to escape towards a world that's full of mystery, uncertainty, doubt, could be hopeless at times, and you're willing to do a lot for your own survival and for the survival of your family and all those kinds of things."}, {"time": 6580, "text": "That's kind of the human spirit, and you just capture it in Lifeboat."}, {"time": 6587, "text": "Can you tell me the story behind this film as you started to already tell?"}, {"time": 6592, "text": "Can you tell me what is it about?"}, {"time": 6596, "text": "So Lifeboat really seeks to sort of lift up and showcase the asylum seeker crisis in the Mediterranean when it was at its height in 2016."}, {"time": 6615, "text": "And it came to be for many reasons, but one of those reasons is colleagues in the NGO community really shared with me that when the borders between Greece and Turkey were shut down, that the flow of Syrian asylum seekers that was initially going across from Turkey to Greece was going to shift westward across the Mediterranean."}, {"time": 6642, "text": "So I started to research that and discovered that was exactly the case, and then further stumbled upon the fact that nation states hadn't really stepped up to address it and that there were hundreds of asylum seekers often drowning in these flimsy crafts that were pushed off from the shores of Libya because the EU wasn't doing its duty to patrol those waters from a humanitarian standpoint."}, {"time": 6669, "text": "And so the net result of that was that this whole sort of like humanitarian community sprung up and it was civil society based that tried to meet the needs of those asylum seekers to just ensure that fellow human beings weren't drowning, simply put."}, {"time": 6687, "text": "And one of those was the small little NGO called Sea Watch, which when they discovered what was happening, just cobbled together a coalition of volunteers, bought a research vessel, retrofitted it, and motored down off the coast of Libya to start pulling people out of the water."}, {"time": 6705, "text": "And again, I found that inspiring, right?"}, {"time": 6708, "text": "I found that inspiring that this group of volunteers was doing something that our leaders wouldn't, right?"}, {"time": 6716, "text": "And it was something as basic and simple as saving human beings."}, {"time": 6723, "text": "And I thought there was an inspiring story there."}, {"time": 6726, "text": "And as it turned out, there was."}, {"time": 6728, "text": "Have you ever saved someone's life as part of making these documentaries directly?"}, {"time": 6737, "text": "And directly, I think you probably have countless lives, but directly, were you put in that position?"}, {"time": 6745, "text": "I don't wanna, I mean, I certainly poured people out of the water who couldn't swim, I did that."}, {"time": 6753, "text": "And that's again, speaking to the basic humanity, put down the camera and help, yeah."}, {"time": 6760, "text": "So this is people coming from Libya, trying to make it across the Mediterranean Sea on a crappy, tiny boat."}, {"time": 6768, "text": "From a filmmaker perspective, how do you film that?"}, {"time": 6771, "text": "Was there decisions to capture the desperation?"}, {"time": 6775, "text": "Well, we were going back to this idea of access and how that's so fundamental to my approach."}, {"time": 6783, "text": "And we were bound by the strictures of the rescue operation on this Sea Watch vessel, which was 30 meters long."}, {"time": 6792, "text": "And we were two of a crew of 15, right?"}, {"time": 6796, "text": "So we had to multitask all the time because the only reason we were on that boat was by agreeing that if needed, we would do whatever necessary, right?"}, {"time": 6807, "text": "To help, right?"}, {"time": 6810, "text": "And so it was very active on multiple levels and we were making decisions each and every day that were not only filmmaking and creative decisions, but also decisions about how to live that duality, right?"}, {"time": 6833, "text": "Of being a humanitarian and a filmmaker simultaneously."}, {"time": 6836, "text": "And the greatest example I can share of that was, or with my director of photography in that project, Kenny Allen, Kenny's a big guy."}, {"time": 6848, "text": "It's like, he's got like arms like tree trunks."}, {"time": 6851, "text": "And he, because he was so physically able and strong, the head of mission really tasked him to be on the Zodiacs to pull people out of the water because he could literally with one arm reach down and just oftentimes pull someone out, right?"}, {"time": 6870, "text": "Whereas usually it would take two or three people, right?"}, {"time": 6873, "text": "And so when we were at the height of triage and there were people in the water all over and rafts were sinking, Kenny was out pulling people out of the water."}, {"time": 6883, "text": "And this went on for like 24 hours, right?"}, {"time": 6886, "text": "And at the end of that first day, I remember like looking over on the deck and seeing Kenny like help people up from the ladders to walk them back, right?"}, {"time": 6896, "text": "And his camera was nowhere to be seen, right?"}, {"time": 6899, "text": "And so I walked over to him and I just grabbed him by the shoulders and said, Kenny, where's your camera?"}, {"time": 6907, "text": "And he didn't know."}, {"time": 6908, "text": "He had no idea where his camera was, right?"}, {"time": 6911, "text": "And so I just said, Kenny, we're here to do what you're doing, but we're also here to film it, right?"}, {"time": 6921, "text": "To make sure that we document what is unfolding in front of us so that we have a record of it, right?"}, {"time": 6928, "text": "So we can bring it to a larger audience."}, {"time": 6930, "text": "So you need to go find your camera so we can also document it."}, {"time": 6934, "text": "And that kind of pulled him out and he went and got his camera and started filming again, but that gives you a sense of sort of this world that we had to live in in order to get the story done."}, {"time": 6943, "text": "But I think to be a great director of photography, to be a great director, you have to lose yourself like that in the story too."}, {"time": 6953, "text": "But usually with a camera in your hand, right?"}, {"time": 6955, "text": "But sometimes you forget the camera."}, {"time": 6958, "text": "I mean, there's a, I feel like if you're obsessed with the camera too much, you can lose the humanity of it."}, {"time": 6968, "text": "You get obsessed with the film and the story."}, {"time": 6970, "text": "It can become clinical."}, {"time": 6971, "text": "Yes, it can become clinical."}, {"time": 6972, "text": "Absolutely, and it's, you know, yeah, absolutely."}, {"time": 6975, "text": "And we don't wanna become, I don't wanna become clinical in my film, certainly."}, {"time": 6979, "text": "Let me ask you a strange and perhaps edgy question."}, {"time": 6983, "text": "So some filmmakers believe it's justified to break the rules in order to tell a powerful story."}, {"time": 6990, "text": "Warner Herzog, I read this somewhere, teaches young filmmakers to pick locks and forge documents and so on."}, {"time": 6999, "text": "Oh, I didn't know that, interesting."}, {"time": 7002, "text": "Bending the rules in service of telling a story."}, {"time": 7006, "text": "You would, of course, never break the law, but is there, does that, just generally speaking, speaking, bending the rules and so on?"}, {"time": 7050, "text": "So, like, the rules are a very hazy kind of concept."}, {"time": 7054, "text": "And a lot of them, especially, like, it's funny, but authoritarian regimes often have a giant bureaucracy buildup that's full of rules."}, {"time": 7060, "text": "There's more rules than you know what to deal with, and you can't actually live life unless you break the rules."}, {"time": 7065, "text": "Anyway, laying that all out on the table, do you ever contend with that, on what are the rules I can break or should break to keep to the spirit of the story?"}, {"time": 7080, "text": "I think you have to ask yourself, are the rules just, and why are they in place, right?"}, {"time": 7085, "text": "So, for example, coming into the airport in southern Yemen, right?"}, {"time": 7090, "text": "If I just tried to walk through the airport with all my equipment, even with all the permissions beforehand, like we had, without having a fixer at the airport beforehand to make sure we didn't go through the standard line, right?"}, {"time": 7104, "text": "We would have been caught up for three hours at least negotiating over our equipment and eventually paying a bribe to get it through, right?"}, {"time": 7113, "text": "That's just reality in a place like Yemen."}, {"time": 7116, "text": "And so, of course, knowing that, right?"}, {"time": 7119, "text": "Having talked to colleagues who had taken that path previously, I took a different path, right?"}, {"time": 7125, "text": "Where we hire a fixer beforehand to sort it out beforehand, right?"}, {"time": 7130, "text": "Rather than spending three hours of our time and paying a series of bribes, right?"}, {"time": 7134, "text": "Instead, we're going to get it fixed beforehand so that we can walk through a different line and have no one look at any of our equipment."}, {"time": 7142, "text": "That's a pretty good trade off in my mind."}, {"time": 7146, "text": "What about security when you're traveling in these places?"}, {"time": 7149, "text": "Do you ever have bodyguards?"}, {"time": 7152, "text": "Well, several questions around that."}, {"time": 7154, "text": "Are you ever afraid for your life when you're filming in a war zone?"}, {"time": 7159, "text": "Is there any way to lessen the probability of death?"}, {"time": 7167, "text": "I don't have a death wish."}, {"time": 7168, "text": "I try to mitigate risk however I can, however I can."}, {"time": 7172, "text": "But one of the ways I can't do it in a conflict zone is by having armed security with me."}, {"time": 7177, "text": "And the reason for that is because, especially in a place like Yemen, right?"}, {"time": 7181, "text": "If you have armed security, you become a target in a way that if you're operating under sort of the auspices of international humanitarian law, I actually have more protection."}, {"time": 7193, "text": "So I don't bring security."}, {"time": 7195, "text": "If you're working in Northern Yemen, for example, you're going to have someone from the de facto authorities with you anyway the entire time you're there."}, {"time": 7206, "text": "So the authorities are with you in form anyway."}, {"time": 7210, "text": "Regarding fear, yeah, of course."}, {"time": 7217, "text": "I mean, fear is a natural human emotion, right?"}, {"time": 7220, "text": "And I think we have a weird mindset, this sort of heroic mindset surrounding fear in the US, which I don't pay tribute to."}, {"time": 7234, "text": "I believe as a natural human emotion, it's an alarm bell that I need to pay attention to."}, {"time": 7240, "text": "And I think rather than pretending to be brave, I think you have to just acknowledge that fear has a place to keep you alive."}, {"time": 7254, "text": "And I think it's a matter of not letting the fear arrest you and allowing the fear to live and then acting anyway."}, {"time": 7264, "text": "Don't you think as a documentary filmmaker, the fear is a really good signal for potentially a good thing to do because there's a story there?"}, {"time": 7274, "text": "So is fear is an indicator that you shouldn't do it or is it an indicator that you should do it?"}, {"time": 7279, "text": "It's probably an indication you should do it, right?"}, {"time": 7282, "text": "And strangely, I think that's why, I think that if there's something unusual about the work I do in some part, it's because of these types of stories, right?"}, {"time": 7295, "text": "They're hard to access, but you also have to have a threshold of willingness to do them when you can't, there is no guarantee of physical safety, right?"}, {"time": 7310, "text": "And maybe that's why you should do them."}, {"time": 7312, "text": "I'm very much motivated by the things that scare me."}, {"time": 7316, "text": "They seem to direct the things that are worth doing in this all too short life."}, {"time": 7321, "text": "How often do you interact with our friendly friends at the police departments of various locations?"}, {"time": 7327, "text": "Like, because of the humanitarian nature of your work, are you able to avoid all such friendly conversations or are you often making friends with our?"}, {"time": 7341, "text": "I try to avoid the friendly police people all over the world as much as possible, but in some instances, it's important to be proactive, right, and make sure that they know what you're doing before you do it."}, {"time": 7357, "text": "So it's all about the context and the situation."}, {"time": 7361, "text": "For example, working in Northern Yemen, you couldn't film for five minutes if you didn't have paperwork, because you'd be taken away."}, {"time": 7368, "text": "So you have to make sure you have all those permissions ahead of time."}, {"time": 7373, "text": "50 Feet from Syria, I would love to talk at least a little bit about this film."}, {"time": 7380, "text": "First, can you, high level, can you tell what this documentary is about?"}, {"time": 7385, "text": "Yeah, it was early in the Syrian uprising, and we returned to the Syrian Turkish border with a Syrian American orthopedic surgeon who was volunteering, operating on refugees as they float across the border from Syria into Turkey."}, {"time": 7404, "text": "And it was an attempt at the time, before a lot of films had come out about the conflict, to really show again the effects of the war on civilians."}, {"time": 7418, "text": "You've heard me echo that sentiment multiple times now, but people knew there was a major conflict in Syria, but didn't really understand the form that that was taking and the impact it was having."}, {"time": 7431, "text": "And so we embedded into the, at the time it was the only clinic in Turkey that was sanctioned by the Turkish government to treat Syrian refugees."}, {"time": 7444, "text": "And so we filmed there with surgeons as they operated on war victims."}, {"time": 7451, "text": "And we also went into Syria into some of the camps as well."}, {"time": 7454, "text": "So in this film, there's a man who crosses the border every day to retrieve the wounded and fair them safety and care."}, {"time": 7461, "text": "And you also mentioned about heroism in the United States."}, {"time": 7465, "text": "Can you tell me about this man and just people like him?"}, {"time": 7469, "text": "Like what's the heroic action in some of these places that you've visited?"}, {"time": 7475, "text": "So in that instance, you know, I thought of him as the Turkish Schindler, right?"}, {"time": 7481, "text": "Because he was a human being who of his own volition, no one was paying him to do this, but he was spending much of his time."}, {"time": 7493, "text": "He was just a local businessman who really saw the need in the camps right across the border 10 K away."}, {"time": 7500, "text": "And he saw the medical need in particular and how hard it was to get people in desperate medical conditions across the border where there was a clinic just right across the border."}, {"time": 7513, "text": "But because of the security and the layers of security, they couldn't get out by themselves."}, {"time": 7520, "text": "So he took it upon himself as a Turkish person to build relationships with the Turkish guards, which was relatively easy."}, {"time": 7528, "text": "And then he built relationships with sort of the guards in the no man's land between the Syrian guards and sort of those who lived in the middle area."}, {"time": 7538, "text": "And then also with the Syrian guards at the camp."}, {"time": 7541, "text": "And he would drive out there daily and bring them food, right?"}, {"time": 7545, "text": "Talk them up and build relationships."}, {"time": 7547, "text": "And so every day he would bring these guards food and build relationships with them."}, {"time": 7551, "text": "And what that meant was eventually, right?"}, {"time": 7554, "text": "He had this avenue of access to and from the camps."}, {"time": 7558, "text": "And so he started using it and he would drive this avenue of access through the three layers of guards each day."}, {"time": 7568, "text": "And then they would open the gates for him because he had made himself trustworthy in their eyes."}, {"time": 7573, "text": "And he would receive the most desperate medical cases that were coming from all over Northern Syria, right?"}, {"time": 7581, "text": "To receive medical treatment."}, {"time": 7583, "text": "And he would, as you see in the film, he would ferry them into the back of his car, right?"}, {"time": 7588, "text": "And then drive them to the hospital where they would receive operations."}, {"time": 7593, "text": "And then he would bring them back if they wanted after they'd healed and recovered back to Syria, if they wanted to return out post recovery."}, {"time": 7601, "text": "And he didn't get paid for that."}, {"time": 7604, "text": "He was spending his own money to do it because he saw other human beings in need."}, {"time": 7609, "text": "And it's like we were talking about earlier."}, {"time": 7612, "text": "That's heroic, right?"}, {"time": 7614, "text": "That's selfless."}, {"time": 7615, "text": "That's aspirational for me, right?"}, {"time": 7619, "text": "Here's someone who is spending their time on the planet doing something of value and good to other human beings."}, {"time": 7627, "text": "I mean, if you draw parallels to Schindler, I feel like the fascinating thing about Schindler is that he's kind of a flawed human and is not the kind of human that does these things usually."}, {"time": 7641, "text": "But he just can't help it."}, {"time": 7643, "text": "And that's like the basic humanity."}, {"time": 7645, "text": "Despite who you are, the basic humanity shines through."}, {"time": 7650, "text": "I think the whims of war test people in those ways, right?"}, {"time": 7654, "text": "They ask of you things that you may not even know were going to be asked of you."}, {"time": 7661, "text": "And then it speaks to who you are fundamentally as a human being."}, {"time": 7664, "text": "They reveal who you are as a human being, just as you said."}, {"time": 7671, "text": "Let me ask a kind of stupid technical question about publications of movies and so on."}, {"time": 7678, "text": "I've been recently becoming good friends with Thomas Tall, who was the producer."}, {"time": 7684, "text": "His company, Legendary, funded some of the big sort of blockbuster films and so on."}, {"time": 7688, "text": "And so obviously money is part of filmmaking, but also the release of movies."}, {"time": 7693, "text": "And me as a consumer, with Netflix, with YouTube, that's one of the reasons I'm a huge fan of YouTube is it's like out in the open."}, {"time": 7706, "text": "Access, especially historical access."}, {"time": 7710, "text": "Like over time, you can look back years later."}, {"time": 7713, "text": "If you pay some money, you can watch some of the great films ever made."}, {"time": 7718, "text": "YouTube, Hulu, Netflix, I don't know what other services there are, HBO, Paramount."}, {"time": 7728, "text": "Anyway, there's all these platforms."}, {"time": 7731, "text": "Spotify now."}, {"time": 7735, "text": "I understand they want to create paywalls and so on."}, {"time": 7739, "text": "It makes sense, but I'm a huge fan of openness and I'm really kind of torn by this whole thing."}, {"time": 7744, "text": "Anyway, that's a discussion for perhaps another time."}, {"time": 7747, "text": "But the short question is why is it so hard to watch your documentaries and other films, other incredible films on the internet?"}, {"time": 7760, "text": "If I want to pay unlimited amount of money, I want to pay a lot of money to watch it."}, {"time": 7767, "text": "Well, Lifeboat is streaming free on the New Yorker."}, {"time": 7772, "text": "Yes, I saw that, which is interesting."}, {"time": 7777, "text": "And then also Hunger Ward is on Paramount Plus, but also it's also streaming free."}, {"time": 7785, "text": "So you can either go through a paywall or you can watch it with ads with Big Macs interspersed."}, {"time": 7792, "text": "Big Macs."}, {"time": 7793, "text": "Yeah, the contrast."}, {"time": 7796, "text": "Well, no, it really reveals the power of the documentary."}, {"time": 7801, "text": "No, but it's still not, even those platforms are, I mean, they're not as easily accessible because you have to like, you have to use, you have to think and you have to chase a particular."}, {"time": 7813, "text": "You have to chase it, yeah, yeah, yeah."}, {"time": 7815, "text": "I guess from an economic standpoint, the answer to that is pretty clear, right?"}, {"time": 7819, "text": "It may not be what people want to watch."}, {"time": 7822, "text": "Maybe people want to watch reality."}, {"time": 7825, "text": "Maybe people want to watch animal rescue shows here in the US, which is exactly why in part, I think it's so vital that we continue to do stories on things that aren't about flowers and puppy dogs, right?"}, {"time": 7844, "text": "I would push back on that."}, {"time": 7845, "text": "So there's TikTok and you could say, well, look, humans just want to watch really short content because they seem to be addicted to that kind of thing."}, {"time": 7858, "text": "That's partially true."}, {"time": 7860, "text": "But they also watch two, three, four, five hour podcasts."}, {"time": 7866, "text": "On TikTok?"}, {"time": 7867, "text": "No, there's different platforms for that."}, {"time": 7869, "text": "It's a place called YouTube, I'll teach you about it."}, {"time": 7872, "text": "Okay, yeah, I've never heard of it."}, {"time": 7874, "text": "It's a good place to publish documentaries, I think."}, {"time": 7878, "text": "Humans are interested in a lot of things and I've seen many times a thing that you think is a niche thing become a very big thing."}, {"time": 7889, "text": "But for them to become mainstream, they have to have a platform that allows for the mainstream to happen."}, {"time": 7895, "text": "The access."}, {"time": 7895, "text": "The access, the dumb, simple, frictionless access."}, {"time": 7899, "text": "The frictionless access is a really important thing."}, {"time": 7904, "text": "Paywalls create friction and not just because of the money."}, {"time": 7909, "text": "It can be free, but if you have to click on a thing or maybe sign up or put your email, it prevents you to enjoy the thing you would really enjoy and you know you would enjoy, but your baser human nature prevents you from enjoying because you can just open up TikTok and keep scrolling."}, {"time": 7934, "text": "So that's just something to say about platforms because I think the things that need platforms the most are things like your films."}, {"time": 7943, "text": "The things that I think a lot of people would love watching."}, {"time": 7947, "text": "They're very important and they can have viral impact on the world that is fundamentally positive."}, {"time": 7952, "text": "You know, it's just, it makes me sad that there's not a machine for celebrating those films."}, {"time": 7961, "text": "There are lots of machines to celebrate them, but they're just not as always accessible as YouTube, right?"}, {"time": 7967, "text": "I mean, as soon as you write me that check for a trillion dollars when I walk out of here, then I'm gonna put all my films on YouTube because then I won't have to worry about, you know, selling them in order so I can make the next film because you know, film is not just an art."}, {"time": 7980, "text": "It's also an industry, right?"}, {"time": 7982, "text": "And that tension between the two is a constant interplay that is a reality for me."}, {"time": 7988, "text": "So I always have to think about how can I access the largest audience, but also, right, go out and shoot the next film, right?"}, {"time": 7999, "text": "So that longevity question is also an issue and the finances are part of that sort of equation that I constantly have to rewrite over and over again."}, {"time": 8009, "text": "How often, as a creative mind, do you feel the constraints, the financial constraints?"}, {"time": 8017, "text": "I wish I could do a lot more films that I can't always because of financial constraints."}, {"time": 8024, "text": "So it's the number of films."}, {"time": 8028, "text": "And is a film that you do currently, is a film that you do at any one time as you're filming it already funded or is it the funding from previous stuff that you're trying to use?"}, {"time": 8041, "text": "Before Hunger Ward, I would just take a flyer on my films, right?"}, {"time": 8048, "text": "Where I would just say this meets the so what threshold."}, {"time": 8052, "text": "This is a story that has to be told and I want to tell it."}, {"time": 8057, "text": "And then I could just go shoot it."}, {"time": 8059, "text": "And usually on credit, usually on a credit card, right?"}, {"time": 8062, "text": "So based on a belief that Lifeboat was done that way."}, {"time": 8069, "text": "50 Feet from Syria was done that way."}, {"time": 8069, "text": "So you're on a boat, broke."}, {"time": 8073, "text": "Yeah, but it's free food, right?"}, {"time": 8074, "text": "And free lodging because there's a bunk on the boat."}, {"time": 8077, "text": "But I do that not intending to stay broke, right?"}, {"time": 8081, "text": "But based on a foundational belief that if I bring to bear all of my sort of quiver of creative arrows to it, right?"}, {"time": 8092, "text": "That I can create something of value, right?"}, {"time": 8096, "text": "In the world, but hopefully also financially that then I can sell to someone."}, {"time": 8101, "text": "And you know, every time I've done that Lex, I've gotten into the black."}, {"time": 8106, "text": "So it's a risk and I have to have a certain risk threshold financially to do that."}, {"time": 8112, "text": "But I believe so deeply in these stories that I'm willing to do that."}, {"time": 8115, "text": "I didn't have to do that with Hunger Ward."}, {"time": 8117, "text": "Luckily I had funders for that film."}, {"time": 8122, "text": "Yeah, take risks in this life."}, {"time": 8124, "text": "It's gonna pay off."}, {"time": 8126, "text": "Which reminds me of, let me ask you, I already asked you for advice about, for a filmmaker, how to win an Oscar."}, {"time": 8134, "text": "Well, I haven't won an Oscar."}, {"time": 8135, "text": "How to get nominated for an Oscar, that's true."}, {"time": 8139, "text": "Or just how to make great documentaries, how to make great film."}, {"time": 8142, "text": "But let me ask, even zoom out bigger."}, {"time": 8144, "text": "You mentioned some of these things, doing the things that you think matters."}, {"time": 8150, "text": "What advice would you give to young people, high school, college, dreaming of living a life worth living?"}, {"time": 8161, "text": "What advice would you give them about career or maybe just life in general?"}, {"time": 8169, "text": "Yeah, I don't know how you're gonna react to this given sort of your expertise."}, {"time": 8173, "text": "But I would say put down the smartphone, step away from the monitor, right?"}, {"time": 8179, "text": "Because real life is not a screen, right?"}, {"time": 8183, "text": "I believe that sort of the foundational skills which are conducive and important to success aren't necessarily those technical skills which we're going to learn in trade schools or university."}, {"time": 8199, "text": "I think they're more foundational than that."}, {"time": 8203, "text": "They're learning how to interact and listen."}, {"time": 8208, "text": "With humans?"}, {"time": 8209, "text": "With humans, yeah, to really see and listen, right?"}, {"time": 8214, "text": "And observe."}, {"time": 8215, "text": "And observe, right?"}, {"time": 8218, "text": "And how to step out of your door and if the electricity goes out, right?"}, {"time": 8223, "text": "And you're five miles away from your house, you don't need a smartphone to get home because you've set visual markers for yourself on how to get back to where you live, right?"}, {"time": 8232, "text": "I think we're in danger right now of living in a world where if the satellites stop functioning, right?"}, {"time": 8242, "text": "Then a whole lot of people have become completely dysfunctional, right?"}, {"time": 8247, "text": "Because we're so reliant upon the screens in our lives."}, {"time": 8250, "text": "So I think there's a lot of foundational skills that have nothing to do with technology that we need to learn and everything rests upon those."}, {"time": 8258, "text": "So I would say learn those foundations, learn how to write well."}, {"time": 8260, "text": "Read a lot, right?"}, {"time": 8263, "text": "It's a different kind of knowledge and wisdom that comes out of that."}, {"time": 8267, "text": "So reading is kind of the equivalent of listening and observing and writing is kind of integration of all of that that you've observed and listened to and tried to express something with that."}, {"time": 8280, "text": "So I think my training in the theater has served me so well in the documentary world, right?"}, {"time": 8286, "text": "Because it's all about interaction and listening and talking and dialogue, right?"}, {"time": 8291, "text": "And that's what I do in documentaries, right?"}, {"time": 8294, "text": "Is I listen."}, {"time": 8295, "text": "Yeah, we mentioned fear."}, {"time": 8300, "text": "Being an introvert, I'm very afraid of people but I'm drawn to them and fascinated by them because of that."}, {"time": 8306, "text": "Enjoy listening to them."}, {"time": 8309, "text": "And observing them."}, {"time": 8311, "text": "And you mentioned reading."}, {"time": 8313, "text": "You mentioned books as a catalyst, as a stimulator of your imagination."}, {"time": 8317, "text": "Is there books in your life, a couple, one, two, three, that kind of left an impact or a little bit of a spark of inspiration early on in life that stand out from your memory?"}, {"time": 8334, "text": "I was given The Prophet by Kahlil Gibran as a graduation present from my high school English teacher."}, {"time": 8343, "text": "And I still have that book in a special place on my bookshelf because I think it speaks to the nature of human experience, right?"}, {"time": 8351, "text": "And I return to it all the time because there's wisdom there, you know?"}, {"time": 8355, "text": "But there's many, many books."}, {"time": 8358, "text": "Fiction or nonfiction, what connects with you usually in the past, for the imagination?"}, {"time": 8363, "text": "I read mostly nonfiction most of the time."}, {"time": 8366, "text": "Ten Points is a book I love a lot."}, {"time": 8368, "text": "What is Ten Points?"}, {"time": 8370, "text": "Ten Points is, I think his name is Bill Strickland."}, {"time": 8374, "text": "He was the editor of, I think, Bicycle Magazine."}, {"time": 8377, "text": "And it's sort of his personal memoir of his experience growing up with a lot of abuse and how that transformed him as a human being."}, {"time": 8386, "text": "You know, one instrumental book for me that I bumped into in my early 20s, boy, these are all nonfiction, except for The Princess Bride."}, {"time": 8396, "text": "Have to mention, it's an outlier."}, {"time": 8399, "text": "No, no, The Seven Habits of Highly Effective People."}, {"time": 8403, "text": "I read that in my early 20s, and I found so many of the principles in that book."}, {"time": 8411, "text": "What are the habits from that one?"}, {"time": 8414, "text": "Seek first to understand, then to be understood is one of them, you know?"}, {"time": 8418, "text": "The notion of proactivity is one of them."}, {"time": 8421, "text": "It's really, and so I've held onto some of those principles through my life as well, for sure."}, {"time": 8427, "text": "What have been, you've observed suffering darker aspects of human nature in your own personal life."}, {"time": 8438, "text": "What has been some of the darkest moments in your life, darkest times in your life?"}, {"time": 8445, "text": "Is there something that you went through and then perhaps you carry it through your work?"}, {"time": 8494, "text": "It was a multiple vehicle crash, and what had happened is that a Volvo had hit another car, and then when it hit it, it went over the top of the car and hit a Volkswagen van, and it peeled away the top of the Volkswagen van when it hit it and then landed."}, {"time": 8656, "text": "Instead, I would allow that fear to catalyze me into action and do something and intervene in whatever way I could, even if I didn't have the skillset."}, {"time": 8668, "text": "And in some ways, all of that echoes in your documentaries."}, {"time": 8673, "text": "I'm not gonna let fear stop you from trying to help."}, {"time": 8677, "text": "I think that experience, that experience of failure, what I framed as just human failure on my part is foundational probably to my work."}, {"time": 8689, "text": "I don't want that to happen again, Lex."}]}]